[
    {
        "rating": 5,
        "cons": "We'll wait to see how well managers can incorporate this. Any performance review and coaching system is only as good as the managers who implement it. But the basics are all there for them to use.",
        "advice": "Keep up the design, feedback, adjust, and adapt methodology.",
        "pros": "IBM Human Resources did it right. From the basic premise of a need to change, to using agile methods for design and feedback, to rolling it all out. They really are walking the talk when it comes to how best to provide feedback in a fast-moving, social environment. While the outside debate rages on about the value of performance management systems, IBM has done something about it, and has spent time listening to empl… oyees and incorporating their feedback into the design elements of the new system. No more forced distribution, with multiple touchpoints during the year and a human-scale time horizon around goal-setting and goal attainment. All around, this is one of the best approaches to performance management that I've seen.",
        "summary": "New Performance Management System",
        "role": "Anonymous Employee",
        "date": "",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "1. Unfortunately, IBM still uses the \"normal distribution\" rating system, where at the end of the year each employee is ranked as a top contributor (5%), above average contributor (15%), average contributor (~75%), and bottom contributor (5%). This curve is difficult to apply in the R&D world, where you may have many members of the team working long and hard hours, and end up being \"average contributors\" at the e… nd of the year, because there just isn't room for all to be top contributors.2. The above may not be so disturbing, if only IBM didn't practically cancelled all raises, performance bonuses and incentive for the non top-performers. I've had a consistent \"above average\" rating in the last 4-5 years, and my raise and performance bonus were ridiculous mere 1.5-2% of my salary. Were I rated \"average contributor\" I would have gotten NOTHING. So you can imagine that people can go year after year without any raise to their salary.From talking to manager friend, this is IBM's way to eliminate the non-top-performers without having to fire them, as part of its direction of reducing US manpower.3. Hiring freeze in many areas - again, as part of IBM's attempt to reduce its workforce across North America and Europe we see many jobs move to the India and Far East markets. This is of course upsetting to see local teams shrink and disappear, especially when many great local IBM colleagues and experts begin to drop out. From my experience thus far working with India SW teams - they are still very far away from the standards I would have expected from US and Europe based teams.4. Poor top down communication about company's and divisions' future. Employees learn from rumors and news websites what's about to come...",
        "advice": "Management must keep in mind that it today's world, which is saturated with brilliant companies that hire top talent, IBM must remain competitive to attract great talent and hold on to it. In the meanwhile, we're seeing the opposite trend, where great people leave IBM for other companies, be it because of a more competitive package, dropping morale and many other reasons.",
        "pros": "Disclaimer: A lot of what I'm writing below of course depends on the work area and management chain. But I found this to be fairly pervasive policies in IBM in my 9+ years with the company.1. IBM's policies and management are very flexible when it comes to working remotely or accommodating various life situations (sick days, doctor visits, etc.). Management is encouraged to measure an employee by their work and i… mpact, and not by hours spent at their office.2. Great colleagues! Though unfortunately, many have been leaving due to the instability of IBM's HW development business.3. At least in my area, there's a high level of flexibility on which projects should I undertake based on my and my management assessment of business impact.",
        "summary": "Advisory Engineer in STG, IBM",
        "role": "Advisory Engineer",
        "date": "Aug 26, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You have to work lot of additional time to spend on IBM activities",
        "advice": null,
        "pros": "Great company to work - Highly innovative",
        "summary": "I/T Specialist",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Top down.May not have access to full resources to perform your job.",
        "advice": null,
        "pros": "Global Company.Major career changes possible every a few years without changing company.I even found a job in oversea ( USA ) with permanent residency visa support",
        "summary": "IBM meant a lot to my life",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Stressful at times. Had to work into the afternoons and nights to keep up. Many of the projects were obscure.",
        "advice": null,
        "pros": "Great Active team, startup culture. The people there had a fantastic attitude and like the work they were doing.",
        "summary": "Intern",
        "role": "Intern",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Little perks on campus. Such as no free food. Small cafe.",
        "advice": null,
        "pros": "Able to work remotely when needed.",
        "summary": "Engineering Co-Op",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "As every business, IBM is reinventing yourself, and the ones who doesn't fit, are being fired.Low salaries.",
        "advice": null,
        "pros": "Discounts in many servicesMeal ticketTransportation",
        "summary": "A good place to work",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "nothing to report at this time",
        "advice": null,
        "pros": "excellent leadership great career opportunities",
        "summary": "Consultant",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Mgmt layers and processes",
        "advice": "Stop letting top SME leave and flatten mgmt ranks",
        "pros": "Smart people, great technology, excellent training",
        "summary": "Sales Lead",
        "role": "Sales Lead",
        "date": "Dec 2, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Not nimble enough to lead the market. Need to be faster..",
        "advice": "Move faster and provide people with more autonomy! Need to own our unique space",
        "pros": "Great company to work for. The best IT company with great leadership.",
        "summary": "Great",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The purchase process is very slow. It would take a month to buy a small piece of device for experiment, such as battery.",
        "advice": "Big companies like IBM need standard procedures for purchasing, but the current procedure is very slow, and it would have negative effects on the research.",
        "pros": "The work environment is very very flexible. The employee that are very friendly, and they are very happy to teach me.",
        "summary": "Research Lab",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- stagnant growth- some parts of the business are contracting- sporadic layoffs",
        "advice": "Continue to make strategic investments to foster long-term growth.",
        "pros": "- competitive salary- great benefits- lots of opportunities to move around",
        "summary": "Good Company Still",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big, slow to move, decreasing",
        "advice": null,
        "pros": "Big, Innovative, nice clients, brand",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I have nothing to complain about. It was a great learning experience within an professional environment.",
        "advice": null,
        "pros": "There is a lot to learn as it has a high volume of work. Lot of growth opportunities. Great culture, amazing co-workers.",
        "summary": "Senior Field Service Analyst",
        "role": "Exchange Online",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "IBM has to do better at retraining people rather than laying them off. Compensation for most has fallen behind over the last several years as well.",
        "advice": "It's hard to make changes in a company the size of IBM, but they are possible. Make career paths more visible and attainable, with education goals spelled out. And make salaries more competitive.",
        "pros": "IBM has the best people to work with and provides top of the line collaborative resources. The work is interesting and ideas are heard. Tremendous efforts were made this year in revamping review the process, making it less tedious and more interactive.",
        "summary": "Invest in Employees",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The job pressure is what gave me my stroke in the first place (IBM was down-sizing).",
        "advice": "Make sure your employees keep up their physical health and do not push themselves too hard.",
        "pros": "Family oriented, I had a Cerebral Anuerysm(stroke) in 1993 and they are still helping me to a small degree.",
        "summary": "Senior Systems Engineer (Retired-Disabled)",
        "role": "Senior Systems Engineer",
        "date": "Dec 2, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Culture, layers of management, hard to get things done.",
        "advice": null,
        "pros": "Great people, wonderful customers, broad technology",
        "summary": "Senior Software Specialist",
        "role": "Senior Software Defined Storage Specialist",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Large company, slow to steer, too much bureaucracy, open sitting and every one back to the office, kind of restrictive, no exercise facility on campus",
        "advice": "Be more diligent",
        "pros": "Technology availability usage of competitor cloud services AWS Azure Google Cloud bluemix and oracle, flexible work schedule good cafe food and coffee",
        "summary": "Define cloud platform strategy for IoT",
        "role": "Chief Cloud Architect",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lacks collaboration; poor upper management",
        "advice": null,
        "pros": "Pays well; great benefits. Reputable.",
        "summary": "Good Company",
        "role": "Associate Partner",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Slow salary growth. Sometimes very strange policies come down from way up that make no sense.",
        "advice": "Give more control and trust to lower level management to do the right thing.",
        "pros": "Good work from home policy. Good life work balance. Great benefits package and long term disability policy.",
        "summary": "IBM review",
        "role": "Advisory IT Specialist",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Some boring days there is not much work at all since it's such a big company-very typical, not that many company outings, some departments very separated from my group",
        "advice": "You're doing fine in my eyes, but maybe do more company outings",
        "pros": "Trainings provided on tools/new things, my management group is very fostering of my happiness, never stressed out, flexible work from home whenever and not strict 9-5pm, opportunity for travel to other US cities-all expensed, room for growth, top-notch benefits, healthy stocked kitchen, etc",
        "summary": "Been here for half a year now!",
        "role": "Programmatic Account Coordinator",
        "date": "Nov 29, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The concept of \"Respect for the Individual\", which guided the company for decades, has gone out the window. An example is the changes to the retirement plan. Pension was replaced by a 401K match years ago, which was actually good if you planned to stay a few years then move on. But then instead of matching each pay period, they now make the payment at year end, so IBM gets the interest on the match, not you. And if y… ou leave, are laid off, or divested before December, IBM gives you nothing at all for that year. Morale is also pretty low in the \"old\" businesses as the company continues to aggressively cut costs in its traditional business units.",
        "advice": "You're not going to cut your way to profitability. If you really want to dump the hardware business, do it and get it over with. Getting rid of your \"very good\" to \"outstanding\" performers because they live in the wrong city or are in the wrong spot on an org chart is really starting to hurt the business.",
        "pros": "The company is huge, so there are many interesting jobs, and you meet and often work with people from all over the world. They also tend to be pretty good at seeing upcoming trends and reacting to them. You also still find that you often work with some really outstanding people.",
        "summary": "Changing",
        "role": "Systems Analyst",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "- IBM is very stingy about bonuses, and annual raises do not keep up with the market. After you've been at IBM for a while you're better off leaving for a year or two, then coming back, in order to stay at a competitive salary.- There's a lot of bureaucracy and pointless busywork that affects your annual performance review. But that's probably unavoidable at a company the size of IBM.",
        "advice": "Make sure that you focus on retaining your talented employees, rather than just acquiring them. Pay loyal employees a competitive market wage, just as you do for new hires.",
        "pros": "- Public sector consultants mostly stay in the DC area, so there isn't as much travel as commercial consultants.- Pay starts off very competitive when you're first hired on.- IBM's software suite and knowledge base is unmatched.- Good coworkers, good clients, good work/life balance.",
        "summary": "IBM Public Sector Consulting is a good place to work",
        "role": "Senior Consultant",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Company is good so no such cons",
        "advice": null,
        "pros": "Good start for a career",
        "summary": "Software Engineer Intern",
        "role": "Software Engineer Intern",
        "date": "Nov 28, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Size: Institutional inertia and process bureaucracy can impede creativity and entrepreneurial spirit.Mgmt. layers: Each can bring rulesets those under it must abide by. Those at the end-of-the-line live under *all* if it.",
        "advice": "Lead, follow, or get out of the way. You have great people who need to be unleashed.",
        "pros": "Size: Global Reach and working with peers all over the WorldBreadth: Cloud Services, database (Oracle, SQLServer, DB2, Cloudscape (...more), on Unix/Win./Mainframe, Websphere MQ, Tomcat, Websphere, Java, Web Services, XML(xsl) (... and more)",
        "summary": "What a ride",
        "role": "App Integration and Middleware Solutions Specialist",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lower salary than most companies around the silicon valley. A lot of change with upper management.",
        "advice": null,
        "pros": "Good growth oppurtunities. Good work/life balance.",
        "summary": "Good place to work, but expect change",
        "role": "Software Engineer",
        "date": "Nov 28, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Necessary relocation was bit tricky and troublesome.",
        "advice": null,
        "pros": "Nice EnvironementAwesome learning experienceNice salary",
        "summary": "Nice Organization to Work with",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "not a thing to report",
        "advice": "have more one on ones with those that report directly to you",
        "pros": "Flexible, good health care,",
        "summary": "Service",
        "role": "L2 Support",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Bureaucratic, Not much opportunity to move up. Salary package less than industry standard.",
        "advice": "Promote from within, adjust salary package to be inline with industry.",
        "pros": "Life work balance. Smart people to work with.",
        "summary": "IBM review",
        "role": "Anonymous Employee",
        "date": "Nov 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Internship feels a little overwhelming",
        "advice": "Diversify workforce intake a little bit",
        "pros": "There is flexibility and latitude in choosing exciting projects",
        "summary": "Experience",
        "role": "PhD Researcher",
        "date": "Nov 22, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Highly process orientedHikes are very limited",
        "advice": "Resource Managers have to ensure that career aspirations are aligned. They just think that they have to reduce the bench strength.",
        "pros": "Work from homeFlexible work hoursPossibility to move across locations within a countryGood pay offered while joining",
        "summary": "Good Work Life Balance but Career Aspirations not heard",
        "role": "Packaging Solutions Consultant",
        "date": "Nov 25, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "No cons as such although Yearly increments are not at par matket",
        "advice": null,
        "pros": "Its one of the best place to work and to be part of iconic organization",
        "summary": "Sr SAp Security Consultant",
        "role": "Senior SAP Security Consultant",
        "date": "Nov 25, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "very busy not time no work life balance",
        "advice": "good keep going",
        "pros": "they deliver quality work satisfied clients",
        "summary": "good",
        "role": "Anonymous Employee",
        "date": "Nov 24, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Poor Training and no emphasis on employee development",
        "advice": "more emphasis on employee development",
        "pros": "Nice relaxed work environementAlot of chance for advancement",
        "summary": "Tech Role",
        "role": "Technical Support Advisor",
        "date": "Nov 25, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "General problems of large companies are a lot of people doing the same job. Watson and the Watson brands are different but at times you do have to deal with the politics.",
        "advice": null,
        "pros": "Being a 100+ year old organization, there is much to learn from being part of such an organization. The people here are smart and the Watson culture is open and welcoming to new ideas.",
        "summary": "Collaborative environment",
        "role": "Account Manager",
        "date": "Nov 24, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No fair salary hikes and not employee friendly.",
        "advice": null,
        "pros": "Good Working culture and Environments.A lot of WFH options.",
        "summary": "InfrastrutureSpecialist - ApplicationSever Administration",
        "role": "Senior Systems Engineer",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "IBM is a place that is not for everyone. IBM allows you freedom to fail and freedom to succeed. The choice is yours but be ready when you first start to wear the eight stripe logo",
        "advice": "Never settle for anything less that total customer satisfaction, and staff excellence. Leave the political influence to the Sr. Management and not the staff.",
        "pros": "excellent technology company with a recognized brand worldwide. A career where there is endless technology job possibilities for qualified staff. Contact made throughout the IT industry.",
        "summary": "IBM Former",
        "role": "Senior Software Engineer, and Systems Development Manager Prior",
        "date": "Nov 22, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Low compensation, does not reflect the market",
        "advice": null,
        "pros": "Great work life balance and flexibility",
        "summary": "Life at IBM",
        "role": "Anonymous Employee",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "large, process oriented, sometimes slow",
        "advice": null,
        "pros": "Innovative, nice people, hard working, transformative",
        "summary": "Great place to work",
        "role": "Senior Consultant",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Cuts, no raises, 401k reduced, remote work going away for co-location in the same city.Layoffs every quarter including top performers due to where they live.Long work hours, evening calls to development overseas (which are not really co-located!)Not much revenue growth and moral is very low, unless you're in a good growth area.",
        "advice": "Focus on employees and what makes them work better to increase productivity and morale.Stop laying off employees who have all the business knowledge. Stop giving executives huge bonuses.",
        "pros": "Many different and interesting areas to work in, the people are generally nice and hard workersWork at home (was) the best benefit they had, slowing cutting that out, making IBM average",
        "summary": "Average Company",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Certain projects feel stagnant, as potential for growth seems entirely dependent on whether upper management feels the product/project is worth investing \"resources\" in.",
        "advice": "Don't forget about employees working for \"legacy\" products. In two years I've seen a lot of talented young engineers leave for other opportunities because they worked on projects where they felt their potential for growth was limited, and that the risk of being stuck on a sinking ship was too high.",
        "pros": "Work/Life Balance is literally amazing.The environment and teams you work with are wonderfulManagers have always been extremely helpful to me as a junior engineer.You won't find a nicer group of people to work with.Team leads and subject matter experts always seem willing to help when you get stuck",
        "summary": "A wonderful opportunity fresh out of school.",
        "role": "Software Engineer",
        "date": "Nov 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I　didn't find big negative thing by now.",
        "advice": null,
        "pros": "Good career;good training;good management;good relationship between manager and employees.",
        "summary": "Automation testing developer and leader, Manual tester and leader",
        "role": "Anonymous Employee",
        "date": "Nov 21, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "low chances to promote, the tasks are separated into many teams, you get to do only a small part of the process",
        "advice": null,
        "pros": "flexibility, nice people, good salary package",
        "summary": "Good Place to work",
        "role": "Marketing Campaign Manager",
        "date": "Nov 22, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Found out after being laid off from IBM that I was not being payed competitively as compared to others with my skill set who work for other companies. Company laid off employees with out taking into consideration the impact with clients.",
        "advice": null,
        "pros": "Able to work remote from home; work / life balance. They offer great benefits that was hard to find after being laid off from the company.",
        "summary": "Laid off from IBM",
        "role": "Anonymous Employee",
        "date": "Nov 21, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I didn't like the fact it was not just 8 to 5 job...I had to work almost 14 hrs aday",
        "advice": "Just be friendly...eveyone is really looking out for eacher",
        "pros": "ERY easy ging, and we'll paid. I thibk if your extrovert, you will be fit for the job",
        "summary": "P2p lead",
        "role": "Anonymous Employee",
        "date": "Nov 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "NEED TO HAVE OWN TRANSPORT",
        "advice": null,
        "pros": "A good company to start the career",
        "summary": "ACCOUNTANT LEAD",
        "role": "Accountant Lead",
        "date": "Nov 20, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management is too top heavy and takes too long to make decisions",
        "advice": null,
        "pros": "Work from home opportunities",
        "summary": "IBM Inside Sales",
        "role": "Anonymous Employee",
        "date": "Nov 20, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "if you want GOOD LIFE come here, if you are in RUSH of becoming rich go somewhere else",
        "advice": null,
        "pros": "Lot of innovation with global scope, good challenging work, good work life balance, nicest people",
        "summary": "Life @ IBM",
        "role": "Anonymous Employee",
        "date": "Nov 19, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "A highly process oriented company, which lags behind when it comes to employee benefits and rewards. The perks and compensation are low and way below market rates.",
        "advice": "There should be more involvement from the higher-ups if the company wants to improve the connectivity among all the employees at all levels.",
        "pros": "It is a good company with a lot of accounts (clients) across all industries, which means that invariably, an IBM India practitioner spends a lesser time on the bench. The GBS accounts follow some of the widely accepted and rigidly followed standards for quality delivery.",
        "summary": "IBM India Global Business Service",
        "role": "Project Manager/Systems Architect",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "not a place for hardworking peoplesalary hike are in peanuts",
        "advice": null,
        "pros": "Flexible work hoursNo work pressureJob switch opportunity",
        "summary": "hardworking people better avoid",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Large, they have a tendency to require usage of their own proprietary tools and applications instead of things that are more popular and transfer better out in the industry.",
        "advice": null,
        "pros": "Good benefits, good pay, Nice people to work with both within the US and overseas",
        "summary": "Software Advisory Engineer",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "on boarding, training etc. are virtually non existent, processes and systems are overly complicated and unique to IBM versus industry norms, takes too many people to accomplish simple tasks. Technical support almost exclusively overseas",
        "advice": "eliminate all of the barriers to success and limited productivity",
        "pros": "working with large accounts, dwindling prestige",
        "summary": "frustrating",
        "role": "Sales Role",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The company is management top-heavy, frequently changing management and reporting structures",
        "advice": "Direct management efforts to serving and understanding customers better instead of constantly brandishing your image.",
        "pros": "Has enormous resources and talent.",
        "summary": "IBM",
        "role": "Senior Education Consultant",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It is easy to get stuck in the 'blue goo' - it's admin-heavy and not all processes are clear.",
        "advice": null,
        "pros": "The people are committed to growing you - especially if you are new to the position or just out of school. Finding help is easily accessible.",
        "summary": "Great place to start your career.",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Churn, Trying to reinvent itself",
        "advice": null,
        "pros": "People, Software, Solutions, Clients, Research",
        "summary": "IBM Review",
        "role": "Anonymous Employee",
        "date": "Nov 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Can be challenging to keep up with innovation",
        "advice": null,
        "pros": "Great support, teamwork and cooperation",
        "summary": "Software Sales",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I don't find any problem.",
        "advice": "Management is doing good.",
        "pros": "Team work and career growth",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Because of the sheer size of the organization, employee sometimes struggle to find right policies.",
        "advice": "People managers should be someone who is your supervisor for day-to-day work.",
        "pros": "Amazing peer group.Great opportunities to learn new things.Not just a job but a career.",
        "summary": "Awesome place to work",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Watch out for those folks touting Work@Home or Work from anywhere as a benefit. Maybe employees are being forced to come into offices now and co-locate with teams or be out of a job. IBM is in full assault mode when it comes to Work@Home and the powers that be have apparently decided that everyone should now be in the office working together as a team. If you are thinking IBM is a great Work@Home option you are going…  to sorely disappointed as IBM reigns everyone back into offices and lays off people who took advantage of 'work from anywhere' and refuse to move.The 401k match being paid at the end of the years is a cruel joke, not only to those who leave or are laid off before the end of the year, but also to current employees. This one move has cost me tens of thousands in missed gains.",
        "advice": "401k payment at the end of the year is just not acceptable and you are damaging your employees retirements because of it. Stop the assault on Work@Home, you pushed people to work from home by offshoring job and putting people out of work. To now drastically swing back the other way at the expense of the loyal and valuable employees who have stuck it out over these past 6 years is horrible!",
        "pros": "Vacation and Holidays, 401k match is pretty decent",
        "summary": "Work@Home going bye bye",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Executive level management slowly stripping or altering benefits in the best interest of the stock value as opposed to the employee. Outsourcing jobs to China and Bulgaria. I had to train the person who is replacing me. Not an employee friendly environment. People always looking over their shoulder waiting for the next lay off. HAVE NOT HAD A PAY RAISE IN 10 YEARS.",
        "advice": null,
        "pros": "I can work from home. However, after encouraging to work from home, now requiring people to return to the office.",
        "summary": "Program Manager",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "red tape, brick walls - meaning there are 'policies' in place to stop movement and other things from happening. IBM is VERY good at sliding through the cracks of law. they want to get rid of the old wood - problem is the old guys know far far far more than the 30 yr olds they want to hire. I work with some of them and I know - they are destroying what used to be a good brand name. Everyone now progresses through each…  month wiping the sweat off their brow glad they didn't get the axe. It's a real shame that Ginny doesn't get it, but she is just another Sam and if it continues IBM will finally have their butts whipped by everyone they 'hate'.",
        "advice": "HUGE News - you ARE NOT a cloud company you lost that battle years ago. You are actually destroying the company and lastly the typical IBM method of \"if we didn't think of it then you in no way could be right\" needs to stop. The lack of vision, service, customer care, and anything you could claim is brilliance is long gone.Wake up fast cause 'too late' is months away.",
        "pros": "great people to work with",
        "summary": "progress and reality",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Its hard to think of some it is a very nice place to work with very nice people",
        "advice": null,
        "pros": "Good benefitsGreat work life balanceWonderful training opportunities especially for campus hires (CBD program)",
        "summary": "IBM EA Consultant",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Don't get your hard work recognized unless you showcase it.",
        "advice": null,
        "pros": "Great training opportunities with future value.",
        "summary": "IBM Review",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Bureaucratic. Difficult to do business with. Lack of respect for employees. Lack of team cohesiveness.",
        "advice": "Listen to your customers. Dedicate resources to your customer. Too much turnover in customer-facing sales staff.",
        "pros": "Depth of talent and skills.",
        "summary": "IT Sales Representative",
        "role": "Sales Representative",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extremely slow HR processes, middle-managers are often disengaged from your career development, tight budgets for campaigns/projects, culture from the top down is not consistent",
        "advice": "focus on educating middle-managers on how to cultivate creativity among their reportees, develop their careers, and create a culture of agile innovation",
        "pros": "Lots of horizontal mobility from one function/team to the next, opportunity to network with partner companies and agencies, be a part of a company on the forefront of machine learning",
        "summary": "Opportunities within the company",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not a paymaster, Very slow professional growth in terms of compensation and position. Does not have any retention policy for the employees that have spent long time with the company",
        "advice": null,
        "pros": "great opportunity to work with Global clients, Work flexibility in terms of hours and location, Good employee benefits , considerate about employee concerns",
        "summary": "Good Employer",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too big a company. Too much time spent on bench when there is no projects. You will have to network or look for a project. Lack of interpersonal interaction with your manager. Travel is demanding.",
        "advice": "Cut down on multiple levels of management. Look at employees as assets rather than numbers when the times are bad.",
        "pros": "Good Career growth support if you get a good manager. Benefits are great. Great fellow employees to work with.",
        "summary": "Senior Managing Consultant",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Budgets are shrinking. Compensation plans are poorly funded. Implementation of performance management system was less than smooth.",
        "advice": "Stop executive raises - especially CEO. Change business strategy / execution to be truly agile - not just development. Truly embrace transparency - not just lip service.",
        "pros": "Many, many different positions to choose from. Opportunities to learn and grow. New performance management system was rolled out.",
        "summary": "Unsure future",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Lack of transportation if you dont drive",
        "advice": null,
        "pros": "Learning a lot from peers and other teammates",
        "summary": "Challenging work",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "honestly have nothing to say on a negative note",
        "advice": "keep up the great work!!!",
        "pros": "great potential to move up, great co - workers",
        "summary": "Pleased Employee",
        "role": "Procurement Specialist",
        "date": "Nov 17, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I would say that aggressive people probably fit best at IBM. I never felt that employees worked together and supported each other as I had experienced in other companies -- even though the model at that time was that of a matrix organization. All-in-all, it seemed to me to be mostly a very competitive environment.",
        "advice": "I don't really have any advice for management. Obviously they are very successful doing what they are doing. with almost 400,000 employees.",
        "pros": "There were a lot of opportunities at IBM. There broad range of products and services create ample opportunity to move in almost any direction desired. BTW, I originally worked for Informix Software where I was Principal Technical Architect . Informix was then acquired by IBM. I left IBM back in 2002 -- the system doesn't allow for older entries; so I note that here.",
        "summary": "Technical Architect",
        "role": "Technical Architect",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It is a large company",
        "advice": null,
        "pros": "It is Great, really good work life",
        "summary": "IBM",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not enough customer interaction for all Senior Software Engineer.",
        "advice": null,
        "pros": "Appropriate amount of responsibility. More independence in terms of project work.",
        "summary": "Senior Software Engineer",
        "role": "Senior Software Engineer",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "better communication with management team",
        "advice": null,
        "pros": "great people, great work environment",
        "summary": "good experience!",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Slow to react and respond",
        "advice": "Be open to change",
        "pros": "Amazing innovations that have transformed the world",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too much marketing driven management.. Risk becoming a \"me too\" company rather than the leader it was and still can be.",
        "advice": null,
        "pros": "Lots of smart hard working people working on some phenomenal ideas and technology.",
        "summary": "IMHO",
        "role": "Cloud Architect",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "working in different time zones",
        "advice": "n/a",
        "pros": "HUge company ability working from home",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The current IBM restructuring process has been going on for some time, and has resulted in confusion and uncertainty about company strategy among employees.",
        "advice": null,
        "pros": "In my many years of employment with IBM, I have found that IBM employees across the board are extremely competent and professional and generally helpful. In most of my experience, IBM employees team well together and are genuinely interested in providing value to the customer.",
        "summary": "Pre-Sales technical professional",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "poor retention of employees that are hard workers",
        "advice": null,
        "pros": "great team environment for most",
        "summary": "poor retention",
        "role": "Senior UNIX Systems Administrator",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Excessive amounts of red tape, culture is declining overall",
        "advice": null,
        "pros": "Great people, competitive pay, good vacation time",
        "summary": "Solution Sales",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not all departments have good work culture",
        "advice": "Manager should have more trust on their employees and do not micro manage",
        "pros": "Employee friendly company with good HR policies",
        "summary": "Work environment in IBM GBS",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High turnover, management styles of most managers very rigorous with no allowance for flexibility, bonuses almost nonexistent due to high management and administrative overhead",
        "advice": null,
        "pros": "Stable work force, processes and procedures well established, name recognition in the marketplace, almost magical credibility just because you work there",
        "summary": "Ok...nothing special",
        "role": "Senior Managing Consultant",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Work pressure during project submission,sometimes tend to work from home on weekends to satisfy client needs",
        "advice": null,
        "pros": "Positive attitude managers,helping tendency of colleagues,flexible timings",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Frequent re-organizations are disruptive, particularly in sales which is relationship-based. Too many products in each sales portfolio. Not enough cultural emphasis on prospecting, especially if business development needs to be a priority for overall growth.",
        "advice": "Take feedback regarding territories from the reps who are interacting with the accounts on a regular basis. Too many weak accounts on Enterprise lists.",
        "pros": "Good pay and benefits; working with other talented peers; good work-life balance typically. Lots of flexibility to set your own schedule and appointments.",
        "summary": "Changes need to be made to get back to business growth",
        "role": "Software Sales Representative",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Continuous re-orgs and downsizing, but otherwise ok",
        "advice": null,
        "pros": "working from home, lots of opportunities",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Breaking into old boys network is not easy. Culture can be a bit challenging on the GBS side specially when you get to AP/Partner level roles.",
        "advice": "Increase mentorship culture in the organization. Eg. sr partners should be buddies to new partners joining the firm and should be rated appropriately for the success of new employees.",
        "pros": "Great learning opportunity as one gets to work with some of the best and brightest in the industry whether it's eCommerce or supply chain or an ERP implementation.Execs have great connection in pretty much every industry at very senior levels which makes the entry easy but expectations are also pretty high from the clients.",
        "summary": "Global Business Services",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Plenty of socially awkward people. You really need to work hard sometimes to figure out who you want to spend time with outside of work.",
        "advice": "For the most part, you guys get it right. But with any big company, sometimes there is just too much red tape.",
        "pros": "Smart people who are easy to work with. You're always challenged which is important.",
        "summary": "Pretty good place",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "To many employees for management ratio",
        "advice": null,
        "pros": "Good company though the changes recently are a concern",
        "summary": "Good company",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I've not had any bad experiences working with IBM.",
        "advice": null,
        "pros": "Lots of diverse people and good working environment.",
        "summary": "Software Eng. IBM Tivoli Network Managment",
        "role": "Software Eng IBM Tivoli Network Management",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "No training or emphasis on growing its employees",
        "advice": "Cut down multi layers of management",
        "pros": "Flexible work schedule. Deep bench at times.",
        "summary": "Senior Consultant",
        "role": "Senior Consultant",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Busy place but fun to work at",
        "advice": "Keep up the good work",
        "pros": "Review and processed all customer accounts",
        "summary": "Account manager",
        "role": "Anonymous Employee",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Most career decisions were based on diversity. It didn't matter how good you were, how much you contributed, how much you worked........the award, promotion, recognition, and decision to keep you on board when the rest of the team was being off-shored was purely based on diversity.",
        "advice": "Diversity has gone WAY overboard. You need to start hiring, promoting, and rewarding individuals based on what they do and their contributions, not based on diversity. Everyone sees it in IBM, but they can't say a word. During the past 15 yrs, all my managers were black females.",
        "pros": "You have an opportunity to do many different things.....you can work just as hard and as much as you would like...over and above your daily job.",
        "summary": "Diversity more important than skills, accomplishments, contributions, etc.",
        "role": "Anonymous Employee",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Constant traveling can be draining.",
        "advice": null,
        "pros": "Nice perks that come with a consulting job",
        "summary": "Average Experience",
        "role": "Anonymous Employee",
        "date": "Nov 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "IBM no longer cared about the semiconductor manufacturing part of the business and transferred them to GlobalFoundries. Prior ro that there was little investment in the fab and in the employees",
        "advice": "Provide more direction to the employees and be more transparent with the health of the company. The employees are treated very well but sometimes need a bit more management",
        "pros": "Coworkers are great. the work in the microelectronics division is still very interesting even though they are only running older technologies on 200mm wafers",
        "summary": "Not so great anymore",
        "role": "Process Engineer",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Worked a lot of hours, there was a little bit of stress. But overall, not much to complain about",
        "advice": null,
        "pros": "Fantastic experience. It was a lot of fun, I met a lot of interesting people and learned a lot.",
        "summary": "Internship",
        "role": "Anonymous Employee",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of training and upward mobility.",
        "advice": null,
        "pros": "A great company to work for in terms of letting you handle the job on your own. Great benefits. Great team members. Variety in your position.",
        "summary": "Senior Deskside Support Representative",
        "role": "Senior Deskside Support Representative",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "lack of leadership, directions, you feel like you totally on your own. A lot of jobs defined are not as they seem like and people stepping on each other feet. no bonuses and very low salary increases.",
        "advice": "treat your employees right, reward them for dedication, set goals, appreciate dedication and commitment.",
        "pros": "ability to grow and expand, learn and create impossible.",
        "summary": "Interesting technology company",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Big Company that does not really care about employees.There is a great deal of company busy work for quarterly and annual reviews.",
        "advice": null,
        "pros": "They allow you to work from Home.Fellow employee's work together well.pretty well compensated with 401K and other benefits.",
        "summary": "IBM Review",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Decisions are usually made many levels above you, make people feel not part of the company. Change product concept too frequently, hard for engineers to focus and really get something valuable done.",
        "advice": "Get better understanding of the market, and stay focused",
        "pros": "good work life balance, layback culture.",
        "summary": "Good work life balance, everything else not so good",
        "role": "Software Engineer",
        "date": "Nov 28, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "So far none to speak of",
        "advice": null,
        "pros": "Completely set up for the remote workforce.",
        "summary": "Summary from a relatively new IBMer",
        "role": "Advisory Project Manager",
        "date": "Nov 13, 2016",
        "is_current": true
    }
]