[
    {
        "rating": 4,
        "cons": "Management and communication across departments was not the best. There was a tradition of just moving the most tenured people up to be managers, but they had no prior management experience and there wasn't much training for them. The departments are all silo'd so it's really hard to get anything done cross-departmentally. I would have loved to switch departments internally, but got shut down each time I tried.",
        "advice": "Keep up the good work, David Sacks. The change you have brought to Zenefits is invaluable – you're smart, trustworthy and a driven professional. I think the entire company is counting on you to bring Zenefits out on top! Which, by the way, I have no doubt you will be! Just make sure there is communication across departments and keep everybody in the loop so they're constantly reminded what they're working toward… s, together!!",
        "pros": "I love Zenefits because of the people you work alongside – a whole boatload of young, smart, fun and driven professionals. Half of my friends came from Zenefits. We played pool, ping pong, and foosball together. In sales, you work short days, typically hustling in the mornings but leaving the office around 4:30pm in the afternoon.",
        "summary": "Growing Pains",
        "arole": "Sales Development Representative",
        "date": "Jun 29, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The buildings are all being renovated and it's quite noisy campus right now. It will be beautiful but it's not great right now. Get the cafeteria done ASAP!",
        "advice": "Be sure to have leaders week each year so we can stay connected and engaged as we grow. Continue to increase the diversity by gender, ethnicity, age (young and old) and thinking. Start a dog to work program!",
        "pros": "eBay is investing in the future and is a place you can really make a difference in whatever tour role. You really feel like you are making a difference by enabling connected commerce in all corners of the world. It's also a fun place to work and there are so many talented and friendly people.It's also a place no matter what your age, ethnicity or background that you feel respected. We need to continue to increase…  our diversity because it will only help us to better understand our richly diverse customer base. I love working at eBay as they are a company that is serious about creating an amazing place to work.",
        "summary": "eBay cares about your career",
        "role": "Senior Director",
        "date": "",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "tough competition in the market",
        "advice": null,
        "pros": "well known brand and company",
        "summary": "Director, Product Marketing",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I have been doing this for a while. In my experience, the cons at eBay are dwarfed by the pros. In my experience as an employee, I am challenged, work with a great team, and am well compensated.",
        "advice": "Keep doing what you are doing, especially the effort around structured data and creating a meaningful site catalogue. This work is going to keep eBay viable and valuable well into this century.",
        "pros": "eBay, by its very definition, is an economic force that helps mitigate the polarization of wealth. It makes commerce accessible anyone with an internet connection. The team I work with is exceptional, full of people that are both intelligent and kind, who are challenge-oriented and care about our projects and one another. I have been a software engineer for 15 years, and have experienced what we all have experienced,…  the various joys and frustrations inherent in our business. I have never been happier than I am at eBay, no kidding. Specifics: - An internal VM cloud, available for any developer to spin up a machine with a Linux or Windows image to test an idea or develop a POC - The freedom to innovate. No one is going to hold you back because \"we don't do things that way around here.\" - Compensation is at the top of the scale - The culture strikes a great balance between caring about employees and getting the work done. I like working with people who want to work hard, and who understand that living to work is insane.",
        "summary": "Great challenge, great team, great compensation",
        "role": "Senior Software Engineer",
        "date": "Nov 24, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "mediocre mgmt of the company",
        "advice": null,
        "pros": "friendly environment in the company",
        "summary": "title",
        "role": "Anonymous Employee",
        "date": "Jul 20, 2016",
        "is_current": true
    }
]