[
    {
        "rating": 5,
        "cons": "Like any tech company, the work is big and complicated so work/life balance can suffer from time to time. The difference is that it's the passion within the individuals that drives them to work long hours and forego time off. Of course there can be times when schedule demands force the imbalance, but it's not such that 10-12 hours days become commonplace and expected regardless. We do what we do to get the job done; … no one is killing themselves because there's an order to do so.Being able to eat to your hearts/stomachs content can be dangerous to the waistline, but that's a self-control thing and not the company's issue.",
        "advice": "Keep doing what you're doing and fight hard to not be complacent. I believe that humility is the key so don't ever lose that thinking. Your motives will always be suspect, but if you're able to look in the mirror everyday and know that your motives are pure, that's all that matters. Walking the talk is the best evidence there is.",
        "pros": "I'm a 55 year old working in a company where the average age is 28, and I've never been happier. I have always wanted to work in a company where I wasn't the proverbial square peg, and after nearly 30 years in the work force, I believe that I have found the company that complements my ideology for how a company should operate. Here are the \"Pros\" as I see them...- Leadership: Mark Zuckerberg, Sheryl Sandberg,…  Chris Cox and the rest of the leadership team. Inspiring, smart and totally real.- The Culture: The openness is a real thing, we're trusted to do the right thing, mistakes are expected, being yourself is important and encouraged, humility is encouraged and expected, building trust is paramount, the mission of making the world a more open and connected place isn't just a cool phrase because it guides everything. It's not about us, it's about everyone else.- The People: Smart and nice is what I find. The diversity is better than any other company I've worked at and it's getting better. Those that are figuring out how to make what we do better for everyone are really good at implementing their ideas. Two years ago I didn't know what this company really was or if it had a secure future. I can clearly see now that they have what it takes to last, and it's sincere.- Management: Managers are hired because they're good managers and not because they're good at something else. The management track is different than the contributor track and they're equal in importance.- Benefits: Working in the Valley it's hard to differentiate all the benefits employees receive and Facebook is at least equal to all the major tech companies, but coming from Seattle the benefits are nothing short of incredible.Granted, I haven't been with the company for very long and I'm still in the honeymoon period, but I can tell what's real and what's not; this place is for real.",
        "summary": "Pleasantly Surprised",
        "role": "Site Selection Program Manager",
        "date": "",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "FB expects a lot out of engineers, and you can't slack off. Of course, you shouldn't slack off at any job, but since FB is pretty fast-paced, there is a risk that you'll have trouble adjusting at first.FB has a lot of custom infrastructure and tools, and prehaps more impressively, it works great. It makes doing your job really great, but on the other hand, you'll end up learning a lot of stuff that won't be a… pplicable elsewhere.FB's code-base is very good in some ways, but in other ways, it's not as great as some of the existing engineers think it is. I don't think this is that big of a deal, but the important part is that as an engineer, you need to quickly learn FB's values and practices and \"get with the program\" so to speak. If you don't like some things, then you just have to deal with it, as it's not likely you're going to change people's minds at this point. The nice thing is that things are at least very consistent.",
        "advice": "You need to focus on how you are going to maintain the existing culture and protocols as you grow. I think this could be really tough.",
        "pros": "It might be easy to roll your eyes when people from Facebook say how open their culture is, but it's true; it's more open than any other place I've worked at. At a company wide-level, secret projects, public incidents, important non-public business metrics and the like are all openly discussed. You can ask questions about them directly to Zuckerburg at the weekly Q&A. I think the idea is that if everyone is on th… e same page or at least, differing views are heard, the company will be stronger, and solutions may be offered from a place you didn't expect. This is much different from previous companies I worked at, where discussions on internal email lists would be shut down by some lawyer saying that there's certain things that can't be discussed, and important data is divided up to groups and individuals on a \"need to know\" basis, etc.This culture applies at a lower level too. You feel comfortable giving feedback to each other about each other, about product decisions, about management, etc. The flipside of this openness is that you of course, have to be willing to receive the feedback, you have to recognize that while openness and feedback is highly encouraged, decisions have to get made, and actions and data are more valuable than words. At the higher level, since the company trusts employees with access to so much information, keeping such info confidential from the outside world is taken seriously.It's a great place to work as an engineer. You're given a lot of freedom, but it's also a responsibility to make sure you're doing things that are valuable. You don't get much credit for working hard or being smart if you don't produce valuable output.One cool thing about Facebook, in contrast to other comparable companies (Google, Amazon, and Microsoft, though in truth, FB is much smaller), is how they have a pretty singular focus. Even with the differing areas (including advertising and such), they do a good job of keeping their eye on their mission of connecting as many people as possible. I also think they are way more empathetic to their users than most people give them credit for. It seems like popular opinion has it that FB is arrogant and only cares about its users insomuch as they represent $-signs. From within the company, it didn't feel this way at all. I saw a lot of empathy towards users, and a lot effort spent to improve or things or fix broken things with no direct financial benefit. The strategy is not complex. The thinking is that if they can make FB easier and more fun to use, then more people will use it for more time each day (which will also have a network effect of attracting even more people to use it), then the advertising dollars will follow. Of course, it is true that FB wants to make the audience more accessible to advertisers as well, but there are a lot of people at FB who care about privacy and security.They have really good infrastructure and really great ways to share the infrastructure and code. They have a lot of cool internal tools, and what they've built is really impressive, and more importantly, it helps your team build products faster without having to solve problems that someone else already solved. Every software company tries to do this, but FB seems to have been more successful with it. Perhaps it's because they're still relatively small, but if anything, I can at least say it is very cool while it lasts.The perks and work environment are great, unless you're one of those types that can't stand open office spaces. I've worked in both a private office and open offices in multiple companies. While I do think a private office has some benefits, I mostly think it's a personal luxury for the employee and a huge waste of money for the company. I'd much rather have the money go into other areas like salary, benefits, and other workplace improvements rather than the added real estate necessary to have offices.Of course, you've heard about the food and snacks. They have an amazing selection of great stuff, and what I like about it is that it sort of goes above and beyond expectations. Sure, some days, lunch is better than others, but I really can't complain, and the selection of drinks and snacks is amazing. It's not like you should work at FB just because of that, but it demonstrates FB's desire to make work as fun and convenient as possible.You'll be surrounded by people who like being there. I can't think of a better environment to work in. If you have a giant ego, you may not like it as much. Respect is definitely given to those that have deep experience in the industry, and they are expected to lead others and mentor more junior employees. However, if for whatever reason, you can't perform at the level expected, no one is going to care if you did this and that at Google or shipped ten things at MS, etc.FB also has a lot of fun events, and I made a lot of friends working there, so going to the events was fun. Also, if you're older and worried that FB is just a bunch of 22-year-olds, and that you won't fit in, I wouldn't worry about that. FB does have a lot of young employees (who are really smart btw), and it does hire a lot of people straight out of college, but it also attracts a lot of experienced engineers from other top companies like Google, MS, Amazon, etc.Work-life-balance seemed totally normal to me. It may be different depending on your team, but I felt you could do 40-50 hours of work a week for the most part and you would be totally fine. It's about what you produce, not how hard you're working. Other team members who had children would work normal hours and go home at normal times. I didn't see any of these folks have a problem when they left early to take care of their child or things like that. Of course, there could be times that people are expected to work extra if something critical happens, but for the most part everyone wants to avoid this and this happens sparingly, from what I observed. Now, there were many times where I chose to work late myself, but I never felt any pressure to do so. The caveat is that there are on-call rotations, and in addition, even if you are not on-call, you are expected to be reasonably available if the on-call person needs your help. However, again, no one wants this, and your team will work on ways to avoid these situations.The best thing I can say is that working at FB is about productivity. I didn't experience and political bs and it was a pleasure working with a group of people who were all concerned with producing a good product and making the best of the time spent while doing it.",
        "summary": "Open, fast, no bs",
        "role": "Software Development Engineer",
        "date": "Mar 17, 2014",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I think the commute is clearly a problem, but also sometimes bureaucracies exist where they should not.",
        "advice": "Keep contractors engaged. They all maintain desires to work here long term, and many have much to offer the company.",
        "pros": "Amazing company, great to be here and learn about the culture, ecosystem, and products.",
        "summary": "Operations",
        "role": "Operations",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "At times, lack of focus...placing too many bets and not quick enough to abandon some and focus on ones that are showing early success",
        "advice": "Focus",
        "pros": "Highly collaborative, smart people, mission driven company, fun colleagues, fast moving, energetic",
        "summary": "Great Culture",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "\"Resource\" allocation is out of your hands, difficult to get things shipped, internal fiefdoms, occasional gross misprioritization around dumb products, innovation is slipping",
        "advice": null,
        "pros": "Amazing people, great perks, opportunities to make an impact that simply are not available at other companies. A++ would work again",
        "summary": "Career-defining",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Hard to get to the top of the company because it is so established",
        "advice": null,
        "pros": "Food, Salary, Smart People, Fast-Paced, High-Growth, Encouraging Environment, Flexible positions / easy to move around",
        "summary": "Financial Analyst",
        "role": "Anonymous Employee",
        "date": "Nov 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The main campus is in fountain valley",
        "advice": "please hear us",
        "pros": "The company has a very family-oriented feel",
        "summary": "Studio Video Producer",
        "role": "Studio Video Producer",
        "date": "Nov 18, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Middle to senior management likes to play the game and it can be hard to move upwards if you don't have management support.",
        "advice": "Don't focus on the people that speak the loudest or self promote the most within the groups. Really look to everyone on your team to have an equal voice and create forums that allow that, especially for international employees.",
        "pros": "Executive team is incredibly strong. Great people to work with across the globe. Lot of mobility options.",
        "summary": "Great company, strong exec leadership",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Facebook still believes that it is a magical meritocracy reasonably free from corporate nonsense. While there aren't any Office Space-style TPS reports to fill out and you don't have to bring in your own coffee and toilet paper, it is now just a big company job like any other. If you want something, whether it be a promotion or a good dessert from the cafeteria, you have to plan how to get it, execute on the plan, an… d then make sure everyone else knows what you did and how great it was. You also have to share just enough detail to be convincing but not so much that people can poke holes in your story or usurp your dessert acquisition techniques.The typical first level line manager at Facebook doesn't have prior management experience, only knows the Facebook way of doing things, and is overwhelmed with all the pressure being placed on them. It's a really hard job, too; your manager will be responsible both for setting the direction of your team and for making sure you and your colleagues grow at the company. Most people are not good at either of those things, let alone both. Be aware of what your manager is looking for and how to best communicate it.Everything FB does is subject to a lot of public scrutiny, and you will know how the sausage is made and see that the goals of the company aren't focused on invading privacy or global domination like everyone else thinks. It's hard to see this thing that takes up so much of your life lionized and loathed by the press and your friends.For engineers, a lot of the tools you will use day-to-day are incomplete, broken, poorly documented, and might not be supported anymore. You will get used to this. \"Move fast and break things\" is more complicated than it sounds, and that's really hard to adapt to when coming from a more traditional company. Have big goals but chop them up into small tasks with well-defined success indicators and communicate them early and often.",
        "advice": "To the director- and VP-level people that have been at FB a long time: it's not the same company you went to work at lo those many years ago. There are between 5 and 50 times more employees now, way more products, and way more moving parts. If you want Facebook to stay Facebook-y, invest in the culture that you love. Teach people how to be successful and reward individuals that focus on impact that makes everyone's w… ork easier and the product better, not on whatever new hotness made a contrived graph go in the right direction. Lots of things aren't working right anymore and it is up to you to start the hard conversations about which sacred cows can't provide enough milk for tens of thousands of employees because you never taught the new people how to talk about that stuff.",
        "pros": "Facebook is probably the best big company to work for. The company cares a lot about having its employees being productive and satisfied with their jobs and it works hard at maintaining an environment to support that. As a survivor from the real world, this is really rare -- pretty much every company-wide system is designed to make life easier for employees. The benefits and conveniences offered are amazing.M… any decisions about the company and its goals are made fairly transparently and open discussion about most things is encouraged. This can get really annoying at times.Unlike most companies, Zuck is actually a pretty inspiring leader. He makes mistakes, but does learn from them. He has really lofty goals, though, and doing the right thing is highly subjective when trying to change the world.If you are politically savvy and willing to work hard and make sure others notice that hard work, you will go far. You will learn a lot if you seek out opportunities to learn, and work with a lot of very talented people. You have to own this yourself, though; don't count on a lot of support.",
        "summary": "Facebook is the worst job, except for all the others",
        "role": "Infrastructure Engineer",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High stress, lot of turnover. I've had a new manager every year. Some teams have a 24/7 work expectation. Highly competitive, and you are competing with lots of smart people. Seems very difficult to get a promotion and junior people who don't rise fast enough are pushed out. For senior engineers, one bad project or not enough impact and it can be very difficult to course-correct.",
        "advice": "Fix the fake news problem. Recognize that incremental improvements and investment in software infrastructure pay long term dividends and reward that. Not everything is easy to quantify in terms of impact and a lot of work on quality goes unrewarded.",
        "pros": "Great benefits and compensation. Lots of different technologies to work on, lots of opportunities for visibility and impact. Good place to learn and explore mobile, full stack and backend infrastructure. Fun place to work when things are going well.",
        "summary": "Great compensation if you can cut it",
        "role": "Software Engineer",
        "date": "Nov 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "advice": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "pros": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "summary": "Internship at Facebook",
        "role": "Software Engineer Intern",
        "date": "Nov 23, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "advice": "In sem justo, commodo ut, suscipit at, pharetra vitae, orci.",
        "pros": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "summary": "Best place to work",
        "role": "Product Manager",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "advice": "Duis condimentum augue id magna semper rutrum. Nullam justo.",
        "pros": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "summary": "Great place to work; Hard to navigate career growth and internal politics",
        "role": "Analyst",
        "date": "Oct 5, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "advice": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "pros": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "advice": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "pros": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "summary": "Amazing place to work!",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "advice": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "pros": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "summary": "Open and transparent, great focus on driving meaningful impact",
        "role": "Media",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "advice": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "pros": "Duis condimentum augue id magna semper rutrum. Nullam justo.",
        "summary": "Great spot to be",
        "role": "Anonymous Employee",
        "date": "Nov 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "advice": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "pros": "Duis condimentum augue id magna semper rutrum. Nullam justo.",
        "summary": "software",
        "role": "Anonymous Employee",
        "date": "Nov 9, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "In sem justo, commodo ut, suscipit at, pharetra vitae, orci.",
        "advice": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "pros": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "summary": "Fun workplace, smart engineers",
        "role": "Anonymous Employee",
        "date": "Nov 6, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "advice": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "pros": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "summary": "PMM",
        "role": "Manager",
        "date": "Oct 23, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "advice": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "pros": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "summary": "Mission-driven, huge impact, helping people",
        "role": "Software Engineer",
        "date": "Oct 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "advice": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "pros": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "summary": "Lots of entitled and well compensated employees working through chaos",
        "role": "Anonymous Employee",
        "date": "Nov 10, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "advice": "Duis condimentum augue id magna semper rutrum. Nullam justo.",
        "pros": "Duis sapien nunc, commodo et, interdum suscipit, sollicitudin et, dolor. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.",
        "summary": "Internship SWE",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "advice": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "pros": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "summary": "AVOID Publisher Solutions, otherwise fabulous place to work",
        "role": "Anonymous Employee",
        "date": "Nov 9, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "In sem justo, commodo ut, suscipit at, pharetra vitae, orci.",
        "advice": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "pros": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "summary": "Nice Benefits but Not True to Healthy Work/Life Balance They Promote",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "advice": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "pros": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "summary": "Amazing!",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "advice": "Duis sapien nunc, commodo et, interdum suscipit, sollicitudin et, dolor. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.",
        "pros": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "summary": "HRBP",
        "role": "California",
        "date": "Oct 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "advice": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "pros": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "summary": "Excellent",
        "role": "Anonymous Employee",
        "date": "Oct 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Duis sapien nunc, commodo et, interdum suscipit, sollicitudin et, dolor. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.",
        "advice": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "pros": "Duis condimentum augue id magna semper rutrum. Nullam justo.",
        "summary": "Good software internship",
        "role": "Anonymous Employee",
        "date": "Oct 24, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "advice": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "pros": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "summary": "Facebook",
        "role": "Anonymous Employee",
        "date": "Oct 24, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "advice": "Duis sapien nunc, commodo et, interdum suscipit, sollicitudin et, dolor. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.",
        "pros": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "summary": "Coming up on a year employed, and I'm finally getting my sea legs...",
        "role": "Software Engineer",
        "date": "Oct 20, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "advice": "In sem justo, commodo ut, suscipit at, pharetra vitae, orci.",
        "pros": "Duis sapien nunc, commodo et, interdum suscipit, sollicitudin et, dolor. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.",
        "summary": "Good company",
        "role": "Software Engineer",
        "date": "Oct 23, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "advice": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "pros": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "summary": "Landslide win over Google for career growth",
        "role": "Software Engineer",
        "date": "May 1, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "advice": "Proin mattis lacinia justo. Vestibulum facilisis auctor urna. Aliquam in lorem sit amet leo accumsan lacinia. Integer rutrum, orci vestibulum ullamcorper ultricies, lacus quam ultricies odio, vitae.",
        "pros": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "summary": "Best Place To Work. Period.",
        "role": "Technical Recruiter",
        "date": "Oct 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Aenean vel massa quis mauris vehicula lacinia. Quisque tincidunt scelerisque libero. Maecenas libero. Etiam dictum tincidunt diam. Donec ipsum massa, ullamcorper in, auctor et, scelerisque sed, est. Suspendisse nisl. Sed convallis magna eu sem.",
        "advice": "In sem justo, commodo ut, suscipit at, pharetra vitae, orci.",
        "pros": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "summary": "Best Company Ever",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "advice": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "pros": "Etiam sapien elit, consequat eget, tristique non, venenatis quis, ante.",
        "summary": "Mediocre",
        "role": "Software Engineer",
        "date": "Oct 27, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Aliquam id dolor. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos.",
        "advice": "Nullam feugiat, turpis at pulvinar vulputate, erat libero tristique tellus, nec bibendum odio risus sit amet ante.",
        "pros": "Etiam posuere quam ac quam. Maecenas aliquet accumsan leo. Nullam dapibus fermentum ipsum. Etiam quis quam. Integer lacinia. Nulla est. Nulla turpis magna, cursus sit amet, suscipit a, interdum id, felis. Integer vulputate sem a nibh rutrum consequat.",
        "summary": "Facebook research scientist",
        "role": "Research Scientist",
        "date": "Nov 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "advice": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "pros": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "summary": "workplace",
        "role": "Anonymous Employee",
        "date": "Nov 1, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Morbi gravida libero nec velit. Morbi scelerisque luctus velit. Etiam dui sem, fermentum vitae, sagittis id, malesuada in, quam.",
        "advice": "Pellentesque ipsum. Nulla non arcu lacinia neque faucibus fringilla. Nulla non lectus sed nisl molestie malesuada.",
        "pros": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "summary": "Intern",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "advice": "Nam quis nulla. Integer malesuada. In in enim a arcu imperdiet.",
        "pros": "Morbi a metus. Phasellus enim erat, vestibulum vel, aliquam a, posuere eu, velit. Nullam sapien sem, ornare ac, nonummy non, lobortis a, enim. Nunc tincidunt ante vitae massa. Duis ante orci, molestie vitae.",
        "summary": "What a great place to work",
        "role": "Engineering Manager",
        "date": "Oct 18, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "none, really. It's an excellent company to work for.",
        "advice": "focus on culture",
        "pros": "Good salary and way above average benefits; work is demanding but very satisfying. It's a place for doers, aiming for technical excellence.",
        "summary": "Awesome place to work",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Keep your guard up against free foods/beverages.",
        "advice": null,
        "pros": "Great company culture, great products, great coworkers.",
        "summary": "Partnership Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It is a very young company. The benefit is that it creates an aggressive and flexible style of working. On the flip side if you like consistency and predictability - this is not the place for you.",
        "advice": null,
        "pros": "The benefits from working at FB are amazing. They are not just throwing money at employees on useless items. They are thoughtful and trying to make people more productive and healthier with the items they provide.",
        "summary": "Fantastic Experience",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Way too many politics for a tech company.",
        "advice": "Encourage good managers, not just high functioning ICs thrust into management roles.",
        "pros": "Massively interesting projects, lots of places to get involved.",
        "summary": "Great company to work at",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Some weeks are longer than others, but that's normal.",
        "advice": "I like the culture of being open.",
        "pros": "Great perks , dental, insurance, food",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Intense workload - you need to be the type of person who can handle this (most Facebookers can).Fast growing org means sometimes the right processes are not in place, or processes are broken, which can lead to churn/frustration/breaking things. This is par for the course in every fast growth company.",
        "advice": "Continue to nourish what is special about Facebook. Be careful and measured about implementing processes, so that Facebook's work culture doesn't turn into that of other tech giants (bureaucratic, political, all that bad stuff)",
        "pros": "Autonomy - managers are trained to empower, not micromanageGreat workplace - all of the perksFreedom - make no mistake the workload is intense. But I have the freedom to work on my own terms and make my own decisions about balancing work and lifeMeaning - you are working on products that impact so many peoples' lives. It's truly a once in a lifetime opportunity.",
        "summary": "Best decision I ever made was to join Facebook.",
        "role": "Communications Manager",
        "date": "Oct 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The open floor plan has a downside: if someone comes in sick with a cold or flu, its too easy to pass it on to others. It is addressed very thoughtfully though, so it's not such a big deal.",
        "advice": null,
        "pros": "Mutual respect; egalitarianism; meritocracy; flexibility. This place makes employees feel welcome and relevant, regardless of their age and gender. What matters is how good you are at doing your job. Everything else is irrelevant. I had some reservations about the the open floor plan, but it actually works to energize the people. You can hear the brains buzzing :-)",
        "summary": "This is the best company I've worked for",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work/Life balance isn't as described. Most interns I met were working 12 hour days, and this seems like its the norm for some teams.",
        "advice": null,
        "pros": "Great benefits, compensation, area. Food is absolutely amazing",
        "summary": "Internship",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "- Commute is O.K.; I find it productive but friends who get carsick, less ideal",
        "advice": "As we scale, don't lose sight of the core values.",
        "pros": "- Hard problems- Strong management/mentorship- Tons of resources- Strong company values- Excellent executive leadership (Mark/Sheryl/Schrep/Cox)- Focus on diversity- Food and general benefits are top of the charts- Flexible work schedule",
        "summary": "5 years in and still loving it!",
        "role": "Recruiting Lead",
        "date": "Oct 12, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's really fast paced and things change quickly. You have to be able to ride the waves and adapt quickly. So many people are grateful to be part of such an amazing company, but there are a few bad eggs who ruin the culture because they takers, not givers. We need to serve more humble pie in the cafes.",
        "advice": "Remember to teach employees the importance of gratitude.",
        "pros": "People here care deeply about the mission to connect the world. Everything we do connects to the mission and Mark talks about the mission in practically every talk. We encourage people to be their authentic selves. There's no \"work you\" and \"personal you.\" There's just \"you.\" People care deeply about each other here. And you have the ability to make an impact beginning on your first day. Some places it takes 6 months…  or a year to make meaningful progress, but here you jump in and make a difference right after orientation.",
        "summary": "Mission Driven. Impact from Day One.",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Gained 10 pounds after starting here. As a contractor, it's extremely difficult to become a full time employee, but at least you get some experience and you're able to put a great name on your resume.",
        "advice": null,
        "pros": "Great atmosphere - people come from all background. This has been the most diverse campus I've worked on so far. There's plenty of resources around to help you shape up and improve your current skills. Free food is always a bonus.",
        "summary": "User Operation Specialist",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "very stressful, bottom percent of people get kicked",
        "advice": "nope",
        "pros": "Awesome people，awesome environment，nice and competent people",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Literally nothing... warning: you will get addicted to Sweet Shop",
        "advice": null,
        "pros": "Fast-paced work environment that is fun to be in!",
        "summary": "Internship review",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "food is not as good as we expected",
        "advice": null,
        "pros": "Different business modes, different products, different groups, very technical",
        "summary": "opportunity at Facebook",
        "role": "Software Engineer",
        "date": "Oct 10, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It is so hard to grow, so many people with great skills, competitive",
        "advice": null,
        "pros": "I love working at Facebook, the enviroment, the people, the benefits",
        "summary": "SMB Account Manager",
        "role": "Anonymous Employee",
        "date": "Oct 6, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There were really no cons.",
        "advice": null,
        "pros": "Great opportunity for growth and challenge.",
        "summary": "Great place to work and grow",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I haven't discovered any yet!",
        "advice": "You are doing great job. Keep it up!",
        "pros": "Awesome place, super awesome people, great benefits and amazing food.",
        "summary": "Solutions Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Middle management is horrible. The company has grown a lot in the last year, resulting in the hiring an promotion of really bad managers that don't fit the culture... I have started to see a trend where as soon as you stop being of use the company will make sure to dispose you and get someone younger and cheaper.",
        "advice": "Listen to ICs concerns, try checking internal anonymous feedback groups where you can really see all the pain and worries people have.",
        "pros": "As a company, Facebook HQ are still Disneyland. It will be difficult to find better benefits and amenities.Some of the top level leaderships are great role models and you can see they really care for their people and the company.",
        "summary": "Culture is no longer what is used to - problems with middle management",
        "role": "Sales Organization",
        "date": "Oct 12, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I can not find any so far.",
        "advice": null,
        "pros": "Good relocation, people here are passionate about their work. Seen Mark several times.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Perhaps this is how it is at most companies, but team priorities/goals often shift fast. Team goals tend to be a bit siloed and different teams sometimes work at cross-purposes.",
        "advice": "Greater coordination across teams to enable more \"global\" rather than team-specific optimization.",
        "pros": "Less bureaucracy than other similar-sized companies, open culture, internal mobility and encouragement to try out different types of projects, lots of development- and learning opportunities. High-quality coworkers -- everyone tries hard and the environment is generally collaborative. I am constantly being challenged by big, open-ended problems. Firm generally tries to be customer-focused and to do good within the co… nstraints of being a for-profit company.",
        "summary": "great working here",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None that I can think of.",
        "advice": null,
        "pros": "Great culture and people to work with. Amazing mission and leadership.",
        "summary": "Great place to work!",
        "role": "Executive Assistant",
        "date": "Sep 30, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I came from a corporates which are not so fast paced and it is difficult onboarding with facebook. But honestly it is worth it",
        "advice": null,
        "pros": "Smart people, fast paced and decentralized work environment which gives immense freedom to people and teams.",
        "summary": "Amazing place so far",
        "role": "Software Engineer",
        "date": "Sep 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Career progression opportunities aren't completely clear.",
        "advice": null,
        "pros": "Facebook moves unbelievably quickly from an engineering perspective, and there's an electricity in the workplace, driven by the company's mission, which is unbeatable.",
        "summary": "Incredible Place to Work",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Still unstructured in some parts.",
        "advice": null,
        "pros": "Great benefits, work culture and management team.",
        "summary": "Media Partnerships",
        "role": "Anonymous Employee",
        "date": "Sep 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Professional growth and career paths are not clearly defined. Promotion opportunities depend more on reorgs and team growth than merit.",
        "advice": "Clear ownership of projects is necessary. Internal team competition hurts us.",
        "pros": "Working at Facebook is great: wonderful opportunities, great perks, competitive salaries, an open and flexible work environment. Your voice will be heard",
        "summary": "All the tools to have impact",
        "role": "Anonymous Employee",
        "date": "Sep 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Perhaps an irregular work week.",
        "advice": "None. Great company!",
        "pros": "Great office environment. Advancement opportunities for skilled contractors. Free snacks and meals!",
        "summary": "Awesome company",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No cons yet, just don't get too big and lose track of what employees care about. Hard to share ideas with the entire organization",
        "advice": null,
        "pros": "Phenomenally smart people to work with which raises your own bar every day, and a sense of accomplishment and satisfaction whenever you do something impactful at work. Hard to beat the benefits",
        "summary": "Best place to work, ever!",
        "role": "Anonymous Employee",
        "date": "Sep 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "New managers in transition, but that's inevitable.Pressure to work more - this is very team dependent. Despite efforts to say work however you like, if many people on your team is working throughout the night, it's hard not to feel the pressure.Open office space isn't for everyone - where's my flow state? This has improved with more and more rooms being allocated for personal use and ability to update work st… atus.Seattle office is older than MPK.",
        "advice": "Keep it up. Try to bolster some of the extra programs in the Seattle office. i.e. volunteer groups seem pretty dead here.",
        "pros": "The perks are amazing.Transparency and openness of policy, leadership, and code base. Props to leadership admitting to their faults/failures and working to learn from them.Supporting your growth - personal and professional.",
        "summary": "Love Facebook",
        "role": "Software Engineer",
        "date": "Sep 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Your desk area can often get loud. The company often doesn't follow through enough on released products, discontinuing them within 1-2 years. You must come into the office at least 80% of the time usually, which means you must relocate near an office.",
        "advice": "Open offices in more affordable areas that don't have extremely high real estate costs. Have succession plans well in advance for products if they don't work out.",
        "pros": "The move fast culture and insanely high ratio of competent co-workers make Facebook one of the most satisfying and exciting places to work in the world. Easily one of the best workplaces where you feel pampered and privileged to have a job there. The food options are vast. You'll never go hungry. There's plenty of interesting spaces around the office to meet, chill, or focus. Easy access to IT and resources removes r… oadblocks from your workday. Projects and tooling are shared openly within the company and knowledge transfer is highly encouraged. Aggressive device refresh policy (every 2 years). Zuck Q&A on Fridays. The ability to easily float between teams makes finding something new that you're passionate about is much more likely and keeps your employment fresh.",
        "summary": "Probably the best job I'll ever have.",
        "role": "Operations Engineer",
        "date": "Sep 20, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Work/Life Balance – Speaking as an intern, you feel implicitly pressured to spend as many hours as you can on campus to leave a good impression as well as work on your project. This can lead to many hours a week at the office.",
        "advice": "Keep up the great work. The transparency is beyond appreciated, the food is phenomenal, the programs are great, and the employees make it an absolutely wonderful place to work.",
        "pros": "Amazing Food – 3 cafeterias, 8 restaurants, and continually stocked microkitchens are fantasticAmenities – Facebook is beyond generous with the benefits and amenities provided ranging from generous vacation days, on-campus spa, on campus doctor and dentist office, wonderful transportation accommodationsPeople – Some of the most intelligent and nicest people I have had the absolute pleasure to wor… k with. Everyone is welcoming and helpful and more than happy to work with you with zero feelings of competition or hostility.Transparency – Facebook is 100% transparent internally with its employees. Ranging from being able to browse the entire codebase no matter what team you're on, to being able to ask Mark any question you have at weekly Q&A.",
        "summary": "Phenomenal Company",
        "role": "Anonymous Employee",
        "date": "Sep 20, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There are several. Note that the role specific ones are only for data engineers. What I have found is that there is a lot of difference in the way different groups function, so if you join as a SWE or as a product manager, your experience may be different.1. The work environment is very open and very noisy. There is absolutely no privacy. This becomes more of a bother here because there are so many people now…  in all of their buildings. The only time when I was able to do any serious work was when I was working from home.2. As a data engineer, you will be working with a very old version of Hive (0.10 I think). This is the version even before the one with windowing clauses. I was used to working with a better version that also had CBO and I found this limiting. Not only that, if you do this for a year or two you will be at a disadvantage when you switch jobs.3. The data engineers are at the lowest rung of the pecking order. Some call them 2nd tier engineers. I call them data peons. They do not get any say in the kind of work they get to do. Any grunt work can be passed on to you and because of the way the review system works, they can screw you if you show any displeasure. An example of this is the data visualizations. The data engineer is expected to do that. I never had to do that before. So you will be spending a lot of time doing housekeeping work like making sure the pipelines run, making sure the font and color choices you made on the dashboards are pleasing to the analysts who sit on top of you in the pecking order. And to add insult to injury, the visualization tool is a home grown one and none of the skills you get from using it are going to help you in a future job i.e. if you plan to continue doing visualizations.4. Data peons are treated differently as compared to software engineers. Whereas on occasion the software engineers get to work exclusively on different projects for up to a month, there is no such options for data peons. So mobility is very very limited.5. The performance review system is stacked against data peons. Because they are at the lowest rung, most of the people reviewing them are analysts or above. So the analysts are the overlords even when some of them are absolute idiots. The only ones who can survive in this system are ones with a servile attitude and with mediocre talent and ambition.Some of these are because of recent org changes. A lot of the people I know who joined around the same time as me have left the company.",
        "advice": "Even though Mark is one of the most open and humble CEOs I have even worked for, there is a lot of abuse and harassment happening in the lower levels of the Org chart. I think you should listen closely to complaints that are made to the HR and review them.",
        "pros": "The only pros I can think of is not really job related. The Disney like setting is good to bring your kids and family to if they are visiting. But the novelty wears of after 2-3 visits. The summer picnic parties used to be fun before but now it is too crowded and held at cheap locations - like this year it was at one of the piers in SF.As a data engineer you can try to understand the topology of the data systems … and see how they work. You can look at the code base and see how they all fit together. See how the log streaming works and how it makes its way into the data storage. These are not job related activities but it will help you in your interview at your next job.",
        "summary": "data engineer",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "little to no advancement opportunities for those who aren't in the \"old boys club\"",
        "advice": null,
        "pros": "Training is great, great experience working across all business verticals.",
        "summary": "Marketing Expert",
        "role": "Marketing Expert",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No cons, the stereotype of working in tech is overrated",
        "advice": "The best",
        "pros": "Great place to work, amazing perks and people. Couldn't imagine myself anywhere else",
        "summary": "Amazing",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Getting too big.Getting complacent and hiring bar is getting lower.Lots of cliques at work",
        "advice": "Focus on keeping the edge and keeping the culture !",
        "pros": "Great place to work overall.Takes great care of employeesBest perks!Best cultureBest CEO",
        "summary": "Great place to work overall. Getting too big and complacent as it grows",
        "role": "Anonymous Employee",
        "date": "Sep 18, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Contract employees have almost none of the perks/benefits full-time employees do. The work is tedious, you'll be pressing the space bar all day. Due to California law, contract employees are temporary. Very hard to climb the ladder into an FTE position if you're contract.",
        "advice": null,
        "pros": "Three straight meals, great coworkers, a motivated team, cool offices downtown",
        "summary": "Perks are nice, work was boring",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Inexperienced management and already full of politics",
        "advice": null,
        "pros": "Lots of perks, many smart people",
        "summary": "Not happy",
        "role": "Anonymous Employee",
        "date": "Oct 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "bad management, high turnover rate",
        "advice": null,
        "pros": "high salary, good environment, training are good",
        "summary": "Overall ok",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing, except lots of people talking all the time. Hard to concentrate.",
        "advice": null,
        "pros": "Awesome company, great benefits, ,lots of paid time off",
        "summary": "Analyst",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "work pressure is high and push too much Lack of communication sometimes .",
        "advice": null,
        "pros": "good place to work and the food is amazing, team is fantastic, tech stack is pretty new.",
        "summary": "working experience",
        "role": "Software Development Engineer Intern",
        "date": "Sep 29, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "-Recruiters aren't allowed to work remote.",
        "advice": null,
        "pros": "+Impact+Working on really cool stuff+Ownership+Culture+Future of the company looks really positive and bright+Making the world more open and connected+You learn a lot from really awesome people around you",
        "summary": "Technical Recruiter",
        "role": "Technical Recruiter",
        "date": "Sep 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "none at all great experience",
        "advice": null,
        "pros": "office and people and work",
        "summary": "good",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "not as great for work-life balance",
        "advice": null,
        "pros": "Impactful work, great perks, energetic environment",
        "summary": "Working at FB",
        "role": "Anonymous Employee",
        "date": "Sep 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Disparate views of management specially in pressure",
        "advice": "Consistency towards vision",
        "pros": "Amazing culture, values and world class infrastructure",
        "summary": "Like working for the company",
        "role": "Anonymous Employee",
        "date": "Sep 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Really ? Very little, I'm stuck thinking about it. I just can't find anything to say here. Like any big company you might have to work through confusing org structures but once you understand that it's easy",
        "advice": "Continue to build programs that will bring out the best in terms of impact, speed, care, openness, courage to innovate etc in new hires especially the ones you hire at a senior level. You have managed to stay away from regressing to the mean- keep it that way!",
        "pros": "So many things but the biggest is that Mark and Sheryl and the team deeply care about their employees. They have combined the art of deeply caring with expectation of high impact and so you don't have under performing employees contaminating the culture of care and impact.Consider yourself lucky if you get a job at Facebook and stay there as long as you can because it will make you an incredible professional … and a better human being",
        "summary": "Best place to work - PERIOD",
        "role": "Director",
        "date": "Sep 11, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Your evaluation rely a lot on your peers.",
        "advice": null,
        "pros": "1. Flat management. Easy to reach out to everybody even as an intern.2. Everyone is friendly and willing to help.3. Intern have the same right as pull time and do the same thing as full time.",
        "summary": "Software Engineer Intern",
        "role": "Anonymous Employee",
        "date": "Sep 6, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I seriously can't think of a single negative thing about Facebook. I couldn't see myself working at any other company.",
        "advice": "Micromanagement doesn't exist. I get credit for what I do, and there's a pretty clear understanding of my role and room for growth.",
        "pros": "I've been blown away by how incredible this company is. From its openness to its diversity, Facebook has truly surpassed all tech companies in terms of culture, perks, and employee lifestyle. As a software engineer, I've learned, grown, and made an incredible impact in just a few months.",
        "summary": "The greatest place ever",
        "role": "Software Engineer",
        "date": "Sep 8, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "it will let employee increase weigh",
        "advice": null,
        "pros": "satisfaction eating need and it is a motivation",
        "summary": "Facebook free launch and snack",
        "role": "Software Engineer",
        "date": "Sep 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Moves too fast for some of the teams that should be doing more research.",
        "advice": null,
        "pros": "Moves fast.Work with smart people.Very less politics.Open culture.High bar for candidates even as company as grown.",
        "summary": "Love it!",
        "role": "Software Engineer",
        "date": "Aug 31, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Commute from SF is tough, and manager support is pretty hit or miss depending on the person. You have to stick up for yourself and be proactive if you want to learn.",
        "advice": null,
        "pros": "Great benefits, culture, mission. There is a lot to love about working at Facebook. Most employees believe strongly in the mission.",
        "summary": "Great company to work for!",
        "role": "Communications Associate",
        "date": "Sep 2, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The customer is a commodity. Complain or try and expose the scams advertisers are engaging in and you are removed.",
        "advice": "Customer service is not to be dispensed with a computer algorithm. Real people exist. It matters",
        "pros": "Looks good on resume. Free food",
        "summary": "Don't speak up. Sit quietly and don't rock the boat. Be happy",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "None that I can think of.",
        "advice": "Keep it up!",
        "pros": "Fast pace, great pay and great management.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Sep 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "As the company gets bigger, it also gets harder to make impact.",
        "advice": "get some good Asian food chefs.",
        "pros": "Facebook is a great company to work at. They care about their employees much deeper than most of companies I've seen.",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "heavy politics compared to other tech companies",
        "advice": "more transparency among business teams",
        "pros": "positive team culture, flexible hours, great employee perks",
        "summary": "Flexible but political",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Becoming political, harder to go up the ranks",
        "advice": null,
        "pros": "Salary, people, perks, benefits, work life balance",
        "summary": "Client Partner",
        "role": "Anonymous Employee",
        "date": "Sep 2, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There's a bit of fiefdom but very little. Sometimes hard to get code-review. We move a little fast for documentation sometimes, and there are often 5 ways to do that one thing and they're very similar with cute animal names.",
        "advice": "Very pleased with the company. Showing concern and continuing to invest in and grow your people is the best for retention. Maybe more roles that cross-pollinate work and all-hands to share our work. Incentivize merges and tech debt burn-down",
        "pros": "Many companies I've worked for talk about access, enablement, open environment, work/life balance, frequent reviews and promotion. FB actually does this: almost anyone can see code for and fix almost any problem. Reviews happen twice a year, and my manager brings up the promotion track more than I do. They aggressively push giving your family the off-work time, and plan events which either include small family member… s or give non-parents a good steam-blow-off as well",
        "summary": "Delivers promised other companies make",
        "role": "Production Engineer",
        "date": "Aug 23, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's political now. It's too big. People watch out for themselves too much.",
        "advice": "Bring in fewer people from corporate backgrounds to mid-level management.",
        "pros": "Facebook has amazing resources for learning. You can take coding classes, product management classes, and dev bootcamp. They are taught by awesome engineers. The culture values shipping things above other priorities.",
        "summary": "Good place to learn",
        "role": "Anonymous Employee",
        "date": "Sep 15, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The culture of some of the departments is slipping away faster than most people would like to admit. The company is becoming more and more \"corporate\" with more politics settling in. This ranges from managers hiring friends and old colleagues, completely bypassing our interview process, to putting \"policies\" in place against company culture that puts unnecessary roadblocks in place, slowing down productivity. The com… pany is growing, which can be appreciated, but the amount of emphasis that is being put on us that we need to move to being \"more corporate\" is completely against what the company was built on.",
        "advice": "TRUST your employees. A little bit of trust goes a long way. This isn't the government or a large corporation - this is Facebook - a once choice employer who is getting eroded by managers doing their best to build an empire and put as many layers of insulation between them and their lowest ranking employees.",
        "pros": "Amazing amount of perks - food, a truly \"frictionless\" IT department, etc. The benefits package is the best I've ever seen and gets re-examined every year to adapt to the changing company population. Facebook, the company, is amazing. What the company is doing to connect the world is something that is truly astonishing and amazing. Being able to work for an employer that is changing the world before our eyes is somet… hing not many people will ever get the chance to say they were a part of!",
        "summary": "A Once Amazing Culture is Slipping Away",
        "role": "Project Manager",
        "date": "Sep 12, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes, it can get pretty daunting for an intern. Facebook has a ton of internal tools and a lot of internal documentation, and it is easy for an intern to get lost in the myriad of internal stuff.",
        "advice": null,
        "pros": "Even as an intern, I was able to work on high-impact projects for the caching infrastructure. All the people at Facebook are really talented engineers.",
        "summary": "Great place to work",
        "role": "Software Engineer Intern",
        "date": "Aug 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "always very ambitious goals which promotes hard work",
        "advice": "keep being accessible, this is something very inspiring for everybody who comes at Facebook",
        "pros": "Great company values, a lot of thought going in everything being done at the company; open culture: visibility and accessibility to management",
        "summary": "Software engineering intern",
        "role": "Software Engineering Intern",
        "date": "Aug 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- The work culture is largely self-driven. There's no particular structure or strict schedule for getting work done, so if you're not self-motivated, you could fall behind without much consistent feedback for your performance.- Work-life balance can be a little unhealthy at times. There felt like there was a bit of pressure to work even while at home, because a lot of people do.",
        "advice": "Not much. My experience was absolutely incredible, and I learned a LOT this summer. Maybe there could be a better system for suggesting ideas and new projects - I felt like I came up with a handful of cool, slightly bigger feature ideas this summer but they often wouldn't be escalated to the project managers or receive any feedback, and just go unnoticed.",
        "pros": "- Everyone, no matter how \"high up\" they are at the company, is very willing to help with whatever question you might have. You can message anyone at any time and they will generally get back to you within the hour.- As an intern your opinions and ideas are valued. I came up with my own product and feature ideas on the side, and I was able to implement them and test them publicly.- The company culture is very…  open. (Almost) everything at Facebook is no secret - Mark is willing to answer any question you might have about company direction and stance at the weekly Q&As, and at any point you can ask what people are working on, and they're willing to share.- The projects you're able to work on are high impact projects more often than not.- Everyone is passionate about their work and incredibly good at what they do. I learned a crazy amount this past summer.",
        "summary": "The Internship Experience Of My Dreams",
        "role": "Software Engineering Intern",
        "date": "Aug 26, 2016",
        "is_current": false
    }
]