[
    {
        "rating": 2,
        "cons": "There is a lack of hours available.",
        "advice": null,
        "pros": "It pays on a weekly basis.",
        "summary": ".",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Talks about leadership but see little any given dayEveryone so desperate to step over each other to growGood luck eating on timeGood luck seeing you family without email sent to youFulfillment hours are geared to operating so often that people lose livesBonus and stock setup to drive you out before most people actually earn them",
        "advice": "If customer obsession is a leadership principle then respecting those who are customers and helping the company grow should be respected and treated like they are people not machines. The company grows so fast but with the work culture I doubt that it will be a sustainable company, employees already leave so often that sooner or later more will leave and word of mouth will lead to fewer applications and a company tha… t can't hire enough talent and retain the talent. Good Luck",
        "pros": "The brandPride in delivering to customersSmart people all around youGet to experience the feeling of how a fast company is innovating and works from the inside",
        "summary": "Good luck",
        "role": "Amazon Area Manager",
        "date": "May 6, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Work -life balance is in vast majority of roles is not possible. Exceptions are HR,IT, Finance, accounting and recruiting but growth opportunity in those exception roles are a lot smaller.Leadership principles are to set impossible goals but allow failures .Depending on your personality type this can be a \"pro\" In some instances this allows you to get the absolute max out of the different teams. I.e. if I ask…  something that will take 100% of the teams time and effort I might miss out on hidden resources in the team so to ensure nothing is missed I ask for a 200% effort as goal. The team produces a 110% output but falls short of the 200%goal. It is a failure but still a 10% increase. That is the logic behind it. The drawback is that in some cases short sighted decisions are made in the effort to reach the 200% goal. This often ends up costing more than realistic goals would. This process also ends up consuming and burning out a lot of resources leading to high turn over. This, in turn, causes a lot of organizations within Amazon repeat many basic mistakes over and over as the lessons learned are not maintained as the experienced/burned resources have left.Company culture. A bit \"cult\" inclined similar to Apple in the Steve Jobs days.Opinions and issue reports of VP's (no matter how small) and above are treated with utmost urgency and attention. Teams have on average 1-2 fire drills per month with VP escalations. This normally involves a min 3-4 people dropping current tasks with max 1 hours notice to work day, night and weekends to root cause issues spanning from setup to product. Daily or twice a day status updates in terms of full fledged presentations are not uncommon.Company benefits. Not a huge decision factor but helps team bonding to be better in other companies that what I have seen in Amazon. One of the Amazon principles are \"frugal\" which was later changed to \"do more with less\". Meaning that they are not spending money on comfort items like \"economy plus\" tickets for long haul business flights, decent cafeteria food vendors, snacks, beverages, subsidized food for late night overtime work, health activities and other small benefits that helps increase employee satisfaction. Team building activities and events are under tight budget restrictions normally limiting it to affordable dinner and movie tickets. Although employees aren't paid to have fun at the office, they are there to work there is a certain lack of camaraderie in Amazon groups and organization that I have always experienced in other companies which I think is a factor to some people when deciding who to work for as you will be spending a substantial part of your life in the office.Expectation is that you bring work with you home and can support late night calls on a daily basis. If you are an exempt employee you should be prepared to explain and justify why you are not available outside office hours and weekends to support standby and crunch work.Please note that you are willing to adjust to these expectations you have great growth opportunities but it might not be for everyone. What I have seen it mostly employees with small kids or sick family members getting bad reviews for not being \"team players\" or supporting conference calls in other time zones or putting in the \"informal standard\" 50 hour work week and more during crunch times.",
        "advice": "Apply principles and expectations equally across organization. The company principles tend to be used as tools to create ownership and accountability down to the lowest instance of employees in the company. Which is great way to ensure all take their tasks and responsibilities I.e. it takes away the ability for the employee to hold their manager accountable for any shortcomings or mistakes. For example \"you didn't kn… ow what was more important to work on?\" the Amazon principles \"ownership, are right, a lot,bias for action\" means that you should find this out for yourself and drive us to success. Is your manager wrong? Then you own the responsibility to make sure he and all others realizes that they are wrong. The issue comes in when the principles ownership is applied a lot harsher in the lower layers of the company hierarchy. There are a lot of mistakes made in the company but it is very rarely there is accountability and ownership taken for this in the higher segments. It creates a fair amount of misogyny and a lot of time spent by employees to cover for themselves rather than focusing on solving problems.Apply or instate a new principle called \"common sense\". With the unique company culture and size which Amazon has, it is easy to get lost in this kind of alternate reality. Much of this alternate reality tend to be incompatible with external collaboration partners and vendors. It is important to raise the bar but in certain cases some moderation or compromises could be explored in the effort to get there. Certain layers of executive management tend to loose anchor points with reality. I think it could be attributed to the way exec escalations are treated internally leaning a bit more towards a fundamentalist view of how the world and industry should operate. Though this Amazonian close to religious conviction is admirable, in certain cases it makes it very hard to collaborate in a productive way.",
        "pros": "Competitive compensationHigh visibilityGrowth opportunities are abundant and rewarded due to high attrition and turn over of employees compared to other companies of Amazon's size.Decent IT support infrastructure (above average of other companies)Feedback system -everyone in the company can input feedback about anyone. It is only visible to the manager and above of the employee. Note: this tends to be…  abused from time to time.",
        "summary": "Amazon - Great career growth opportunity if you can tolerate unique culture and tough work conditions.",
        "role": "Manager",
        "date": "May 7, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management (some), they don't hear a single word said to them... Sold a dream. They bring you in under the guise of \"family-oriented\" work place... Give it two weeks, tops.",
        "advice": "Listen to your employees and try to compromise some of the time. Stand in our shoes occasionally. And stop holding conversions, and or rafts, over our heads.",
        "pros": "Friendly co-workers... That is it.",
        "summary": "Don't Do It.",
        "role": "Warehouse Associate",
        "date": "May 7, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "workers are unappreciated and no chance for advancement what so ever.",
        "advice": null,
        "pros": "the pay is ok and time off is ok. easy to get hired. co workers are decent people. nothing else.",
        "summary": "place sucks",
        "role": "Anonymous Employee",
        "date": "May 9, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The message from corporate and upper management is \"Associate engagement\" which is great! We strive to engage our associates and remove their barriers giving them a better work experience. That doesn't happen because we are stretched thin on the floor. OPs manager will make you collect details about something going on in another department you don't even manage so they will have details for their report at the end of…  shift. Therefore it is difficult to give the associates the experience they deserve. Work life balance, FORGET ABOUT IT!",
        "advice": "Find a company that cares about their leadership team as much as they want you to care about the associates and maybe we can all have life balance",
        "pros": "The ability to work in locations all over the country and possibly the world. Constantly opening new facilities allowing for growth opportunities if you are OK with relocation.",
        "summary": "Area Manager",
        "role": "Area Manager Level V",
        "date": "May 10, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No unionmanagers can be very unconcernedbad work environment",
        "advice": null,
        "pros": "pretty as many hours as you could wantfairly clean",
        "summary": "Warehouse Associate",
        "role": "Picker",
        "date": "May 10, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There is a long list. 1) breaks are only 10mins they say they give you 2 mins to walk there and 2 mins to walk back. With the amount of work you are doing we should get a full 15 mins. Its basically like working really hard and not getting time to rest. And depending on where u are coming from in the warehouse it can take 4 mins to walk to the break room. 2) don't make friends there because they don't like seeing you…  smiling or laughing on the job and will split u and ur friends up. They are big hypocrites because the managers and pa will be on there phone taking social calls and laughing and talking about going out when they are supposed to be working. 3) managers are rude, disrespectful and micro manage everyone. Literally they don't do anything, all they do is walk around and stare at people. They can't read reports right because they come out saying one thing and really mean another. 4) managers don't know where anything is or how to do something fully. They have never worked with Amazon from the ground up so how can they teach anything if they have never done it before. Like I said the list is long and can go on and on forever. Amazon get it together and don't just hire a manager because they have a degree and no experience. Smh. Horrible package for bonuses, medical, vacation, sick time. No paid time off (because I guess we don't have lives outside Amazon).",
        "advice": "Get more experience under your belt. Understand we make friends at work and will probably enjoy working there if we are working with our friends. Learn how to talk to people. A degree doesn't mean anything if ur rude and disrespectful to ur employees. Empathize!",
        "pros": "There is nothing really good about working here. You are treated horribly and micro manage constantly here. The manager are hipocrates",
        "summary": "This place is like a big high school. Nothing but drama and politics going on.",
        "role": "Warehouse Associate",
        "date": "May 12, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You're basically a number they don't care about their employees at all, all they cared about was the you made rate and we're hitting the numbers they expected. No opportunities for advancement",
        "advice": "Learn your job lol",
        "pros": "You got 3 days off and also had lots of personal time you can use anyday or anytime you wanted to",
        "summary": "Fulfillment Associate",
        "role": "Fulfillment Associate",
        "date": "May 12, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The expectations of the stowers is rediculous. What is expected from the stowers is rediculous. picky about everything we do, every mistake is reported back to us and we get written up for too many mistakes because it's considered bad quality. Building is huge 4 levels and there is only break rooms on 1st and 3rd floor. You have 5 minutes to walk to break 10 minutes to take a break and 5 minutes to quickly walk back.…",
        "advice": "Realize not everyone is going to work like a robot. Writing people up for making mistakes/not meeting expectations is rediculous. Let people learn from their mistakes and give time to improve instead of writing up. Treat us like humans, not robots.",
        "pros": "40 hours a week, constant overtime opportunities, flexible schedule, managers are easy to talk to",
        "summary": "Unrealistic Expectations unless your a robot",
        "role": "Tier I Associate (Stower)",
        "date": "May 15, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Company treat low to mid-level employees as disposable parts",
        "advice": "Well, that NYT article has said enough.",
        "pros": "Have opportunity to learn and build systems.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lifting 49 pound + boxes every 90 seconds or less by yourself, No weekends, No life balance, No support from overwhelmed HR, No transfering inter-department for good workers",
        "advice": "Allow good workers to transfer before their body gives out. If I had been able to go to ICQA I would still be working there today.",
        "pros": "Weight loss, benefits from day 1, steady work, Vendor coins, BNA bucks, Everything is online, No \"real\" dress code, free safety gear",
        "summary": "I lost 40 pounds in 2 months.",
        "role": "Outbound Order Picker",
        "date": "May 17, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Poor management, poor HR, lack of communication within the whole warehouse",
        "advice": null,
        "pros": "Set schedule, 3 days off, always work",
        "summary": "Fulfilment associate (Tier 1)",
        "role": "Anonymous Employee",
        "date": "May 18, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Favoritism, doest value hard workers, managers don't care about you",
        "advice": null,
        "pros": "Competitive wage , cross train , friendship with many co workers,",
        "summary": "Warehouse associate",
        "role": "Anonymous Employee",
        "date": "May 21, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "long work hours, evil managers who have free reign to do as they wish. If you're lucky to get a good one, great, but most people aren't that lucky. Super high turnover. Just read all the bad press-it's true.",
        "advice": "stop working people to death and promoting bad managers",
        "pros": "fast-pace, working with very smart people, tech environment, casual dress code, modern buildings, amenities, salary and bonus are above market",
        "summary": "Take what you can get out of it but be prepared...",
        "role": "Anonymous Employee",
        "date": "May 21, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Walking for 10 hours a day",
        "advice": "Learn your employees names",
        "pros": "Good benifits, plenty of overtime",
        "summary": "Not worth it",
        "role": "Picker",
        "date": "May 21, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lack of camaraderie by co-workers, management and even security. Most employees are distrustful of management for the way they handle union talk and how the treat employees. The constant pushing of unattainable rates just so they can weed out employees and boost their numbers. Lack of transfer opportunities or career advancement.",
        "advice": "Learn to value the options of the employee. Don't talk down to them, listen to their concerns.",
        "pros": "One good pro is seeing the items that you normally wouldn't see in brick or mortar stores up close. This job helped with acquire some skills I can put to use in another field. And then offering a career choice option for people whonwantnto go back to school for another is a plus by them.",
        "summary": "Amazon fulfillment good for short time",
        "role": "Mezz Pack Associate",
        "date": "May 22, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management can be abusive. No consideration for work life balance. Internal competition borders on being cut throat. CEO never gets the true picture from upper management. Too much sanitization of the message.",
        "advice": "Leadership principles are great, but they're only applied selectively. For example disagree and commit is used to reprimand employees. Too much emphasis is placed on bias for action not enough on teamwork and being right.",
        "pros": "High value on getting things done. Company is open to new product ideas, and willing to take chances. Good place for new grads to gain a lot of experience quickly.",
        "summary": "Fast paced and intense",
        "role": "Anonymous Employee",
        "date": "May 24, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Political, Condescending, Long Hours, Holidays, Hourly employees are treated very poorly with a lot of false promises. Dirty buildings with no amenities. AWFUL WORK LIFE BALANCE",
        "advice": "Think about someone other than yourself",
        "pros": "Competitive Salary, Good Benefits, Substantial bonuses. Good exposure with the big company name on your resume.",
        "summary": "Not For Everybody",
        "role": "Anonymous Employee",
        "date": "May 24, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Terrible work life balance. You practically live at the warehouse and can hit 60+ hours if in any of the level roles vs. the warehouse associate roleNo standardization, which is a positive at times but this means the leadership team can run it however they want with no consequence as long as the numbers are made.Management can be shady and will push you out if they do not get along with you even with … great performance marks. They will tie something to you and let you go.Relocation can be detrimental to your move and needs improvement for those being relocated across country.In the warehouse environment in the leadership team, can be punished for using time off. But not rewarded for volunteering oftenEthics line is useless and will not follow up",
        "advice": "I would like to disclose that this is not all Management as some leaders are great but are held down by the others unwillingness to change or keep people in the building that just agree and don't challenge.Managers, approach seek to understand with positive intent on the employee. I personally saw multiple wrongful terminations happen due to manipulation of evidence. This is not ethical or fair to your grunts…  nor team. Care about your employees and they will put out miracles for you.Also, remember the leadership principles. Leadership, not all, have completely ignored them and should be used more often and remember where the company came from. Everyone in that building in Amazon, not just you.",
        "pros": "Great fast paced environment and have lots of opportunity to learn new skills and grow.Competitive pay and benefitsLots of people with potential",
        "summary": "Fulfillment Side Shady unethical",
        "role": "Human Resources",
        "date": "May 25, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very hard to move up in the company. I was told point blank that I was under qualified for a role I was over-qualified for and that I would have a better chance at moving up if I left the company and came back. Management shows heavy favoritism in warehouses, valuing sociability and production over skill and knowledge. Management was more focused on making people better at what they are bad at than putting people whe… re they work well and excel. Overall moral among tier 1 associates was fairly low on average and management was quick to blame associates for systemic problems.",
        "advice": "Focus more on building people's strengths and encouraging people to succeed and advance rather than treating individuals as expendable work horses that you can beat into the dirt and toss aside like garbage. Focus more on individuals whom are qualified to perform certain tasks rather than chose based on who you are friends with.",
        "pros": "Company is extremely customer focused and makes sure that they can do as much as possible to fulfill every customer demand. Amazon does a lot to innovate every stage in their processes to make the customer experience as simple and efficient as possible while keeping it cost effective and fast. Benefits were outstanding and compensation was at least competitive with the rest of the region.",
        "summary": "Customer Centric Company",
        "role": "Fulfillment Associate",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Salary is to low the wage scale ceiling is way to low they move you to any department theyes want to suit there needs if you don't make rate they fire you",
        "advice": "Management should support the fullfilment center employees request more than they do most of the suggestionsame are valid and would benefit the company",
        "pros": "Good benefits four day work week and lot of flexibility opportunity to transfer to many location",
        "summary": "Fullfilment associate",
        "role": "Line Leader, Order Fulfillment Department",
        "date": "May 27, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Long hours, standing on your feet all day, extremely physically demanding, mandatory overtime",
        "advice": null,
        "pros": "Great benefits, great pay, you will meet really cool people",
        "summary": "Wouldn't reccomend but if you like warehouse work you may like this",
        "role": "Anonymous Employee",
        "date": "May 27, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "they are right up happy it kinda sucks",
        "advice": "please select management better and please understand people give their best but your standards are a little too high",
        "pros": "great pay and great benifits.",
        "summary": "Those 90 days suck",
        "role": "Anonymous Employee",
        "date": "May 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Hours, progression, opportunity, work-life balance",
        "advice": "invest in employee relations at the management level",
        "pros": "Stocks, Location, Outlook, Interesting, Salary",
        "summary": "Burnout central",
        "role": "Anonymous Employee",
        "date": "Jun 1, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lot of smart people but most of them are weird, narcissistic, arrogant or loud. its hard to find normal people. Even though there are lot of learning opportunities you end up learning nothing. the main reason, there are always too much work (volume wise) but not quality wise. there are too many cross team initiatives, you cannot focus and work on one thing and feel accomplished. if you love your life, really feel pas… sionate about work, find a better employer, this place will suck the blood out of every employee and sometime you realize it much later after spending few years with them",
        "advice": "Change Annual Review Process. Claiming Amazon as a data driven company but everything on the annual review process is subjective. one thing you can actually measure is deliverable, that should be the measuring stick not some weird leadership principle which is interpreted by each team differently. Second, I have seen same feature or functionality developed at at least half a dozen times within different parts of amaz… on. decentralization is good, helps to move forward fast at the same time - reinventing the same wheel 5 times does not makes sense",
        "pros": "Lot of challenging work, quite a bit of smart people, cutting edge technology, some company wide practices are great like writing working backward document before start building a product",
        "summary": "If you are Normal or Nice Person, Run in the other direction",
        "role": "Product Manager",
        "date": "Jun 1, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "IntegrityCare for employeesEmployees aren't cared for. I was asked to fudge a review about one of my employees in order to help fit the review curve.Had to fit a mold or else you wouldn't make it. Individuality not appreciated.Left on my own terms, was told I was a regretted attrition.",
        "advice": "Treat employees like humans and don't pit them against each other",
        "pros": "Critical ThinkingCustomer FocusResourcesCompany was amazing customer focused, and I learned so much about critical thinking and developing business cases and plans",
        "summary": "Learned so much, but treat employees terribly",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not worth all the politics to throw each other under the bus to take the next step up. They promise they care about associates but they are willing to push them as hard as they can.",
        "advice": null,
        "pros": "Ability to grow from within the company up to higher manager positions in the company.",
        "summary": "Not worth it",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Limited growth opportunities and lack of coaching/feedback (I'm identified as very high potential and yet I have no coaching even after asking for it --- seems weird)Lack of vision and constantly changing vision from org's senior management.Lots of management churn in org (on 5th manager within 2 years).Don't feel intellectually challenged by work.",
        "advice": null,
        "pros": "The people in the org are generally smartThe pay is decent.Blah, blah, blah.",
        "summary": "Ehh...",
        "role": "Senior Project Manager",
        "date": "Jun 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Its all about the external customer and ZERO about the internal customer. Specifically the area managers. They take AM's for granted and work them into the ground. It's frowned upon if you work less than 55 hours in 4 days. The workload is unrealistic and intentionally unattainable. Senior management constantly stresses and brags that Amazon is all about \"associate engagement\" and pushes AM's to focus on that the mos… t yet they pile on a million other projects and expectations to the AM's and they have little to no time to truly focus on team engagement. Either you fit their perfect mold or they will find a way to get rid of you. Don't allow or foster individuality whatsoever. You are just another sheep they demand to herd.Ambiguity environment is over the top insane.",
        "advice": "Start focusing on getting feedback from the AM's on what they need and want and not just the associates. Reevaluate how much work you continue pile on the AM's to the point of causing overwork and burn out. Completely revamp OLR process. It's horrible and cruel how the entire process is decided. Pay raises are a joke. Average is 2-3%.",
        "pros": "Restricted Stock Units. Benefits. 4 day work week. Maternity leave is good. Met some cool people. No other pros!!! Zero, zilch, nada!!",
        "summary": "MISERY",
        "role": "Area Manager",
        "date": "Jun 3, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Zero career growth (managers were open about no promotion track past X level)Terrible management structures (Mangers just ran interference to keep you from bothering Director/VPs)Culture is as bad as you've heard -- all the way to the topLow margins everywhere includes the employeesVery low Equity vs CompetitionLong-timers suffer from stockholm syndrome",
        "advice": "Current trajectory is great for revenue, but is unstainable from a human capital perspective. Not a place I would ever work again.",
        "pros": "Cool tech -- Cloud was *the* new hotness while I was there.Logo looks nice on resume",
        "summary": "AWS -- top heavy management, poor culture, opportunity boom is already over",
        "role": "Senior Solutions Architect",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-not great customer service when it comes to employees; terrible work life balance, for someone in the RC role you are on call and constantly available whereas other roles in recruiting may have more flexibility; currently I work 10-12 hours days and most weekend nights as well and still always feel behind.; Amazon seems notorious for seeking the most amount candidates for roles that don't even exist yet; constant am… biguity and not a lot of consistency",
        "advice": "Offer more chances for development for employees, especially for those who may be struggling in the role; be more engaged with the team, know more of the team as a group; the functions of each role and what they do and don't handle; provide more headcount for the team for work load balance (stop being so cheap when it comes to your employees!); provide managers who are willing to work with employees not push them up … or out",
        "pros": "flexible, work from home culture, great innovative events to go, the perks (concert, Amazon events, great benefits package, 401K); great place for type A folks, or people who come to get things done; offers great customer service to it's customers",
        "summary": "A Great Place for Hard Works..Terrible place for Work-life Balance",
        "role": "Recruiting Coordinator",
        "date": "Jun 6, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Strange hours, hard work, little breaks",
        "advice": null,
        "pros": "Benefits, Decent Pay, Bonuses, and opportunities to succeed",
        "summary": "Hard but Fair",
        "role": "Fulfillment Associate",
        "date": "Jun 9, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No one had time to give mentorship. Incredibly cuthroat within my division",
        "advice": null,
        "pros": "Solid pay. Great internship staff.",
        "summary": "User Experience Design Intern",
        "role": "Anonymous Employee",
        "date": "Jun 9, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Upper management is highly competitive and cares more about the performance than morale of the team. 401k matching is only 2%. They are overall misleading in the recruitment process and leave out important information. In the FC's, all management works at least 12 hours a day, four days a week, even though the recruiting staff says its four 10 hour days. That also means the week of personal and vacation days you accr… ue only amounts to four days of both, not five. You may get pressured and not allowed to use your days if the team isn't performing well. There is only a 50/50 chance of working nigh tshift, but once you're on nights, the likelihood of switching to days is minuscule. As an incoming new manager, your shift really comes down to chance. Starting on the same day with the same amount of seniority, one person may be given Mon-Thurs Days and the other Fri-Mon Nights. And there's nothing they can do about it to change it regardless of other family commitments. Not suitable for those with families unless your spouse is willing to stay at home full time and support you.",
        "advice": "Take a second from trying to push performance and listen to your Area Managers. They are the front lines of the operation. If they aren't happy, you'll have a hard time driving results.",
        "pros": "Amazon is a great company to work for. They touch many lives and obsess over the customer. Stock bonuses are great if you manage to stay for the amount of time they require to vest. If you are highly competitive and can focus 100% into your career above all else, you may do well.",
        "summary": "Area Manager (L4)",
        "role": "Area Manager",
        "date": "Jun 10, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "They will work you till you cant anymore",
        "advice": "Pay more attention to how the associates feel",
        "pros": "Great pay, lot of room for extra hours",
        "summary": "Outbound picker",
        "role": "Warehouse Associate",
        "date": "Jun 11, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "They knit pick about everything and are notorious for firing people. Their scheduling sucks. Most people get stuck on a every weekend shift",
        "advice": "Pay more attention to the positive of the work the employees due versus the negative.",
        "pros": "Decent pay...... for a teenager $13.00 hr. Easy interview easy work for a warehouse",
        "summary": "Ok for now job",
        "role": "Fulfillment Representative",
        "date": "Jun 12, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Everything else. You don't get paid NEARLY enough for the work they ask you to do. They offer VTO and then complain that it's being taken. They send you to AMCARE (nurse) for every little thing, but a big thing happens and it gets swept under the rug and you are made to feel like crap if it bothers you. Management doesn't take you seriously. It's hot as heck, and you have to walk 5 minutes to the break room and it co… unts against your break. Also, they preach \"SAFETY!!\" a million times a day, but in reality, they don't care. They tell you to report \"every little thing.\" and then they complain when you do.",
        "advice": "We work hard. Maybe you need to see that a little more clearly.",
        "pros": "The only good thing about working here is that you can manage your time off from your smartphone, which helps those of us with anxiety get things done.People are relatively friendly.You have the option to cross train.If you stay long enough, they have good benefits like schooling and stock.",
        "summary": "Absolutely not!!",
        "role": "Fulfillment Associate",
        "date": "Jun 14, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "My experience during my first 90-120 days was that it was a very unusual culture and that something was amiss, although it was difficult to put my finger on it; then the infamous NYT article hit the press. While some of the themes resonated with my observations, it didn't completely align with my experience at the time. Fast forward to six months later (Spring 2016) and our team culture and dynamics had become the em… bodiment of the NYT article, including people crying at their desks, fragrant violations of FMLA relating to parental rights and serious illnesses (e.g. we can't delay this project due to the poor optics, too bad you or your spouse is seriously ill), and teammates working long hours every weekend for months on end. Our team has had > 50% voluntary turnover in the last 11 months, with another 33% actively looking to leave. Health issues abound on the team due to the stress and regular beratings which occur daily and are justified by the \"Leadership Principles.\" It is the epitome of a toxic workplace.To be fair, this does appear to be isolated to certain teams and your experience can be totally hit or miss. I have spoken to people who have moved around the company and have said that while it exists in pockets (how many is uncertain) there are places that are sane and enjoyable. If you're considering employment at AWS, probe deeply in this area if things like culture, work:life balance and your health are important to you.",
        "advice": "- Professionals with 10+ years of experience don't need micromanagement- Eradicate managers who abuse the Leadership Principles to justify mistreating employees or denying them rights protected under Federal law- The anonymous feedback system doesn't yield actionable feedback and fosters an environment of mistrust; anytime feedback is fine, but open up the system so that all aspects of feedback are visible by…  the recipient",
        "pros": "On many teams there is an opportunity to learn a substantial amount in a short period of time and build skills that are valuable in the marketplace.",
        "summary": "Exercise Caution",
        "role": "Anonymous Employee",
        "date": "Jun 14, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The revolving door aspect of the hourly ranks is frustrating. Building knowledge is a struggle due to the transient nature of the hourly workforce.",
        "advice": "It is always challenging to find the right combination of capacity and stabilizing the workforce. I understand the conflict, but I believe it compromises the quality of service.",
        "pros": "Their leadership mantra is strong and logical, consistent with my own. The founder's vision of re-investing in the enterprise is a good sign for the long term success.",
        "summary": "Life work balance",
        "role": "Operations Manager",
        "date": "Jun 15, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Well you feel as if you are working in a prison and ontop of that the pay is high but the reason is that they take out SO MUCH TAXES and it feels as if your only making 10 dollars an hour there in death row. The job itself is extremely easy...too easy... next thing you know you will be counting numbers in your sleep. And to even becoming anything higher then you are you have to be there at least a year and also if yo… ur scheduled graveyard shift you will never be able to switch to day shift even though they say in orientation you can after 30 days but there is such a long waiting list to even get close to being accepted to go work days so your sleep schedule will be horrid",
        "advice": "-",
        "pros": "Benefits are amazing!!!!!!!!!!! everything else....No.",
        "summary": "How I feel",
        "role": "ICQA",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The culture and talent management systems are not set up to make people succeed. There is fear and denial in wanting to look at the root cause issues and make real changes.",
        "advice": "Take a systems look at the issues that were spelled out in numerous articles on the culture. There are several practices that happen that cause much of the pain people experience.",
        "pros": "The chance to work on numerous problems, work with motivated people. You will get a chance to develop grit.",
        "summary": "Sr. HR Program Manager",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The work is tedious. You only get 10 hours of Approved Time Off (ATO) for the year, but there is a good chance you won't get that time you earned, which is unfair. If you miss 4 days of work without ATO, you're fired. They offer no health benefits or paid time off. The schedules can be weird and the hours are not flexible. So you can forget travel plans and being sick. I wouldn't recommend this place if you want to b… e treated as a valued employee and not a robot. They ask for too much but give too little back to associates. Amazon works with a Temp Agency to hire seasonal employees until they can convert to Amazon. This obviously isn't working for them since they keep losing associates.",
        "advice": "Treat your employees fairly, realize they can't always be as perfect as you want them to be. There are a lot of great workers there, recognize and reward them.",
        "pros": "This review is in regard to work as a seasonal part time Prime Now associate. What you'll be doing is walking for 5 hours, picking items and prepping them for delivery, you have to be a fast worker. You get one 15 minute break. I didn't mind the walking, but you will be sore at the end of the day. Good exercise though. The co-workers are very nice people, a couple of the managers were awesome. You can pick up a coupl… e of good skills working in a fulfillment center.",
        "summary": "PT Seasonal Associate",
        "role": "Fulfillment Associate",
        "date": "Jun 16, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "sucky place sucky management plays favorites",
        "advice": null,
        "pros": "great pay and health benefits",
        "summary": "sucks!",
        "role": "Trainer",
        "date": "Jun 17, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Despite all of Amazon's Leadership Principles about long-term thinking, Amazon looks at their human resources as short-term assets. They drive people extremely hard. I was hired to manage one location, but was soon managing multiple locations and running projects in other locations. Travel was not mentioned in my hire, but I was traveling at least one week per month and up to three weeks.Amazon uses stack ran… king, so after spending a lot of time making quality hiring decisions you will, annually figure out who you have to cull.Amazon has poor project management. Major projects like code changes, infrastructure implementations, and new site builds, are usually approved late and understaffed, but the executive management will hold the project managers to the original project timelines and sometimes even insist on \"early\" completion. I and many of my peers completed multiple projects not because they were well planned or properly resourced, but because we were dedicated professionals who wouldn't let them fail. Dedicated professionals will only do this so long as they think the company has their back. Driving employees like this is the status quo at Amazon, and it is a primary reason why attrition is high. When I left I was more senior than 78% of the work force. Most employees will not see the majority of their stock options because Amazon back loads the payout. Executives are well aware that most employees won't stick around to get them all. The theme is work them as hard as you can while you can and then hire someone new.Finally, in spite of heavy growth, internal promotions were almost non-existent. Round after round of external senior managers were brought in while hard-working managers at my level were passed over time and again.",
        "advice": "Care about your people. This is truly the only way you can build a long-term company. You cannot expect people to travel all the time and work 55+ hours year round. Also you cannot hypocritically mandate managers work fewer hours while keeping their workload the same.",
        "pros": "The people: fellow managers, team members, and customers. I enjoyed working with a large number of highly qualified managers and team members from around the country and world. They are sharp folks.I enjoyed hearing from customers about how well they like the service we provided. I liked being part of a large well-known, well-thought-of (by customers) company. It was one of the only places I've worked that I … didn't have to explain to people what we did.My base pay was decent and benefits were good.",
        "summary": "Relentless Expectations and Travel",
        "role": "Technical Services Manager",
        "date": "Jun 17, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "What you've heard about the company is true. While it can and does work out for many, if you are a female over 40, the odds are not in your favor. If you are Black or Latino the odds are NOT in your favor. Amazon has a HEAVY population of white males, Asians and East Indians. Nothing against any of those groups of people. They just do not share the love to everyone else so if you fit into one of those groups you are … GOLDEN! No matter what they tell you Delivering Results reigns king and it is by any means necessary. If you are a people leader, you can kiss your personal life GOODBYE! If you have a college degree of any level but you just \"want to get a foot in the door\"; don't believe it. You will be stuck at the lower levels because Amazon does NOT value promoting from within and through the ranks. If you are a twenty-something fresh face college graduate with zero management experience, this is the place for you! Oh but they won't tell you how those skills that you don't have will come back to bite you later. If you are analytical by nature and work better alone DO NOT TAKE A PEOPLE LEADER ROLE. You will get zero training about how to lead people but you WILL be held accountable for being able to engage and motivate people. If you don't know how, don't do it!",
        "advice": "Stop just going through the motions. Learn how to really care and demonstrate it. Stop thinking that for the associates you are competitive and fair when it comes to compensation. YOU try raising a family or having a decent life making what they make.",
        "pros": "Benefits are awesome. As a \"leader\" compensation is great. There is the added bonus of having Amazon on your resume",
        "summary": "Unless you just can't find a job any place else run the other direction",
        "role": "Former Customer Service Manager",
        "date": "Jun 17, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Managers are rude for absolutely no reason",
        "advice": "You must treat all employees better",
        "pros": "They provide you with a steady job",
        "summary": "warehouse",
        "role": "Anonymous Employee",
        "date": "Jun 18, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Where do you find your managers, in North Korean prisons?- Wicked relationship between business and IT- Indian cliques and the lack of diversity- The culture of drinking alcohol in the office, during the day- Poor support of local initiatives (you are not Microsoft)",
        "advice": "One day your golden wave will crash. Then lawsuits will follow. Better start fixing your abusive culture now.",
        "pros": "- Amazon will teach you about your own limitations- Great compensation- Access to interesting projects and top-notch technologies- Brand new offices in attractive locations- Great company picnic and other events- Executive management is top notch",
        "summary": "Dysfunctional, innovative and mythical",
        "role": "Software Development Engineer III",
        "date": "Jun 20, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Constant stress to hold rate. Constantly hiring and firing",
        "advice": null,
        "pros": "Quick hire and unlimited hours to work",
        "summary": "Turnover",
        "role": "Anonymous",
        "date": "Jun 21, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The training consist of watching videos and demos. Also taking test after videos.You are expected to do hours and hours of training and pass the test.Training is rushed.When you have questions your team lead is hard to get in touch with.The network they uses has many glitches they tell you to call IT...but good luck with that... On hold for hours with no resolution resolved.",
        "advice": "Stop trying to forced so much training in very little time.",
        "pros": "No commute.easy process in the hiring process. The pay is 10 dollars per hour good pay considering working from home.",
        "summary": "Rushed training and terrible glitches in the log in systems.",
        "role": "CSA",
        "date": "Jun 21, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management associate engagement and HR is not for the people",
        "advice": null,
        "pros": "Health insurance. Stock. Vacation paid to off unpaid time",
        "summary": "Work life",
        "role": "Warehouse Associate",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "expects numbers over safety",
        "advice": "Really hard to get",
        "pros": "great for people 23 and under",
        "summary": "Associate",
        "role": "Anonymous Employee",
        "date": "Jun 22, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Managers have no heart, are like robots, they are the worst managers I have ever seen they don't have a clue, lots of favoritism, everything is black and white",
        "advice": "Chose better managers, change your goals and expectations of your employees",
        "pros": "Pay good, overtime available, payed time off",
        "summary": "Wharehouse associate",
        "role": "Wharehouse Associate",
        "date": "Jun 23, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Really is no work life balance and you need to move back within one year or get a black mark",
        "advice": "Do regular audits of your employees and managers",
        "pros": "Constantly working with new technology",
        "summary": "Sweat shop",
        "role": "Anonymous Employee",
        "date": "Jun 25, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Very long hours and work weeks. It is not unusual (and usually expected) to put in 70 plus hour work weeks even outside of peak. GM/Regional leadership is very spotty. Some very good leaders, but way too many poor leaders who focus on their own success at the expense of their managers. Managers are viewed as expendable and are lured/kept by providing stock shares that vest in the future.",
        "advice": "Worry as much about the development/welfare of your managers/leaders as much as you do the associates. Let the leaders run their business.",
        "pros": "Very good leadership experience. Good pay and the ability/expectation to drive change. Strong culture on providing specific feedback on performance and opportunities to improve.",
        "summary": "Sr. Operations Manager",
        "role": "Anonymous Employee",
        "date": "Jun 27, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Works you like a slave",
        "advice": "Good management.. Don't make your permanent job..",
        "pros": "Good paying job. Make sure to work ICQA.. the easiest job you can take/be part of...",
        "summary": "Amazon Fulfillment Warehouse",
        "role": "Packer",
        "date": "Jun 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very shady leadership. They are unethical. Read NY times.",
        "advice": null,
        "pros": "Good name. Company doing good things",
        "summary": "RLD",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No benefits, delivering over 150 packages daily, changing rules daily.",
        "advice": null,
        "pros": "Flexible Scheduale, decent pay for first time job",
        "summary": "Amazon Logisitics",
        "role": "SMX Deliver Driver",
        "date": "Jun 29, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "long hours, shift work, little to no advancement",
        "advice": null,
        "pros": "wonderful pay, monthly bonuses, company discount",
        "summary": "Operations Administrative Assistant",
        "role": "Operations Administrative Assistant",
        "date": "Jun 30, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The company expects way too much out of each associate. The management is not always understanding of your current situation.",
        "advice": null,
        "pros": "The company offers great benefits for employees and many hours of over time during their peak season. Pay is good too.",
        "summary": "Pick",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you get on a bad team, the job is horrible. You can be faced with unrealistic expectations and forced to work 70+ hours a week.",
        "advice": "If you really want to retain people, you should have a system that allows employees to express concerns. Supposedly, Amazon addressed the problems expressed in the NY Times article, but my experience the past 6 months proved otherwise.",
        "pros": "Great job if you are on the right team. Most employees, especially at the corporate level, are very intelligent. You get to work on new projects all the time. I've had a series of excellent bosses who developed me.",
        "summary": "Business Analyst II",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Work life balance. High attrition levels drive excessive hours on remaining management teams. Expect to work 50-70 hours per week.",
        "advice": "End stack ranking. Very outdated and severely mismanaged to the detriment of the company.",
        "pros": "Innovative company. Challenging environment. Access to many tools and opportunities to work with good leaders until they are fired or quit.",
        "summary": "An experience worthy of its own comic strip.",
        "role": "Area Manager",
        "date": "Jul 3, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No communication, long hours standing in one place.",
        "advice": null,
        "pros": "Decent pay, easy to do work",
        "summary": "Packer",
        "role": "Anonymous Employee",
        "date": "Jul 4, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "They expect you to have an open schedule, they change hours randomly, so one day you could come in to work at 7am and the next day at 2am.",
        "advice": "Stop treating the people working there as if they were children. People have responsibilities and bills to pay.",
        "pros": "It is a fairly easy job to do. The pay is better than minimum wage.",
        "summary": "warehouse associate",
        "role": "Anonymous Employee",
        "date": "Jul 4, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "management is either nearly always wet behind the ears, or get overly confident about the amount of \"experience\" they have, regardless ends up leading to everyone stepping on each others toes bc of different management styles, also a huge lack of communication. Those in lead positions (pg, problem solver, sherlock, etc) should be paid more",
        "advice": "Need to improve their communications within departments so that each manager is on the same page regardless of front/back half shifts or day/night shifts",
        "pros": "great benefits, good coworkers, diverse environment, opportunities to cross train in other positions or departments, career choice program is a great way to help pay for school for associates",
        "summary": "Good benefits, Terrible management",
        "role": "Anonymous Employee",
        "date": "Jul 5, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "So many people in and out of that place that is really impossible to get to know anyone. Too much petty drama. The breaks were horrible at best. The location I worked at was huge and it took forever to get to the breakroom.",
        "advice": "Do something about the breaks. Put an end to the petty drama and last but not least stop hiring people straight and put them in management roles. They don't have a clue and drag the whole company down.",
        "pros": "The healthcare and dental benefits are really nice and the people I worked with were really awesome. Free swag all the time.",
        "summary": "Warehouse Associate",
        "role": "Anonymous Employee",
        "date": "Jul 5, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not a lot of room to growNot allowed to really talk on the floorBenefits and time off is not reasonable.",
        "advice": "If you want to keep employees, give them a better benefits and time off package. No one is going to be able to squeeze all their time off into the small allowance you give.",
        "pros": "Nice starting pay, almost guaranteed your full 40 hours",
        "summary": "Seemed awesome until you got through the door",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Absolutely no autonomy. Completely micro-managed.",
        "advice": "Trust your employees and their ability",
        "pros": "Fast-paced. Never a dull moment. Always learning.",
        "summary": "Technical Account Manager",
        "role": "Anonymous Employee",
        "date": "Jul 8, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Everything is urgent. Spent way too much time in escalations because everything was a Bezos priority. Way too much context switching for my liking,",
        "advice": null,
        "pros": "Lots of things get done",
        "summary": "Like drinking from a fire hose",
        "role": "Senior Technical Program Manager",
        "date": "Jul 11, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Management sucks. You have multiple managers telling you different things, no one is ever on the same page. Once you convert to permanent you will have to fight for your hours. They don't care if this is your only job or that you have kids, bills, or sick family members. I would not recommend this job to anyone unless you have another job or people to fall back on when they start to cut hours or fire you!",
        "advice": "Communicate more to all associates/ managers so that they will know everything they need to know in order to do their job the right way.",
        "pros": "Sometimes work can be fun and entertaining. Small work shifts. Theme days, music.",
        "summary": "Prime Now Fullfillment Associate",
        "role": "Fulfillment Associate",
        "date": "Jul 13, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "everything else includingworkpeople (some not all)the warehouse",
        "advice": "This is your classic sweatshop. They tell and rush you to your breaks and lunches. for example they give you 15 minutes break but only give you 2 minutes to get to the break room. When the facility is like 3 football fields put together. For a 12 hour shift you only get a 30 minute lunch. And don't even think about going to the bathroom outside of break because that goes against your time off work quote.",
        "pros": "paybenefitstime ofbreak roomsfree gloves",
        "summary": "stower",
        "role": "Stower",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Almost too many to mention....ridiculous rates to be met under poor working conditions. It's almost like sending cattle to the slaughter with the mentality that prevails.",
        "advice": "Be more helpful with employee issues and actually listen to what they say. Put yourselves through the actual jobs on a regular basis to see how difficult it is to make rate.",
        "pros": "There weren't too many pros......four day work weeks were nice. There is plenty of opportunity for overtime and you meet good people.",
        "summary": "Picker",
        "role": "Picker",
        "date": "Jul 14, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No work/life balance. Burn out. No down time.",
        "advice": null,
        "pros": "Great People. Metrics driven. Great benefits for new parents.",
        "summary": "Infra Ops",
        "role": "Anonymous Employee",
        "date": "Jul 16, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Rates, You're tracked as if in prison. Middle of nowhere",
        "advice": "Cut the rates",
        "pros": "Benefits from day 1, okay Pay, 4 day work week",
        "summary": "Dont do it",
        "role": "Anonymous Employee",
        "date": "Jul 19, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Work-life balance is very poor. Unfortunately the only people that get promoted are the people who put their jobs first. It is great place to work for single people, but not if you have a family or want one.",
        "advice": "Spend more time investing in your best assets: your employees!",
        "pros": "The environment is always changing, super fast paced and is innovative.",
        "summary": "Fast paced and Busy",
        "role": "Process Engineer",
        "date": "Jul 19, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Misogyny Abounds. Be warned, if you are a female with career goals, you'll watch male counterparts around you be promoted and succeed twice as fast, while putting in half the time, effort, and talent.",
        "advice": "Care, really care, about gender bias issues.",
        "pros": "Surrounded by smart people, and some have the opportunity to grow into leadership roles fairly quickly.",
        "summary": "Misogyny Abounds",
        "role": "Anonymous Employee",
        "date": "Jul 19, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Bad Management, no LEADERS. If you are one of the guys, then you will get far, they cream over military and not all the time they are great.",
        "advice": null,
        "pros": "Good People to work with, hours are heavy but easily work with home life.",
        "summary": "Amazon Fulfillment, Eh.",
        "role": "Human Resources Assistant",
        "date": "Jul 21, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "long hours 10 hours a daytoo many rulesshort breaksa lot of standinga lot of walking",
        "advice": "too much for me to write",
        "pros": "decent money in your 20'sfull timepromotions right wayno uniformfriendly employee",
        "summary": "working at amazon",
        "role": "Problem Solver",
        "date": "Jul 22, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Drama, feels like high school, people constantly on your back, bad morale",
        "advice": "Train your managers better. I made top 10% in my department for 2 months, still had the manager harass me everyday til I quit. Write ups are a joke",
        "pros": "Decent pay, meet a lot of people, paid time off and voluntary time off options",
        "summary": "Job sucks bad",
        "role": "Stower",
        "date": "Jul 22, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-ABUSIVE culture where workers are rated based on speed and accuracy, turn over rates are extremely high in warehouses-extremely low morale at work-workers treated like machines and often forced to work mandatory overtime, managers don't care if you're tired or if you didn't have enough sleep.... you are expected to hit rates everyday(or week)-a lot of dumb coworkers since they hire mainly people with hig… h school diplomas/ GED, some don't even have it-incompetent managers",
        "advice": "quit treating people like machines",
        "pros": "perks included:-health benefits-partial dental/vision benefits-tuition support up to 3k a year after working full time as a blue badge-restricted stocks, can't sell until you've worked there as a blue badge for 2 years and you lose it if you leave the company before the 2 years are up-easy to get hired since they need so many workers at the warehouses-tasks are easy to learn but repetitive…  and boring-lots of opportunities for overtime and moving up",
        "summary": "people treated like machines",
        "role": "Warehouse Associate",
        "date": "Jul 23, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "To say Amazon (warehouse, line packaging, etc..) is fast paced is an understatement. They expect you to be so fast and meet such high productivity goals the job is miserable (physically damaging and painful to your body). The ergonomics of the work stations are horrible! You strain your back constantly. They expect you to work so fast that you can't take even a few seconds to lift properly and still meet productivity…  goals. If you stop for just a few moments to step in the bathroom, use the urinal as fast as possible and go right back to work you'll be under the productivity demands the rest of your shift. You have to pack at least 160 items an hour. That includes checking the computer screen, getting a box, taping the box, applying the label, getting the item, scanning the item, packing with padding, sealing the box, scanning the box, and then putting it on the conveyor.",
        "advice": "Be accommodating to employees ergonomic needs which will reduce injuries. I asked to work the sorting area at least part of my shift to reduce back strain and they said \"No.\" I asked to do another job at the facility for which I had almost 20 years experience at another employer. They refused until I worked there a full year.",
        "pros": "If you're young with little job experience this would be an ok place to work. Good benefits, decent pay, a lot of overtime if you want it.",
        "summary": "Beware",
        "role": "Packager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There are not many pros in the current configuration of Amazon Prime Now Flex. The workload has increased substantially and the manpower has been effectively reduced through the misuse of the flexible scheduling option. Some employees scramble to be online so they can snatch availability at the location I am associated with; some of them go for weeks with no hours available to work. I was shocked to see how insidious…  the lure of a change in status of employment from part time seasonal to a permanent Amazon hire was used to basically trick the unsuspecting employee into reducing hours for the company. Since the change, I see understaffing to the point that the managers have to pick product and the associate that has hours has to work at a fever pitch just to keep up with the demand.When the service launched there were,on average, eight employees on shift. Now there may be two and in some cases one. That is very abusive. One more thing. The managers do not care that you have been picking product from the time you clock in. Once you finish the task of picking and slamming products the expectation is that because they are so short staffed and need to have product put away or stowed they continue the grind you into the dirt...until your break, which you will need because the warehouse is so hot you drip sweat.",
        "advice": "Please staff appropriately so you do not burn out the Part time seasonal employee. There can be no doubt that if the current pattern continues there will not be many associates that are willing to work as if they were three people. Keep all employees for the entire shift so that when the opportunity arises to stow product you have enough people to get the job done without stressing out the staff.",
        "pros": "Fair hourly wage, the work activity can be really good for weight loss. The Flex shift hours can allow one to feel like they have a good work life balance, especially if you don't mind missing a few paychecks. The break room is nice. They have a microwave and vending machines,and water coolers.",
        "summary": "Flex scheduling has made Amazon Prime Now a terrible place to work",
        "role": "Seasonal Part Time Picker",
        "date": "Jul 24, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too hot, excessive amount of walking in heat, horrible parking, managers have a lot of attitude....not professional at all",
        "advice": "Take some classes on management etiquette",
        "pros": "The pay was ok but they should pay more for all we did",
        "summary": "Picker",
        "role": "Picker/Packer",
        "date": "Jul 28, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "As for the insurance benefits, for a company the size of Amazon.com, and with as many subsidiaries that they own, they should have been able to hire someone who could have negotiated a much better deal for their group insurance rates for anyone with a family. I've worked at smaller employers, with nowhere near the employee capital leverage that Amazon.com can command, and they provided much better insurance for famil… ies or Parents w/children, at much lower rates.again, as long as you're single, or only have a spouse/domestic partner...and that spouse/domestic partner is able to/willing to move. If you have children, or your spouse/partner can't/won't move for whatever reason, then you better have a college degree to move up within any real time frame. In my 4 years of being at Amazon.com, I knew of many Tier 3's who had been at Amazon for 5 years, maxing out their pay, before they were promoted. For me, that's just too long to be in one place, with less than a dollar raise per year, to be on one position.....Unless you were some one if the opposite sex of who wanted you to fill a Tier 3 role (that's right, sexist behavior) or Unless you have a degree...Add that in and I've known of a dozen or more who were promoted within 18 months or so. That doesn't count the number of newly hired Area Managers that were only able to do the job because of the Tier 3's in the area, and then still fail and before being fired, start going on write up spree's to prove they can be better managers. Amazon doesn't have a formal policy for having to have a college degree to be promoted, but even if you have more than a decade in direct management, don't think you'll be promoted to an actual AM position, at Tier 4 or above, unless you have a degree.The shares of stock (Stock Bonus) that you receive, only twice, as a Tier 1 (or even after being promoted to Tier 3) employee is nice, but tons of employers offer far better bonus options, however, tons of employers also offer NO bonus options.As for the monthly bonus that you MAY receive, it's far from guaranteed, and seems to be skewed to benefit employees who don't have children to take care of (single parents), or a handicapped/sick spouse, parent, or have to have another main priority other than Amazon. If you use your Unpaid Personal Time, then the small monthly bonus that you MAY receive is docked by 50%. Use that time twice and you lose it.As for Leave, different facilities may have different requirements for approving the leave, forget that some states and federal laws require that it is provided in certain instances. Even if you have the correct documentation, then you can still be denied FMLA. I know, it's a serious accusation, but it's completely true. And their Ethics line complaints? well, maybe i depends on who deals with your complaints, but no one that I knew of ever was able to have anything happen (unless it was a Tier 1, who were sometimes fired as a result of theft)As for the Tuition/education program, it's not bad, but changing it to allow for earning, at least, an Associate degree, since you can actually earn it from some programs, or with some college (from before Amazon), and it would really be great.the Pay structure is somewhat odd, I've worked with temps, who have less experience, and knew than me, but made $2.00 per hr more than I did..Why? I had more responsibility expected of me but I actually made less than someone who was able to skate by doing as little as possible, making as much as possible. Amazon makes an attempt to vary pay increases by looking at other employers in the area and calculating other benefits, giving an extra quarter (sometimes less, or more than that).And one more thing...if you think that once you're promoted to a higher position, (Tier3 or up,) you could ever skate by with only getting your regular 40 hours, forget it, as an AM or higher, you hae to put in a TON of extra hours, so kiss your kids, wife, and anyone else in your life goodbye.",
        "advice": "As the American workplace continues to change, you'll need to change the way in which you promote, or change the way you pay the lowest employees. Amazon will get bad employees, who only want to collect a check, putting more stress on the Managers, who will pass that stress along to the good employees, not making as much as the temps. Then because that employee learned a few things at Amazon, they'll leave because th… ey don't make enough money, from limited and quickly maxed out pay, or from inability to be promoted within a decent time frame. That means eventually, someone who doesn't know as much will fill that position, with the problems only rolling downhill from there.Amazon is a pretty darn good company, in spite of their size, but some serious changes need to be made with respect to pay, promotion, and holding higher up HR employees responsible for enforcing FMLA policy",
        "pros": "Your hard work gets noticed, by Managers and Tier 3s alike (Tier 3 is a position that is somewhat equivalent to an Assistant Manager at other employers, but they directly manage the bulk of resources in the areas that they're assigned). You can be trained in other areas in your working area if those above you think you can handle it. At date of hire, you receive up to 4 days off, in the form of -1-10 hr block of Vaca… tion Time, 1-10 hr block of Paid Personal Time, and 20 hrs of Unpaid Personal Time.Vacation time must be submitted for approval no less than 24 hours before the time you wish to be off, the Paid personal time can be used whenever you like, and the same with the Unpaid Personal time. You get up to two weeks , 1 week of vacation and 1 week of paid personal, and every quarter, you accrue 2 extra unpaid days. You can have up to 80 hours of unpaid time accrue before you max out, you lose all of your 1 week personal time if you don't use it by the end of the year, and my understanding is that vacation time can be accrued for an unlimited amount of time. After your first year, you receive double the amount of vacation time to accrue throughout the year. Remember, all of that time takes the whole year to accrue, so every pay period, you get a little more that you can use in whatever type of increments you decide. Insurance Benefits aren't too bad, if you're single, or have a spouse/domestic partner... If you have a family, still not the worst that I've seen, but fairly standard...(See Below) For advancement and promotional capabilities, Amazon.com is also great if you're single and/or have a specific type of spouse/domestic partner...(See Below) 401 K is pretty standard for the industrial warehousing industry. After being there for predetermined amounts of time (2 years, then 3 years), you receive a few units of stock at both intervals, which is nice...(see below) You MAY receive a small monthly bonus, based on the whole facility performance, so that's definitely good..(See Below)Amazon.com also has tons of Leave types available for emergency situations or personal issues, but really could benefit from enforcing the laws concerning certain types of leave...(See Below)They also have an Ethics Line, for employees who feel like they're being slighted, or have seen something they feel or know is wrong. (See Below)Tuition Reimbursement - WONDERFUL... Amazon has a pretty good tuition program. You have to be an Amazonian for over a year before it can be used, but they'll pay up to 12k for certain college courses, usually a technical certificate, or Certificate of some kind. It's supposed to be up to 3K, spread out over a years time, but they're pretty flexible on that because of the limited number of available programs that you can finish over a few years time period... And they also pay for your text books related to the program/classes you're taking. Really, really nice.Pay isn't bad, for a warehouse, unskilled, position either...starting out.(See Below)In the end, Amazon.com isn't a bad place to work, it's really great for hardworking, high achieving, single people, or people who don't have families, or people with a college degree BEFORE you start at AMAZON.",
        "summary": "College Degrees STRONGLY preferred (if you want to be promoted), no matter the Location",
        "role": "Fulfillment Center Associate",
        "date": "Jul 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "To many to list here",
        "advice": "Stop making billio a without caring about developing employees",
        "pros": "The company doesn't care about you its a farce",
        "summary": "Amazon is dangeroud",
        "role": "Process Guide, Warehouse Lead, Trainer",
        "date": "Jul 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "pay and they are not transparent with the employees they tell you one thing and do another. never have your managers there if you need help. It is like a huge high school full of lies and drama",
        "advice": "love your employees do not work them to death and pay them kibbles and bits",
        "pros": "casual laid back environment you have no supervisors breathing down your neck and over your shoulder. able to complete work independently",
        "summary": "operations specialist",
        "role": "Anonymous Employee",
        "date": "Jul 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too much overtime, too high expectations and quotas for employees, very poor training (and it WILL affect you later), a very negative environment full of miserable, tired, ignorant and rude people (particularly on day shifts) that will disrespect you in a heartbeat, it seems that much more importance is given to numbers than the people that work hard to make them. Feels like slavery and prison all at once, without th… e whiplashes. The Inbound department is very disorganized and you will get confused and get blamed for mistakes that are not your fault. It is the worst department to work in and they have a very high turnover rate.",
        "advice": "When hiring new people, don't just have someone train them for one day and if you move them to other areas, have the \"right\" people train them. It's not fair that a new employee should be subjected to verbal abuse simply because they did not receive the correct training. Also, HR should not tell employees when they start that this place does not tolerate harassment. My first week there, I was harassed by a janitor an… d had to fill out two statements before they finally left me alone and I had a witness. I was treated very disrespectfully by my co-workers as well. Try to be more for your people and not so much your numbers, especially the Inbound team.",
        "pros": "Great benefits, good pay, bonuses, some management staff and problem solvers that care and make the experience tolerable.",
        "summary": "Former fulfillment associate, Carlisle PA",
        "role": "Fulfillment Associate",
        "date": "Jul 30, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Management staffing issues and retaliatory work assignments",
        "advice": "Be fair as to the work assignments",
        "pros": "40+ hours a week. Good benifits",
        "summary": "Amazon treats employees like cattle",
        "role": "Fulfillment Associate",
        "date": "Jul 30, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Constant ware and tare on your car. Constant construction going on so have to drive more just to make deliveries on time. They will terminate you even tho you have a reason why with police records, hospital records, or etc. I has my car broken into so my phone, cash, and other things was taken. I had no idea that I had to be at work on Sunday which was a new week. I have a police report on Saturday. I received an ema… il from amazon telling me I missed my block and etc. I responded with my reason stating allow me to make it up. They responded telling me it will not reflect on my rating. I went into work that Friday 8hr drive day. I go home get another email telling me I was terminated for missing deliver blocks. So I work and they fire me after telling me I was okay in a prior email. Going to labor board and attorney to seek damages with my police reports.",
        "advice": "There are no managers to speak too. Only email.",
        "pros": "The money that is just about it. The ability to make your own schedule as well, and chatting with Rusty who is cool as heck",
        "summary": "Flex driver in Las Vegas UNLV1",
        "role": "Delivery Driver",
        "date": "Jul 31, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Bad culture and management.",
        "advice": null,
        "pros": "Good chance to be transferred abroad.",
        "summary": "Bad Company",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2016",
        "is_current": true
    }
]