[
    {
        "rating": 4,
        "cons": "Lack of personal time when on-call.",
        "advice": "Keep up the good work.",
        "pros": "Work with many smart and talented people.",
        "summary": "Great place to work.",
        "role": "Systems Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Due to lack of inter-team coordination developers are often required to take on job roles that they might not be interested in or suited for. It's not uncommon to see your manager acting as a technical lead, developer, manager, project manager and marketing person all at once.Also, Amazon lacks any sort of training programs for it's staff. You won't find any sort of training programs at the company..",
        "advice": "Improve inter-team coordination and spend some more time investing in your top talent.",
        "pros": "Amazon is a fast paced company where you get the opportunity to work on just about every aspect of a problem to get it done. If you have the right type of personality (I do) then this is a great chance to try out allot of different job roles without switching companies or positions.",
        "summary": "Good place to cut your teeth and learn where you want to go next.",
        "role": "Technical Program Manager II",
        "date": "Aug 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The amount of work is often borderline insane and we have a tendency to burn out people. We need to watch this.",
        "advice": "Watch attrition. Too often people burn out too early in the process (e.g. after <1 year)",
        "pros": "Innovation, innovation, innovation. Work hard. Have fun. Make history. It truly still is \"day 1\" at Amazon. Amazon loves to try new things and we give people room to fail. Failure is important if one learns from the mistakes. And every now and then great new ideas are born. Look at Web Services, look at things like Mechanical Turk. These are awesome, awesome projects to work on. Amazon has some of the smartest people…  in the industry. Think of what you can do when you are together with so many great minds!",
        "summary": "A great place to work if you can get through the initial fire drills",
        "role": "Senior Manager, Software Development",
        "date": "Aug 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too much demand from employees",
        "advice": "na",
        "pros": "great experience to work with very clever people",
        "summary": "great place to work!",
        "role": "Senior Software Engineer",
        "date": "Aug 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "My personal experience as an SDE Intern screened me from a lot of the downsides of working at Amazon, but I know many other fellow interns whom had to work continuous extra hours (all the time, not just at push). In addition the Amazon work model lends itself to being \"on-call\" - a.k.a. giving up your personal life for a week once every two months to support your team's software.",
        "advice": "One manager and mentor assigned an intern a project that a SDE III declared \"impossible\". They then subsequently saw his efforts at completing his other project to push something useful out by the time he left as being inefficient and blamed him for the original project's failure. Don't worry, we interns won't forget that episode so easily.",
        "pros": "Great place to get started. You can work with a lot of difference technologies and get the Amazon stamp of approval on your resume.",
        "summary": "Amazon - Lovely to visit, poor to stay",
        "role": "Software Development Engineering",
        "date": "Aug 30, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I worked at the Fulfillment Centers at Amazon.com. That being said, at the FCs, attrition is high and morale is low. This is probably because everyone works long hours, there is no AC in the warehouse, and also there is an intense focus on productivity rates. So in general most regular hourly workers seem quite depressed and robotic. This makes for a depressing work environment. As a result of this, there is frequent…  turnover among the staff.",
        "advice": "Although Amazon is striving to lower costs continuously in order to pass on the savings to customers, management must be careful in how these initiatives affect the line workers and ultimately, the morale and working environment in the FCs.",
        "pros": "It's great to work for a company that you're also a customer for. It definitely creates a more fun working environment.",
        "summary": "Good company, but low morale at the FCs",
        "role": "Anonymous Employee",
        "date": "Sep 2, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "not a lot of information sharing or development",
        "advice": "share the information",
        "pros": "Very dynamic company and high growth",
        "summary": "Amazon",
        "role": "Finance Director",
        "date": "Sep 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "the hours were crazy all the time",
        "advice": "work life balance",
        "pros": "the people were great, the brightest i've worked with",
        "summary": "good experience",
        "role": "Software Engineer",
        "date": "Sep 4, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The operational aspects get to you sometimes.",
        "advice": "Keep doing what you are doing",
        "pros": "It is a big start up company. Original ideas are respected and you see the sprite and growth of a start up company. Unlike many high tech companies that I have worked - I like the frugal ways of Amazon. It is more long lasting that way and enhances the share holder value in the long run and as an employee you do hold a large amount of company stock. There are lot of new initiatives which keeps the innovation level ve… ry high. At the same time mere visionaries and arm chair thinkers have no chance of surviving in the company. Innovation is only respected if you can execute.",
        "summary": "Great place to work if you are creative and also execute on you ideas. Mere visionaries will find it hard.",
        "role": "Senior Engineering Manager",
        "date": "Sep 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Make no mistake, you will work hard at Amazon. This is not a place for slackers or for those who want to work 40 hours per week and then go home. The email load can be intense and the pace of the business means that you are expected to respond quickly. If you can't think, respond, act, and perform at web speed then you will get run over. Amazon's now legendary emphasis on frugality means that you will be working at a…  so-called door desk, and that you may be crammed into a small office with a couple of other people.",
        "advice": "Invest more in physical facilities. Dingy offices and door desks may have been cool once upon a time, but now they are depressing and even unprofessional.Invest in employee benefits, pump up the insurance plans, and help us to save more money for retirement.Make sure that your employees really do feel appreciated for what they do.But, by and large, keep doing what you are doing to keep Amazon … in the lead as a technological innovator.",
        "pros": "I get to work with very bright, very customer focused people, who are also genuinely decent and caring individuals. I get to work on some amazing technology and I can see how it will change the world when it is in the hands of our customers. Senior management is smart, intense, focused, and driven by results. They are also very accessible via email, and will take the time to respond. There's a total lack of politics,…  game playing, and manipulation. The product cycle is short, so the work you do today will be in the hands of customers tomorrow. You can bring your dog to work. Having fun and helping to make Amazon a fun place to work is a core value and doing this right can even have an impact on your review.",
        "summary": "Great place to work, slackers need not apply",
        "role": "Senior Manager, Product Management",
        "date": "Sep 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Work does get hectic sometimes - need to work extra hours some times- On-call rotation - have to provide 24/7 support for software- Cooperation between teams is very hard - a lot of teams are overly defensive-",
        "advice": "More transparency",
        "pros": "- Interesting/hard issues to attack. Challenging and fun.- Fast release cycle.- SDE does work in multiple areas - some development, some QA, some PM, ...- Encouraged to explore new technologies and get experience for other teams.- Brilliant, knowledgeable and friendly coworkers- Friendly management style.",
        "summary": "Challenging and fun place to work",
        "role": "Software Development Engineer II",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's a very idiosyncratic company. I have read that the personality of company springs from the CEO, and that is certainly true at Amazon. Jeff Bezos is present in the company in the same way that Steve Jobs is or Bill Gates was. That has its upsides and downsides.",
        "advice": "Amazon does not have a love of its employees. Ultimately, there is a sense that every employee is expendable. It's not that those employees aren't valuable per se. Just that there is another similarly impressive candidate to step into any position.",
        "pros": "Genuinely intelligent co-workers. I have always been very impressed by the quality of the people I work with at Amazon.",
        "summary": "Very intelligent, but also very idiosyncratic.",
        "role": "Senior Program Manager",
        "date": "Oct 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You better be ready to back your opinions up with tons of data or they will laugh at you.",
        "advice": "Communicate the specific strategy to the employees",
        "pros": "If you are good and can handle the pressure you will go far",
        "summary": "pretty good place to work",
        "role": "Senior Manager, Software Development",
        "date": "Oct 9, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "On-call duty can be painful at times. Essentially house arrest for a week at a time once every two months can be frustrating. This can vary greatly from team to team, however my team is particularly bad.",
        "advice": "Stay the course, in that, we have time to fix problems that don't necessary advance the business but will allow expansion later on.",
        "pros": "There is no micromanaging on my team, and I'm free to make whatever corrections I deem are necessary. If I see a problem and decide it needs fixing there is nothing in my way, and I enjoy this freedom.",
        "summary": "Happy working there",
        "role": "Software Development Engineer",
        "date": "Oct 11, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Large company bureaucracy and fiefdoms.",
        "advice": "Thanks for the ride.",
        "pros": "Got to work on a cool project that the whole world can see.",
        "summary": "Great place to get your career started",
        "role": "Software Development Engineer II",
        "date": "Oct 28, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Support of the tier-1 systems can be exhausting at times. Hundred of groups with lots of freedom sometimes creates duplicate efforts and mismatched goals.",
        "advice": "Stay focused on providing the best on-line retail experience for our customers. Revisit auctions and figure out how to make them work. Revisit search and consider improving its results.",
        "pros": "Work with empowered, very smart people. Lots of interesting technology. Individual groups have a lot of autonomy and are empowered to make their own decisions.",
        "summary": "Creativity in the midst of chaos",
        "role": "Software Development Engineer III",
        "date": "Oct 29, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "no work life balance for your family",
        "advice": "should allow for work life balance and more team activities",
        "pros": "growth and money you can grow really fast",
        "summary": "work here for few years to get experience",
        "role": "SFA",
        "date": "Nov 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Because the company is so lean, there is a lot of work to do - so you have to put in a lot of hours. Positive reinforcement is a bit lacking.",
        "advice": "Provide more positive feedback to employees",
        "pros": "Work with really smart people. Pay is good. The brand is very strong. You get to work on very cool products and because there are so few product managers, you get a lot of responsibility.The company is moving in a really cool direction from a technology and business standpoint, and there is a strong sense that this company will be continue to be a leader in the long term.",
        "summary": "Product Manager Review",
        "role": "Product Manager",
        "date": "Nov 3, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Promotions are few and far between. Stock is a big part of your compensation and because our stock swings wildly it can significantly impact your income from year to year. For a new person Amazon can be quite a struggle to find your place. Most groups are sink or swim and if you are hired you are expected to seek help as it won't seek you.",
        "advice": "Jeff is a real ball buster if you don't have your act together and he will often be way over the top when critiquing work. Other senior leaders need to step up and defend their teams.",
        "pros": "Amazon is a place were you work next to really smart people who are motivated and excited about what they do for a living. While our workforce has changed over the years, the culture instills a focus on knowing the details of your business, maniacal focus on the customer - even if that means short term and perhaps long term pain - because that is the right thing to do and a willingness to take risks. People who love … change and deal well with ambiguity thrive at Amazon. Those who want to be told what to do and who desire a clear road map get very frustrated. Every job has it's ups and down and Amazon has had it's fair share and more, but the company continues to innovate, continues to eschew the trappings of success and the employees take pride in their work.",
        "summary": "Long timer's perspective.",
        "role": "Director",
        "date": "Nov 6, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The biggest down side is carrying a pager around. Depending on your luck of the draw, you could be working on holidays. Some teams within the company are not as responsive to taking ownership. i've also seen many talented SDE 2's that have worked at Amazon for many years that have not been promoted to SDE 3. It seems that jump is a huge roadblock for the SDE career path. The health benefits are not that great when co… mpared with some other companies. Also, the company's only perk is a 10% discount towards Amazon.com purchases up to a total savings of $100 a year. Even if one of the company's core value is frugality, this is too frugal.",
        "advice": "For the most part, i believe in the senior management at Amazon. They are fairly approachable, and you also feel you can escalate an issue to them and have them actually listen. The senior management also does a decent job of giving praise when the individual has done something to deserve the praise. That type of recognition is always good to have.",
        "pros": "Amazon is a fast paced environment that allows one to learn a lot from developing large scale software. The company does care about it's customers. You can often end political arguments by focusing on the customers. You will work with a bunch of smart workers who are very talented. The work life balance is decent, but it also depends on the team you are on. The senior management has been pretty good at listening to p… eople below them, and giving the workers the proper support they need. Senior management also has a pretty good idea of how to progress the team for the future.",
        "summary": "Overall good company to work for",
        "role": "Software Development Engineer II",
        "date": "Nov 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Management are cheap when allocating equipment like desktops to developers.- The company does not sufficiently support a good work/life balance and does not have any problem requiring you to routinely answer calls and tickets in your free time.",
        "advice": "The software development process at Amazon is inefficient. Small changes to the way developers are supported would lead to a large increase in productivity and software quality. Most of the issues are small, and could be addressed by allocating a small amount of money to development teams to improve their environment.",
        "pros": "- Work experience is excellent, with exposure to many different technologies.- Amazon Web Services is a technology leader in some fields, which makes working on some of the web services projects extremely interesting.- Their are some excellent managers and team leaders in Amazon, with great insight into the process of software development.- Amazon has a higher hiring bar than much of the industry, which e… nsures that most (but not all) employees are competent and good at their jobs.",
        "summary": "A lot of experience and a lot of work",
        "role": "Software Development Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Constantly changing priorities and goals. Unpredictable work schedules. Some company objectives are in conflict. When everything is important it is sometimes hard to figure out which tasks to push out and which deliverable you'll be asked for next. This can generate a lot of stress and uncertainty. Managers usually rely on employees to figure out what is most important because they don't always know what's expected n… ext either.",
        "advice": "Be clearer about goals and priorities.",
        "pros": "Employees are challenged on a daily basis. Decisions are made quickly and people are willing to listen to new ideas. People work hard and are passionate about what they do and how it benefits the customer. Amazon consistently hires very intelligent, motivated, and ambitious employees.",
        "summary": "Mixed bag",
        "role": "Anonymous",
        "date": "Nov 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Long hours sometimes expected, work can be repetitive.",
        "advice": "Offer telecommuting option for employees who are interested.",
        "pros": "Excellent medical/dental benefits, good pay and interesting work.",
        "summary": "The best job I've ever had.",
        "role": "Tier II Customer Service Representative",
        "date": "Dec 3, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It can be extremely stressful. New fire drills daily and work-life becomes hard to balance. Managers shift frequently making it difficult to maintatin consistency in terms of career. Seem to spend more time preparing reports and summaries than i do on fixing the actual poblems i'm reporting on.",
        "advice": "Invest more in marketing and research. We are a product-led company and this need to be balanced by investing more time into research whether the money we are investng in are indeed the right opportunities.",
        "pros": "A great experience if you want to make a difference ay a major corporation. Employees can diretly impact the business and the company encourages you to \"just do it\". I've been a long-time employee and i my whole career has been at Amazon but feel that i have had ample career growth opportunity.",
        "summary": "Encourages \"just do it\"",
        "role": "Senior Product Manager",
        "date": "Dec 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "work life balance, lack of detailed training, must have ability to shape actions from vague goals",
        "advice": "Promote talented folks with proven records",
        "pros": "career growth, ability to impact business, ability to make a difference",
        "summary": "A great company to learn, good opportunities for different roles, but prepare to fast and challenging work",
        "role": "Manager",
        "date": "Dec 9, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A normal 40 hour work week is virtually unknown by anyone working at Amazon. The company's value of frugality sometimes is penny-wise and pound foolish. Don't expect as many perks as you'd see at Google or Microsoft.",
        "advice": "I really respect the senior leadership team. I think they have the very rare quality of looking at the long term and investing in ideas that they think are good regardless of if there are any immediate profits to be had.",
        "pros": "Industry respect. Focus on the engineer and finding creative solutions.",
        "summary": "Amazon, interesting work, long hours",
        "role": "Anonymous Employee",
        "date": "Dec 28, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Amazon used to be the place where you \"acted like an owner\", and everybody went beyond their job descriptions and did what was best for the company. They've morphed into a standard large company where people now answer \"not my problem\" instead of \"I'll take care of it\"",
        "advice": "Value your employees. Give a little - get a lot. It was disheartening to hear Jeff answer questions about perks and such at every quarterly meeting, and have him dismiss every comparison or request that was made as unnecessary. His attitude is you don't like it, get out.",
        "pros": "Be part of the leading online retailer.",
        "summary": "Not your small startup anymore.",
        "role": "Senior Financial Analyst",
        "date": "Dec 29, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "low salary and poor benefits",
        "advice": "focus on retention",
        "pros": "An innovative, fast paced place",
        "summary": "Fast paced environment",
        "role": "Manager",
        "date": "Dec 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Most software groups are responsible for software that is used by a production website or service -- that means that depending on how old the software is or how well it was written or how well its operations were thought out, it can fail gracefully or not. Some groups have frontline oncall support teams, but many do not, so if the production software fails a lot, you may be on a pager rotation that can cost you some … sleep :(.",
        "advice": "Make sure that your groups have a sane operational support plan.",
        "pros": "There are a lot of smart people and lots of opportunities to learn from them - frequent tech talks, generally open communications policies. All of the managers I've had have been people that I've felt like I've worked _with_ rather than _for_ - they've been generally interested in figuring out what's needed for our customers and getting the group's feedback on how to get it done. I haven't experienced any of the micr… omanagement styles that I've seen mentioned in other reviews here.",
        "summary": "Lots of smart engineers and groups, but be careful of poorly run oncall rotations",
        "role": "Software Development Engineer",
        "date": "Dec 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "On-call! On-call sucks! It's possible to have a decent on-call experience, on one team in the past I had just that great experience, but most of the time it sucks really bad. The worst of all is being on-call for horrible software that you didn't even write and not getting much opportunity to fix it. The work environment is pretty horrible, if you care about working in an aesthetically pleasing environment then don't…  work for Amazon (although it might be different once we move offices to South Lake Union in 2010). The benefits aren't as good as a lot of other big companies, if you have a family then you might not want to work for Amazon. Some parts of the company are run by completely incompetent people, you really need to get lucky when you start working for Amazon to get a good group, although it's pretty easy to move around once your manager realizes that you're an engineer that Amazon should try to keep.",
        "advice": "Stand up to Jeff B once and a while. He's not god. You're not going to get fired for telling him that he's wrong. If he has a stupid idea tell him it's stupid. And if he wants you to do something really quickly make sure he knows what you're going to have to trade off for that. Jeff is normally a pretty good CEO but he can only successfully do his job if you stop kissing his ass so much.",
        "pros": "The problems you have the opportunity to solve are large and unavailable at most other companies. It's extremely exciting to see your project talked about all over the tech press and to think about how many billions of times a day your code is being run. At Amazon someone who is right out of college can easily have the opportunity to design a big system from scratch without being told what to do by other more experie… nced people (although this is a negative if you are that experienced person having to clean up after the newbie). This of course allows you to learn from your own past mistakes since you are allowed to make them. And, after you eventually leave Amazon you'll have that recognizable name on your resume.",
        "summary": "Great place to learn; Some teams are better than others; Incompetence exists just like any other big company.",
        "role": "Software Development Engineer III",
        "date": "Jan 1, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Middle management sucks (which is valid for any relativeley big company)",
        "advice": "Give more opportunities to employees having long experience with the company. Many people still work for the idea sitting behind Amazon. Give them the chance to grow rather than looking for outside people who'd leave the company for the first opportunity paying a few extra $.",
        "pros": "It's a place where I'm allowed to implement the ideas I have.",
        "summary": "It's not for everyone to work here.",
        "role": "Financial Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The jobs become very repetitive.",
        "advice": "Better communication",
        "pros": "Great managers that are easy to talk to. Easy work.",
        "summary": "Warehouse Associate",
        "role": "Warehouse Associate",
        "date": "Jan 6, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Amazon is a great place to work but because people are quick to give feedback and/or share an opinion on your work you really need to have a thick skin or be able to take critism well.",
        "advice": "Allow line managers to have more fiscal responsibility.",
        "pros": "At Amazon innovation and efficiency are prized. Amazon's customer obsession is a big positive. The company prefers to invest in long term decisions which are positive for customers over short term decisions which may give the company a temporary boost. While no company is a true meritocracy, Amazon does a great job of rewarding performance and delivery of results. You will also get to work with very smart people at A… mazon. There's always an opportunity to learn from your peers or management. There are many mechanisms for feedback and your job will have a lot of visibility and potential for impact.",
        "summary": "Amazon - Smart people, innovating quickly to create a better customer experience.",
        "role": "Anonymous Employee",
        "date": "Jan 7, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Amazon will eat your life - pager rotation sucks, and if your service needs babysitting, you may not have an ops team to handle the general things. What this means is that a lousy service will take your free time and interrupt your sleep one week out of 6-8. This would be as expected for a lot of things, but some services are naturally chatty (external systems, upstreams that file a pageable ticket to find out why yo… ur service is acting up, etc.). In addition, the workload can be high if you find yourself in the wrong place - choose wisely.The downside of free reign with teams is that there is often little consistency of behavior, as each team implements what it needs; this can cause problems if you need something not offered. It also impacts crosscutting concerns - coordinating multiple teams is almost impossible.Payments is a high stress area, as is anything that supports warehouses. Having been in payments, it's getting better, but I didn't get along with one or two of the managers; I got a bit burnt out, then was denied vacation that I desperately needed and tossed on a deathmarch project., so that colors my views a bitAmazon has cheap benefits (frugality is the watchword, but it burns a bit when the most significant bennie is a bus pass). On the flip side, you are paid well if you do well.",
        "advice": "Not a lot - planning for a post bezos world is important, as is ensuring that the leadership is strong, but I haven't run into too many problems of their creation. Well, except for stack ranking - fire the low performers sure, but don't force managers to make someone the 2.5 review just because someone has to be on the bottom. Sometimes, you've got a team of stars.",
        "pros": "Amazon has quite a lot of smart people, and they're given free reign to solve problems the way they think best (after all, they have to deal with the aftermath). The result is a streamlined, low effort, build/deployment system, fairly low bar for building new services and tools, and the opportunity to try new things in a safe manner.the technical environment is top notch, and the important parts are implement… ed well enough (always some room to improve).Amazon is obsessed with metrics - when a service is deployed, part of the process is choosing metrics and monitors to ensure that any problems are caught automatically and fixed; due to the good tools, patches can be pushed out in hours, and rolled back in minutes, so responsiveness is expected.Senior management communicates fairly openly; the CEO fields questions at the quarterly meeting, and welcomes hostile or difficult questions, which surprised me. At a divisional level, I always had a good idea of where things were headed and the priorities.",
        "summary": "Lots of smart people, a bit of a meat grinder",
        "role": "Software Development Engineer",
        "date": "Jan 8, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There are long hours, but time flies as the work is interesting.",
        "advice": "There are a lot of people who work hard to make your job easier. Remember those people!",
        "pros": "One of the selling points for this job and for the company was that there is a high level of employee visibility.",
        "summary": "Amazon.com: Hard work and high visibility",
        "role": "Financial Analyst",
        "date": "Jan 10, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As owner of your product, your team will also respond to downtime, most likely with a pager rotation.Depending on your team, you might experience some micromanagement from the Senior Management, but in my experience it happened on an occasion rather than constant basis.Also, sometimes the autonomy that teams have can be detrimental to cooperation. Some times work is duplicated instead of shared proper… ly.",
        "advice": "Focus on clear, attainable goals to avoid fiddling with the details yourself. Foster an environment of cooperation between the teams.",
        "pros": "I highly recommend Amazon. As an engineer, you have a vast amount of resources and tools to get the job done and the infrastructure is such that you don't have to bug IT to install this and that on your servers (unlike other companies). Your team takes ownership of almost every aspect of your product, so there is a lot of opportunity to improve how it runs with limited red tape. There is a huge emphasis on working on…  large-scale systems which is both fun and an educational experience.",
        "summary": "Great place for software engineering",
        "role": "Software Development Engineer I",
        "date": "Jan 13, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Working in a fulfillment center prevented me from enjoying Christmas and Thanksgiving since that is the busy season. It was all hands on deck so I couldnt travel to see family. As the company has matured it was beginning to lose some of the laid back culture that it had. Very much a place where you are expected to jump in and contribute - the downside of this was there was not a lot of training - though there were re… sources for support",
        "advice": "Keep innovating and try not to become a 'typical' corporate environment.",
        "pros": "Great enterprenuerial environment where one can really make an impact on the business. Great co-workers who work hard at what they do. Input was actively solicited by Senior management and I felt that my opinion was valued and listened to.",
        "summary": "Amazon is a great place to make a difference",
        "role": "Process Engineer",
        "date": "Jan 22, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There are some issues with work-life balance for some employees. Although hard work does speak loudly, there is a level of politics that still goes on that is distracting, demoralizing and old school business.",
        "advice": "As long as senior management can compensate the employees that perform best, then they will keep that talent. Focus less on politics and more on employee development. Listen to the employees and allow them to make business decisions - be employee focused as much as Amazon is customer focused.",
        "pros": "The best reason to work at Amazon is that it gives you the ability to control your own destiny. If you are assertive and hard working then you will go places, just keep up the hard work and people will notice.",
        "summary": "Hard work will pay off.",
        "role": "Financial Analyst",
        "date": "Jan 23, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "We are a very frugal company, but I would rather be in business then have to be making cuts.",
        "advice": "None.",
        "pros": "Amazon has a great future and it is exciting to be a part of that.",
        "summary": "Go Amazon",
        "role": "Recruiter",
        "date": "Jan 26, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The culture at Amazon is notoriously frugal, and that can feel penny-wise, pound-foolish after a while. The startup culture that existed in the early days is also not as prevalent, which can make staying motivated somewhat challenging when surrounded by people of varying levels of motivation. In the technical career track, Amazon does a pretty poor job developing and enabling the growth of their employees, aside from…  the very early stages of an engineers career, unless the employee is inclined to move into a management track. This lack of career development can be compounded by the large operational responsibilities of many teams, which makes it difficult for engineers to find the time to interact with groups outside of their general are and explore other opportunities that could help foster career growth.",
        "advice": "Institute mechanisms to enable lower level employees to feel more empowered and connected to what is going on in the company.",
        "pros": "If you are on the right team, your work will have a tangible impact on millions of people, and as an engineer, it is interesting and gratifying to work on the large scale, difficult software problems. Direction is still very much set by Jeff Bezos, but to his credit he has made a lot of bold but correct decisions in the lifetime of the company. While the startup culture has faded a bit, that does mean that you can ma… intain a surprisingly good work-life balance while still working on interesting things.",
        "summary": "An interesting place to work... for a while.",
        "role": "Senior Software Engineer",
        "date": "Feb 4, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "1. Extremely detail oriented culture. It is expected (and considered a strength) that management \"dive deep\" into all details. This can be very trying at times.2. Organization is very lean in terms of staffing. While there is the argument this can drive innovation, and has positioned the company well in the current economic climate, it means there is ALWAYS more to do than time to do it. You need to be able to dr… aw your line (in terms of what you are willing to give) and hold to it while delivering on the top priorities.3. Not the place to go to be \"developed\". It's very much a \"sink or swim\" type of culture. The expectation is to hire smart people and then it's up to them to deliver and make their way through the organization.",
        "advice": "n/a",
        "pros": "1. Customer focus is truly priority #1 throughout the organization.2. Long term focus of management means consistent message and direction.3. Plenty of smart people, and very few places for the \"dead weight\" to hide.4. Very easy, and expected, to rotate through various functional areas of the company. Most people switch roles at least every 2 years.",
        "summary": "True customer focus, but not the right place for everyone",
        "role": "Director",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Longish hours, pager duty is a bit of a drag when u have to be on call for a week once a month or so.",
        "advice": "none",
        "pros": "Great place to work, smart people, innovative culture, good benefits and good growth",
        "summary": "Great place to work",
        "role": "Software Engineer",
        "date": "Mar 10, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Amazon has a horrible \"not-invented-here\" syndrome. Amazon has a self-prescribed culture which believes fundamentally that it has problems which are unique to the size and scale of Amazon's operations. While this is true for a number of systems throughout Amazon; the culture permeates to systems which should be more than capable of leveraging existing software and solutions.Amazon also has an excruciatingly h… igh hiring bar (which is a good thing). The result of this, however, is that some engineers who were used to being the rock-star amongst their peers can feel overwhelmed by the aggregate level of talent and ability of other engineers.",
        "advice": "keep up the good work",
        "pros": "Amazon has a variety of interesting business and technical challenges which continually provide an opportunity for fun work and fun problems. I started at Amazon after college and I feel that I'm a better software engineer now that I would have been had I been employed elsewhere.I also feel that Amazon does a good job of allowing ideas and solutions to bubble up from the bottom. In my experience at the compan… y, I feel that I've been given a great degree of freedom to develop software that I want to develop when I can demonstrate that my solution is superior to existing ideas.",
        "summary": "Fun, interesting challenges. Not for everybody, though.",
        "role": "Software Development Engineer II",
        "date": "Mar 14, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "During peak they sometimes require mandatory overtime, and this can interfere with personal obligations. People steal, so there is tight security. Lots and lots of walking.",
        "advice": "Don't wait so long to convert temporary associates that they leave the company. Currently there are a number of excellent employees seeking employment elsewhere, because management has not made the move to hire these excelling individuals on.",
        "pros": "During peak season there is opportunity to work a large amount of overtime. The pay is reasonable for the job. Although not all of the bosses are good, my boss is amazing. I feel a sense of accomplishment when I leave work.",
        "summary": "Amazon.com a good place to work",
        "role": "Warehouse Associate",
        "date": "Mar 14, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You must be a strong willed individual and be ready to prove your case with data and to fight for your viewpoint against the odds. If you aren't willing or capable of doing this, you won't enjoy your job much.",
        "advice": "Treat employees with as much respect as we treat customers",
        "pros": "You'll work with some of the smartest people you've met",
        "summary": "Smart, and strong willed people will thrive here",
        "role": "Anonymous Employee",
        "date": "Mar 26, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work/Life balance has to be self managed.",
        "advice": "Shield your employees.",
        "pros": "They get stuff done. There are a ton of technical problems and smart people working on them.",
        "summary": "Work hard and smart.",
        "role": "Database Engineer",
        "date": "Apr 9, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "everyone works hard for long hours, but salaried employees do not get overtime",
        "advice": "no",
        "pros": "fundamentally sound company. strong growth YoY still, and should become a force in the retail industry for years to come as internet continues to become a bigger part of our life.",
        "summary": "good company to work for in 2009",
        "role": "Financial Analyst",
        "date": "Apr 11, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "24/7 pager expectations, long hours, unpaid overtime.",
        "advice": "Adopt follow the sun support.",
        "pros": "Smart motivated people, challenging work.",
        "summary": "Great people",
        "role": "Software Development Engineer",
        "date": "Apr 12, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "not many benefits are available compared to other companies in the area",
        "advice": "no advice",
        "pros": "a growing company where there are great opportunities",
        "summary": "working at amazon.com is great!",
        "role": "Software Development Engineer Intern",
        "date": "Apr 15, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Operational load can sometimes overwhelm engineers, since there is so much at stake when you are making a change to the architecture.",
        "advice": "Pay more attention to what's happening at lower levels",
        "pros": "Interesting problems to solve every day, very smart people all around to work with, scale of operations make you push your limits, relatively short lifecycle of projects enable you to see the end results sooner than later, every engineers voice counts if you know what you are talking about. Different organizations of the company are like a startup within itself, there are always new technologies being developed, it's…  fascinating the amount of high tech impact each one these projects has.",
        "summary": "Fascinating high tech environment",
        "role": "Software Engineer",
        "date": "Apr 19, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hours can be long. Pager-duty is a burden. (Both of these vary widely by group). Company-wide, there's not much room for promotion on the technical track (doesn't mean you can't get a raise or large RSU grant). Praise doesn't come easily. 401k match is a garbage 2% of salary. Absolutely no support for continuing education.",
        "advice": "Keep listening to the customers, it's worked wonderfully. Quit with the RSUs and give us an ESP plan. RSUs don't breed ownership.",
        "pros": "High pay for Seattle, which is not the cheapest but definitely not the most expensive city. As a software developer there can be a lot of leeway for technologies used. A single engineer can be involved in all aspects of product life cycle, there's little division of labor. UI, schema design, implementation, testing, maintenance... High hiring standards have paid off - your peers are very competent and many downright … inspiring. The company really does make long-term strategic commitments and stick to them. Employees truly do frame meetings around \"so how is this good for the customer?\"",
        "summary": "Truly dedicated to the Customer.",
        "role": "Software Development Engineer II",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Benefits package is below average.The high hiring bar isn't applied evenly to all teams leading to some teams that are way below par.",
        "advice": "Look for groups that are lowering the bar. When a manager lowers the bar hold them responsible!",
        "pros": "Assuming you pick your group properly: Great co-workers, fun projects, great products and managment that actually listens.",
        "summary": "Great place to learn",
        "role": "Lead Software Development Engineer",
        "date": "Apr 27, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of direction and corporate rigidity are not for everyone. It is a young company, that has grown in leaps and bounds of late - so the typical growing pains can be expected.",
        "advice": "Too much focus is placed on the top 5-10% performers, as while they are well rewarded, those at the 11-20% top performance level are the ones that are often grossly under-rewarded for their work - and the difference between being in the top 10% and just out of it is so slight that the most dissatisfied employees are those that are outstanding performers, but not the rock-star of the group.",
        "pros": "Small company atmosphere with big company stability. Profitable throughout the worst economic downturn in the modern era. Not stuffy like MSFT, but not as",
        "summary": "Small company atmosphere with big company stability",
        "role": "Stock Plan Administrator",
        "date": "Apr 29, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company can be frugal to the point of being penny-wise and pound-foolish, and communication between orgs isn't great. Maintaining work-life balance is also difficult, though in my experience not as tough as it's sometimes cracked up to be--you just need to set and maintain the boundaries that work for you. I'm in a fairly supportive group, though--I've heard horror stories from colleagues in other areas of the co… mpany, and there's a ton of turnover in some areas.",
        "advice": "Do more to encourage appropriate work-life balance.",
        "pros": "The entreprenuerial culture makes Amazon a great place to grow your career if you're the kind of person who will not only pick up the ball and run with it, but will make the ball in the first place. If you're looking for someone to lead you by the hand, though, Amazon's not for you.",
        "summary": "Amazon: The big company that thinks it's a little company",
        "role": "Product Manager",
        "date": "Apr 29, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "everyone works so hard to be the best that sometimes people forget to be collaborative to the point of being internally competitive",
        "advice": "listen to the little people",
        "pros": "a lot of opportunities for career growth and challenge, but you have to make your own opportunities-no one is going to give them to you",
        "summary": "i've enjoyed ed",
        "role": "Anonymous Employee",
        "date": "Jun 7, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extremely large company with distributed interests presents the considerable task of navigating various intranet resources and offices to locate information. It pays to ask for help, not necessarily a bad thing. Not much in the way of centralized information, that is left to the management chain with predictably inconsistent results.",
        "advice": "Let your people know what is needed and when, and that you are fighting for their interests.",
        "pros": "A large pool of potential mentors, seems to be adequate support in teams for cross training, skills rehabilitation, professional growth as communicator and contributor. Excellent knowledge sharing in the form of collaborative tools such as mailing lists, chat, wiki, SharePoint, etc... They support Mac in the enterprise! Lot's of room for new ideas.",
        "summary": "Challenging opportunity that rewards quirky genius and strong professional skills",
        "role": "Information Technology",
        "date": "Jun 8, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can be chaotic and challenging to navigate the extra-team environment.Leadership development programs somewhat spotty.Manager support lacking.Infighting between senior managers and VPs can be tiring.",
        "advice": "I would spend more time with the senior leadership teams to enable more alignment across divisions so projects can be completed more regularly and without last minute interruptions or cancellations.",
        "pros": "Strong sense of ownership at the team level.Fast paced environment.Cutting edge technologies.Strong customer focus.Opportunity to make long lasting changes at all levels.",
        "summary": "Amazon is a great place to work",
        "role": "Software Development Manager II",
        "date": "Jun 9, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lower salary, hard to move upward, poor work/life balance. People tend to work a lot of hours here so it is important to try and define boundaries from the start",
        "advice": "Don't be too busy to mentor talent. There is a lot of good young talent that needs nurtured so that they stay at Amazon for the long haul.",
        "pros": "Fun company, good stock and benefits, challenging. They are building a new campus that is dog friendly and on South Lake Union!",
        "summary": "Fun company, tough to move upward",
        "role": "Associate Buyer",
        "date": "Jun 16, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No central support, little QA, messy cross team coordination.",
        "advice": "Pay more attention to QA and user experience.",
        "pros": "Advanced software platform (most of it anyway), creative teams, full control given to developers.",
        "summary": "Good place to learn, and not only software",
        "role": "Software Development Engineer II",
        "date": "Jun 29, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "on-call support requirements, random one-off projects for business teams",
        "advice": "Give engineers more opportunities to automated process and innovate",
        "pros": "career growth, opportunity for innovation, ownership",
        "summary": "As much as you make of it",
        "role": "Software Development Engineer II",
        "date": "Jul 3, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There is little consideration for people's personal lives, and the impact that their work may have on their personal life. Transportation pass is a really good benefit, but really the only benefit outside of basic medical/dental/401k.",
        "advice": "For the most part keep it up, but at the same time, hope they realize the impact of the cons in the longer term.",
        "pros": "Lots of room for growth, learning and advancement.",
        "summary": "Good place to work",
        "role": "Senior Financial Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Growth of the company has exceeded the skills of most of its management. People management is especially poor and the company is developing a bureaucracy and \"drinking the kool-aid\" mentality that holds back innovation.",
        "advice": "Need to really assess how useful the \"Amazon Core Values\" are given the size of the company and whether your people are managing based upon them or just steering the ship. The core values speak to the importance of dissent, analysis and innovation but many managers run things completely \"by the book\" focusing on financial management, taking few risks and assuming success just because the high level sales numbers are … growing.",
        "pros": "Get exposure to most of the best practices and trends within e-commerce. Good compensation and fun work environment in growing company that offers many opportunities.",
        "summary": "Great company but lots of grunt work and little feedback",
        "role": "Product Manager",
        "date": "Jul 13, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "not so good benefits for spouse and kids",
        "advice": "no idea",
        "pros": "decent pay for new hire",
        "summary": "a good company",
        "role": "Software Engineer",
        "date": "Jul 13, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- on-call- crappy offices- crappy computers- career growth is nill for those who don't kiss ass- on-call",
        "advice": "make the promotion process less draconian. it's ridiculous that it's considered easier for me to leave, go work somewhere else for awhile, and then come back in order to get a promotion",
        "pros": "- interesting work- deal with scales you can't get in many other places- can feel like you're contributing to customer experience and the bottom line",
        "summary": "Good job, on-call gets very old very quick",
        "role": "Anonymous Employee",
        "date": "Jul 18, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Amazon is a very decentralized company and silo'd company, so manyareas are essentially rat holes that developers can easily get lostin. Most of the negative reviews are probably from those areas, andthey are every bit as bad as you might imagine.Rather than repeat the bad, I would encourage anyone looking seriouslyat Amazon to ask a few things of the developers (not the hiringmanager) tha… t they talk to: how often are you on call? How often doyou get paged? What kind of schedule does this position require (45hour weeks? 60+ hour weeks?)? When was the last time you worked aweekend when you weren't on call? How much legacy/technical debt isthe team responsible for? And probably the most important question ofall you have to ask yourself: is this team solving problems that areinteresting to me? The teams that aren't are teams you will never behappy at, no matter what the rest of the environment is like.The final tidbit that does somewhat makeup for some of the less\"optimal\" teams: Amazon has a policy where anyone can change positionsafter they've been in their current position for a year (provided youdon't get a negative review). So even if you don't like where you'reat, you can always move, which is great if you don't want to lose yourvesting stock grants.",
        "advice": "We measure success and efficiency on so many dimensions, I think itwould be worth taking a deeper look at what makes a successfuldevelopment team inside Amazon. We would all benefit if some light wasshined into some of these teams with high attrition even among veteranAmazonians: what these teams cost the company is hard to measure, butit's certainly larger than a breadbox.",
        "pros": "Amazon is a very decentralized company and silo'd company, so manyareas are great for developers and managers to work in. In these goodareas, devs get:* A lot of freedom to do the right thing* Great support from upper management* The ability to experiment with new and interesting technologies* A strong commitment to building tools and infrastructure to makelife easier for devsAs a … manager, if you're in these shiny areas, you own your project,soup-to-nuts. You will work *with* program managers and productmanagers, not for them. It isn't an easy environment to manage in:you're generally expected to do a lot of things that other companiesuse TPMs for, but I personally find the challenge very rewarding.",
        "summary": "Some places at Amazon are really good... and some aren't",
        "role": "Software Development Manager",
        "date": "Jul 21, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can tend to be a bit Chaotic with changing priorities.Groups within Amazon vary a lot in terms of quality and work.Oncall duty.Inter and intra group politics.",
        "advice": "Treat your employees with a bit more care. They are your biggest investment.",
        "pros": "Chance to work with the latest technologies.Chance to try out new/innovative ideas.Work around lots of smart people.Very aggressive place if you want to grow.Company is in a hight growth area.",
        "summary": "Excellent place to work at with lots of smart people that you will learn from and admire. Be prepared to work hard!",
        "role": "Anonymous Employee",
        "date": "Aug 8, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Every workplace has something to complain about and Amazon is no exception. Any given day you could conceivably complain about being micromanaged, having to work with a thick headed coworker, feeling unappreciated, etc. However, the good typically far outweighs the bad.",
        "advice": "Keep doing what you are doing. I have lot of respect for the senior management team at Amazon and appreciate the whole \"thinking like an owner' concept.",
        "pros": "Get to work on great projects; excellent networking opportunities within the company; quality coworkers; smart and savy senior management team; lots of opportunity for lateral movement within the company",
        "summary": "Great place to work",
        "role": "Senior User Experience Designer",
        "date": "Aug 28, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "frugalitycareer advancement could be structured better",
        "advice": "offer better benefits",
        "pros": "flat culturefast paced environmentsmart peopleinnovationgrowing company",
        "summary": "pros and cons",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "hit or miss - depends on what group you end up in. platform groups have been awesome technically, but you're far from the customer. app groups are stressful, but you have the pleasure of building customer facing stuff.",
        "advice": "value your engineers through compensation, not just lip service.",
        "pros": "awesome large scale problems to work on.",
        "summary": "hit or miss",
        "role": "Senior Software Engineer",
        "date": "Sep 19, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too based on e-mail communication.",
        "advice": "..",
        "pros": "Data driven company with leadership development focus. Values MBA",
        "summary": "Great company. Makes you get out of your confort zone! Jeff Bezo is great",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Overworked, involves staring at a computer screen all day...",
        "advice": "transparency!",
        "pros": "Fun work environment, casual attire, quality not quantity, intelligent coworkers...",
        "summary": "Solid Job",
        "role": "Site Merchandiser",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The hour can be very long and times. How you like it all depends on your team and your manager.",
        "advice": "Evaluate manager more often, to make your they are actually managing there teams and not throw work at them last minute, then throwing them under the bus when it doesn't get done on time.",
        "pros": "My experience at amazon was a good one. I learned more there in 6 months then i did in 2 years at my other job.",
        "summary": "Great Place to Learn",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Long Hours, lot's of issues with system",
        "advice": "Keep pushing forward, you are light years ahead of other retailers.",
        "pros": "You can see results in minutes not months",
        "summary": "AMZn is place to be..",
        "role": "Vice President Hardlines",
        "date": "Nov 5, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Source code wise, Amazon as a company isn't a huge contributor to the programming community - there seems to be a real reluctance to share and collaborate outside of the company, or work on open source software.",
        "advice": "Yearly planning is an amazingly painful process. There must be someway to streamline it.",
        "pros": "Amazon is the kind of company you'd go to, when you want to earn your programming chops. I know so many awesome developers who started out at Amazon before they moved on to bigger better things. You'd think that a company with a core value of frugality wouldn't have some of the best salaries and benefits of all the big tech companies, but you'd be wrong.",
        "summary": "A place to grow as a developer",
        "role": "SDE I",
        "date": "Nov 9, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long hours, company takes too much time to learn from mistakes (but usually the mistake is immediately quantified and the fix justified in terms of cost or opportunity cost), little work-life balance, benefits are low, 401k match is on the low side for a fortune 500 company, many people have pointless dead-end jobs in pockets of the company, often pass on good candidates during interviews, interviews focus on wrong t… hings. They build heroes and superstar SDEs, others are support staff. Stress level is extremely high during Thanksgiving->Christmas. Too much focus on stock grants and not enough on base salary, but when stock is doing well who can really complain? Sometimes way too frugal, expensing team lunches or outings for team building is a contentious topic. Average engineers may see very little monetary benefits. Bad engineers and underachievers take up too much headcount. Not very family friendly, long work hours + virtual freeze on vacations during the period from Thanksgiving -> Christmas.",
        "advice": "Keep doing what you're doing. Pay more attention to the voice of the engineer, they know the problems. Get rid of the bad engineers replace them with good ones. Really need more levels. Morale suffers greatly at Christmas when it should be a time for family and friends, figure out ways to compensate in other areas.",
        "pros": "Data driven, lots of development, chance to innovation, smart people, high hiring bar, rewards the achievers, cool technology, freedom to write code, management buys into logical arguments, good compensation, very little politics, no glass ceiling, frugal, ability to switch teams easily (still requires interviews), intense customer focus, and passionate people.SDEs are the bread and butter of this company, no… thing moves unless SDEs make it happen. Management structure is thin, but hit or miss, but when they hit, its usually a homerun and you wonder why they decided to work at Amazon and aren't running their own startup. SDE are given very direct access to upper management, Directors, VP and sometimes the senior VP. Management structure is flat, makes it easy for superstars to stand out. Good work is recognized and rewarded. Average and below average engineers see little monetary increases in salary; very much a meritocracy.",
        "summary": "Not for everyone. Mostly A-type personalities preferred.",
        "role": "Software Development Engineer III",
        "date": "Nov 20, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work/life balance can become a big issue if you want to get promoted. Still too reactive at times. Dinosaurs who have been working there forever and remain the same slow the company down. Need to provide better benefits for employees (i.e. vision coverage is insufficient). If you expect the next job simply as the next step of your career progression, then look elsewhere. It's very much learn on the job with little de… velopment provided.",
        "advice": "Additional development opportunities should be provided",
        "pros": "There are a lot of smart people who are passionate about their jobs. If you are not afraid to express how passionate you are, then this is a potentially good environment to work for you. I say potentially because if you disagree the right way, people will listen. Decisions are made with data support and tradeoffs are made when it benefits customers. If you understand you get the next job by doing it first, then it is…  the right place for you.",
        "summary": "Learn on the job; fast-pace; always changes; reactive",
        "role": "Investigations Specialist",
        "date": "Nov 28, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Career growth is slow. No bonous and etc",
        "advice": "Should come up with plan for career devleopment",
        "pros": "High accountability for all. You get recoganisation for your work.",
        "summary": "None",
        "role": "Anonymous Employee",
        "date": "Dec 13, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "On-call rotation for almost all engineers.",
        "advice": "Process is good, but don't make it and end in itself.",
        "pros": "Good opportunity to work on real-world scaling problems.Lots of new project initiatives, and still some good challenges in migrating from legacy systems.",
        "summary": "Good, interesting opportunities at Amazon",
        "role": "Anonymous Employee",
        "date": "Dec 31, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Stressful. Work-life balance is poor in many groups. High operational burden in many groups.Benefits are bare minimum -- their philosophy is they would rather give more grants to reward the productive, then to have benefits that go to all employees.",
        "advice": "Recruiting is overly decentralized. Too often a candidate gets \"grabbed\" by an inappropriate group, and then the candidate will either be turned down or unhappy they didn't get a good match.",
        "pros": "Real corporate culture -- it comes from the top, it is consistent, it is communicated, it makes sense, it makes customers happy. People really refer back to it when making decisions. Kind of tough on the employees but you can't have everything.If you perform, stock options are excellent.If you want to be a leader and you can do it, you can get extremely educational access to incredible top people.",
        "summary": "Tough, Love",
        "role": "Senior Software Engineer",
        "date": "Jan 11, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "tough operations. slow in promotion.",
        "advice": "stop micromanagement! trust your engineers.",
        "pros": "good for development for a new hire. You'll learn a lot from peers. Good money too.",
        "summary": "be prepared! You have to work very hard.",
        "role": "Anonymous Employee",
        "date": "Jan 13, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "low salary...need to change the policies..., make some changes for work culture and give some more liberty to the people/employees",
        "advice": "salary hike for everyone",
        "pros": "job securitygood work environmentfun place to workeasy access to resourcesgood for freshers",
        "summary": "good employer",
        "role": "Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "lots and lots of work - i completely agree with other that there is NO work/life balance in amazonvery aggressive coworkers - you need to be tough",
        "advice": "more communication.",
        "pros": "challenging projects, good pay (considering RSU), talented coworkers, good place to learn, get to work in various areas (project management, planning, architect, development, maintenance, monitoring, metrics, etc etc)",
        "summary": "work hard and good pay",
        "role": "Software Development Engineer II",
        "date": "Feb 6, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Job promotions are hard to come by, and seems to be dependent on knowing and talking to the right people. Hard to advance as a software developer if you just want to be a skilled coder.",
        "advice": "Make promotions within software development be more related to software development skills, not the ability to smooch up to people or hold presentations or abilities that doesn't really speak for an individuals ability to create and design good software.",
        "pros": "Good compensation, varied and fun job possibilities. You get to work with a lot of smart people every day. It's good to work at a place that is well known so you don't have to explain where you work to everyone you meet.",
        "summary": "Not a bad place to work",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I worked a lot of overtime. Most of it was because I'm a slow coder, but I felt like I needed to get things done so I stayed late to do it.",
        "advice": "I thought the management at Amazon was very open. It was easy to talk to people there and if they caught me staying late they invited me out for drinks.",
        "pros": "Great work environmentGreat locationInteresting tasksAmazon treated interns fantastically. They had social events for us, set us up with housing and paid well. One thing I really liked was that each intern was given a project to complete. In other Internships I've had I've just been added to a project; here I got my own.",
        "summary": "Interning at Amazon.com",
        "role": "Software Development Engineer Intern",
        "date": "Feb 17, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Lack of strong leadership-Limited opportunities to advance",
        "advice": "Promote from within and offer better guidance on the vision and mission for your respective teams",
        "pros": "-Recognizable brand name-Fast paced environment-Opportunity to learn and grow-Smart people",
        "summary": "Life as an SFA at Amazon",
        "role": "Senior Financial Analyst",
        "date": "Feb 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some groups do not have great accountability; the company can be very cheap about things like hiring QA or support engineers.",
        "advice": "Embrace the value of spending money on operational support and support engineers. Give people enough time to design things with a longer-term horizon in mind.",
        "pros": "There are some very challenging problems and smart people at Amazon. If you find a group with strong management and smart peers, you can learn a lot and work on satisfying problem sets.",
        "summary": "Depends on where you land",
        "role": "Software Development Engineer III",
        "date": "Feb 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "* Being on an on-call rotation and carrying a pager. The operational burden placed on developers varies significantly depending on what group you're in, but some groups are pretty horrific.* Middle management is often woefully ineffective (of course there are exceptions)* Compensation doesn't always correlate with performance, developers in the same level are almost always paid about the same regardless of ho… w much they accomplish, promotion is the only guaranteed path to compensation increases.* The hiring/interview process is a complete crap-shoot, bad people get in, good people get rejected, when things break there's almost never any attempt to look at what went wrong and how to prevent it in the future.* RSU (stock) based compensation is highly variant depending on the stock price (when you are awarded the stock and when it vests can be separated by years). In some situations this is positive and some situations its negative, but cash based compensation would be more predictable. If the stock does go up one year your compensation the next year may go down in order to compensate.* As inevitable with large companies, Amazon is becoming more process oriented, this means more pointless meetings (this is often exacerbated by poor middle management who care more about process than results, and rarely take a step back to see if what they're doing is actually adding value). The weekly metrics and change management meetings that some groups have typify this problem.",
        "advice": "Focus more on results and less on process. Don't measure something because it's easy to measure, measure something because it actually has real customer impact. Look for ways to ease operational pain so that developers can focus on creating new solutions rather than continually and hopelessly patching bad ones.",
        "pros": "* You get to work on challenging and interesting problems* The types of problems and challenges vary greatly from group to group giving you plenty of opportunities to try and learn new things, if you're looking for a change you don't necessarily have to find a new job, just a new group.* In general you get to work with really smart, competent and experienced developers that will push you.* Good compensati… on* Performance is generally acknowledged* Developers and principal engineers choose the platforms and technologies used, not the business teams or management.* The mantra that \"it's all about the customer experience\" is actually true and enforced. Whenever a tie needs to be broken on how something should work the answer to this question is usually sufficient to break it.",
        "summary": "Lots of opportunities and good compensation. Operational support can be burdensome.",
        "role": "Software Engineer II",
        "date": "Feb 26, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "pager duty, career advancement, pay",
        "advice": "More opportunities for career advancement",
        "pros": "smart people, good projects, fun work",
        "summary": "amazon.com review",
        "role": "Software Development Engineer",
        "date": "Mar 2, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I choose corporate housing and it turns out to be a huge amount of taxable income (albeit non-cash) on the W2. Called back HR and she wouldn't give detailed breakdown. The benefits appeared great to intern but the taxing is huge! (I have other income as a grad student so the benefits turn out to be costly).",
        "advice": "Wish the internship is more structured. Have to change gear to a totally different project in the middle of the internship. In hindsight I could have accomplished a lot more with the first one.",
        "pros": "Definitely good program as an intern. Lots of networking and learning opportunities. Give you a good exposure about the internal workings of this consumer-centric, often-fragile company.",
        "summary": "Good internship program but watch out for caveats.",
        "role": "Product Management Intern",
        "date": "Mar 9, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Sometimes I spend too much time at the office. Parking spaces are limited. If you have a bad manager, life can be ... difficult.",
        "advice": "Too early for me to have a real opinion yet",
        "pros": "Exciting. If you have the right team, it can be a very pleasant place to work in. Unlike others, I find the operations burden refreshing (I come from working as a federal government contractor). On call pages are often opportunities to learn thing, and I like the investigation",
        "summary": "Early opinions of working at amazon",
        "role": "Senior Systems Engineer",
        "date": "Mar 20, 2010",
        "is_current": true
    }
]