[
    {
        "rating": 4,
        "cons": "My work (in QA) is very boring.",
        "advice": "Get more serious about properly staffing//funding maps application.",
        "pros": "I love working for Apple. They treat you well. The work environment is great.",
        "summary": "Apple - mixed bag",
        "role": "QA Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-none that I've had at this point",
        "advice": null,
        "pros": "-Working from home-very open contact with manager-flexible to your situation-great pay for job skill",
        "summary": "Great",
        "role": "Senior Advisor",
        "date": "Apr 30, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The #1 con is that most customers lack the skills to use the products. People don't take the time to understand Apple's technology so they blame the store employees when their computers or iPhones don't work. On a daily basis customers don't know their email addresses or passwords and expect you to do a more thorough investigation than Sherlock Holmes in order to help them download an app.Some co-workers don'… t try at all or pass their problems around and the result is the good employees clean up the messes.Performance is not incentive based. The guy who has the highest sales could technically earn as much as the guy with the least amount of sales.To get a promotion is difficult because there are many people vying for one spot.Different roles in the store are very stressful. Sometimes we have to help multiple customers at once with very diverse problems. We have to turn people away from tech support because they don't have an appointment to meet with a technician. It gets very difficult after the 20th time in an hour.Your hours will vary because of the stores longs hours. Sometimes you work early in the morning and sometimes late at night. Usually you will be working on a weekend. Not very fun and not very conducive to family based or social people.",
        "advice": "Figure out a way for your employees to earn more money. I am single with very few financial obligations but yet I'm still going broke while working for Apple. Hire more full time and less part-time employees.",
        "pros": "Apple retail offers great health benefits, product discounts, free software, lots of technical and leadership training. The store management empowers the workers to grow themselves professionally and personally. They would rather be helping you to get what you want out of life than getting reamed out by an angry customer. The pay significantly above average for retail employees.They seem to be listening to th… e employees and some changes have reflected that.When they say you can get whatever you want out of your time at Apple it is largely true but takes a lot of work and usually very creative thinking on your part.",
        "summary": "Great company, great resources, excellent job to carry you through to next step but not a career place.",
        "role": "Specialist",
        "date": "Apr 30, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometime you need slog a lot.",
        "advice": null,
        "pros": "Fun filled environment. Great to work with knowledgeable people.",
        "summary": "Great experience...",
        "role": "Anonymous Employee",
        "date": "May 7, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Somewhat demanding hours - but worth it.",
        "advice": "Keep up the great work!",
        "pros": "Invest in their employees. Hard work but rewarding. Met people as co-workers and are now life time friends.",
        "summary": "Enjoyed working for Apple - 12 plus years",
        "role": "Anonymous Employee",
        "date": "May 8, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Managers tend to \"manage up\".-Lots of trendy business lingo without a lot of substance in some of them.-The company can be greedy. Compensation plans change to drastically reduce employee income when it suits them.-Culture is changing since Steve Jobs is gone",
        "advice": "Manage your employees instead of managing your spreadsheet. Build tools that help not only you but your employees do their jobs more effectively. Remember that other companies envy your talent pool.",
        "pros": "-The stock purchase plan has been rewarding.-My co-workers tend to be very high quality. The average tenure is much longer here than at other companies so I tend to think most of the employees are satisfied.-The onsite caffe is great and serves healthy fare.-Employee perks are numerous and generous. (beer bashes, BBQ cookoffs, etc.)",
        "summary": "Hard work but can be rewarding",
        "role": "Anonymous Employee",
        "date": "May 9, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It winds up being another corporation and working for another job. You get lost in the slew of other employees and they tend to be much too focused on sales and numbers.",
        "advice": null,
        "pros": "You learn a lot and get to network with a bunch of great people. You learn the best sales skills and how to interact well with the public.",
        "summary": "Great culture - same retail experience",
        "role": "Sales Specialist",
        "date": "May 9, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "depending on the current administration at your job locations, you are either in and good up the ladder or put aside because your management is not favoring you at the moment. Everything is done by consensus. If one person out of 19 does not feel you are qualified for the job or promotion, you will get black balled. I've seen it too many times.",
        "advice": "Get a third party opinion ,outside of the small mgmt click that ends up making all the decisions, not necessarily for the right reasons. Sometimes doing the right thing is not as important as following the flock.",
        "pros": "Good Company to work for innovative, leading edge in consumer electronics, has methodologies to follow.",
        "summary": "Business Manager",
        "role": "Senior Business Manager",
        "date": "May 9, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lots of politics in the workplace, and can be a little cultish at times. Have to be willing to drink the koolaid.",
        "advice": "A lot of favoritism is present in most stores.",
        "pros": "Best retail job you can ask for. Great benefits, good pay, better culture than most. Paid vacation for full-time.",
        "summary": "Great Place to Work!",
        "role": "Specialist",
        "date": "May 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited potential for growth as employee.",
        "advice": null,
        "pros": "Good place to start in NY.",
        "summary": "Good place to start...bad long term.",
        "role": "Mac Specialist (Apple Store)",
        "date": "May 12, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There is a terrible work/live balance that does not even exist. You will always be working. People will always ask you question about Apple for the rest of your life even after you quit.",
        "advice": "The culture of Apple and what it represents is dying starting from the Inside.",
        "pros": "Stable employment that is not going anyway. People will always love there apple product and always will be all over a place like apple.",
        "summary": "It's OK",
        "role": "Genius",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You pretty much hit a ceiling once you've been here long enough. There are so many retail employees and so little room in upper management. I have know a few to move up but it is very difficult.",
        "advice": null,
        "pros": "This is a great job if you are looking to start out or in college. My review is strictly for retail so I can't speak for corporate. The benefits are fantastic and the pay is decent",
        "summary": "Great college job",
        "role": "Genius",
        "date": "May 16, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very little time to relax, non stop calls, deal with angry customers, stressful situations",
        "advice": "Once school started the team started to get distant and no longer felt like a team environment. Find a way team members can interact and stay close together during the school year.",
        "pros": "Good experience, looks good on resume, better pay than most college jobs, benefits, work from home",
        "summary": "At-Home college advisor",
        "role": "At-home College Advisor",
        "date": "May 16, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Room for advancement doesn't seem to be dictated necessarily by performance, but by who is a bigger 'suck up'.",
        "advice": "Set more realistic expectations in terms of advancement.",
        "pros": "Friendly environment, flexible times, benefits, discounts, great people, approachable management, fun, relaxed",
        "summary": "Apple",
        "role": "Specialist",
        "date": "May 20, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Can be limited career opportunities working on the retail side.",
        "advice": "Need to interact more with employees.",
        "pros": "Great company, great employees, overall great experience.",
        "summary": "Great job",
        "role": "Specialist",
        "date": "May 22, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The retail part of the company is a grind, while corporate jobs are more enjoyable.Difficult to move vertically within the company. Most of the hiring is done externally.",
        "advice": "Develop your internal talent. Encourage promoting from within. Continue the great benefits and never lose focus of taking care if your most important asset, your employees.",
        "pros": "Great benefits, they are better than any other I have seen, EVER",
        "summary": "Best retail job",
        "role": "Expert",
        "date": "May 23, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Some choose to micromanage when it's not needed. Company political and social opinions are not appropriate in the workplace.",
        "advice": "Don't micromanage Senior resources. Stop with the social engineering at work.",
        "pros": "Freedom to creatively contribute to the Company's success.",
        "summary": "Apple",
        "role": "Senior Project Manager",
        "date": "May 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The company just blew up in a the last couple years, a lot of people left.Politics have taken over the company, we need to go back to making great products.Opportunity to grow upwards is limited since its a very flat organization.Bad Work/ Personal Life balance.",
        "advice": "We need to focus on the product and notGive employees who perform well a chance to grow.",
        "pros": "Best company I ever worked for.Very innovative, industry leaders.. both for the product as well as services around the product.",
        "summary": "Best company I ever worked for, but a large company",
        "role": "Test Program Manager",
        "date": "May 30, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "My job deteriorated from one of vast potential and creative facilitation to one of mundane tasks and a feeling of being underutilized and undervalued.",
        "advice": "Learn about Apple culture, not just how to manage (if that's what you want to call it). Most employees come to Apple because they like the products as well as the culture, not just for money (clearly).",
        "pros": "Great place to learn about all things Apple.",
        "summary": "Downward Spiral",
        "role": "Creative (Apple Store)",
        "date": "May 31, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Being a retail job, it came with problems such as terrible customers and less than ideal schedules.",
        "advice": "Do a consistently good job at scheduling",
        "pros": "It was a great opportunity to learn skills varying from technical to customer service, and helped you meet an interesting cross section of people. It also provided plenty of stories.",
        "summary": "A great place to work during college, leaving me with job experience at graduation",
        "role": "Creative (Apple Store)",
        "date": "Jun 1, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There were no cons when i worked there",
        "advice": "Keep up the good work",
        "pros": "Employees are friendly, helpful, and excellent managers",
        "summary": "Receiving",
        "role": "Customer Service",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's retail so no set schedule",
        "advice": "Be consistent. Stop being fake, others can tell when someone is genuine.",
        "pros": "Lots of perksBenefits are amazing",
        "summary": "Great place to work, family of friends",
        "role": "Specialist",
        "date": "Jun 11, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "As a Business Specialist, your pay is still tied to retail standards, which is unfair considering the amount of revenue you're expected to drive, particularly if you work at a high traffic store like my store. One of my biggest issues with Apple is no commission, no bonuses, at all. Regardless of your background and experience, as a retail employee you will have a strike against you if you're interested in corporate … roles, and recruiters make it clear. Most corporate hiring is done through external talent sourcing. Conversations around career paths for retail employees are centered on retail opportunities, not corporate opportunities. Not encouraging when you know you are a valuable asset to the team.",
        "advice": "Get out of your own world, remember that you started somewhere too. Value the people that want to grow at Apple and bring a lot to the table.",
        "pros": "Excellent benefits, some of the most interesting people you'll ever meet in your life, great environment to work in. Great business customers. You also learn how to better deal with personalities of all types. Most people that come to Apple, leave better than they came (many come back!). Your feedback is heard and the company responds (to most things).",
        "summary": "Amazing Experience! Still Major Flaws in Career Path for Retail Business employees.",
        "role": "Business Specialist",
        "date": "Jun 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "secretive cultureapple is very big, has large corporate culture, lots of processif you work on teams that are not central to the company, you could feel under appreciated",
        "advice": "culture could be a little less secretive within the company to encourage innovation and collaboration across teams",
        "pros": "smart and caring peoplethey make sure you are doing work you are interested in and foster your growthflexible schedule and autonomymy managers have been awesome, and really care about my career interestapple product perks",
        "summary": "great place to work if u r on the right team",
        "role": "Designer",
        "date": "Jun 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There's a lot of politics and secrecy. There are few opportunities for advancing your career.",
        "advice": "Develop your employees and promote from within.",
        "pros": "You get to work with a lot of great people who are smart, passionate, and hard-working. The products are beautiful and you're part of a company that has a huge worldwide impact.",
        "summary": "Great people to work with. Exciting environment. Not a lot of career growth opportunities.",
        "role": "Product Marketing Manager",
        "date": "Jun 14, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Low pay for the skills required, even if its high for retail.",
        "advice": "Value your employees with dollars, not just recognition.",
        "pros": "Phenomenal culture and rewarding experiences.",
        "summary": "Great company, low pay.",
        "role": "Expert",
        "date": "Jun 14, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-insanely busy-no room for growth",
        "advice": "-employees at bigger/busier stores need more (and longer) brakes",
        "pros": "-$15/hr for retail, sales floor position-nice people-sense of community-good training program",
        "summary": "Good Company, Crazies Retail Experience",
        "role": "Specialist",
        "date": "Jun 14, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "High store traffic.Constant changes to products/services which is also can be a good thing",
        "advice": "Maintain constant communication and transparency to optimize workplace efficiency.",
        "pros": "Great people and products.Sincere employee development.Constant workplace improvements for external and internal customers.Knowledgeable staff to supplement your abilities.Caring leadership.Great products.Low pressure environment.",
        "summary": "This is the best retail job available.",
        "role": "Mac Specialist (Apple Store)",
        "date": "Jun 15, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor store management (across multiple stores), long hours, terrible work/life balance, not as well-paid as one would hope, and an attendance policy that borders on draconian.",
        "advice": "Fix the attendance policy, pay your employees what their worth (especially in technical support, where they get yelled at regularly by customers), and provide better facilities overall at all stores.",
        "pros": "Amazing benefits, employee stock purchase plan, a ton of free software, amazing peer coworkers, significant product discounts.",
        "summary": "Great for the first couple of years",
        "role": "Genius",
        "date": "Jun 19, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The pay is much less than a similar job at other companies, moving up is extremely hard to do, and management isn't always trusting. Just like at many other places, the bad apples (pun intended) tend to ruin it for everyone.",
        "advice": null,
        "pros": "It's always busy, you're always learning new things, and the benefits are ridiculously good. The people I've met at Apple are lifelong friends and have helped me get through the roughest of days.",
        "summary": "Exciting and overwhelming",
        "role": "Genius Administrative",
        "date": "Jun 19, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Just one thing:Long work hours",
        "advice": "Less work hours and becoming more supportive",
        "pros": "Great EmployeesGreat Salary PayGreat BenefitsAmazing and Helpful staff",
        "summary": "It was amazing",
        "role": "Mac Specialist (Apple Store)",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extremely political. Lots of red-tape. Managers do not seem to care about long term career of employees. Groups are compartmentalized and hence there is little cross-pollination. Very hard to know the big picture of how ones is work fits within overall company plan/products. Very hard to obtain internal transfers to work on other projects.",
        "advice": "Try to improve on the cons listed above.",
        "pros": "Company is doing well. With right attitude one can acquire new sets of skills that can be useful down the road.",
        "summary": "Generally positive especially if looking for new experience",
        "role": "Anonymous Employee",
        "date": "Jun 21, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Store manager was awful, didn't understand the repair business at all, and tried to micromanage. New store manager since I left, and I've heard they are much better.",
        "advice": "Sometimes you just have to stay out of the way. Trust your employees to make responsible decisions based on company goals. Otherwise you take away their motivation and as a result, their productivity.",
        "pros": "Great coworkers, fun environment. Good benefits too, including product discounts.",
        "summary": "Excellent coworkers, poor manager",
        "role": "Mac Genius",
        "date": "Jun 21, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The career path in any part of the company is not very clear. At all.",
        "advice": "You've gotta do something about the lack of a clear path for advancement.",
        "pros": "Great work environment, great benefits. It is a lot of hard work, but if you beleivein the mission it is worth it.",
        "summary": "Great Expereince Overall, Some Small Complaints.",
        "role": "Content Manager",
        "date": "Jun 25, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The compensation should be higher for the pressure you have.",
        "advice": "better compensation",
        "pros": "The best thing working at Apple is the group of intelligent people that surrounds you.",
        "summary": "Apple Creative",
        "role": "Creative (Apple Store)",
        "date": "Jun 26, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It can vary from store-to-store but management needs to do a better job of communicating with each other.",
        "advice": null,
        "pros": "Working at Apple was a great part of my life to experience. It helped me improve upon personal faults as well as build leadership skills. It's a very open-minded environment and your surrounded by creative individuals.",
        "summary": "Great, lasting experience",
        "role": "Creative (Apple Store)",
        "date": "Jun 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "little transparency in HR processes. for workerbees below director level, bonuses are not based on merit or tied to company performance, they're basically based on how well your management team likes you. also, HR is reluctant to share basic info with employees (eg, salary ranges, performance review schedule)",
        "advice": null,
        "pros": "at the forefront of consumer electronics; excitement about new products",
        "summary": "crazy place, truly a large startup",
        "role": "Anonymous Employee",
        "date": "Jun 28, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I would have to relocate. But CA is a nice place to live.",
        "advice": null,
        "pros": "I think it is a great company to work with. The location is good too.",
        "summary": "engineer position",
        "role": "Product Design Engineer",
        "date": "Jun 28, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not great pay, extremely difficult to get promoted, and very little feedback unless directly requested.",
        "advice": "The expectations of sales of add-on services are sometimes unrealistic and unfair. Also, as an employee that was super-ambitious and excited to learn, I felt ignored for older, less motivated, worse performing employees who simply knew management longer.I was practically begging for full-time hours and was always offered a lame excuse.",
        "pros": "Great company, great products, fun environment, and managers are easily accessible.",
        "summary": "Specialists: A complex relationship",
        "role": "Specialist",
        "date": "Jun 29, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The cons of the apple store, poor management. Lack of promotions, even though you are promised from the interview that every week there is not a person who doesn't get a promotion. Overall your store leaders are the ones who make your store a good one or a bad experience for your self and its customers. I would make sure to talk to apple store employees before applying to make sure if this store location is for you.",
        "advice": "Listen to the feedback given by your fellow employees, they have more idea whats going on in the store than you are. Be more engaged on the floor with your employees.",
        "pros": "You come into work knowing that your customers come in needed your help, and its your job make sure you \"enrich\" their lives. I leave everyday tired, but a sense of fulfillment knowing that I have helped so many people with either new or old products. Glad I was able to make them leave with a smile on their face. Over all the pay is worth the work done, its still retail.",
        "summary": "Better than most retail but still retail",
        "role": "Mac Specialist (Apple Store)",
        "date": "Jul 1, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-Having to deal with occasional high-maintenance or angry customers that may be having issues with their product.-Like many of retail workplaces, not having a consistent work schedule.",
        "advice": "Don't get too caught up in lecturing. Remember to ask questions.",
        "pros": "-A lot of resources for training and advancing career.-Some good benefits like free bus card.-Exciting to see new release of products/services.-Coworkers are generally friendly & environment thrives on feedback.",
        "summary": "Working at the Apple Store - Great environment for retail experience.",
        "role": "Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Would love to have been a part-time manager for Applecare",
        "advice": "Lets open our minds to innovation.",
        "pros": "Easy, laid back interview process. Very interesting benefits. Love the attention to employees.",
        "summary": "Looking for a Part-Time Opportunity",
        "role": "Anonymous Employee",
        "date": "Jul 5, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management not good. Mid-management is not good. Lacks attention to how place experience with the right position. Interviews showed very little interest in learning more details about candidate and hiring was more like a placement of a body than trying to get the right person for the job.",
        "advice": "Mid-management needs help although they look like they have a lot of experience.",
        "pros": "Great benefit, culture, top notch technology for daily use.",
        "summary": "Not so positive",
        "role": "Financial Analyst",
        "date": "Jul 7, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "bad hours give at lease some weekends off",
        "advice": "give better hours to employees",
        "pros": "teaches a lot about how to give customer service",
        "summary": "its good and i like it",
        "role": "Expert",
        "date": "Jul 8, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It can become very routine and complacent unless you have the desire to become a Genius and ultimately break apart and fix Macs and iPhones; upward mobility isn't really offered in any other way",
        "advice": "Stop micromanaging! and please stop hiring management externally! It's really embarrassing when a manager doesn't know how to turn on location services in front of a customer and has refer to a resource.",
        "pros": "LOVED the dynamic group of people I had the pleasure to work with! Everyone is so smart and talented in their own way, which makes for awesome people in your network and even better friends, if you should be so lucky to vibe so well.",
        "summary": "Good for People, not so much Growth",
        "role": "Mac Specialist (Apple Store)",
        "date": "Jul 11, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Lots of long hours- Very little job flexibility",
        "advice": "Give your employees more work/life balance",
        "pros": "- It's Apple- Discounts on products- Working with lots of smart people- Unparalleled technology",
        "summary": "A great company to work for",
        "role": "Anonymous Employee",
        "date": "Jul 12, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Hard to move around company if you want to try something different",
        "advice": null,
        "pros": "Great name on resume, pays well if you do well",
        "summary": "Great Name, Competitive Salary, Hard to Move Around",
        "role": "Anonymous Employee",
        "date": "Jul 14, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- For many employees, it's easy for the job to become your life. You work there 8 hours, slowly you realize all of your friends are your co-workers, you end up talking about work when you're not there, etc.",
        "advice": "I'd love it if management was a bit more serious about putting employee suggestions to action. Sometimes I feel as if it's all talk and not actually walking the walk.",
        "pros": "- Amazing people - seriously, because Apple focuses on your relatable qualities when they hire you, it creates an amazing environment of interesting and friendly people. I considerable my Apple co-workers a family and I've made amazing friends that I'll have for years to come.- Learn every single day- Awesome benefits and decent pay- Fairly transparent management- Opportunity for self-improvement. Som… e people can make Apple retail a career. But for those who aren't planning on that, their training allows for opportunities to improve on yourself. A lot of the skills used and developed on the sales floor have positively impacted who I am as a person. I'm more patient, knowledgeable, can strike up meaningful conversation with strangers - all things that can be very useful in life or for future jobs.",
        "summary": "Great friends, reliable, fun",
        "role": "Specialist",
        "date": "Jul 16, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It was a bit too many hours for my liking, I dont mind working long hours but at times it was a mess when it came to my scheduling.",
        "advice": "Keep up the good work.",
        "pros": "Great atmosphere with potential to really make it far. Because of your surroundings, it makes it easy to truly step up your game",
        "summary": "Wonderful",
        "role": "Sales Associate",
        "date": "Jul 16, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "At times it can feel condescending the way peers and management have \"feedback\" on a personal level; however, I believe this to be a result of the poor leadership and their \"agendas\" that existed in 2010.",
        "advice": "Listen more, be patient, and live the credo; even when it's not convenient.",
        "pros": "Well developed culture and products and extensive training...",
        "summary": "One of the better retail jobs...",
        "role": "Genius",
        "date": "Jul 18, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hours are rigid, shift bids infrequent",
        "advice": "Allow split bids or changes based on productivity, not just longevity",
        "pros": "Excellent support, great benefits, outstanding team building opportunities",
        "summary": "Good company",
        "role": "Mac Specialist (Apple Store)",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Monotonous, long hours on launch days",
        "advice": "Eliminate cliques to allow for better team",
        "pros": "Great benefits, great pay, great job",
        "summary": "Sales Floor selling macs, ipads, ipods, and iphones",
        "role": "Specialist",
        "date": "Jul 22, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Work pressure, Deadlines, Long hours",
        "advice": "Needs to mellow down",
        "pros": "Working with real-time geeks who have had their 2nd PHDs done.Beer bashes, wine cheese, good food, employee benefits, unmatched health insurances, Live concerts.",
        "summary": "Stay hungry Stay Foolish",
        "role": "Anonymous Employee",
        "date": "Jul 23, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Little internal development. You may stay at the same position for a very long time.",
        "advice": "Help your employees become the best employees.",
        "pros": "Positive environment. Great Healthcare and other benefits",
        "summary": "Apple is great place to work.",
        "role": "Genius",
        "date": "Jul 25, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The houses are very expensive here.",
        "advice": "Not available. sorry, i have no idea",
        "pros": "You can get well paid and learn a lot if you are an intern.",
        "summary": "you need to work",
        "role": "Anonymous Employee",
        "date": "Jul 26, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long days and nights, shitty managers",
        "advice": "none",
        "pros": "Great product discounts and benefits to employees",
        "summary": "Hard",
        "role": "Specialist",
        "date": "Jul 28, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Senior management was infiltrated by retail clothing managers who did not understand technology, were very focused on the fashion they wore each day and their primary skill was often an ability to play court politics.There is also an almost cult like self-improvement culture. Except senior managers (director level) don't apply it to themselves. So everyone below them should be open to \"feedback\" at all times,…  but not if you're in a management role because then you're showing vulnerability and how would that look?",
        "advice": "You need to stick to products and technology and hire people in the stores and at HQ who get it. Great \"people persons\" who don't know tech will not be respected or be good at their jobs. If SJ had met the people who were directors in Apple Retail he would have been appalled (except for a few, there were a few who were excellent).",
        "pros": "Very bright co-workers, dedication to higher goals, commitment to quality, the front line people in the stores are great.",
        "summary": "Apple Retail (Cupertino HQ) - great company, strange culture",
        "role": "Anonymous Employee",
        "date": "Jul 30, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Internal promotions are hyped during training but Apple fails to promote from within",
        "advice": null,
        "pros": "Worthwhile benefits for PT and FT retail employees",
        "summary": "A good job to help you find yourself",
        "role": "Specialist",
        "date": "Jul 31, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No documentation, little/no software engineering process, high expectations/workload.",
        "advice": null,
        "pros": "Descent salary, good benefits, 401K match, stock bonus, & other perks.",
        "summary": "Different than the typical outside impression.",
        "role": "Software QA Engineer",
        "date": "Aug 1, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of internal vertical movement, social drama among employees, lack of realization that this isn't a retail job (in the traditional sense) and thus shouldn't be deemed a retail job when presenting comps in terms of salary/wage.",
        "advice": "Provide more internal vertical movement, more attention to development, acknowledge that the internal customer is just as important as the external.",
        "pros": "The people, the customers (yes, the customers!), being exposed to constantly emerging tech, learning a lot about yourself, fine tuning your strengths and becoming aware of your opportunities.",
        "summary": "Sales Expert position was worth the time, even if it's a position that lacks focus.",
        "role": "Expert",
        "date": "Aug 2, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not a place that you're going to make a lot of money, long hours with little consideration of personal life",
        "advice": null,
        "pros": "Apple provides a structure and culture unlike any other in corporate america. Its a great place to transition into the professional workforce out of college",
        "summary": "Great place for recent college grads",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You need to be an absolute junkie to mesh",
        "advice": "Ensure on boarding is properly completed",
        "pros": "Consistent coaching across all levels",
        "summary": "Specialist",
        "role": "Specialist",
        "date": "Aug 5, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's a retail job. Unclear path for movement in my store. Little to no full time opportunities. Any full-timer that leaves or gets fired gets replaced with 2 part-time positions. Favoritism for promotions or movement within the company.",
        "advice": "Help build morale by promoting internally and giving everyone an equal opportunity to shadow the roles of their interest.",
        "pros": "Pretty relaxed work environment amongst peers and management, depending on the managers for the day. Medical benefits for part-timers. Commuter benefits help a great deal in nyc.",
        "summary": "I have been working part-time for 2 years.",
        "role": "Specialist",
        "date": "Aug 6, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-just another sales job-not enough new opportunities presented- management was sometimes too busy and could not be found when needed.",
        "advice": "create job plans for new employees. where do they want to go in the company. more check-ins with their specific manager to talk about goals would also be helpful. sometimes its easy to get lost in the employee shuffle because there are so many blue shirts, might be nice to include more personal rewards and assessments. if I would have been offered a higher more challenging position I would not have quit.",
        "pros": "-great training program- great products-fun team to work with-fun team building activities-interesting market",
        "summary": "Good training program",
        "role": "Specialist",
        "date": "Aug 7, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Most of the cons were due to my own personality, but I was continually stressed by times when I would have to try and make meaningful connections with people who didn't understand technology the way I did. I wouldn't trade the experiences I had there for anything, and I met a lot of really amazing and interesting people, but the amount of time I had to spend explaining things to people that seemed second nature to me…  required a lot of patience to bridge that gap, and that's not for everybody. Sometimes sporadic nature of how my schedule shifted around got on my nerves, too.",
        "advice": "It's important to communicate if you don't see eye to eye with an employee, or if you can't necessarily understand their feelings on the subject. I know when you are a manager you worry about rubbing someone the wrong way if you don't completely align with what they are trying to say, but if you don't provide any perspective and just agree with everything, that can almost be just as problematic. If there is an experi… ence you don't understand, just say it. It will gain more ground in communication even if it isn't the most positive of responses, and it can lead to a positive conclusion.",
        "pros": "They helped pay for my transit to and from work, which helped me save a lot of money, they held contests to win software like adobe creative suite for free, which is an amazing chance for anyone who knows how much those products cost, and they were always concerned with my well-being as an employee...it was a huge concern to the people that I worked under that I not feel as though I was just a cog in a machine, they … stressed the philosophy of the importance of teamwork and impact of employees.",
        "summary": "A lesson in how my technical expertise factors into social interactions",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You may be looked at as an outsider if you don't drink the Kool-Aid soon after hire. Your job description changes on a regular basis. And, when new products are to be released, you're not given any training nor advance notice to prepare.",
        "advice": "Fix the cons listed. As for how, you'd have to pay me for that.",
        "pros": "The food is great at the Austin Customer Support campus. The people are mostly decent (just avoid the sales guys). And, there's typically a fairly well defined path for advancement.",
        "summary": "Great Culture, Poor Communication",
        "role": "Anonymous Employee",
        "date": "Aug 10, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Current employees are overwhelmed with work. Apple is trying to dramatically grow revenue without growing head count, which can lead to burn out of it's current employees. Additionally, there is not much in terms of a career path.",
        "advice": "Apple needs to grow its head count and foster a career path for its employees. Also, Apple should take care of medical premiums.",
        "pros": "Apple makes great products and its employees are proud of their company. Apple employees are driven and passionate, which fosters a fantastic culture. Apple has a competitive benefits package, which includes 401K matching, medical, dental, vision, fitness reimbursement, and Employee Purchase Program.",
        "summary": "Working at Apple",
        "role": "Systems Engineer",
        "date": "Aug 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The work life balance on my team it not what it used to be. Very little time for your family especially if you have young children at home.",
        "advice": null,
        "pros": "Get to work independently. Well paid for retail sales. Work with all kinds of people and customers. Never a dull moment.",
        "summary": "Love it.",
        "role": "Apple Solutions Consultant",
        "date": "Aug 12, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No concept of work-life balance.",
        "advice": "Hire more people and improve base salary compensation",
        "pros": "Work with a fantastic team of people doing challenging work. Never a dull moment",
        "summary": "Great company, slave hours",
        "role": "Anonymous Employee",
        "date": "Aug 13, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- High heavy traffic- New Weekly Work Schedule",
        "advice": null,
        "pros": "- Great people and environment- Amazing innovative products to learn and showcase to customer",
        "summary": "Great Company to work for!",
        "role": "Mac Specialist (Apple Store)",
        "date": "Aug 16, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Fast-paced to the point of stressful; intense secrecy and company speech rules",
        "advice": "Relax about on your 'company message'",
        "pros": "Casual but still professional; customer focused; good pay",
        "summary": "Specialist (retail)",
        "role": "Mac Specialist (Apple Store)",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "\"Big Brother\" product secrecy.Upward movement difficult.",
        "advice": null,
        "pros": "Smart, focused and driven coworkers.Fun products and exciting technology.Learned a ton even at the very beginning of my career.",
        "summary": "Financial Analyst",
        "role": "Anonymous Employee",
        "date": "Aug 20, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Tiny cog in a giant machine - very little input on how anything works. Retail is a bit grueling, especially at the scale that Apple does it. Holidays are hard.",
        "advice": "Never sacrifice the customer experience - the expectation that they will always find really passionate, intelligent staff - in favor of people who just look the part. The staff in some stores doesn't really represent the level of excellence my store always brought.",
        "pros": "When I was working at Apple Retail, it was such an exciting time to be with the company. New, exciting products all the time, great energy and an amazing staff. Loved my coworkers - and keep up with them to this day.",
        "summary": "Best college job ever.",
        "role": "Creative (Apple Store)",
        "date": "Aug 21, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "hours can be long especially during launches. Pay is terrible considering the amount of product you are moving out the doors. Zero opportunity if you are looking for a career.",
        "advice": "pay your people better. Share some of the massive profits with your retail people.",
        "pros": "Great people to work with. Generally great customers. Great to put on your resume.",
        "summary": "Great job during college. Zero opportunity for a career.",
        "role": "Mac Specialist (Apple Store)",
        "date": "Aug 23, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Typical retail issues: managers unwilling to be flexible with scheduling, a little too much \"kool-aid\" to drink at times, esp. when managers are discussing metrics (the need to hit AppleCare and MobileMe sales goals at the time, althought MobileMe has been phased out.) VERY little career mobility; even shifting into a Genius role is nearly impossible as a part-time employee.",
        "advice": "Fair enough if you don't want to internally promote much, but it's not fair to your workforce to use career progress as a carrot to continue hitting sales goals when you rarely fufill it. The rest of the retail environment I can take as coming with the territory, but I thought it was particularly unfair to give the impression that people are getting new jobs within the company all the time.",
        "pros": "Great customer service experience since you're dealing with a HUGE flow of many, many different customers. Good formal product/customer service training for someone with little previous retail experience. The chance to play around and talk all day about cool gadgets. A company culture that manages to motivate it's employees nicely. Pretty good pay for a mall retail outlet.",
        "summary": "Apple Retail: Good company if you can deal with Retail.",
        "role": "Specialist",
        "date": "Aug 23, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Since working with a great company that people look up to, customers feel more dissapointed when things go wrong.",
        "advice": null,
        "pros": "Beer bashes, Full Benefits, My manager tried holistic coaching methods, Great discounts on Apple products",
        "summary": "Overall great experience",
        "role": "ITunes Advisor",
        "date": "Aug 23, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Narrow upward mobility within business field. Corporate strategy often trumps the autonomy to take care of customers at street level.",
        "advice": "Consider allowing more outside connection with business customers.",
        "pros": "Great personal development, training and benefits.",
        "summary": "Business Manager",
        "role": "Business Manager",
        "date": "Aug 27, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The hours suck and they work you hard and don't pay you very much.",
        "advice": null,
        "pros": "They hire great people to work with. They have great discounts.",
        "summary": "Great values and great individuals.",
        "role": "Family Room Specialist",
        "date": "Aug 28, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "typical retail hours, \"interesting\" clientele",
        "advice": null,
        "pros": "Encouraging work environment, gain great customer service skills, learn new ideas",
        "summary": "Great place to start career",
        "role": "Family Room Specialist",
        "date": "Aug 29, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The only problem I noticed at Apple was the diversity. I am a non-person of color but realized that there weren't many people of color in our intern class. It was quite noticeable especially during our intern events. There were like 5 interns of color out of hundreds of interns. During lunch at main campus, I never did see hardly any people of color sitting at a table. It was kind of odd to say the least. I thought A… pple corporate diversity would resemble the retail store diversity. I could tell the interns of color noticed it too. I was talking to one of them and the intern mentioned visiting Google campus and that it was way more diverse. I recently visited Google at lunch for an interview and my friend was right, it’s a totally different feeling. Google’s executive leadership on the website even shows a person of color and a woman. I love Apple but sometimes wondered if it was by design (like their products). As a non-person of color, I felt Apple corporate Intern program could improve on this front. It was obvious that there isn't a voice pushing this in upper management. My 2 cents...",
        "advice": "Great intern program, bravo, but increase diversity of people of color...it just looks off.",
        "pros": "The internship was a great experience. We were introduced to the Apple culture, plus had executive speakers, and other fun activities. The company also provided housing.",
        "summary": "I interned at Apple this summer (2013). I was surprised at lack of diversity.",
        "role": "Intern",
        "date": "Sep 1, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Apple offers different pay bands through out the country and the region that I work in is the lowest on the pay scale so someone in my same role may get something much higher just because of where they work. However, cost of living in my hometown is not low so I'm not sure the justification.",
        "advice": null,
        "pros": "Great discounts, flexible hours, availability, love the people I work with.",
        "summary": "Love my time here...but kind of a holding pattern. This is not long term, but more of an idle...",
        "role": "Business Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The work is hard. Customers can be downright abusive. Upward mobility can be more political that based on skills at times.",
        "advice": "Apple has such an amazing vision for who they are and how their people should be cared for. I think retail has lost some of that vision. It needs to be restored.",
        "pros": "The benefits are amazing. The people are among some of the smartest I have ever encountered. You will become better at whatever you do after working for Apple.",
        "summary": "All the rumors you have heard are true... This really is a great place to work.",
        "role": "Anonymous Employee",
        "date": "Sep 4, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It is very hard to move up. Once there are a lot of employees all going for the same positions and it is not always based on merit.",
        "advice": "Value your employees more",
        "pros": "This is definitely a great company to work for. Learned a lot and worked with some of the most intelligent people on the planet.",
        "summary": "Great Company to work for!",
        "role": "Anonymous Employee",
        "date": "Sep 6, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "In a crowded retail environment where employees often get sick from their customers / the public, Apple has an attendance policy that severely punishes employees for taking sick days. Because of this, most employees come to work sick [and sometimes injured], especially during flu season and the holidays, to avoid being penalized. This, in turn, gets more people sick. During the holidays, 30-50% of the employees in th… e store will be at some degree of ill, many repeatedly re-catching illness from other co-workers.Upwards mobility is limited. Apple often hires outside manager candidates with little or no experience working in the store and places them in a position to manage people far more experience than them. Apple also has policies in place to prevent managers from building a human connection with the people they manage, such as preventing the few internally hired managers from working with previous co-workers, and preventing managers from having any social interaction with non-management employees outside the store. As a result, managers form their own \"social click\" like the the \"cool kids in high school\" that is entirely detached from the rest of the store.",
        "advice": "The attendance policy is abusive and bordering on inhumane. This is one glaring flaw in a company that in every other way seems concerned with the well-being and development of employees.",
        "pros": "Great co-workers, challenging environment that will build personal & job skills like at no other company. The wealth of personal and job growth someone can have working at Apple is unrivaled at any other company. Apple employees, due to excellent training and a stringent selection process are highly skilled and personally well rounded, if not from the moment of hire, they will become that way within the first yea… r of working in the Apple environment. Apple provides a sort of education that can't be learned anywhere else.Employees are paid well for retail. There are frequent opportunities for lateral movement in the store, and opportunities to \"intern\" or work temporarily at corporate.",
        "summary": "A great company to work for with a few glaring flaws.",
        "role": "Specialist",
        "date": "Sep 8, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Apple is a big small company, sometimes it was hard to get my individual issue heard and addressed by corporate. When it came to things that effected everyone, however, store management was more than responsive.",
        "advice": null,
        "pros": "If you apply yourself and go above and beyond, there is no limit to where you can go, literally. Apple has positions all over the globe, great benefits while simultaneously offering lot's of opportunities for personal growth and education.",
        "summary": "Great Company, lot's of development opportunity.",
        "role": "Mac Specialist (Apple Store)",
        "date": "Sep 9, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "* Pretty rigid in process* Middle management became a growing problem (in that more and more middle managers were hired)* Very tight deadlines and media events mean there's no room for error on delivery; the work absolutely needs to be finished on time",
        "advice": null,
        "pros": "* A lot of very smart people to work with* At the time, the compensation was excellent* Team culture was excellent for the team I was on* It's amazing to work on the innovative products Apple is producing",
        "summary": "Great place when I started but some bad hires soured the experience.",
        "role": "Lead Front End Developer",
        "date": "Sep 9, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- City stores in particular can be incredibly hectic and constantly busy.- Although the culture is great, it can feel a bit like a cult at times.- While pay for specialists on the floor is good compared to other retailers, pay for technicians is below the average pay grade of similarly certified technicians elsewhere.",
        "advice": "While it is great that Apple strives to create a similar experience in all of its stores, the differences between a flagship and a mall store mean that it becomes inefficient to adapt the same internal systems to wholly different store environments. More recognition of the difficulties that different kinds of stores face could lead to greater efficiency overall.",
        "pros": "- There is a great respect for work-life balance.- Compensation is better than average for retail employees and come with great benefits.- Full-time employees receive full benefits on day one, part-time after 90 days.- All managers I have worked with have been incredibly helpful and supportive.",
        "summary": "The best retail experience I've ever had.",
        "role": "Family Room Specialist",
        "date": "Sep 9, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The work schedule can be a bit demanding for someone who prefers a work-life balance, but definitely not too intimidating. Also, I wouldn't suggest anyone who isn't people person to work here.",
        "advice": "Care more.",
        "pros": "Nice company perks for employees around the holiday time, so no complaints in that department--at all. Overall, a cool experience.",
        "summary": "Cool Gig",
        "role": "Business Analyst",
        "date": "Sep 9, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Work LIfe Balance is difficult",
        "advice": null,
        "pros": "Its Apple...great co-workers...growing like crazy",
        "summary": "Great company",
        "role": "Ops Support",
        "date": "Sep 10, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Pressured to sell to progress into other non-sales career paths. Especially Apple Care...- A few ingenuine management members. On the surface, they're very personable. But when push comes to shove, you're treated lowly. The fake smiles start to annoy you.",
        "advice": "Visit an apple store without the managers around and ask employees' opinions directly.",
        "pros": "- Great base salary- Friendly co-workers.",
        "summary": "Great if you like to drink the kool-aid",
        "role": "Mac Specialist (Apple Store)",
        "date": "Sep 15, 2013",
        "is_current": false
    }
]