[
    {
        "rating": 5,
        "cons": "Long hours (but they make it clear in your interview, so no surprise here). Yearly compensation is minimal. Cafeteria gets repetitive really fast and the prices are high.",
        "advice": null,
        "pros": "You learn something everyday. Work with great people, including management. Do an outstanding job and it is easy to move up or around the company. Great benefits",
        "summary": "Great job, many opportunities",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Standing long hours and no much break times",
        "advice": "None",
        "pros": "Disccounts given to employees every three years",
        "summary": "Good company to work",
        "role": "Anonymous Employee",
        "date": "Sep 20, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "none its all good great",
        "advice": "nothing",
        "pros": "pay and flexible hours awesome stuff",
        "summary": "specialist",
        "role": "Specialist",
        "date": "Sep 20, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "They can do better for people of color. Too often my fellow coworkers of color were targeted for minuscule offenses. This often held them back when it came time for promotion. My white counterparts would make the same offenses but they would go unseen by management. I don't think this is fair at all. All in all, I still believe that it's a wonderful place to work.",
        "advice": "Give everyone and equal opportunity to grow no matter their race.",
        "pros": "You'll have a chance to work with some of the smartest people to ever walk the face of the earth. Creating WOW moments for customers every single day is probably the most fulfilling part of the job!",
        "summary": "Most Enriching Position I've Ever Held",
        "role": "Expert",
        "date": "Sep 21, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Retail hours, not given information early so sometimes you are left in the dark about products or soluitons until Apple releases it to the public even if you know things are coming.",
        "advice": null,
        "pros": "Great culture, products, team, management, vision etc. I couldn't have imagined a better place to work while I was in school.",
        "summary": "Family Room Specialist",
        "role": "Family Room Specialist",
        "date": "Sep 21, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "A con would be making it how it is for example the iPhone it's so specific in detail that I'm sure it's challenging for some to make such a product",
        "advice": null,
        "pros": "The best reason to work at Apple is to become an engineer at the facility and making some of these best products they have to offer for the people",
        "summary": "Product",
        "role": "Sales Associate",
        "date": "Sep 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "hoursholidayslanguage barriers of customersconstant turnoverconfidentiality",
        "advice": null,
        "pros": "BenefitsCo-workersfast pacedcompany culturedesign of stores",
        "summary": "Redzone Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 23, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "There are no downsides to it.",
        "advice": null,
        "pros": "All it's cracked up to be.",
        "summary": "Believe the hype",
        "role": "Anonymous Employee",
        "date": "Sep 23, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The job will make you work harder than you have ever worked even when you most likely have other things going on. For the most part, you are contributing to the team and everyone works hard and does their part to contribute. There are times your family won't see you enough.",
        "advice": "Thank you for working as hard as you do.",
        "pros": "Great, positive environment working with some of the most talented people in the world! Amazing Agents, Team Managers, and all levels of management, up to the Business and Director level. Your career is driven by you and there are so many opportunities to develop if you are willing to put the time in to be the best.",
        "summary": "Work hard, play harder with some of the most talented people in the world!",
        "role": "Anonymous Employee",
        "date": "Sep 23, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "High stress, conflict resolution with disgruntled customers.",
        "advice": "More breaks.",
        "pros": "Wonderful coworkers, great compensation, fantastic discount.",
        "summary": "FRS",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Being able to enrich a customer's life with Apple product. Endless possibilities.",
        "advice": null,
        "pros": "Having to deliver bad news to customers",
        "summary": "Difficult Job with Heavy responsibility",
        "role": "Genius Administrator",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Customer can be pretty difficult at times.",
        "advice": null,
        "pros": "Great place to work, always challenging,",
        "summary": "Genius",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not a clear path for promotion",
        "advice": null,
        "pros": "Apple takes time and money to invest into their employees",
        "summary": "Operations",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Get yelled at a lot by customers",
        "advice": null,
        "pros": "More fulfilling than Specialist Role",
        "summary": "Technical Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing really. I loved working here to be honest.",
        "advice": "Keep up the good work, maybe fast-track promotions.",
        "pros": "Good pay, co-workers, and overall working environment",
        "summary": "Pretty Good",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Pay is a bit less than what you might expect from such a successful company however, the benefits are great!",
        "advice": "Hire people to work shifts instead of random hours. It is difficult at best to have a work/life balance when you do not have consistency in your work hours.",
        "pros": "Constantly learning from some of the most amazing people I've ever met. They really want to share their knowledge and help you to become proficient.",
        "summary": "Brilliant coworkers!",
        "role": "Specialist",
        "date": "Sep 27, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Working with customers is always a drag because anyone is allowed in the store.",
        "advice": "More pay for lower wage works, its hard to make a living working on low pay.",
        "pros": "Great products to sell and nice management. Discounts on amazing gear.",
        "summary": "Part time store",
        "role": "Anonymous Employee",
        "date": "Sep 27, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None that I know of.",
        "advice": null,
        "pros": "Meeting new people everyday and finding out what makes them unique all within your 10-15 interaction is an amazing experience. Management and the team are always so cheerful and friendly. They all support you with anything and everything that you do and they all want you to succeed at your goals both personal and professional. Fantastic work/life balance as they try to accommodate you for the things you have to do ou… tside of work, like having a life!",
        "summary": "One of the greatest companies.",
        "role": "Anonymous Employee",
        "date": "Sep 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A lot of traveling. Away from home alot.",
        "advice": null,
        "pros": "Excellent company to work for.",
        "summary": "Global Security",
        "role": "Global Security",
        "date": "Sep 28, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "customer attitudes, not a lot of supervision..very learn as you go",
        "advice": null,
        "pros": "Great company culture, experience working with people of different backgrounds, great pay",
        "summary": "Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work-life balance is practically non existent. If you are looking for a career and are not applying for management, then opportunities to progress are non existent.Micro Management (but it is a tech company)Micro PoliticsIf you are entering with the thought of applying to corporate, then think again.",
        "advice": "Apple has some brilliant people who work in their retail stores AND their corporate offices. The sad fact is that if you enter the retail side, you are ALWAYS going to be tarred with a 'retail' brush. For those that aspire, it's a dead-end.Apple used to be a place to go and give as much as you could to your customers every day and be paid for doing so. Now it's simply catering for the next dividend to the big sha… re holders who are just padding their portfolios and egos. Your mantra has changed from \"The people\" to \"the sale at any cost\"Apple is a fantastic company: it's just searching for a way to \"be\" a company that's hip for the hipsters and rock steady for business and innovative for both. Take more notice of your people and don't just ask them to come up with stuff and then move on. Circus's and games didn't help the Roman Empire, Apple. Caveat Emptor",
        "pros": "Competitive workplace, latest technology, strive for perfection, lots of deals and great benefits and as long as you know your stuff, your customers will love you.",
        "summary": "Creative like nothing else",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "i work by the street and its a lot of noise",
        "advice": "Please make new buildings way from traffic please",
        "pros": "i get discounts on new apple products like the iphone 7",
        "summary": "the best job i can get",
        "role": "Graphic Artist",
        "date": "Sep 29, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Any regular retail cons. Long hours, holidays, weekends, launch days. Working with the general population can be very challenging at times",
        "advice": "Continue to hire wonderful people. Make it easier to move up within the retail store structure for people who have been there for a while.",
        "pros": "If you are going to work retail, you might as well work for the best. I thoroughly enjoyed my time at the fruit stand. The values and lessons you learn are applicable to any future job profession",
        "summary": "Excellent!",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None apple is the best",
        "advice": "None apple is the best company",
        "pros": "Great pay great people awesome",
        "summary": "Great job",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The inconsistent schedule and the abuse from customers.",
        "advice": null,
        "pros": "The people you work with are life long friends.",
        "summary": "My life",
        "role": "Anonymous Employee",
        "date": "Sep 30, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No work life balance. Unrealistic goals.",
        "advice": null,
        "pros": "Innovative. Helpful. Career oriented. Knowledge",
        "summary": "Na",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Career Opportunities and work/life balance.",
        "advice": null,
        "pros": "Great company to work for, great benefits. Good for doers, people that like to work and prepared to work hard.",
        "summary": "Love it!",
        "role": "Anonymous Employee",
        "date": "Oct 2, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It can be hard to advance at an Apple Store, and there are a lot of politics and seniority that comes into play when you try to move up.",
        "advice": "Keep up the good work, I would say just to not feed into the drama and politics when it comes to managing the team.",
        "pros": "Working at an Apple Store was the perfect job for me during college. The management understands that you have other commitments outside of work, and is super flexible in making time for your life outside of Apple.",
        "summary": "Perfect job during college",
        "role": "Anonymous Employee",
        "date": "Oct 2, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Haven't had a problem yet",
        "advice": null,
        "pros": "Good salary, amazing recruitment process and till now there hasn't been a month where they haven't contacted me to ask it was going.",
        "summary": "Amazing company to work with",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Very busy but isnt too bad",
        "advice": "None",
        "pros": "Great benefits and great people",
        "summary": "Sales",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The almost/not quite cult behavior is not for everyone. Being retail I get it... but don't expect them to cater to the hours that you can or can't work.",
        "advice": null,
        "pros": "Fun, Uplifting and motivating work environment. I loved the people I worked with and learned a lot from my experience.",
        "summary": "Short but sweet",
        "role": "Sales Specialist",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The constant change in processes and operating systems can be challengingn to keep up with and remember.",
        "advice": null,
        "pros": "As a part time employee, you get benefits and sick time! They also do tuition reimbursement.",
        "summary": "Love this job",
        "role": "Specialist",
        "date": "Oct 4, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not given the opportunity to advance",
        "advice": "No favoritism",
        "pros": "I believe in that Apple culture and how it prides it self on Customer Service",
        "summary": "Great Company",
        "role": "Mac Specialist (Apple Store)",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cupertino is a bit of a boring place.",
        "advice": "More code collaboration",
        "pros": "Beer bashes, free dinner, free snacks, department off-sites",
        "summary": "Great place to work",
        "role": "Software Engineer",
        "date": "Oct 5, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "But hard to advance from at home advisor",
        "advice": null,
        "pros": "Great benefits, amazing health care",
        "summary": "Amazing Company",
        "role": "Anonymous Employee",
        "date": "Oct 6, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Nothing is bad about this company. I loved every day.",
        "advice": null,
        "pros": "Loved the work. Was excited to work here everyday",
        "summary": "Intern",
        "role": "Anonymous Employee",
        "date": "Oct 6, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Commute from the city takes a long time. Secrecy is an obscession which makes it more difficult to create your own network.",
        "advice": null,
        "pros": "Good projects for a DSP guy. Casual and opened people. Salaries and overall conditions are good.",
        "summary": "Hardware engineer",
        "role": "Hardware Engineer",
        "date": "Oct 6, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Too many contractors, outcalls and lack of work life balance",
        "advice": null,
        "pros": "Knowledge, pay, hours, co workers and apple swag",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I worry about being able to move up in the company. I've heard from multiple people that it's almost impossible to go to corporate after working for retail.",
        "advice": null,
        "pros": "The people I work with are the coolest people I've met. I'm constantly learning and developing not only in the workplace, but also as a human being.",
        "summary": "Best job I've ever had. Great benefits, incredible people. I'm stimulated every day.",
        "role": "Creative",
        "date": "Oct 7, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Ambiguous for promotion, hard to get hired",
        "advice": "Better promotional rates. Get competitive for what work is done in retail. Stem the flow of talent leaving for higher wages.",
        "pros": "Super progressive great benefits and helpful",
        "summary": "Love it",
        "role": "Anonymous Employee",
        "date": "Oct 8, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Competitive, Compensation, Support, Staffing, Attitudes.",
        "advice": "Take charge when needed but let your team do the work because if you prepared them properly there is nothing to fear.",
        "pros": "Knowledge, Technology, Teaching, Connecting, Exchanging, Enriching, Specializing.",
        "summary": "Apple Expert",
        "role": "Apple Expert",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You'll read a lot of negative reviews -- is it stressful, yes, but what customer service job isn't? I felt like I was constantly in hyper-learning mode for the first 6-8 months. If you don't like continuous change and constant learning, then this may not be the best fit. (To me it's not a con) I truly don't have any real \"cons\"",
        "advice": "Keep listening to the voice of the advisors on the front lines, as you've been doing.",
        "pros": "There is not enough GOOD things that I can say about working for Apple. If you've ever dreamed of working for this company and thought you knew what it would be like -- you're probably not even close. It is truly everything I thought it would be and more. In this position getting to work from home is a huge plus. In my honest opinion they offer a very generous compensation package. If you love working with customers … and helping even the most frustrated with their tech issues, and you're comfortable working alone -- then this is a great position for you! If you excel at your position there are opportunities for advancement and expanding your overall skills.",
        "summary": "At Home Advisor",
        "role": "Applecare At Home Advisor",
        "date": "Oct 8, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I did not have any regrets while working here.",
        "advice": null,
        "pros": "Great pay, great benefits, great managers.",
        "summary": "Advisor Review",
        "role": "Anonymous Employee",
        "date": "Oct 9, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No cons. Apple treats its interns very well",
        "advice": null,
        "pros": "Amazing experience. Interns are treated like full time employees",
        "summary": "Software Engineering Intern",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Easy to get \"stuck\"thereSome don't utilize feedback",
        "advice": "Don't have favorites",
        "pros": "Great BenefitsAbility to move upExcellent training",
        "summary": "Specialist",
        "role": "Sales Specialist",
        "date": "Oct 10, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The retail schedule can be tough. Although, Apple is taking steps to improve this area.",
        "advice": null,
        "pros": "Development focused if you are driven to make yourself better.",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You can feel like you hit a wall at some points due to lack of opportunities to get promoted. Overall, it is not the worst feeling, but it pushes you to work harder.",
        "advice": null,
        "pros": "It is a wonderful environment that revolves around enriching lives. You get to have flexibility and learn new roles every day.",
        "summary": "Enriching Lives",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "there really aren't any cons",
        "advice": null,
        "pros": "great amazing fun cool nice",
        "summary": "love it",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work life balance could be a little better.",
        "advice": null,
        "pros": "Great perks. Cutting edge work.",
        "summary": "Great employer",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Some benefits are reducing year after year like every where else. For example, lunch price and travel. Overall it's a great place to work.",
        "advice": null,
        "pros": "Great pay and bonuses. Excellent health care benefits and work environment. Every individual is responsible for his/her work, when at the same time, everyone is part of a team. Love Steve Jobs' model.",
        "summary": "One of the best place to work.",
        "role": "Senior Engineer",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "very repetitive duties every day",
        "advice": null,
        "pros": "Got to work from home",
        "summary": "Okay for a summer job",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No room to grow, lower pay than what most are qualified to do, customers are pretty crazy sometimes.",
        "advice": "Increase retail salaries and make the starting wage $20/hr. This would set Apple apart from the competition and would help indirectly grow the brand as Apple is recognized for treating their workers fairly.",
        "pros": "Apple has some of the best benefits in the world and offer the best products in the market. In addition, the people that you work with are some of the best and brightest around.",
        "summary": "Great Company, Great Benefits",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Advancement can seem arbitrary, unless one learns to navigate the politics landscape.",
        "advice": null,
        "pros": "Genius teams, and everybody really, have the power to do anything they need to solve a problem.Pay is fair. Many want more, but in truth the pay is appropriate.Work with the smartest and most dynamic people you'll ever meet in your life.You will be challenged every single day, if you're not it's because you're not trying.",
        "summary": "Genius",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A lot of complaints from customers and fire drills from executives that need to be handled even on weekends.",
        "advice": "Need to give more training and time to help junior engineers understand code path.",
        "pros": "Get to work on products that many people are excited about. Get to work on technologies that are cutting edge.",
        "summary": "WiFi Systems Software Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "either early hours, or incredibly late hours. Hard to have a work/life balance.",
        "advice": "NA",
        "pros": "a position that always keeps you on your toes... mentally.",
        "summary": "Creative",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None That I can think of",
        "advice": "N/A",
        "pros": "It was a cool company",
        "summary": "Genius",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "no regular free food available",
        "advice": null,
        "pros": "Most branded company around the area and very generous on yearly RSU bonus",
        "summary": "Pays really well",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Can be extremely busy, especially during holidays.",
        "advice": "Keep up the good work!",
        "pros": "Apple maintains a positive and energetic work environment. All employees seek to help each other out and make sure the store and it's team is functioning well and efficiently.",
        "summary": "Awesome Store",
        "role": "Technical Specialist",
        "date": "Oct 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Hard to Move up- With things changing so much, your job description may get longer but pay stays the same- Managers are usually hired externally- Technicians are not paid more than sales even though their jobs are 10x more difficult",
        "advice": "Give every one in Technical Support a hefty raise, they deserve it.Get out of the back more, but besides that thanks for keeping everyone motivated!",
        "pros": "The people you work with are great. Benefits are amazing!!! If you're okay with ambiguity it's an ever changing job which keeps things exciting. You can be yourself :)",
        "summary": "Good People",
        "role": "Service Technician",
        "date": "Oct 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Processes and procedures constantly in development- this is both bad and goid",
        "advice": null,
        "pros": "The People, the atmosphere, the growth opportunities",
        "summary": "Data Center",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Retail Schedule is not the best environment for a parent.Pay is substantial but having a family is can be harder.",
        "advice": null,
        "pros": "People are wonderful. Benefits are amazing! Pay is good.",
        "summary": "Technical Specialist",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Internal systems are not very well supported and occasionally cause difficult customer situations. The role does not change very often and seems to have less focus from corporate team.",
        "advice": "Focus on development with this role. Recommit energy to supporting the Business Team. Make it apart of daily operations and communication.",
        "pros": "Exciting position in the Apple Store! You get to develop strong relationships with SMB business customers using Apple technology. Noncommissioned Sales with a primary focus on customer success, which can be very fulfilling.",
        "summary": "Business Team",
        "role": "Anonymous Employee",
        "date": "Oct 15, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "This place is great to work for",
        "advice": "More bonuses.",
        "pros": "Great place to work, salary is very competetive, awesome Chefs to work with, they have great benefits, emoloyees are encourage to continue with school.",
        "summary": "Cook",
        "role": "Cook",
        "date": "Oct 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Very Goal oriented. Managers job is for you to do yours. Keep you nose clean and meet the benchmark you should be fine. Lots of goals to move around laterally, but moving up is very rare and you have to be very lucky.",
        "advice": "More options to move up and around management in AHA",
        "pros": "It is a really nice place to work. Benefits are excellent, vacation and sick time are great and Apple pays for a bunch of stuff such as child care. Don't forget those Apple Discounts!",
        "summary": "Great Place to work if you're goal oriented",
        "role": "Apple AHA",
        "date": "Oct 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "-As the company has grown, it can often be hard to see changes be made quickly. As things have gotten more structured and organized, naturally, some of the freedoms of a more organic and adaptive organization have become more limited.",
        "advice": null,
        "pros": "-Incredible culture that celebrates diversity at every turn, fiercely protects its environmental impact, and values people above profit.-The skills Apple will teach you not only make you successful in your role and industry, but also translate to relationships and overall being a person who helps move the world forward in positive ways.-Leadership is very supportive and works very hard to ensure people feel s… upported and developed.",
        "summary": "Life Changing!",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Transfers to different positions do take time. They want to make sure they have the right fit, and sometimes there just aren't any available for a period of time.",
        "advice": null,
        "pros": "I loved my time with Apple. They train their employees really well and give them the tools to succeed in customer interactions. My managers always backed up what I told customers, and if they decided to make an exception, they made sure customers knew it was a special circumstance. They were also really supportive in helping me find the best career path for me. Benefits, compensation and time off were great for a ret… ail position.",
        "summary": "Loved working for Apple",
        "role": "Sales Specialist",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "A lot of hours during weekends and holidays",
        "advice": "They do a great job in hiring and instilling the apple culture from day one",
        "pros": "You can't beat the discounts and benefits of working with such a prestigious company",
        "summary": "Best company to work for",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "can get very busy at times",
        "advice": null,
        "pros": "fun job while it lasted",
        "summary": "fun",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "When you have technical issues, they could be more helpful",
        "advice": null,
        "pros": "they teach you everything you need to know and the job is rather simple",
        "summary": "Fun place to work",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Bi-yearly schedule change with start times ranging from 7am to 1:30pm",
        "advice": "Keep doing what you do!",
        "pros": "Awesome coworkers, plentiful growth opportunities, great benefits, casual dress, awesome environment",
        "summary": "Fantastic company, amazing team",
        "role": "Carpe Facto Advisor",
        "date": "Oct 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "heath benefits can be frustrating outside of major markets",
        "advice": null,
        "pros": "Excellent company and benefits package",
        "summary": "Apple Retail",
        "role": "Mac Genius",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I have no cons for this company",
        "advice": null,
        "pros": "-Awesome people-great company-You get to talk to people about what their looking for all day!",
        "summary": "In store sales",
        "role": "Anonymous Employee",
        "date": "Oct 20, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "long hours, secrecy and some time you face a lot of pressures",
        "advice": "be open",
        "pros": "wonderful company, great benefits and you are part of something cool",
        "summary": "Apple is a great place to work",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There are no Cons to working at Apple. Keep on doing what you are doing.",
        "advice": null,
        "pros": "Highly competitive salary.Great benefits.Healthcare is amazing.Challenging work.",
        "summary": "Production Analyst",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It is a retail environment so retail hours. Vacations are paid but not easy to take the day off on holidays.",
        "advice": null,
        "pros": "401k, Stock Purchase Program, Health Insurance, Discounts, Restricted Stock Units, Life Insurance, Accidental Death and Dismemberment Insurance, Vacation, Commute etc.",
        "summary": "N/A",
        "role": "Apple Retail",
        "date": "Oct 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Some employees top-out in retail and can progress no further unless there's an interest in management. The company has a tradition of promoting from within however and many move from retail into corporate. That pathway is not always clear but the company continues to develop talent even when it means losing a valued employee from the retail space.",
        "advice": null,
        "pros": "Progressive company. Egalitarian. Employees first philosophy which redounds to unmatched customer relations. Incredible hiring practices in the retail environment.",
        "summary": "Apple Genius",
        "role": "Apple Genius",
        "date": "Oct 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Depends on your managers really, I've had good and bad ones. Again this place is what you make of it.",
        "advice": "Treat your employees well, bend over backwards and watch them do the same for you.",
        "pros": "Great company to work for, I've learned a lot. Apple is the type of company where you put a lot of hard work in it does pay off.",
        "summary": "Great Company",
        "role": "Genius Administrator",
        "date": "Oct 22, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "This job really didn't come with any cons. Everything is laid back and it's just a great work atmosphere!",
        "advice": "Continue what you're doing!",
        "pros": "- Compensation!- Benefits!- Team!- Opportunity for development!- Great Hours",
        "summary": "Great Company!",
        "role": "Red Zone Specialist",
        "date": "Oct 23, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "It can get hectic and fast paced but the team support always keeps you going",
        "advice": null,
        "pros": "Amazing team to work with!",
        "summary": "Great",
        "role": "Anonymous Employee",
        "date": "Oct 24, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Lower salaries. Hard work life balance.",
        "advice": null,
        "pros": "Benefits. Culture. Inspiring environment",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Customers can be rude. Coworkers can become clique-y. The inside of the store is more political than you'd expect.",
        "advice": "Hiring based off people skills is great, but please don't forget that technical skills are a huge impact on the job as well.",
        "pros": "Great benefits. Friendly co-workers. After all, it's still technically a retail job and you're paid way above the average.",
        "summary": "Recent Hire",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None that I can think of",
        "advice": null,
        "pros": "Great on site cafeteria!! Love it",
        "summary": "Ok",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "$12 food is provided AFTER 7pm to ENGINEER ONLY.",
        "advice": "cheaper, better and earlier dinner",
        "pros": "Intercampus on-demand shuttle is convenient.",
        "summary": "Horrible Food",
        "role": "Intern",
        "date": "Oct 26, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I want to go back to Apple. Was golden period in my life.",
        "advice": "Thank you for taking my career a million steps a head.",
        "pros": "Amazing culture. Progressive products. Employee discounts. Free gadgets. Incentives",
        "summary": "One of best companies I worked for",
        "role": "Sales Specialist",
        "date": "Oct 27, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Schedule, job can become receptive",
        "advice": null,
        "pros": "Great management, the products we support are awesome",
        "summary": "Senior Advisor",
        "role": "AppleCare Senior Advisor",
        "date": "Oct 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing at all, I loved working for Apple",
        "advice": "A little less micro manage",
        "pros": "Culture is fantastic, managers are easy to talk to.",
        "summary": "AHA",
        "role": "Apple AHA",
        "date": "Oct 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Could pay better that's right.",
        "advice": "Keep up the good job",
        "pros": "Awesome place to work thats right.",
        "summary": "Awesome place",
        "role": "Apple Technical Specialist",
        "date": "Oct 27, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "To huge a company, which comes with its own issues.",
        "advice": null,
        "pros": "Great people, awesome work, be part of something really cool and cutting edge",
        "summary": "Working in Core OS",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes the scheduling can be a little rigid but nothing over the top. No real cons.",
        "advice": "Continue to invest in your employees and the company will continue to thrive.",
        "pros": "Great benefits, amazing atmosphere, and you can transfer to nearly anywhere if you move especially in the US. Working in the retail side of it gives you flexibility to move to an entire different state and have a secured job that pays well.",
        "summary": "Technician",
        "role": "Technician",
        "date": "Oct 28, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Working alone at home sometimes a bore",
        "advice": "Micro manage as little as possible",
        "pros": "Good mangers help make realistic goals for advancement",
        "summary": "Great compnany",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2016",
        "is_current": false
    }
]