[
    {
        "rating": 3,
        "cons": "There is not a significant opportunity for professional growth, working retail.",
        "advice": "Consistency is important. Many times I had managers who enforced different rules.",
        "pros": "Great Benefits-- Educational Reimbursement. Colleagues are great people.",
        "summary": "Apple Retail Specilaist",
        "role": "Apple Retail Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "A lot of the call center jobs pay in the $40K range. There is a lot of focus they have on numbers, a lot of the times the numbers cannot be controlled by the work you do. It seems harder to move up as managers have been in the same departments for years and everyone including management seems to feel stuck.",
        "advice": "Focus more on helping improve the individual employee succeed and move on to other roles, rather then offering \"feedback\" all of the time and calling out the mistakes.",
        "pros": "The facilities, the people, the environment and products are one of a kind.",
        "summary": "Senior Customer Service Representative",
        "role": "Senior Customer Service",
        "date": "Aug 6, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- the people running retail have narrow mindsets- the people running retail business hadn't a clue how to build the business- you must love Apple like a deity in order to advance there, or at least pretend",
        "advice": "Make sure that all managers would pass the Steve Jobs elevator test.",
        "pros": "- shiny happy people all around- Apple tries to provide first-tier benefits- you have the chance to work with products you love",
        "summary": "Retail Business, still figuring it out.",
        "role": "Business Manager",
        "date": "Aug 8, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The big problem at apple is at times navigating the ladder of success, if you happen to fall for the bait of more money and and a chance to prove yourself in a new division. Make sure the managers there are about employee growth and not about self-promotion,because you might end up stuck in a deadend job.",
        "advice": "Let your employees open there wings and fly if they are ready they will make it, if not they will fail and appreciate that you gave them the chance to succeed, and will work that much harder for you.",
        "pros": "The company celebrate the individual, and really attempts to provide a good environment for growth.",
        "summary": "Good if you get the right manager.",
        "role": "Texas",
        "date": "Aug 8, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Be prepared to have other reliable income. This isn't it.",
        "advice": "Pay more attention to the people who contribute.",
        "pros": "A good place to work if you're in college or just wanting part-time work.",
        "summary": "Specialist",
        "role": "Specialist",
        "date": "Aug 11, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no discipline, no best practices",
        "advice": null,
        "pros": "brand, collaboration ,teamwork, local, salary",
        "summary": "fun, but..",
        "role": "Senior Product Manager",
        "date": "Aug 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The discrepancy between contract workers and actual Apple workers is HUGE in terms of pay, treatment, benefits, etc. Contractors don't get access to a lot of things, and we aren't even notified of Apple events even if we are allowed to go. There's no way to move up from our current position, people get told of contract extensions literally DAYS before their contract is up, and we are treated like we're disposable and…  expendable. When you know that there's close to no chance of being hired as a formal employee or moving up, it's extremely discouraging, none of us have any work morale, we feel no sense of loyalty, and creates a generally negative work environment. I accepted this job offer thinking that if I worked hard, I could get somewhere with Apple. That's what I was told by others who now work for Apple that started off as contractors, like me. It breaks my heart to know that that's not the case anymore. A lot of us are feeling that there's nothing to work hard towards.",
        "advice": "Please give your contract workers more of a chance to succeed, and treat them more fairly. It would benefit both Apple and the contractors; the contractors would feel more motivated to work harder and be more productive, and Apple as a corporation would obviously benefit from that.",
        "pros": "Overall I love working here- I like the people, it's a nice atmosphere, and we get to put \"Apple\" on our resumes. It's really awesome to be able to work at Apple, and I could only imagine what it's like to be a formal employee.",
        "summary": "Loved it, but expected/wanted more",
        "role": "Maps Analyst",
        "date": "Aug 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "After 6 months of working at home, you get stir crazy. With little to distract from your daily routine.. It's very difficult to stay fully engaged. Also, having very little options for shift bids is very restrictive.",
        "advice": "I would recommend more positive reinforcement. More opportunities to move out of home office if requested. Possibly part time options.",
        "pros": "It's very nice to be able to work from home; not having to leave home for work and better diet. At first it's very relaxing. There's descent opportunity for advancement.",
        "summary": "Great benefits; not so great atmosphere.",
        "role": "Apple At Home Advisor",
        "date": "Aug 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work life balance is impossible.",
        "advice": null,
        "pros": "Great people and constantly learning from encounters with customers in the Family room.",
        "summary": "it's a job for someone",
        "role": "Family Room Specialist",
        "date": "Aug 15, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Stressful Growth is limited. Sometimes management sucks. Mass exodus",
        "advice": "Care about your employees and everything will work out",
        "pros": "Constantly learning Great people coworkers",
        "summary": "Genius",
        "role": "Genius",
        "date": "Aug 22, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's retail so the hours suck, making your life/work balance not optimal especially if you have a family. If you work on the sales floor you are constantly bombarded with customers, which can be quite taxing for some. Not a good option if you're looking for a career.",
        "advice": "There are too many managers and not all are good at their jobs. With so many on staff it's amazing that they can not be found when needed.",
        "pros": "The pay is really good for a retail store job. The benefits are very good with some things being pleasantly unexpected. The employee discount is great and includes friends and family discounts.",
        "summary": "It's still retail",
        "role": "Back of House Specialist",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There is no work/life balance.",
        "advice": "Coordinate policies so everyone is on the same page.",
        "pros": "Great benefits if you are full time.",
        "summary": "specialist",
        "role": "Specialist",
        "date": "Aug 23, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Repetitive work becomes extremely boring and lack of opportunities for growth and learning can become stifling for anyone. It was a clock in clock out atmosphere.",
        "advice": "Create different paths for growth into other positions and make it visible and viable for those who are interested.",
        "pros": "Learned a lot from my peers, coworkers were the best and extremely smart. Customers were difficult and also fun and interesting.",
        "summary": "Learned a lot, got out at a good time.",
        "role": "Creative Trainer",
        "date": "Aug 23, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Management plays favorites and it can be hard to advance within the company. It's very corporate and it acts like it. The company can also afford to pay its employees better and listen to them more. It's worth billions of dollars, and is really money hungry.",
        "advice": "Treat your employees better and don't play favorites.",
        "pros": "Good community of people that you work with. The company has really good benefits and discounts for employees.",
        "summary": "Specialist",
        "role": "Anonymous Employee",
        "date": "Aug 23, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lack of transparency (something Apple prides itself as being), they will let you work yourself to death, employees come to collect a paycheck while you run circles around them.",
        "advice": "Listen to the employees when they go to you and make changes.",
        "pros": "People, discount, culture, fast paced, and the learning opertunity.",
        "summary": "Great for a short time!",
        "role": "Genius Administrator",
        "date": "Aug 24, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There is no set schedule.",
        "advice": null,
        "pros": "World class customer service every day.",
        "summary": "Enriching Lives",
        "role": "Anonymous Employee",
        "date": "Aug 26, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "learn on your own, very hard to talk to people 9 hours a day. They hire management from stores like gap that don't understand technology. They say they give feedback but they real don't very often.",
        "advice": null,
        "pros": "On the job learning and great discounts! Great benefits!",
        "summary": "Expert",
        "role": "Expert",
        "date": "Aug 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Extremely underpaid, poor management, bad hiring practices, complete disregard for employee returns after medical leaves, constant hiring freezes, no room for growth",
        "advice": "Hire people for what they are worth. It's extremely telling when the majority of your company lacks a degree (especially management) but all your hiring reqs require a Masters. Honor your word. When an employee accepts a position, goes on leave, possibly related to the stress of this company, and then returns to find themselves in a completely different role...you're doing your employees a complete disservice. Take a…  look at the staff you have. Be aggressive in auditing their productivity. Sorry, if you had worked at my company for 10 years and never amounted to poop...I'd let you go.Get rid of the lazy leeches. Hire realistically. Uphold the expecatation you set for employees even if they go on leave. Pay better than your peers.",
        "pros": "Great benefits, excellent training, well-known company",
        "summary": "Not what it seems...even if you drank the koolaid",
        "role": "Customer Service Specialist",
        "date": "Aug 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor leadership structure, favoritism and too much focus on metric based performance is chipping away at the culture. This is present in AppleCare as a whole and people are fading away or becoming miserable. There is also a zero retaliation clause but it happens all the time if you speak up.",
        "advice": "Stick to the culture as outlined in the initial onboard packet. Spend more time managing managers and less time on numbers. People are treated like robots and the leadership culture needs a serious overhaul.",
        "pros": "Apple provides a environment with amazing learning potential and a ton of perks. Benefits are fantastic and 401k match is just as good.",
        "summary": "AppleCare Trainer",
        "role": "AppleCare Trainer",
        "date": "Aug 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Stressful at times, sometimes feel undervalued, not efficient as could be. Customer situations can get way out of hand and out of scope.",
        "advice": "Value your people more than you do. Forget about retail and take care of your people.",
        "pros": "Great benefits, great people, great products. Great culture at times and you feel like you're part of something bigger. RIP Steve",
        "summary": "Great at times, stressful and frustrating at others.",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "With so many things right with this company, it's extremely disheartening that there are also so many things wrongs.1) Little opportunity for upward movement - Apple REALLY likes to encourage its workers with promises of career advancement. Unfortunately, and not until recently, any and all movement I've encountered in the last year and a half has been lateral. The reason for this is due to Apple's outsourcin… g of advisors to 3rd party call centers or \"vendors\". For this reason, Apple is no longer opening up additional management positions, which has lowered the ceiling pretty dramatically. This is a huge disappointment for those of us who have at the \"Management\" carrot dangled on a stick in front of us for 2+ years.2) Metrics-based performance measurements - One of the metrics by which advisors are measured is 'Issue Resolution.\" After troubleshooting with Applecare, a customer gets a survey asking if their issue was resolved. If they answer 'yes,' this is good. If they answer 'no,' then the advisor is penalized. The problem I have with this, as a measured metric, stems from the fact that there is no expectation that all issues will be resolved by the end of the first call, before the survey is sent out.So even on issues where the resolution is not 100% in control by the advisor, advisors are still graded on it. This means that if a hardware repair is needed, the call isn't resolved on the phone, and yet the advisor still gets a survey where they are held accountable for the resolution. If the customer has to stop troubleshooting and resume at a later time due to time constraints or a prior obligation, they'll get the survey, and may answer 'no' to the issue resolution question, and the advisor will be punished. Some tasks take a long time to complete over the phone, and customers are asked to call back after a specific step is completed. Once again, issue is not yet resolved, and yet the customer receives the survey asking this question.I am of the opinion that if there is so much as an INKLING of a possibility that the issue not being fully resolved before the first call, due to factors outside of the advisors' control, then the advisor simply should not be graded on it. It makes as much sense as penalizing a baseball team for missing a game due to inclement weather.Too frequently do circumstances outside of the advisors control govern an issue's resolution, and yet advisors are held accountable to these factors. This is wrong. This is unethical. And honestly, I feel that this runs counter to the culture Apple boasts. Any grievances aired to upper management about this are met with suggestions of mental gymnastics to try and essentially convince the customer to answer 'yes' to it, even if the issue is not resolved. No effort has been made to really address this as a valid issue, and I do not anticipate that this will change in the future. This is a fundamental flaw, and it's the only major, significant gripe I have about Apple policies and procedures, as a big company.How this punishment affects the advisor is addressed in my next item:3) Schedule picks - Advisors get a new schedule every 90 days. This is done through a process by which an advisor 'bids' on their preferred schedule, from a list of available schedules. The list of schedule picks available to the advisor is governed by their aforementioned metrics (including the dreaded Issue Resolution metric). Those with the poorest metrics (whether in their control or not) are often left to pick the 'scrap' (minus the 's') schedules from the bottom of the barrel; schedules that have the advisor working the entire weekend, working until nearly midnight every night, working on holidays, etc. Given the fact that the metrics on which we are measured that determine our 'place in line' for a schedule pick are not entirely within our ability to control, this inevitably screws with the home lives of a lot of advisors. I've heard of parents being unable to take or pick their children up from daycare because of this, people unable to attend church functions, celebrate holidays with their families, etc. And on some occasions, even glitches on the back end have stuck advisors with terrible schedules, without so much as a word from upper management on addressing it. And the ways in which the different senior area managers address these issues is extremely inconsistent, and would benefit from some calibration.Apple is a large enough company, at this point, with a large-enough employee base that it could very easily assign workable, manageable schedules to every person in every timezone in such a way that it does not negatively affect their home lives, and still ensure that all customers are taken care of in a timely fashion. It's 100% plausible. And doing so would further promote the progressive culture that Apple loves to boast. But alas, they will do nothing of the sort.4) The customers - As is the case with any customer service job, the most stressful part, day-to-day, is the customers. Angry customers who won't think rationally. Customers who simply want someone to get in trouble. Customers who blame Apple for their inability to function in a world full of modern technology. Customers who refuse to acknowledge user-error. And they take it out on you. Working this job has shown me the worst of the worst in people, and I know it's affected me in a very negative way (so much that I sought therapy from depression/emotional exhaustion because of it). This isn't Apple's fault, but people should still know what they're getting into.5) You will work on major holidays. At least you will be scheduled, and expected to be in your seat ready to work, before they say \"Ok, you can leave,\" after the first few hours on the clock. Every single major holiday, advisors are required to work, and are often dismissed early due to low call volume. Of course I love being dismissed early on holidays. What I don't love is the inability to make plans with family for holidays due to the requirement of working, despite knowing I'll be dismissed early. Just let us off. Apple customers can go a day without someone to yell at when they don't know how to use their device. They'll live.6) The resources given to advisors to utilize while troubleshooting are often insufficient, often nonfunctional and broken, and the fat is constantly being trimmed from them to make the advisors' jobs that much more difficult. Despite this, we are still held to the almighty metrics.For some, these complaints may be relatively minor, but for me, after working here for 4 years, I'm left disenfranchised, and often uninterested, and certainly no longer passionate, about the work I'm putting in. I no longer look forward to working each day. At that same time, I feel trapped, because I know I won't find another job with benefits and compensation nearly as competitive as Apple's. I guess that's corporate work life for you. The level of effort I put into my work has lowered drastically, and with the punishments in place and the lack of incentives for hard work, I don't anticipate a shift toward the positive in the foreseeable future. The benefits and perks are phenomenal, but at a primal level, the things that affect you emotional, day in and day out, are what impact you the most, and Apple has lots of 'areas of opportunity' to improve upon.",
        "advice": "It's time to dump the antiquated metrics-based performance measures, and implement something more in-line with Apple's progressive culture. Stop punishing advisors for factors that are out of their sphere of influence. Stop making promises of upward mobility where there is no upward mobility to be found.",
        "pros": "Best benefits I've ever had of any job. And perks out the wazoo. Work culture is very liberal and laid back. Pay is very competitive for the industry.",
        "summary": "Lots of Pros, and a few big Cons",
        "role": "At-Home Advisor",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Depends on each and every individual",
        "advice": null,
        "pros": "Cool TechnologyLarge Scale ProjectsOpportunity to Learn",
        "summary": "Senior Engineering Program Manager",
        "role": "Anonymous Employee",
        "date": "Aug 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Claim it is not a retail store and hold to a \"higher standard\" but then treat people like disposable retail employees",
        "advice": "Care more. Remember your employees are people. You expect work of the highest caliber and hold your employees to the highest standards remember your employees expect the same of you.",
        "pros": "Great job for during school, post school, Very few other places you can make 40K a year working sales or \"help desk\" with great benefits",
        "summary": "Good pay for entry level",
        "role": "Family Room Specialist",
        "date": "Aug 31, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "We have slow work periods that can carry up to 4 months. In that time we do small service jobs and barely reach 30hrs a week during this period.",
        "advice": "Hire good sales people to arrange big jobs for the the slow period. Look for out of town jobs that can make a profit.",
        "pros": "The owners of the company are family oriented. The hours are flexible, the work is always different. Wonderful health benefits.",
        "summary": "Lead tech",
        "role": "Lead Tec",
        "date": "Aug 31, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The hours truly are unpredictable. One week you're opening, the next you're closing. Typically you have set days off (if full time) but that doesn't always mean you will have the days you're supposed to. And it's a good retail job with decent pay (for retail). But moving up is almost impossible and after a while the magic of it all wears off and you get hungry to be more and make more money. At which point management…  will move up their favorites and keep giving everyone else more things to work on. Everyone I saw promoted in my position was a clear favorite of management, and their promotion had almost nothing to do with them being better than anyone.An ok experience but clearly things to work on seen by the fact that I left. I don't regret leaving at all- I make more money know, have way more opportunities for growth than Apple ever gave, and feel like I work in a professional position. There's just too much politics and coworkers and managers can be super narrow minded and caddy at times.",
        "advice": "Management needs to stop playing favorites. Sure your favorites stay around forever but so many people leave because they feel burnt out and like they are at a dead end. Make potential for growth and promotion more clear and obtainable, but also understand that just because somebody does things differently doesn't mean it's wrong. Get less political and care more about keep your team around as a whole.",
        "pros": "To add to what everyone has said here, benefits/discounts/perks are fantastic. There's always something exciting and new happening. There's rarely a day where everything is the same. You pick up a lot of knowledge about technology and customer support that is really valuable. Management puts a lot of focus on helping you develop as a person. While I was there I was going through really though times for about my last … 4 months with the company and they were more patient and understanding than I could have ever asked for. So work life balance is pretty well respected.",
        "summary": "Both good and bad",
        "role": "Specialist",
        "date": "Aug 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The position itself, especially in this location is ideal for someone who loves tourists. Unlike other locations, it's a very transactional store. Incredibly busy and understaffed. Changes all the time, never consistent with plans. You don't get to connect with people as much. Growth in this store is slow.",
        "advice": "The store environment really needs to improve. There's too much micromanaging going on. It's not a happy work environment. Management picks favorites and can be fake.",
        "pros": "The benefits are incredible! Whether you are part time or full time you receive the same benefits. Met some of my best friends because of the company!",
        "summary": "Great company, Okay position",
        "role": "Anonymous Employee",
        "date": "Sep 1, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "No Compensation structure, Work/life balance is not so great ( but thats retail)",
        "advice": "Management is good, very encouraging.",
        "pros": "Great Culture, Great environment and team development.",
        "summary": "Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The management is awful, they don't care about their employees at all. Some managers are really petty, especially when it comes to scheduling. Part-time retail employees are forced to commit to 20 hours a week at minimum, which is hard with a full-time job.",
        "advice": null,
        "pros": "Generally a fun place to work, the benefits are great for part-timers, and co-workers can be pretty great too and easy to get along with.",
        "summary": "Great benefits, awful management",
        "role": "Anonymous Employee",
        "date": "Sep 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Working with novice hardware designers, ridiculous deadlines, some of the leadership doesn't appreciate the skill required to bring up suppliers. Very little family and social life,too much travel, meetings, politics and drama can be emotionally draining. Management has tried to reduce travel and improve work-life balance, it's kind of fake since good employees are still working from home 20+ hours a week is normal (… on top of 60+ hours at work).",
        "advice": "Please have PD do the ground work before rolling out half-baked ideas, it would save a lot of time and money, also, get some people in there who actually have worked in engineering to vet out the ideas prior to kick-off. I can't say this enough, the folks with boots on the ground are unsung heroes, thrashing away at suppliers and bringing them up should be given praise and reward. Please figure out who the key employ… ees are and work damn hard to keep them, they love Apple, without them the core culture will perish.",
        "pros": "Okay pay and benefits, company is socially conscious, exciting and challenging work. It's an okay place to work, relatively speaking for the Bay Area.",
        "summary": "Hard core work environment",
        "role": "Senior Hardware Engineer",
        "date": "Sep 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Fast pace, rude customers, missed breaks, under a microscope, quotas, poorly managed. I can say more but I won't. Blah blah",
        "advice": null,
        "pros": "401k match, health, vision and dental plans, stock purchase plan, stock grants, health ReimbursmentTuition Reimbursment and more blah blah blah",
        "summary": "Benefits are great",
        "role": "Apple Expert",
        "date": "Sep 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "you're working at a big tech company, and there are two cultures, contractors and full-timers. prepare for that.",
        "advice": null,
        "pros": "all the usual benefits everyone raves about.",
        "summary": "good work, but also a big company",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Favoritism is still a think even if you aren't in the store. If you aren't under a manager that cares, you will be stuck in the same role until they switch you teams. Also for the stress that an At-Home advisor goes through, we could be paid a lot more. Work/Life balance is something that's hard to maintain",
        "advice": null,
        "pros": "If you really want to move up, you can under the right manager. The culture for the most part is a pretty good one and as an At-Home Advisor, you don't have to worry about crowds or multiple customers at one time.",
        "summary": "Pretty Good",
        "role": "Anonymous Employee",
        "date": "Sep 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "You have to hit the ground running, progress or be left behind; meaning don't just do your job, but strive to put yourself on the radar. Your day requires a story and the successful employees are the most talked about storytellers amongst their peers. This is the key to advancement. You have to win over your team or no matter how good you think you are statistically or as a person, it will be hard to be promoted. Ach… ieving work life balance during holiday seasons can be challenging. Increased stress loads are present when stores are understaffed (which is often).",
        "advice": "Demand of yourself what you demand of your employees. Excellence, sacrifice and punctuality in some cases shouldn't be one sided commitments. How are you an excellent employer? Do you start your meetings and end them on time? Are you considerate of your employees time OUTSIDE of your stores? Finally, the \"take one more\" is a debt that should be repayed. Whether it's a transaction or appointment. Gratitude for the pay… check and position comes automatically when an employee shows up to work, so ask yourself, what are YOU doing to earn the buy-in and employees loyalty.",
        "pros": "You have a job. You work 40-80 hours as anemployee. Health Benefits, 401K, Stock Options, Student Loan Payment Program, Discounts, Occasional opportunities for advancement",
        "summary": "Progress or be left behind",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "condescending upper management and always worrying about the bottom line",
        "advice": "take into consideration the needs of the employees not just productivity",
        "pros": "Laid back environment and a relatively nice iterations with other departments",
        "summary": "Analyst",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "It was ridiculously easy work which is why I can see Apple hiring sheep. I thought I had a lot more to offer in terms of the work my leads gave us but as a contractor I didn't have a lot of room to be hired FT. Hiring to be FT required several years of being there as a contractor (at least in my division) and it was not worth my time to take a chance on that with such low wages, no attending events/beer bashes, and w… ork repetition.",
        "advice": "Nothing, honestly they have a perfect management system in place that effectively controls their workers and limits them from mutiny (you can get fired on the spot/day of for ostensibly not working hard enough or not being able to work well with the team).",
        "pros": "Interesting characters who were contractors around my age (post college grad). Met some good friends and also met some lazy/clueless idiots.",
        "summary": "Interesting people - no room for movement",
        "role": "3D VIsion",
        "date": "Sep 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Managers are not lenient with work/life balance. Some customers are extremely negative and rude. New call every 10 seconds, small amount of time for break.",
        "advice": "Care more about employees and instill positive reinforcement instead of negative threats and consequences. Understand that you are working with people, not Apple Products/Robots",
        "pros": "You gain knowledge and training on Apple Products and team building opportunities are endless. Constant Customer Service and access to resources",
        "summary": "Great Experience, Would Not Do it Again",
        "role": "Applecare At Home Advisor",
        "date": "Sep 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Difficult to move up and grow. Pay isn't what it should be for the amount of money we were bringing in.",
        "advice": null,
        "pros": "Great environment, great people, great benefits, fun to continually learn and be around the best products.",
        "summary": "Solid place to work, great to learn.",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Has become a very corporate environment of late. Everything is recorded, analyzed, and then re-analyzed. A bit robotic",
        "advice": "Things are going great for the entire company. Ease up on squeezing every little drop out of employees.",
        "pros": "Great deals and most of the people you work with have the same passion for technology.",
        "summary": "Good, Not Great",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Health care and compensation are only average at Apple. It's a retail environment so the \"needs of the business\" come before any and all other personal scheduling needs.",
        "advice": null,
        "pros": "There are always new systems or programs to master as the technology landscape even at a retail store doesn't stay the same for more than a few months. Discounts abound for a wide variety of 3rd party products and of course Apple products as well.",
        "summary": "5+ years",
        "role": "Genius Administrator",
        "date": "Sep 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "AppleCare is NOT an Apple position. On paper, yes. But Apple treats their support employees like slaves compared to retail/corporate.",
        "advice": "Stop choking the life out of your support groups when you are the most profitable company in history.",
        "pros": "Salary is decent, benefits are good.",
        "summary": "AppleCare",
        "role": "Tech Manager",
        "date": "Sep 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "management has been poor. I have seen store leaders berate employees in front of other staff and there is a huge disconnect from what is done at a Starbucks and what is done at Apple. Technicians are not paid enough, in fact most of the store outside management is not paid enough for the responsibilities that are expected.The flat nature of the company makes it difficult to advance, and managers will sometime… s make up things for you to work on in order to hold people back.It can be fixed, but they have to promote Apple people from within, hiring outside managers puts a huge gap in knowledge and teamwork (top down management, vs a cohesive team)I left because I don't have the patience to wait for things to get better.",
        "advice": null,
        "pros": "Most of the people are great, it is a great place to work if you want to relocate to another city, as there are apple stores almost everywhere",
        "summary": "Management should not come from retail",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There is no room for upward advancement. It's difficult to move from employee to management status, and nearly impossible to move into some kind of job in Corporate. Pay does not increase at a rate that is commensurate with experience.",
        "advice": "Let employees know they're actually valued, rather than seen as replaceable and fungible. Increase pay commensurate with experience, and provide more room for advancement.",
        "pros": "Apple Retail offers decent pay, comparatively, in its industry. There are also a lot of perks and benefits that Apple employees get, whether they're in Retail or Corporate. The company culture is pretty accepting and affirmative of diversity among its employees.",
        "summary": "No room for advancement in Retail",
        "role": "Specialist",
        "date": "Sep 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Change schedules too often (every 3 months)",
        "advice": null,
        "pros": "Nice payGreat benefits I suppose",
        "summary": "Apple care",
        "role": "Anonymous Employee",
        "date": "Sep 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Discounts are very small, there are a ton of business politics in play at the Apple stores. Most managers have their own agendas and the promotion process couldn't be any further from a meritocracy. Most customers are entitled whiny babies, but some are cool. Very little career opportunities unless you leave the company to go work somewhere else and then come back to a better role. The pay could be way better based o… n how much cash they have on hand, the pay actually sucks to be honest.",
        "advice": "Quit playing politics for your own personal gain, stores run a lot smoother if you promote based off of merit.",
        "pros": "Fast paced, good company that teaches a lot of life skills that are difficult to gain elsewhere, Apple employees seem to be looked at in higher regards when applying for other companies. I recommend working here only due to the fact that I developed skills at Apple that are useful everywhere that I couldn't have learned anywhere else.",
        "summary": "Apple Genius",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There is a culture of \"putting in your dues\" that is somewhat brushed over. Many people have been passed over for promotion because they have opted to bring in external people rather than promote within.",
        "advice": null,
        "pros": "Co workers and benefits are great at this company.There are many benefits that you have to figure out on your own, but if you do, there are some really great things you can find.",
        "summary": "review",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No work life balance. You work at the mall, don't forget that. Very very political. Prepare to kiss lots of butt to get ahead and lose your soul in the process.",
        "advice": "Live by the credo. Actually read the credo and understand that your people come first the. Everything else will fall into place.",
        "pros": "You meet incredibly talented people, lifelong friends and skills that are invaluable. Education reimbursement and benefits are great.",
        "summary": "You better be ready for politics",
        "role": "Specialist",
        "date": "Sep 19, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's retail so scheduling is crazy; if you are part-time don't expect to have any consistency or predictable schedulingHard to take off time if too many people have already requested similar daysVague at times and don't have a lot of training on the processes before new products are releasedManagers don't always show they care about you and favoritism is a huge game. Be a player and you can succeed.Th… ey don't really hire outside of referrals unless absolutely necessaryIf you speak multiple languages, don't expect a pay raise.Moving up doesn't really equate to a raise.",
        "advice": "Be present. Don't give your staff hope for things you know won't happen. Be real",
        "pros": "Family feel/dynamicGreat people cultureWorking for one of the best tech companies in the worldLooks great on any resume when it comes to applying for other jobs",
        "summary": "Specialist",
        "role": "Specialist",
        "date": "Sep 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Politics in the workplaceUnclear career path work/life balance unsupported by higher leadershipPay rate growth minimalLeadership develops Kent not consistent",
        "advice": null,
        "pros": "Pay, higher than other retail on averageLarge teamsHigh levels of responsibilityChallenging work environmentHighest standard for customer experience",
        "summary": "Apple Leadership Team",
        "role": "Manager",
        "date": "Sep 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "HR and managers are not focused on having good projects for interns.",
        "advice": "If you hire interns, make sure that you define some good projects for them.",
        "pros": "Great learning opportunity and supporting colleagues",
        "summary": "MBA Intern",
        "role": "Anonymous Employee",
        "date": "Sep 20, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Awful retail schedule, stores are too busy, dealing with all walks of life, low retention rate, retail store.",
        "advice": "Instead of \"bubbling things up to corporate\", focus on the changes you can make in the store.",
        "pros": "Great people, great benefits, discounts, pay is alright for retail I guess, good insurance, 401k and stock options.",
        "summary": "Retail",
        "role": "Anonymous Employee",
        "date": "Sep 22, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-Often feels like there's little opportunity to move up rather than lateral-Many employees express feeling like they are strung along for career opportunities where they here something akin to \"just keep working at it and you can achieve X position'.-Feedback from leadership can often be very generic (positive or negative feedback) so it doesn't feel like they actually know what you have contributed during yo… ur review-Easy to burn out in most roles within the stores",
        "advice": "Do your best to follow through on commitments made to various teams and take to heart some of the outlier NPP comments. Sometimes they are things more people want to say but are afraid to. Leadership really makes or breaks the Apple Retail experience and that's a very powerful responsibility.",
        "pros": "-Fast-paced so it's never boring-Opportunity to learn a lot-Opportunities to intern (sort of) for Corporate positions that can expose you to the right people/teams-Discount incentives-You will work with some of the greatest people from all walks of life-Helps you with time-management and dealing with regular changes in your job/workplace",
        "summary": "Some notes on Apple Retail from a Creative",
        "role": "Creative",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too much work, lack of management",
        "advice": null,
        "pros": "A different experience for the career. Learn something new",
        "summary": "Awesome Apple",
        "role": "Python Developer",
        "date": "Sep 23, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "call center servicecareer opportunities limited",
        "advice": null,
        "pros": "Great pay rateGreat insuranceGood teams",
        "summary": "Great job",
        "role": "AppleCare Senior Advisor",
        "date": "Sep 25, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not very flexible in shuffling candidates from one project to another",
        "advice": null,
        "pros": "Once of the best place to start your career with",
        "summary": "Nice place to start with",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Pay could be better, considering the cost of living in the area.They like to stretch people thin, and don't spend money where they should.",
        "advice": "Stop cutting budgets like the company is running out of money. Product quality is going down because of it.Also don't treat long term operational requirements like second class citizens. Products have to be supported after they're sold!",
        "pros": "Stable job, smart coworkers, and interesting challenges",
        "summary": "Not as great as it once was",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "not good environment for contractors",
        "advice": null,
        "pros": "balanced work and business visibility",
        "summary": "not so good for contractors",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management never seemed to care and didn't know much about the product. Only way to move up was to make friends with the management. If you disagreed with them they wrote you off.",
        "advice": "Find people who are actually willing to invest in your teams an not just themselves. People join Apple because they love the company and your manager destroy that love.",
        "pros": "Great people to work along side with. Great Benefits. Best retail environment. Ability to learn lasting social skills.",
        "summary": "Great retail job but not a career for most",
        "role": "Specialist",
        "date": "Sep 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Need better pay for what we do.Stressful work environment",
        "advice": "N/A",
        "pros": "Great team.Discounts on products.Opportunity for growth",
        "summary": "Family Room Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor company benefits (vacations, retirement, subsidies), very little profit sharing with employees, boring office parks, expensive cafeteria.Apple is culturally rooted in the past, and as such has not adopted a more aspirational mission like Airbnb, Uber, Google, Facebook. At the bottom of the line, it's all about doing business and making profit through great products — improving humankind and accepting soc… ial responsibility is no priorities to the company (and rather a projection of the marketing team).Apple also doesn't care too much about the needs of its workforce. Company gym? Pay for it. Healthy snacks/fruits during the day? Rare. Child care? You're on your own. Need to send mail? You need to consider that their campuses are in the middle of suburbia with few options to satisfy your daily-life needs. And you work long hours.",
        "advice": "It would serve the company enormously to have fresh blood, reinvigorate its ranks with a worldview that is not so cordoned off. The outside world has solved many of the problems that Apple is internally suffering from, but too bad the leadership doesn't know better.",
        "pros": "Bright people, some very idealistic and driven, great diversity. Generally high flexibility in self organizing and high accountability for employees (people get demoted or fired if they don't deliver what is expected of them).",
        "summary": "Idealism buried deep under a decades old corporate culture",
        "role": "Anonymous Employee",
        "date": "Sep 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "really hard to move up",
        "advice": null,
        "pros": "great benefit, and work life balance",
        "summary": "Specialist",
        "role": "Anonymous Employee",
        "date": "Sep 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not very organized, code quality is ok but just ok",
        "advice": null,
        "pros": "General package, regular benefit",
        "summary": "Software engineer",
        "role": "Software Development Engineer IV",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "High expectations and heavy workload that doesn't match your pay",
        "advice": null,
        "pros": "Amazing benefits, convenience of working from home",
        "summary": "Not what I expected",
        "role": "Anonymous Employee",
        "date": "Oct 2, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "500$ off discount is only applicable once every 3 years, other discounts are very small. Job is very mentally stressful and aches your body sitting for so many hours out the week.",
        "advice": null,
        "pros": "Great benefits (Vacation, Extra Time off, Medical), DIscounts, Good pay. Stocks.",
        "summary": "IOS/Mac at home advisor",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not good for work life balance",
        "advice": null,
        "pros": "Great perks and discounts for Apple everything",
        "summary": "At Home Advisor",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Company taks care of customers at the expense of the employees . It is not a place to grow a caree.",
        "advice": "With high expectations and low pay, help your employees grow their career.",
        "pros": "Exciting atmosphere. Company really wants to take care of its customers.",
        "summary": "Retail is fun and painful",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Low pay, mediocre discounts, incompetent middle management (in Retail) and a lack of career growth options make Apple just a career experience, and not a good place to foster a career.",
        "advice": "Spend more time on the hiring process and pay for quality employees, or be more transparent about the this-is-dirty-retail nature of the job.",
        "pros": "Excellent benefits, wonderful coworkers, and the chance to genuinely make the world a better place all combine to make Apple a worthwhile career experience.",
        "summary": "Apple focuses on changing the world—often at the expense of its front-line employees.",
        "role": "Genius",
        "date": "Oct 3, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Low wages. No commission for workers that usually total close to $1million in sales per year. (that's 1 million per worker!!!)",
        "advice": null,
        "pros": "Diversity among workers, exposure to different people from all walks of life. Great networking opportunities.",
        "summary": "Family Room Specialist",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Needing open availability in our market was ridiculous. They wanted use to keep our entire schedule open for them, yet they only scheduled us 20 hours max. You can't have an additional part time job, or even go to school. You have to work AROUND them, they WILL NOT work around you. At All. I was forced to quit my part time job teaching children in order to sell Apple products.People who stab each other in the…  back often rise up the ranks. Which is sad.",
        "advice": "Losen up a bit. You treat us as if we should be happy to work ten dollars an hour at a prestigious company and are offended when we say we need to supplement our income with another job. Don't be such a control freak.",
        "pros": "You get to play with the technology.If you can survive retail at Apple, you can get a job in ANY other retail environment easily.Profit sharing is nice.",
        "summary": "Corporate is hard work. Retail is frustrating work.",
        "role": "Mac Specialist (Apple Store)",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Special Projects are well funded in Hardware Engineering but politics are the worst Ive ever experienced. Never again.",
        "advice": "What management? Thank God Bob is back but what a horror to those 400+ let go.",
        "pros": "Great company, amazing benefits, good culture...everywhere except SPG",
        "summary": "Never go to Special Projects",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "StressfulLack of supportLeadershipTraining",
        "advice": "I think you should take your employees into a little more consideration when implementing new processes and launches.",
        "pros": "PayBenefitsWorking from homeProvided all equipment",
        "summary": "Great Benefits, great company, not so good structure",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Micro managing from management. Hard to get promoted. Lots of talk but no follow through.",
        "advice": null,
        "pros": "Decent pay & good benefits. Awesome co-workers",
        "summary": "Work life balance",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They are not interested in contractors.",
        "advice": null,
        "pros": "It opened the door for me to work for other tech companies.",
        "summary": "linguistic tester",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Extremely busy and over worked with little recognition. Poor Leadership (no accountability for poor performers, us against them mentality). Retail decisions are made at the corporate level by individuals who either do not have retail experience or have dated retail experience. This leads to a disconnect where these decisions negatively affect retail's day to day. There is not an easy communication channel to provide … feedback regarding these decisions which results in a lot of \"work around\" solutions.",
        "advice": "Feedback and performance management cannot be an after thought, it needs to be a daily part of the company culture. Correctly performance managing will allow Leadership to terminate those employees who are toxic to the work environment. The hard workers can become disenchanted due to picking up the slack and are not being recognized for it. Most importantly, you need employees in the retail stores WEEKLY who look at … how to improve our processes and systems and get that feedback to the right teams quickly, in order to create a better experience for our customers and our teams.",
        "pros": "Amazing benefits including fitness reimbursement, tuition reimbursement, transportation subsidy (public transportation allowance). Flexible schedule if you are part-time. They hire the best people; you will meet many creative professionals with amazing skills you can learn from.",
        "summary": "Apple Retail",
        "role": "Store Administrative Assistant",
        "date": "Oct 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not quant driven, data messy to work with, a little political, poor work life balance",
        "advice": null,
        "pros": "Stable company, good benefits, lots of internal opportunities, clear org structure",
        "summary": "Lead Analyst",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "No holidays, constantly reviewing metrics,horrible customers, no set schedule it changes every 3 months, low call time expectations, constant threat \"if numbers are not met\"",
        "advice": "Give back holidays and stop with the performance management",
        "pros": "Good pay, good benefits (not outstanding), ability to work from home, Reimbursement for internet, decent accrual of vacation and sick time, benefits start when hired",
        "summary": "Typical call center type environment",
        "role": "AppleCare Senior Advisor",
        "date": "Oct 11, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not the best place to develop professionally, low pay, repetitive/menial duties, little room to advance. A wonderful job for someone working while going to school. Not a career environment",
        "advice": null,
        "pros": "Tuition aid, great healthcare, flexible schedule, discounts on products, employee stock purchase program, diverse workplace, progressive values",
        "summary": "Good product...great job for students",
        "role": "Creative",
        "date": "Oct 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "i like the company but they work you so hard and expect so much for the title we have",
        "advice": "listen to the guys at the bottom",
        "pros": "good pay, nice atmosphere, and okay work buddies",
        "summary": "was okay",
        "role": "AppleCare Senior Advisor",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "At its best, which is pretty decent comparatively, it is still just a retail job at the end of the day. Here are some opportunities for advancement, but if they are not for you than you are kind of out of luck.",
        "advice": "I do not have any advice for management.",
        "pros": "You work with some of the best people you will ever work with. Everyone in the place really cares for each orher",
        "summary": "Good place",
        "role": "Apple Retail",
        "date": "Oct 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "No opportunity for growth - In my 3 years there, they never considered existing employees for managing roles. Always hired from Starbucks or Target.Don't accept \"Career Experiences\". They Apple's politically correct way of giving you more work without paying for it, with promises of getting to management they never keep.Very strict schedule, and hard to get time off. Don't expect to see your family for holida… ys if you work in a customer facing role.",
        "advice": "You have a TON of amazing talent working at Apple. You should look at it and actually use it.",
        "pros": "Benefits are amazing.Working with like-minded people.Get to stay current with technology.",
        "summary": "Don't Expect To Grow Here",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "1. Apple expects you to grow vertically. This means work can be repetitive and people may not get to explore many new things2. Not so great people management3. Long work hours (with repetitive work)",
        "advice": "Help people grow plan and grow their careers",
        "pros": "1. Apple surely has the brand value2. Provides a Big Company experience3. Get to work with talented and accomplished colleagues",
        "summary": "Product Planner",
        "role": "WW Supply Demand Planner",
        "date": "Oct 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "There was always more work to be done than time in the day. If you want mentoring, you had to actively, doggedly pursue it ... unless you are a \"Golden Child\" and favored by management.",
        "advice": "Apple culture is unique, but holding employees accountable for events and products outside of their sphere of influence while not listening to them is not a culture many people will stay in for long.",
        "pros": "Work was always challenging and fulfilling. Co-workers, through their actions, are focused on making this company one of the best in the world.",
        "summary": "Development Supervisor",
        "role": "Software Development Supervisor",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No benefits, but expected as thats the way it goes for contractors.",
        "advice": "None",
        "pros": "Fun place to work at.",
        "summary": "Data Analyst",
        "role": "Anonymous Employee",
        "date": "Oct 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It is still a retail job",
        "advice": null,
        "pros": "One of the best retailers to work for",
        "summary": "Great for Specialists, terrible for everyone else",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Drama, politics, being over worked, no work life balance.",
        "advice": null,
        "pros": "The benefits are awesome, The people you work with are amazing.",
        "summary": "Specialist",
        "role": "Specialist",
        "date": "Oct 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Inconsistent schedule. Advancement. It is still a retail environment, therefore you work retail hours.",
        "advice": null,
        "pros": "Amazing benefits. Meet some great people. Fun environment to work in. Technology is really fun and exciting.",
        "summary": "Fun Place",
        "role": "Sales",
        "date": "Oct 17, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Sometimes not open to outside of Apple ideas",
        "advice": null,
        "pros": "Great Compensation and a lot of talented co workers",
        "summary": "Pluses and Minuses",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Unrealistic metrics. Unrealistic goals.",
        "advice": "They need to acknowledge that not all customer surveys apply to the rep. If its an issue with a carrier AT&T/ VZW and the survey was bad and criticised AT&T then dont blame the Apple rep for a bad survey.",
        "pros": "Good benefits and discounts. Need to recognize talent especially among minorities.",
        "summary": "Customer service metrics need to be realistic.",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The day to day grind was ROUGH. Customers yelling at you everyday for 8 hours a day was insane. Schedule adherence and screen monitoring is so intense and makes you feel like you're under a microscope.",
        "advice": null,
        "pros": "This job included great benefits and was a real resume booster. You get tons of discounts on apple products and products they sell and partner with.",
        "summary": "Eh.",
        "role": "Apple At Home Advisor",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "not much room for growth unless you fit the mould.always getting screamed at by customers.store leaders and market leaders are not present and completely disconnected to the realities of the job",
        "advice": "Reconnect with the store teams, step away from constant conference calls and join the teams in the stores.",
        "pros": "great people to work with.always great products.always busy.potential to move to other parts of the country",
        "summary": "Great People, Great Products",
        "role": "Manager",
        "date": "Oct 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "OverworkedHecticInadequate pay for the amount of work",
        "advice": null,
        "pros": "Great benefitsUnique eventsBounses",
        "summary": "Team Manager",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2016",
        "is_current": false
    }
]