[
    {
        "rating": 2,
        "cons": "If your not a couch potato that has no life other than video games then this is the perfect job for you. If your someone that wants a life outside of work than this is not for you. Vacation please, you get time off but don't expect to be able to use the time, cause they will tell you no for some reason.",
        "advice": "Don't make us feel like we are going to lose our job because one out of one hundred people give you a dissatisfied survey. Things happen and you can't please everyone.",
        "pros": "Job security, benefits and convenient. They hire anyone which could be a con but it is nice to be a graduate with an Art Degree and have a job.",
        "summary": "It's all or Nothing",
        "role": "Senior Technical Advisor",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Terrible corporate politics, no forward movement in retail, management is horrible",
        "advice": "Grow up, stop acting biased and stop pretending like working there is the big time. It's still a retail mall job, regardless of what you want everyone to believe.",
        "pros": "Interesting work, always around new technology, occasionally great customer interactions",
        "summary": "Great products, terrible company.",
        "role": "Expert",
        "date": "Oct 1, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "location, hours, too many supervisors",
        "advice": "ditch the overwhelming sense of micro-management.",
        "pros": "Nice environment, paid training for supported products",
        "summary": "This was long before 2008... things may have changed",
        "role": "Frontline Helpdesk",
        "date": "Oct 9, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Arrogant management with so many smoke and mirrors deployed you would think they are running for political office-The amount of whispering and gossip that occurs I have not seen since high school-Lack of advancement opportunities, the more skilled positions are outside hires-All the feedback received is in a manner similar to an assembly line and very impersonal",
        "advice": "Be a little more transparent. Most of the feedback we get is what we can do to improve our customer's experience, but I'd like to know how dissatisfaction is being analyzed and what is being discussed so customers have a better experience.",
        "pros": "-No work outside of business hours-Solid time off policies-If you don't like challenging you may enjoy this",
        "summary": "Too much smoke and mirrors",
        "role": "Developer Support",
        "date": "Oct 16, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "WORK LIFE BALANCE! Expect long shifts, minimal breaks, with pressure from managers to skip or come back early because it is \"busy\" Not a workable solution for someone with a family! The Vision of the past has been replaced with an acquisition model, poaching big box retail managers from other companies and bringing them in, which has changed the retail store culture from what it once was, to a much more sterile and i… n your face style. This is a company that outgrew its roots and has transitioned from a one stop shop where you met friendly passionate people who cared about the products to a circus sideshow or efficiency at all costs - even customer service unfortunately.",
        "advice": "Stop with the Big-Box retail manager hires and focus on retaining the passionate and incredibly gifted people that are there because they LOVE APPLE as a product and as a company. Those are people worth investing in and keeping... Why on earth would you hire a awl-mart, target, or BB manager who hasn't even owned a Mac before to manager a retail store where you are trying to preserve and cultivate a culture of passio… n and knowledge? It is an insult to those who are there for the right reasons.",
        "pros": "Fantastic Products, great talent, fast paced... good for young college students.",
        "summary": "A Fantastic Opportunity to Waste a few years of your life!",
        "role": "Assistant Retail Manager",
        "date": "Dec 7, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Middle management is generally clueless.",
        "advice": "Can't you hear the din of chips being cashed? Senior management doesn't need my advice. They know what the company is ballmerizing.",
        "pros": "You get to work with a decent number of dedicated people who believe in their work, especially in junior positions.",
        "summary": "Never again",
        "role": "Creative (Apple Store)",
        "date": "Dec 29, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Average Salary- poor bonus with no stocks- Obj C/Cocoa is only matters, don't even bother if you are HTML5/js person- Not much innovation in a lot of departments, especially IS&T- Very little diversity in a lot of departments",
        "advice": "Pay more to engineers, better bonuses, and free food",
        "pros": "It seems to be good for resume. People believe that Apple is hot.",
        "summary": "Too many limitations and hype for average salary",
        "role": "Software Engineer IV",
        "date": "Jan 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Ever increasing responsibilities without proper compensationHard to take time awayCan get \"stuck\" in certain positions with out any growth opportunities.",
        "advice": "When employees have real concerns, take them into account and do not just shove them into a corner. There is a reason why so many are not happy working here.",
        "pros": "Great people to work withDiscount on productsWorking for the best electronics company in the world.",
        "summary": "Slow downhill ride",
        "role": "Mac Genius",
        "date": "Jan 9, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "People stealing credits getting ahead in reviewsManagement complicit in outsourcing projects to body shopping companiesArrogance and sycophants are rewarded",
        "advice": null,
        "pros": "Good reputation and brand nameDecent compensation",
        "summary": "Things have changed for bad, I think",
        "role": "Senior Software Engineer",
        "date": "Jan 18, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Extremely flat at the top, execs make almost all of the decisions- Promotions are very few- Poor feedback from the management team- 60-80 work week is the norm, not the exception- 2-3x per quarter in China, expected to go to every Engineering built, even if to just sit in the factory \"in-case\" something goes wrong- Organized chaos, everyone does their own thing to get the job done. No structure<… br>- Salary/benefits are below market average, and yearly compensation is getting worse every year I've been here",
        "advice": "Have been opportunities to promote. Increase benefits and compensation.",
        "pros": "- Great products and new technology to work with- Learn to leverage Apple's huge supply chain influence to get what you want quickly- Business class travel and 5-star hotels",
        "summary": "Great place to learn, then move on",
        "role": "Operations Product Manager",
        "date": "Jan 27, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Low pay compared to the amount of money you make for the company, not very generous towards employees, very strict, very corporate, attendance policy",
        "advice": "Take better care of your employees. Give better perks.",
        "pros": "Amazing co-workers, innovative workplace, clean workplace, amazing benefits, health insurance, stocks, 401K",
        "summary": "Great company, bad retail gig",
        "role": "Expert",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "you have to live in a high pressure working enviornment, long time work even in the weekend. no appreciation to your contribution",
        "advice": "they have high pressure too and handover pressure to lower employees.",
        "pros": "can use latest apple products for free and can learn new tech. travel condfition is good, business calss and 5 star hotels.",
        "summary": "review",
        "role": "Engineer",
        "date": "Feb 14, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Training Is very strict, no room for any error,Very little support throughout trainingHR attitudes can be horribleThey don't seem to value their employees my experience was just a number",
        "advice": "Invest more than equipment and gadgets into your employeesHire HR reps who are actually human towards other human beingsRethink how you train and invest in employees as people and not numbers",
        "pros": "Good PayCan Work From HomeNice Benefits and PerksManagers were pretty cool",
        "summary": "At Home Advisor",
        "role": "At Home Advisor",
        "date": "Feb 19, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "terrible work life balance; no promotion, just lateral",
        "advice": "a few kind words to the peons wouldnt hurt now and then",
        "pros": "great people smart and capable",
        "summary": "OK place",
        "role": "Software Engineer",
        "date": "Feb 25, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "pressure, culture of blame, infighting",
        "advice": "get back to the common mission, be willing to hear bad news",
        "pros": "challenge, stimulating co-workers, public recognition",
        "summary": "a winding road",
        "role": "Senior Hardware Engineer",
        "date": "Mar 2, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Salary is not greatSupervisors are not greatThey mircro-manage and harass you about small things you could have a 100% CSAT for surveys by customers about your performance and your manager will find something bad to say about your performance that monthThe job is very annoying calls back to back you have to baby customersThere is no room for growth with the At Home positions I know people who have bee… n agents for years and have masters degrees but aren't supervisors but some joe or tom off the streets with a degree can apply and become a supervisor because they seem to only hire externally for management positionsYou change schedules every three months which makes it hard to kind of have any work/life balance or take any classes",
        "advice": "If you are not going to provide better schedules to employees at least provide a better salary because people are giving up a lot just to work for Apple and are not getting a lot in return.",
        "pros": "Work from homeGood Benefits they really take care of their employees",
        "summary": "Good company, good benefits job sucks",
        "role": "At Home Advisor",
        "date": "Mar 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "At first, management was welcoming, made everyone feel at home and would support your decision with a customer regardless of who they were. Then, a new shift in management came through and were micro-managing to a ridiculous degree. Also, they were unsupportive of the workers unless you were considered a \"favorite\" by which I mean, you had to think like them.Also, be prepared for some grueling conversations w… ith customers, most likely getting sworn at, and learning to get a backbone if you don't already have one.Expect no vacation time, unless you ask for it in the summer. You run by their schedule and only their schedule. I was not able to visit family for Thanksgiving, Christmas, or Spring Break.",
        "advice": "Get to know the people you work with. Respect them and they will respect you. Micromanaging is not the only way to get people to do what you want. There are many other ways to lead a group of people. Also, back up your team. If you don't, how can you be a leader?",
        "pros": "Some of the best people I have worked with. Talented, creative, and just a joy to be around (not including management). Had they not been there, I would not have stayed for as long as I did.",
        "summary": "Apple Specialist",
        "role": "Mac Specialist (Apple Store)",
        "date": "Apr 3, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No social life, No peace of mind",
        "advice": "There are lots of disparities between hardware and software teams. Software teams are looked after better and are offered lots of perks. Hardware teams dont enjoy the work, everyone's in for the money.",
        "pros": "Your friends will have high regard for you",
        "summary": "All work and no play",
        "role": "Anonymous Employee",
        "date": "Apr 13, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Horrible BossLimited CapabilitiesRestricting Bureaucracy",
        "advice": null,
        "pros": "Apple Hardware DiscountGood BenefitsReduced Priced Software",
        "summary": "Too much work for not enough pay",
        "role": "Anonymous Employee",
        "date": "Apr 15, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "If you're there now, you're being overworked and not getting the stock appreciation the old-timers got",
        "advice": "Stop working people to exhaustion",
        "pros": "If you were there 5 years ago, you're now rich",
        "summary": "Decent pay, no work-life balance",
        "role": "Anonymous Employee",
        "date": "Apr 20, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "For those coming in to the company with years of work experience, your salary and position level will be cut with the pitch to dream your career path because it can be achieved, even if they position doesn't exist. Extremely political, more like a sorority. Many managers do not have a clue how to manage and develop teams. Senior managers are constantly being degraded by customers and customer reviews determine all.",
        "advice": "The company needs Ron Johnson back. It's been a downward spiral since he left. Retail and Corporate are more separate than in sink these last couple of years. Management holds a tough position - half are incompetent, there isn't any stable internal development for talent pipeline, no succession planning and those managers that are great are SLAMMED and overwhelmed with work. Get ready to be mentally, emotionally and … physically exhausted every day.",
        "pros": "if you like fast-paced, ever-changing environments this is a great company to work for. Great health benefits, salary is high for retail.",
        "summary": "Good company if you get hired into Senior Management",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Income and growth opportunities are non existent",
        "advice": "Appreciate your employees!",
        "pros": "Management and co workers are amazing individuals to work with",
        "summary": "Not worth the pay",
        "role": "Sales Specialist",
        "date": "Apr 29, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You need to attend meeting, which are pretty pointless, and IF there is anything important it could be summed up on a post it note.There is a cultish feel to the company, and if you share negative thoughts on products or anything Apple, managers will not be happy with you.Customers have a sense of entitlement and can be very rude and disrespectful.Promotions are in short supply, and offer marginal raises.… The chances of moving from retail to corporate is basically 0. Not saying it never happens, but extremely rare.No bonuses or incentives for reaching sales goals, or any other goals.The job can get repetitive and very boring. How many times can you sell the same thing, and answer the same questions?All in all, its a retail job, and not much more. If retail is you passion, you'll love it. If your a college student, or in a transition period, and over-qualified, you will not be able to wait, and move on to bigger better things.",
        "advice": "Try and take the employees side once and a while before giving a complaining customer the world.Realize that the retail employees are just that, and not apple clones, and that they don't always have to think Apple is the greatest thing since sliced bread,",
        "pros": "Apple is a growing and extremely successful company, so working hours are never really in short supply.Decent DiscountRelatively Easy.",
        "summary": "Red Zone Specialist",
        "role": "Red Zone Specialist",
        "date": "May 7, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Competition, distrust from management, lacking flexibility",
        "advice": null,
        "pros": "Great coworkers outside of technical support team",
        "summary": "Passionate but lacking supportive community",
        "role": "Genius",
        "date": "May 10, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Worst management style ever. If you're not on their A-list, it is all a numbers game. Although input in the form of employee feedback is important to collect, it is not an agent of behavior change. Very superficial employers.",
        "advice": "If your retail employees are Prozac like Tim Cook says, than you have a dangerous batch. As it is, the change in leadership has been rough-and-tumble with longtime fans. Harming the majority of your workforce at the bottom of the barrel does little to inspire the hope of the brand.",
        "pros": "Best pay in retail, best benefits, best colleagues",
        "summary": "I felt like there was never a pat on the back",
        "role": "Red Zone Specialist",
        "date": "Jun 8, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "THIS IS RETAIL. It may be cool to say you work for Apple but if you're not a fan of retail and the terrible hours along with the unpredictable schedule, don't waste your time",
        "advice": "Give full timers 2 days off in a row to allow them to recharge.",
        "pros": "If you want to be lazy you can for the most part - you will not be fired for performance in sales (or at least that won't be the official reason)",
        "summary": "Don't let them fool you... this is retail.",
        "role": "Specialist",
        "date": "Jun 21, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-set on random schedule with metrics, don't bother the flexibility ( you will work on holiday as well )- less staff on demand peak and management doesn't speak up to make a better change- no stocks options, no bonuses, no appreciations for hard work- internal politics and favoritism, micro management, no room for advancement and development for a long career- too many changes within the management pro… cess, work process",
        "advice": "Recommendation in listening to employees, sharing a pool of bonuses since the company has so much cash in reserve. Can improve to develop the career path for everyone. If the company makes everyone happy from the work environment and implement the cons listed above, the company should be on the top just like Google. Apple should match Google culture",
        "pros": "-Good discount and some good benefits for employees-I have met great co workers-technology , products",
        "summary": "Gave hope but Not so impressed anymore",
        "role": "Technical Support",
        "date": "Jun 22, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "High school like clicks, unrealistic metrics, and forever on the late shift if you have no children",
        "advice": "I would like to quote Heidi Fleiss \"Be nice to everyone because you never know who will be on your jury\". My advise to management. Be nice, Stop pretending that people are numbers and do not forget where you came from. There is more to life than that silver portable that you carry everywhere...",
        "pros": "Great company, great experience and interesting situations.",
        "summary": "it was good till it was bad",
        "role": "Cusstomer Relations",
        "date": "Jun 23, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Exploitive. Apple retail keeps people in the lower-paying rung of \"specialist\" while utilizing your expertise to fill in for people who get paid more doing tech and training (and not promoting). It's getting worse and worse. Many would be willing to be \"utility players\" and do more than one role, but the pay and official title stays on the lower scale. I also think there is a \"bait and switch\" in the recruiting proce… ss where Apple contacts people with training and tech skills with the promise of Creative or Genius, lures them to work for Apple, but then keeps them in the Red Zone.Lots of part-time positions, with crappy and inconsistent hours (I know, this is retail), managers are increasingly micromanaging issues to keep employees from progressing for silly rules (i.e.: gum chewing and color or pattern or shirts worn under Apple shirt) and employees who give great customer experiences (NPS) are not acknowledged in terms of advancement, it has more to do with kissing up to management and saying the correct corporate gobbelty-gook. Suck-ups are rewarded. Age-ism can be an issue at some stores. Pay is not great. Employee store meetings are rah-rah annoying. People are feeling unhappy about the lack of movement. Outside hires are poisonous. Standards regarding experiences and benchmarks for roles are a personality contest.",
        "advice": "Stand up for your people. Don't allow \"head-count\" issues to keep people from advancing. I know the emphasis on \"one to many\" is a great skill, but the Family Room is understaffed and there are many people in the Red Zone with a passion for Apple products who are up to the challenge of being busy their entire shift.",
        "pros": "Excellent benefits, even as a part-timer. It's also great to introduce or reinforce customer's experience to Apple products, which are the best in the world. I love the fast-paced environment and constant change of working for Apple. It's a job that allows you to learn a lot from experience and also from training. The interaction with customers is energizing.",
        "summary": "Apple technology is great, but the retail experience is not so great",
        "role": "Specialist",
        "date": "Jul 18, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-Managers constantly micromanage-Difficult customers-Hard to have a work-life balance with constantly changing shifts that sometimes end at 10pm-Unclear expectations from management-Little room for growth-Body gets tired from standing all day",
        "advice": "-Provide a consistent message-Trust your employees",
        "pros": "-Discounts on products-Fun and outgoing co workers-Best pay for retail job-Store meetings you get paid for",
        "summary": "Best option for retail. Great co workers. Not the best management",
        "role": "Expert",
        "date": "Jul 20, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Customers who take advantage of APPLE, letter writers to CEO, lack of trust amongst management, pretenders.",
        "advice": "Show some loyalty to the people who do all the work, support decisions in the store, get rid of poor managers sooner than later and the whole idea of \"ambiguity\"?",
        "pros": "Fellow co-workers, awesome products and having the ability to make someones life better with technology.",
        "summary": "Overrated",
        "role": "Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "everything is outsourced to the communists",
        "advice": "ur all incompetent",
        "pros": "I would have to say that your a nut working here",
        "summary": "stay away",
        "role": "Program Manager",
        "date": "Jul 26, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No choice in work schedule. I worked evenings and weekends. Communication was horrible from the get-go. While recruiters admitted it was a sales job, they downplayed it severely. In the end, they should not have hired me. Although I seemed to excel at one set of metrics (customer response), which they said was most important, they hammered me on another set of metrics-- basically they wanted me to try to get every ca… ller to buy crap they weren't shopping for. I can't do that. They didn't like that.",
        "advice": "Be up-front with your prospective employees about the REAL requirements of the job. If it's hard-core sales, tell them that! Then, when they aren't meeting expectations-- communicate that and work with the employee to solve it.",
        "pros": "It was great working from home: no commute, no dress code, no bag lunches. There was a pride factor in working for Apple. Extensive training.",
        "summary": "Oh yes, it's SALES",
        "role": "At-Home Mac Expert",
        "date": "Jul 28, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Full time employees work five 9-hour shifts per week with a 1 hour break after 4-5 hours, schedules are generally not set, meaning your work schedule may change week to week. When I started working at Apple in 2008, my schedule was set every week, but in 2013 Apple decided to \"get away from set schedules to meet the needs of the business\". This makes having a personal life and a decent work-life balance nearly imposs… ible.",
        "advice": null,
        "pros": "Excellent discounts offered to employees on Apple products, as well as rotating discounts on third party products.",
        "summary": "Not the Apple they used to be",
        "role": "Genius",
        "date": "Aug 18, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Horrible working conditions. I was expected to be creative and innovative but my desk was between the people answering phones and the people on break. Not enough room to breath let alone think!",
        "advice": "Design your stores so that they are management friendly as well as customer friendly.",
        "pros": "Great Prestige! Great Products! Beautiful Stores!",
        "summary": "Retail Business Manager",
        "role": "Retail Business Sales Manager",
        "date": "Aug 26, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The pay sucks unless you are in Executive Management or are a software engineer. You will starve to death unless you are in one of these groups. Also, unless you are age 25 or under, forget it. They do big time age discrimination and don't like to hire seasoned, experienced people aged 40 (or older) when they can pay 11 bucks an hour for a kid.",
        "advice": "Pay us more! We work our ass of for you!",
        "pros": "Great energy, great morale, great products, smart folks work here.",
        "summary": "Great place to work; but the pay sucks!",
        "role": "Anonymous Employee",
        "date": "Sep 1, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Wild variations between stores. If you're seen as part of a \"bad store\" or a \"bad team,\" it's almost impossible to gain forward momentum in your career. Stacked rankings mean that you can exceed your goals and still fail to gain sponsorship for career advancement. You won't get fired, but you will get managed out with bad schedules and reduced hours. Leaders are more excited to recruit a senior leader from another co… mpany for a junior role at Apple instead of building a bench of talent.",
        "advice": "Stop looking for ways to rule out internal candidates for advancement.",
        "pros": "Some store leaders and managers will coach you for great success. Exceptional health and education benefits. Strong product training for team members who choose to avail themselves of it.",
        "summary": "Don't join the wrong team.",
        "role": "Specialist",
        "date": "Sep 6, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Micro Management is very poor",
        "advice": "Get Another Job",
        "pros": "Good People to work with",
        "summary": "This is just a dead end job",
        "role": "Warehouse Worker",
        "date": "Sep 7, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's all about the numbers! The emphasis on quality and great experience and ease of use that makes their products fantastic -- does not exist at all as an employee.",
        "advice": "turn over is expensive. You lose a lot of people because of the very low focus on employee commitment, recognition and development",
        "pros": "Everyone think you are incredible. It is great to build your resume. Great to be with a leader in technology; particularly if you live in the Bay Area.",
        "summary": "You either \"fit\" in or you don't. Aren't in folks that last longer than 2 years that was a 'fit'",
        "role": "Anonymous Employee",
        "date": "Sep 16, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No way of moving up the food chain",
        "advice": "promote",
        "pros": "Good people to be around",
        "summary": "Janitor",
        "role": "Janitor",
        "date": "Sep 20, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Poor management, poor hours, poor scheduling, poor pay (they will absolutely take advantage of the fact that people love the idea of working for apple and there is no shortage of those who are willing to work for little pay no matter how valuable you are), poor recruiting, poor communication, very little opportunity to move around in company.",
        "advice": "Pay your employees what they are worth, not what the market dictates. Obvious profiteering, a part time sales person is able to easily move close to 500K worth of product in a year but is only paid 12 dollars per hour? Very greedy.",
        "pros": "Work on the bleeding edge of tech. Coworkers who are not management are great people, and just as passionate about company as you are. As a creative, you work mostly with people who are satisfied with their products already, and just want to learn more - not traditional customer service where a customer comes in frustrated with a problem you have to fix - thats a job for the Genii.",
        "summary": "Great Ideas, Poor Management",
        "role": "Creative (Apple Store)",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you magically turn into a real human wanting decent benefits, work/life balance and upward mobility none of the above will ever happen - if you are 25+ with 2.3 kids maybe they will consider you for more - but as a young adult you are only considered to be there for so long and in it for an experience versus a career",
        "advice": "What management?",
        "pros": "If you are young and different versus experienced and professional you will be hired",
        "summary": "Like Vector or Cutco",
        "role": "Runner",
        "date": "Sep 25, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Internal promotions are rare to none even for top performers. Politics and bureaucracy have taken over, making it nearly impossible to provide feedback to the upper management. The IT support team (IS&T) is filled with incompetent making your life harder when you discover a systemic problem. Many empty promises!",
        "advice": "Cut the red tape and listen to the field. Merit increase is below industry standard and cuts motivation.",
        "pros": "The best products in the world and the company trainings are some of the best I've have the chance to experience.",
        "summary": "Overworked under valued",
        "role": "Business Manager",
        "date": "Oct 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "no work-life balanceoverly demandingmanagement makes unreasonable requests",
        "advice": "Listen to employees and provide better flexibility and work-life balance so they don't burn out so quickly.",
        "pros": "Great productsGreat people who are passionate about their work",
        "summary": "Great professional experience but with a lot of personal sacrifices",
        "role": "WW Supply Demand Planner",
        "date": "Oct 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Will never move up in the company unless you are friends with managers and have a degree.",
        "advice": "Please be sure to keep track of who mgmt promotes and the reasoning.",
        "pros": "Health Insurance, Matches 401k, Discount on Stock",
        "summary": "Disappointed. Seems awesome at first but it wears off the 3rd year. You realize how the company truly operates.",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Retail hellVirtually no advancement opportunities in retail realmInconsistent hours, late nights, early mornings, all-nighters, weekendsLow salary for comparable positions in other companiesExtremely negative environment in Support",
        "advice": "Understand that employees are people, and treat them as adults. Extremely poor attitude when leaving company, as if it were a personal attack, rather than a positive experience. Remember that everyone that works here wants to be part of something bigger, and advance as such. Treat them like gold, as they are what brings the business.",
        "pros": "Working for the #1 technology hardware company in the worldGreat product discountsAmazing co-workersOccasional free food",
        "summary": "Romance was the draw, then I woke up",
        "role": "Technical Project Manager",
        "date": "Oct 7, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Compensation is below comparable positions. Cupertino doesn't seem to really care about people and facilities outside of Cupertino and maybe Austin. The retail stores are treated very poorly.",
        "advice": "Take some of the billions in the bank and invest in better compensation for retail employees and in making the retail stores a better environment for employees. Customer facing part of the stores is great but the back of house is garbage.",
        "pros": "The people are fantastic and some of the smartest I have ever worked with. The benefits are really great and Apple takes really good care of its employees. As long as you don't do anything stupid the job security is great.",
        "summary": "Career stalling move to work here",
        "role": "Business Manager",
        "date": "Oct 10, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "They say that people are their greatest asset. They pay horribly low and increases are pathetic at best. Specialists often fill in the gaps of other positions in the store for extended periods of time, years without getting the actual position and the the increase that should go along with it. Super high turnover rate. Most come in super stoked that they got hired by this amazing company that makes the best products … in the world. They often get fed up and or jaded and wind up leaving.This is a great job for a collage student and looks great on a resume.",
        "advice": null,
        "pros": "Great 401K, stock purchase plan, really cool employees. The specialist role is stressful but not difficult. You can leave the job at work. You meet interesting people all day long.",
        "summary": "Specialist, Apple Retail",
        "role": "Mac Specialist (Apple Store)",
        "date": "Oct 14, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's a very legacy driven environment. They haven't changed their ways and aren't interested in how the rest of the world operates.",
        "advice": "Pay attention to the infrastructure, it's quite broken and in need of investment. Scale only makes the problems worse. Manual brute force isn't the answer.",
        "pros": "There is some real exciting stuff going on, lots of bright innovative people. They're at the leading edge on the hardware side.",
        "summary": "Didn't drink the kool-aid",
        "role": "Director",
        "date": "Oct 22, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not a lot of room to advance. Managers just promote their favorites. Expected to do things that are not in your job title. Not a good place to have a career (despite them telling you it is over and over).",
        "advice": "Open your eyes. You promote people who aren't good at their job. Sometimes I wonder if I am working at a different store. They have no idea what really goes on in the store.",
        "pros": "Good pay for retail. They don't push you to sell everything and don't place a huge emphasis on numbers. It is a great job for part-timers.",
        "summary": "Good Job for College Students",
        "role": "Mac Specialist (Apple Store)",
        "date": "Oct 23, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Little care about the employee at the retail store. Too much talk about how they care and very little to show it. Employees at Apple retail have become disposable commodities which has resulted in a revolving door. Market managers and above simply do not care.",
        "advice": "Wake up, get real, have honest dialogue with your store management team about what is really going on. You are asking so much of everyone and giving so little in return.",
        "pros": "Great team to work with. Smart people.",
        "summary": "Manager in a retail store",
        "role": "Store Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management is inconsistent in direction, advice, and level of knowledge (or lack thereof). They're sneaky in phrasing pep talks as though everybody is up for a promotion, but like many lesser companies, the promotions go to the butt-kissers not the hard workers. Bitter? Who, me?",
        "advice": "pay more attention to the minions, don't just fake it. stop passing out kool-aid and give employees options they can really use. your image matters to the public, but employees don't care about that. retail employees mainly care about two things: hours and salary. if you mess with those, they won't like you. if you recognize the importance of pay for work, instead of putting gold stars on their learning blueprint, th… en maybe you'll get somewhere.",
        "pros": "SOME benefits, but read the fine print. Healthcare appears to be good, but there are many holes in services offered. Ability to purchase stock was great and made a good amount of cash from that, even though I didn't sell at $700 (darn it). Tuition reimbursement is pumped up, but there are a lot of requirements and limitations about what is approved.",
        "summary": "First few months great, then downhill from there",
        "role": "Genius",
        "date": "Nov 5, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Under constant scrutiny and surveillance.",
        "advice": "Stop micro managing the workers and penalizing managers that really care for their teams. Be more inclusive with the workers and not just your favorites to build a stronger team.",
        "pros": "Learning what's new in technology. Some of the people are really nice and open while others are closed only to people in their circle. Discount on products & services.",
        "summary": "One of the most incisive yet ambiguous learning experiences into human nature and hi-tech.",
        "role": "Specialist",
        "date": "Nov 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lost sight of their core value \"our core is our people\" I started working at Apple in 2007 and boy have things changed! It has gotten more and more corporate and more and more dehumanizing focusing more on policies and proceedures than the wellbeing of the employees. The daily foot traffic in the store is immense! The climate can be very emotionally overwhelming, loud, and overly stimulating...yeah you are probably t… hinking I am some sensitive shmuck! But the daily traffic gets overwhelming when you are responsible for dealing with angry customers daily in an environment where you have little support! Managers are inconsistent in implementing company policy, constantly making exceptions for customers who scream and disrespect employees. THERE IS NEVER ENOUGH EMPLOYEES ON THE FLOOR!! BUT MANAGEMENT EXPECTS US TO HELP 4-6 PEOPLE AT ONCE TO MAKE UP FOR IT. LASTLY; moving up in the company is extremely difficult! there are many lateral promotions that warrant no pay raise, but managers are extremely inconsistent in their reasoning for promoting people. You could have perfect numbers and attendence but they will give the promotion to someone who has worse numbers but just sucks up to them more and they will give you a lame reason such as \"we think you need to work on your peer to peer relationships\" (happened to several of my co-workers) THERE ARE NO REAL BEARRINGS FOR PROMOTIONS. AND MOST \"PROMOTIONS\" ARE LATERAL AND ALLOW YOU TO WORK HARDER AND DO MORE IN THE STORE WITHOUT GETTING PAID A CENT MORE...THEY HAVE A REALLY WONDERFUL WAY OF TRICKING YOU INTO FEELING LIKE YOU SHOULD BE THANKFUL AND HAPPY THEY GRANTED YOU WITH THIS OPORTUNITY!!! AND THEN DURING THE REVIEW THEY WILL COMMENT ON HOW YOU DON'T SMILE ENOUGH IN YOUR NEW ROLE AND THEY ARE WORRIED YOU ARE GETTING BURNED OUT................AFTER GETTING YELLED AT BY A CUSTOMER EVER HOUR THAT DOESNT WANT TO OBIDE BY THE COMPANY POLICY, AND THEN AFTER THAT CUSTOMER SCREAMS AT YOU AND DEMANDS A MANAGER THE MANAGER GIVES THEM EXACTLY WHAT THEY WANT! MAKING YOU LOOK LIKE THE BAD GUY WHEN THEY TOLD YOU TO UPHOLD COMPANY POLICY! IT CAN BE HARD TO KEEP SMILING! BUT WHEN AN EMPLOYEE NEEDS AN EXCEPTION MADE FOR THEM???OOOOHHHH NOOOOO....THE POLICY IS WAY MORE IMPORTANT THEN!!! They say they want to give you more personal development training time but you have to FIGHT for it!ONE MORE THING! The corporate availability requirements! you are forced to give 29 hours of open availability and they can ether give you 5 hours a week or the full 29....you cannot request to work more or less. THEY ARE SEVERELY INCONSIDERATE AND UNFLEXIBLE ABOUT PERSONAL AND FAMILY EMERGENCIES! IF YOUR GRANDMA DIES AND YOU CANT GET YOUR SHIFT COVERED IN TIME OH WELL! YOU WILL RECIEVE AN ATTENDENCE POINT EVEN IF YOU NOTIFIY THEM A WEEK IN ADVANCE! EVERYTHING IS DONE BY A COMPUTER...ALTHOUGH MANAGEMENT HAS OVERRIDING POWERS THEY WILL SELDOM MAKE EXCEPTIONS AND JUST SAY \"SORRY THE COMPUTER ALREADY SCHEDULED YOU...I HOPE YOU FIGURE SOMETHING OUT!\"",
        "advice": "Read above. YOUR SOUL IS NO LONGER YOUR PEOPLE! As much as I loved your company and invested 3 years of my life to it, my last day was the best day of my life. You must find a way to maintain the appointment queue at the genius bar and lessen the stress on the FRS role. You must find a way to be solid as a management team and have a joint agreement about when to make exceptions. If a coach has a team and teaches the … team to obide by certain philosophies, such as: good conduct at every game...but when team players dont follow the rules, no consequence is given...the team loses integrity and later down the line the coaches philosophies will mean nothing to its students because they all know the philosophy was never upheld or valued. This is what is happening to apple retail. The credo is no longer living, it is not longer the center...we never revisit it, we never recall it. And if we do, we never believe it because there is no integrity.",
        "pros": "Apple is a great company. The pay is outstanding for retail, they offer part time benefits and many other cool perks. You meet amazing people, co-workers are brilliant and very talented! Its a great job for a while but don't get stuck there just because they pay well. Many opportunities for growth...if you are willing to look past their inconsistencies. You could easily work your way up to 20+ dollars per hour within…  2 years without becoming a manager. Unheard of in retail! Health care, transportation benefits, free services, stock purchase plan. Easy access employee website.",
        "summary": "Innovative and unique company, inconsistent management",
        "role": "Anonymous Employee",
        "date": "Nov 8, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "MOST MANAGEMENTApple hires 99% of managers externally; internally expect to stick around for years before promotion unless you're in a new storeYou will not have a life",
        "advice": "The southern California market specifically is crammed with subpar managers that are so lazy and disinterested in anything but their paychecks. I've experienced this in 3+ stores. Prepare to be very very frustrated in SoCal Apple stores.",
        "pros": "Educational ReimbursementEPPPay compared to other retailers",
        "summary": "Don't expect advancement into Management; very hit and miss",
        "role": "Expert",
        "date": "Nov 10, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The culture listed above does not apply to management. Overtime is required as you will spend 40+ Hours on the floor creating that culture, so the tasks necessary for running the store/department will be done before or after your shift.",
        "advice": "Utilize the Credo to support your leadership with the same commitment you do for your employees and customers.",
        "pros": "Apple has an amazing culture related to their employees and customers. Extreme attention to detail and a commitment to excellence.",
        "summary": "Lack of Work/Life Balance",
        "role": "Senior Assistant Manager",
        "date": "Nov 17, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "A lot of corporate kool-aid",
        "advice": "Not every metric needs to be sales-oriented.",
        "pros": "Comes with decent pay and discounts",
        "summary": "Typical coporate environment",
        "role": "Specialist",
        "date": "Nov 18, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Ambitious managers with not much technical background, low integrity and lots of politics",
        "advice": "Do your research on who you promote. If more than X (X>5?) people leave a team in a year, do not promote the manager. Also provide new managers with training so they can perform better and lead teams according to stated values. Do not let people play politics and increase transparency in decision making.",
        "pros": "Get the opportunity to work on really cool and visible projects, together with great engineers and designers.",
        "summary": "Poor management. Managers not living up to company values.",
        "role": "Senior Engineer",
        "date": "Nov 21, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management. Customers are entitled savages.",
        "advice": "Start listening to your people",
        "pros": "Health benefits are pretty good",
        "summary": "Not what it used to be.",
        "role": "Specialist",
        "date": "Nov 22, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There is very little work life balance and the perks are not as good as other companies.",
        "advice": null,
        "pros": "It's Apple so it's nice to have on a resume.",
        "summary": "Brutal",
        "role": "Anonymous Employee",
        "date": "Nov 25, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "This entire Enterprise organization from the inside sales group to the field is mismanaged. The management team has been in place for a long time and is best described as complacent. The work environment is both hostile and demeaning. I would strongly recommend avoiding this organization.",
        "advice": "Resign.",
        "pros": "This review is not a reflection of Apple as a company but rather the US Enterprise group. The company as a whole has great benefits and perks. I've also heard very positive things about other departments/divisions.",
        "summary": "Avoid Enterprise Group",
        "role": "US Enterprise Sales",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Horribly Misguided Management, Tons of Bureaucracy, Nothing Gets Done, No Clear Direction, Uninspired, Often Too Proud to Admit When Heading in the Wrong Direction",
        "advice": "If you want to be a leader in the retail space who will stand out for having a truly innovative and enriching customer experience. Stop hiring your higher management from other lack luster retail shops... unless of course you want to become like them. They bring plenty of bad habits with them and want nothing more than to apply their existing formula to the Apple stores.Your successful stores capitalize on th… e organic growth that happens among the employees in the store. That is the magic of the Apple Store; the unique retail environment the employees create. When you try to shove policy and bland retail marketing across the board to every employee... the store loses it's individuality and it struggles to find its identity constantly. This becomes incredibly distracting for the employee and distracts from the goal of hitting their metrics and performing.",
        "pros": "Company's Financial Stability, Stock Bonuses, Great Health Benefits, Good Compensation",
        "summary": "The Apple Store Leader Program",
        "role": "Apple Store Leader Program Associate",
        "date": "Jan 2, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lots of managers who did not graduate through the company",
        "advice": "Stick to the creedo",
        "pros": "Things are constantly changing and it looks good on your resume",
        "summary": "Decent company to work for, as a company they have moved into a huge business and less focus is on the employee",
        "role": "Mac Genius",
        "date": "Jan 9, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Poor management training. No advancement if you can't brown nose. No work life balance.",
        "advice": null,
        "pros": "Great name company for your résumé.",
        "summary": "Don't do it.",
        "role": "Anonymous Employee",
        "date": "Jan 9, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No job growthMiddle management has no clue",
        "advice": null,
        "pros": "Money and stock compensationglamorous products",
        "summary": "apple experience",
        "role": "Anonymous Employee",
        "date": "Jan 21, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It is a cult with no room to be creative",
        "advice": "Learn to manage and develop true talent",
        "pros": "They hire the smartest and most creative people",
        "summary": "Cult like",
        "role": "Redzone Specialist",
        "date": "Jan 22, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No room to grow. Dead-end job.",
        "advice": null,
        "pros": "Best pay in retail. Lot of jobs available.",
        "summary": "Decent place to work",
        "role": "Creative (Apple Store)",
        "date": "Jan 28, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many levels of management and it takes a long time to come to decisions due to lack of understanding of the systems in place.",
        "advice": "Be more open about future plans and provide solid direction",
        "pros": "Ability to work on problems related to high traffic websites",
        "summary": "Process heavy and lots of managements levels",
        "role": "Anonymous Employee",
        "date": "Jan 29, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Selective few get promotedPlenty of favoritismLots of micromanagementManagement pretends to be there for you but really all they care about is the metricsIt's retail so don't get caught up in the hype!Don't believe what they tell you in core.",
        "advice": null,
        "pros": "Great benefits!Work with amazing employeesFlexibility: ideal job for college students",
        "summary": "Apple has some great qualities. It's better to own the products than work for the company.",
        "role": "Anonymous Employee",
        "date": "Feb 5, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Apple really wants its employees to be sheep, blindly enthusiastic about every initiative the company develops, even as these initiatives may change drastically and contradict former initiatives, without warning. A lot of beating around the bush with feedback and expectations.Most employees are overqualified people who are treated like babies.Despite management saying the company is Custo… mer Service driven employees are rewarded more on their sales and attachment programs rather than quality of relationship with the customer, though employees receive no bonus on sales.Loss of individualism. Really feels like a corporation. Employees expected to fit into cookie cutter roles while being told they are hired for who they are as individuals.Employees and especially management seem really fake.Employees could be paid a lot more considering how much profit the company makes. High turnover as employees are unhappy with the meaninglessness of the job.",
        "advice": "Be more direct",
        "pros": "Nice friendly coworkers, okay benefits",
        "summary": "It's really about drinking the Kool-Aid",
        "role": "Specialist",
        "date": "Feb 8, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not so great payEnough work hours!!",
        "advice": "Please out!!",
        "pros": "Nice HQ (I talk about CA)Smart coworkers",
        "summary": "I hate this company",
        "role": "Product Design Lead",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Incompetent managers, interpersonal drama a la high school, difficult to succeed. Random imperatives from corporate level employees who have never worked in a retail environment.",
        "advice": "Trust your employees. Take their advice. Help them succeed and advance. Explain your decisions. Allow people with ambition to aim for management!",
        "pros": "Employee discounts, a great team mentality, the work isn't hard. Lots of attractive young people in one place with a common interest.",
        "summary": "Pit of Despair",
        "role": "Family Room Specialist",
        "date": "Feb 17, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "People are very busy with tasks on hand and have little or no time to pause and think about the task. Big and complex processes which can lead to small rivet in a big machine feeling. Very limited time to work on new things due to schedule.",
        "advice": "Improve the process and put down time between projects in schedule.",
        "pros": "Very smart and dedicated folks. Good benefits and great cafeteria. On site health and welllness center (cupertino) is very nice. Laser focus on milestones and schedule.",
        "summary": "High octane + fast pace",
        "role": "Anonymous Employee",
        "date": "Feb 19, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You will never move up unless you are buddies with management.",
        "advice": "Quit micro managing and watch lower management who take advantage of their workers.",
        "pros": "Great benefits. Ok Pay. They will match 401k to a point",
        "summary": "Order Support Specialist",
        "role": "Order Support Specialist",
        "date": "Feb 28, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Don't get paid nearly enoughWas around during the awesome $2-5 raise that many employees got, but otherwise it's around $.25-$.75, once a year.Not enough support for the Back of House (this is company wide, not just my store)You're working retailDid I mention it's retail?For my store, it was 24 hours minimum you had to work per week, which is not an easy thing to do when you're going to school ful… l time. They used to be a lot more flexible with students and their schedules, but they seemed to have changed that.It pays you just enough so that you're afraid to move on to anything else. You get comfortable and next thing you know, it's 3 years later and you're at the same store. I've seen it happen to many people until they realized they can do better and left. Just be careful. This is a decent job if you're working here and going to school, but after that, get out.",
        "advice": "Support your BOH teams. They may not be customer facing, or sell anything, but they are the reason products get restocked, computers are available to be purchased and how customers computer parts get received on time. Take a little time and actually try to understand what they go through on the day to day, it would mean a lot to them.",
        "pros": "DiscountsSurrounded by some great peopleGood work experience to understand how awful the human race isLooks good on a resume (as I've been told)Really good health benefitsStock purchase plan",
        "summary": "Don't get too comfortable",
        "role": "Back of House",
        "date": "Mar 1, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Difficult to move up or around. They like you to get good at one thing and them just do it. Not employee focused.",
        "advice": "Care more about the people going all the work.",
        "pros": "Dynamic, fast paced. Smart people around you who take pride in their work.",
        "summary": "Customer support process",
        "role": "Quality Program Manager",
        "date": "Mar 2, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-Tough to deal with disappointed customers-Lack of support from leadership-Shifts are exhausting",
        "advice": "-Please decide if you want to be a \"turn and burn\" employer or if you actually want to develop career paths. In my experience, we were promised everything, and treated like we were replaceable.",
        "pros": "-Great personalities in coworkers-Every day is different-Some great customer interactions-Cool technology",
        "summary": "They will run you down",
        "role": "Genius Administrator",
        "date": "Mar 4, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Extreme politics to a point of not truly supporting a performance based culture, HR practice was a joke (from how they promoted, to how they rolled out training, etc.)",
        "advice": "Higher level executives need to work on visibility and make their presence known. There was a considerable disconnect between the people doing the work, and the executives. With Apple being such an incredibly innovative company from a product perspective, they were far from that in how they managed people. Lots of traditional, autocratic, hierarchical structure. I witnessed a lot of morale issues and people problems … that could be addressed with putting more focus on understanding how to manage talent and engage the workforce.",
        "pros": "Products, intelligent and talented workforce, lots of opportunity for growth",
        "summary": "Horrible HR Practice",
        "role": "Store Manager",
        "date": "Mar 5, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Micromanaging. No flexibility. Feels like a line worker. Bullying.",
        "advice": "It's not okay to discriminate by age or sex.",
        "pros": "Casual atmosphere. Face to face communication not required during normal work hour.",
        "summary": "Micromanagement",
        "role": "Anonymous Employee",
        "date": "Mar 6, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Training is a work in progress, dept is going through growing pains, only motivation to do hard work is for the chance you MIGHT get the schedule you want, shift bids every 6 months, hard to get recognition, when you do get recognized you aren't eligible to receive another award for over a year, employee morale is low. Keep in mind this company is based in California so there's a lot of thin skin.",
        "advice": "Lift the year probation on award winners, expand rewards program instead of diminishing it, stop dangling carrots when you know you aren't going to deliver.",
        "pros": "Great benefits, 401(k) match, vacation time, sick time, will pay for school (as approved by your immediate supervisor), great to have Apple on your resume, job security, takes a lot to get fired.",
        "summary": "Great to work for if you are looking for another job.",
        "role": "Fraud Prevention Specialist",
        "date": "Mar 28, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It doesn't take very long if you search the internet for people dissatisfied with Apple. Although with anything online, some claims are petty or from former bitter employees. If you are favored and well liked you will go far regardless of your skills. I believe people should only be rewarded for a job well done. I've seen countless skilled & talented coworkers, that deserved the opportunity, be passed over often,…  for someone less qualified. I understand every business is political to a point, but when this practice becomes the norm, there is a problem.",
        "advice": "Senior management should really take a look at who they are hiring as Assistant managers. Several are woefully under qualified and have difficulty meeting the performance goals listed within the job description.",
        "pros": "One of the best things about Apple is the community. Being able to work for the company that produces hardware, software and support for them both is a big plus. Additional training and resources are always available.",
        "summary": "The rumors are TRUE!",
        "role": "Apple Genius",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Business at Apple is a grey, murky area. There's no alignment with enterprise-level business sales, so internal poaching happens. We had to share our inventory with the store, so sending a customer to third-party sales options happened from time to time and was frustrating.Store Management was extremely short-cited - most of them had only ever worked retail, which didn't help the company's vision to be more t… han just a retail location. They didn't understand anything beyond what was right in front of their noses. I felt smarter than most of my \"leadership\".I shouldn't have been hired at the store - I was overqualified for the job. When management realized that, I wish they would have assisted me in looking for other opportunities...I would have liked staying with the company, but I didn't know what other options there were.",
        "advice": "Just because you know buzzwords doesn't mean that you understand them.Store Management: If learning about the Business Team is part of your training, it's your responsibility to retain that knowledge. (We facilitated \"What does it mean to be a Business Specialist?\" presentations every few months, not to highlight what we were working on at the time, but to outline, again, what our job entailed.)Busine… ss Management: GROW A PAIR. Stand up for your team. Don't be a passive \"company man\".Corporate: Learn operations. Visit the stores. Talk to the low men on the totem pole. Listen to them. Consolidate.",
        "pros": "The benefits were great - health, matching 401k, stock options. Pay was good for retail, and the discounts (Apple-provided and third party) were insane. By the time I left, I was up-to-speed technologically. My peers were INCREDIBLY talented, charismatic people. The only positive thing I have to say about management was that they knew how to hire.",
        "summary": "Working Retail at Apple is still working Retail - no matter your title.",
        "role": "Business Specialist",
        "date": "Apr 6, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lack of growth, leadership, communication, huge lack of respect to employees. Terrible, non-useful \"propaganda\" training, even though they claim it's the best. Awful, inconsistent scheduling, with total disregard for employees. Pay is FAR too low for what they demand of employees vs. store revenue, and do I have to mention those awful shirts? I took this job out of desperation and as bad as I expected it, it was much… , much, worse.",
        "advice": "People flock to Apple to build a career. You build them up during core training to be working for the best of the best, you talk of empowerment, providing \"Ritz-Carlton\" service, and finding \"the right solution\" for each customer. All that does is disappoint every single employee when they soon realize that all the company really cares about is sales and there is rarely time to actually spend time with a customer. Th… e store was usually understaffed and when the store went to chaos and customers became unruly with sales and repair wait times, the \"managers\" typically hid in the back office. If you want your employees to think of this as a career and not just a job, there is NO reason you can't provide set schedules for full time employees, while flexing the part-timers, as needed. No matter how you hype it, it's just another retail job- only much more demanding. #1 complaint: Pay a living wage. Period. You should be ashamed.",
        "pros": "Great on resume, good if you like a discount on apple products, learn technical skills, above average benefits.",
        "summary": "Genius Administrator",
        "role": "Genius Administrator",
        "date": "Apr 18, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You will be up for a ride working at a Apple Retail Store in NYC. Most of the customer interactions are negative and they have absolutely no respect for you!! Customers, will scream and shout out you and will look down upon you like your less than a homeless person. The store was generally understaffed and several hundred customers were pulling me in every single direction at one time. Managers wanted us to follow th… e company policy 100% without no hesitation. However, if we were doing our part and a customer was angry, then they would throw a tantrum and the managers would give into them All the Time and make Us Specialists look like the Bad Guys!!! I have seen times when a customer caused a scene because they couldn't return their two year old phone. As a result, the manager would give in and also give them a free phone case. The policy is 14 days and the policy never sticks. When it came to making an exception for an employee. OOOO Noooo But the Policy!!! Many of my co-workers were frustrated with the mixed messages of management.During my time there, out store had a really harsh Time and Attendance Policy. If you were late or call out no matter the reason you would get an occurrence. The subway could of shut down or you might of had a death in the family, doesn't matter!!! Many great employees were fired because of this broken policy.They had system called the NPP where the customers can rate you. This was one of the reasons I left. Your raise is dependent on this. The store can be way understaffed and a customer can write a negative review about the experience ( not having control over it) so that effects your raise. Also, Management wants you to sell as much AppleCare or One to One as possible. You can convince a customer to buy it without being pushy at all. Then later on the customer will have buyers remorse and slam you by giving you a negative NPP score by saying \"they were too pushy\". Then I would be blamed by the managers for being too pushy and getting a detractor. If I didn't Applcare then they would ask me to please improve my numbers. Again, mixed messages!!!The NYC Market is run by very poor management. I understand that other markets and stores are much better.",
        "advice": "You are completely disregarding your Core Values. I understand that you want to 100% satisfy your customers and there is nothing wrong with that. There needs to be rules though such as keeping true to your return date policy ( with reasonable exceptions), and not give into angry customers who are degrading your employees.",
        "pros": "Great Health Benefits, nice discounts, \"fearless feedback\" and open communication with managers. With the exception for Time and Attendance, it is a very secure job and hard to get fired.",
        "summary": "A Retail Slave",
        "role": "Specialist",
        "date": "Apr 21, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Overall an extremely disappointing experience for me. I loved Apple before I worked for them. I quickly learned that the retail stores are not a professional environment. And there's a lack of integrity that I found to be too frustrating for me so I quit! Not my thang.....",
        "advice": "Get some moles into the retail stores and markets and you'll find out what I'm talking about.",
        "pros": "Working for a top brand selling great products. Customers love Apple products.",
        "summary": "Don't Mix Business with Retail!",
        "role": "Business Manager",
        "date": "Apr 23, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The people there are the worst. They're completely full of a crusader Apple spirit that says Apple is the best and if you don't agree you're wrong and not very smart. They're VERY exclusive. It's one thing to be proud of your company but another to be derogatory to people who have different tastes. The phone policies are terrible. Customers have to pay for phone support past a complimentary period, and if they're pas… t that you can't help them with anything, even very minor stuff.",
        "advice": "Improve training. It's horrible.",
        "pros": "The pay is ok and the benefits are good. If you like Apple products they have a good employee discount, which you can also use for friends.",
        "summary": "Terrible unless you're mindlessly devout to Apple products",
        "role": "Apple At Home Advisor",
        "date": "Apr 23, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Frequently mismanaged, Retail leadership runs around like a chicken with their head cut off. Clear disconnect between Corporate management and the Retail side.Stressful environment, lots of work to be performed in short reservation windows with a focus on metrics.Low wages for the work that is performed, I could (and did) leave for a similar role with similar benefits for a massive pay increase.",
        "advice": "Focus more on the internal customer. Happy staff makes happy customers. Session delivery is important, but so is providing the team with the tools they need, and tailored opportunities to grow. Make plans, communicate, and don't let the business control you. Leadership can be too wishy-washy in crunch time.",
        "pros": "Stable career, I never felt that I could be out of a job.Great training, I loved every minute of Genius Training.Amazing benefits, I have better health and fringe benefits than anyone I know my age.",
        "summary": "Dealing with Ambiguity is a cop out.",
        "role": "Genius",
        "date": "Apr 29, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I started working here back in 2007 and left 2013. The mind set changed, because Apple stopped promoting within. Instead they bought people from Circuit City, Best Buy, Walmart, Target, etc. People who never had a Apple computer and do not care about the Apple culture. There are a lot of broken promises. If a manager says that they will help you get to Corporate they are LYING!",
        "advice": "Tell the truth and back the people you see everyday. Instead of taking the word of a customer you just met over a employee you have known for 4 years and see everyday.",
        "pros": "Easy going and friendly atomposhere. A good discount and AMAZING BENEFITS!",
        "summary": "Genius Administrator",
        "role": "Genius Administrator",
        "date": "May 14, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Read above. Seriously. This place is not an easy place to work at. It was my first retail job out of college and the job that showed me that I really wanted to become a teacher and help educate people, instead of act like a cleaner, more youthful equivalent of a sketchy car salesman selling overpriced and over-hyped tech goods. What I liked about working at the Apple store most, instead of selling useless goods to pe… ople, was teaching them how to use the technology. It's good tech, just too expensive and snobbish for the plebeians (like me!) to be marketed towards.",
        "advice": "Elevate the smartest people in the store, the hardest working and the least committed to petty retail gamesmanship to better positions on the floor. If people WANT, really want, to educate others at the FRS booths, let them. OH WAIT! I forgot, us FRS (Family Room Specialists) don't make any money for the company, at least not in a straight transaction sort of way. What a joke. Talk about devaluing a core tenant of th… e Apple stores, the education....",
        "pros": "I learned a lot about crisis management: What to do when ALL managers were absent, how to handle the terrible relationships with pathetic customers who only valued material goods, how to advocate (unsuccessfully) for my advancement in the store and, most importantly, how to force a smile when every day felt a little bit more soul-sucking.",
        "summary": "Just another retailer..that shoves its hype down your throat from day one",
        "role": "Redzone Specialist",
        "date": "May 14, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Favoritism in retail, people getting promoted who didn't deserve it, moving up the retail ladder requires lots of lateral moves, pay is alright but not great, if you speak a language, they milk it. I've worked retail for 10+ years and I thought Apple would be totally different. I thought it would be an easier foot in the door into apple corporate. Just be careful, apple is VERY selective to who they promote into corp… orate (certain positions), plus your manager needs to give you a good work if they decide to promote you and its just like any other retail jobs. The perks make it semi-tollerable.**Use your 2nd language to leverage more pay when negotiating pay in retail, especially if you speak Chinese or Spanish, very high customer volume in stores here in the Bay Area, California **",
        "advice": "Don't micromanage, don't talk down to the associates (Some managers, not all), We all have favorites but please don't make it so obvious as to who you do favor, promotions or even lateral moves need to be carefully evaluated. Some people don't deserve them but they happen. I tried to become a 'Creative and I did many in-store initiatives to make my way there. However, numerous people got promoted to the next steps ov… er me who didn't deserve it or didn't work as hard as myself.",
        "pros": "The perks, the benefits (only if your offered the full time role), stock options, Apple Passport, discounts on Apple goods and also third parties product discounts.",
        "summary": "Apple Retail: Great in the beginning but turned out to be just like any other job.",
        "role": "Red Zone Specialist",
        "date": "May 17, 2014",
        "is_current": false
    }
]