[
    {
        "rating": 2,
        "cons": "Crushing, incompetent middle and senior management. Lack of vertical mobility without leaving the company: there's a saying here that Dell is the best first and third job you can have, because you have to leave Dell and be rehired to be promoted. Cubicles.",
        "advice": "It's difficult to offer a company your best when you live under the Damoclean sword of constant layoffs.",
        "pros": "As large organizations go, it's not the worst one in the world to work for. Round Rock is a \"company town\" - your Dell badge gets you $2 off at the local Supercuts. Also, HR tries - albeit somewhat cluelessly - to make the place a better one in which to work.",
        "summary": "When the prospect of being laid off is widely considered a mixed blesing",
        "role": "Customer Technical Training Advisor",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You are a commodity, nothing more. If you let them they will work you to death, literally. Metrics are used and abused to a fault in making decisions. Not everything can be measured. I spend at least half my working time reporting on what I do to a various other areas of Dell. This was supposed to be reduced but actually got worse because they came up with more metrics to measure how we waste our time. This is most l… ikely because 80% of my management has no experience in the field they manage and rely on \"dashboards\" of metrics, most of which are measured in a way to look good, not be an accurate view of the situation.",
        "advice": "Bring common sense back into the decision making process. It has a place at the table but is being kept away.",
        "pros": "The pay is pretty good. There are very smart and driven people at Dell, you rarely run into incompetence.",
        "summary": "What happened to common sense?",
        "role": "GCM",
        "date": "May 9, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Government-like bureucracy throughout the company.Most risk averse environment I could ever imagine.No actionable interest in innovation from management team.Strong 'blame' culture in face of failure.No useful communication from executive leadership to their employees.Absolutely no avenues of advancement to executive level; all execs are hired from outside.All real decisions come from external…  consulting teams.",
        "advice": "Promote to your senior leadership from within. At least 10% of the senior VPs should come from inside Dell. Take risks by actually listening to what your employees and customers are saying. Stop relying on external consultanting firms for every decision.",
        "pros": "One of the few companies giving truly global and grand scale experience in all avenues.Truly great people to work with. Best place to learn to think big and aspire to big things.Fantastic place to try different jobs and expand your career opportunities.You can literally have multiple careers ranging from engineering to architecture, to marketing, sales, etc.",
        "summary": "Dell - The best first and third place to work.",
        "role": "Services Architect",
        "date": "Jun 5, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Long hours. as they outsource more resources around the world, getting anything done was a pain. The good old boy network is big drawback, that is if you would rather have your work speak for you. Their rating system is idiotic, as it requires a curve to be enforced and good people to managed out as the bottom of your group. Talented people when I started in 98 slowly left and was replaced with people more interested…  in a paycheck than doing something great and new.",
        "advice": "Bring back Mort.",
        "pros": "Dell paid me well and continued to dangle a carrot of more to inspire me to work longer and harder. Located in Austin, which is relatively cheap to find housing. Bonus plans were easy to understand, published for everyone to see. Christmas break was nice as the company really does scale down for about 2 weeks.",
        "summary": "Great pay, bad work environment",
        "role": "Senior Systems Engineer",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Idiot management. They are extremley disconnected with the way things really work at the bottom level.",
        "advice": "Spend a month on the phones in tech support before you try to \"fix things\" and end up making our jobs harder adn more complex.",
        "pros": "Pay, Benefits, and culture. They try to make it a good place to work with nifty contests and what not. Good for culture, but essentially, that doesn’t make up for the overall stupidity in decision making.",
        "summary": "Disconnected management",
        "role": "Enterprise Technical Support",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "fake culture, too many people always live in state of fear of their jobs and metrics, in the central Texas area almost everybody has worked for Dell its a revolving door, usually once your worked there you never want to come back again, very stressful environment, extreme Micro Management, metrics for everything",
        "advice": "Quit hiring people with Management Degrees their solution to everything is micromanagement, hire some MBA's and CPA's which actually have an idea how business works and know how to utilize your employees as a asset not a liability. Prime examples of companies which have learned this are Google and Apple. Develop an internship program for college graduates which actually makes students excited if you notice Dell is no… t listed even close to the top 100 best internships in the country, start recruiting the best not whats left over after every other company already took the best candidates.",
        "pros": "health insurance, dental, eye care, 401k the standard",
        "summary": "Dell more like Hell",
        "role": "Anonymous Employee",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "After spending 5 years in Dell trying to make something positive of this career mishap, I cut my losses and moved on. To this day I cannot laught at Dilbert any more, because it hits too close to home. Dell does not even make an attempt at \"our poeple are our number one asset\". The employees have been the first to get hit with layoffs anytime the stock goes down. Engineering jobs are being shipped to China, IT jobs t… o India, this is a fact of life in this company. I've observed directors and VPs from Oracle and Microsoft join Dell and leave after 1 year because poeple got threatened by their new ideas and got them fired at the next round of layoffs. Finally, there was an annual survey question placed to all employees like \"If you were offered similar compensation and benefits at another company would you leave Dell\" and the survey results were always between 65-85% 'Yes'. I believe they stopped asking this quesiton a few years go. Dell IT is about the most miserable place I have ever worked in.",
        "advice": "I never got the feeling that executive leadership knew where to take the company, like there wasn't any wisdom on top. The feeling you get from below is that the 'Dell model' is a cash cow and that's all you need to know to run this business. From sales, to marketing, to IT it was a backstabbing free-for-all to get all you can for yourself... until the model didn't hold any more of course.",
        "pros": "If you are a local that happened to be lucky enough to land in Dell IT in the early days, Dell is a windfall for you. If your strong suit if relationshps and politics, you will find a good home in Dell IT. It is the sole reason for advancement.",
        "summary": "The single worst career move I made to this date",
        "role": "IT Architect",
        "date": "Jun 12, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lack of career development, and company stability",
        "advice": "Start caring about the employees again",
        "pros": "Salaries are quite high and the benifits are good",
        "summary": "Sad place to work",
        "role": "Program Manager",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's owned by Dell; when Dell gets dragged through the mud, we do too. Another down side is the competency of the management staff. Most of the managers/supervisors have never been in this type of environment before. Without a knowledge of how this industry works, how do you expect a company to succeed???Also, communication is a HUGE problem. For so long, people would say how the 'rep' would not speak to each other a… nd be very territorial about their job...now, it's impossible to hold a conversation with any member of managment b/c they are all bickering with each other and 'jumping ship'....There is no communication at all!",
        "advice": "Take a closer look at those who are working for you. Compensate the ones who pretty much do your job and let you take credit for it. Sit down and see exactly what it takes to get things done. Maybe then you can understand the importance of RETAINING TALENT!",
        "pros": "The team mates are fantastic. The management staff is very fun at times but when it's time to get down to business, they become mute. The benefits are good, time off requests are typically approved and fairly reviewed. DFS definetly has it's moments to shine...if you are there at the right time/right place.",
        "summary": "GET IT TOGETHER DFS!...IF NOT, WE WON'T BE ABLE TO RECOVER....",
        "role": "Anonymous Employee",
        "date": "Jun 13, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "management has been going great lengths to reduce OPEX and they have taken away resources and made it harder to hit your goals",
        "advice": "Cherish their outside sales force, without them you have no direct business or relationships.",
        "pros": "you work with every angle of the industry and get to help customer's address their business challenges",
        "summary": "Great industry experience, little reward",
        "role": "Account Executive",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The processes and systems in place at the company are terrible. People uses to work a lot of extra hours to get the job done and are not always recognized for that. Recently the company started several cuts on operational costs what means cuts on expenses for everybody except for the senior management. Lots of jobs were transfered to emerging countries with low paycheck and low quality delivered.",
        "advice": "Care about people, because the processes and systems are so bad that without the motivated people working there, the company would break.",
        "pros": "The salary is not that bad and overall the people outside sees Dell as a great company. This is good for the career to have Dell in the resume but it is not for a long term.",
        "summary": "Bad processes and systems.",
        "role": "Business Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Reorganization once a quarter. Lack of long term direction. Priorities constantly shift. The focus is on cost. Employees are not truly valued as important. The will take from you as much as you let them. Top heavy and increasingly high red tape. People have blinders on and focus on making themselves look good, but the bigger picturee gets lost.",
        "advice": "Determine the competitive advantage and support it. Pick a strategy and stick to it. Stop reorganizing quarterly. Create a longer term leadership development plan.",
        "pros": "The world is your oyster. They will let you step into most any void you find as long as you continue to show results. Though it has gotten more political",
        "summary": "Growing pains...",
        "role": "Senior Manager Operations",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "They change your bonuses every month and you don't find out what the new one is until after the first week. They ding you by twice the amounth that you miss your quota by. 90% =80%, 75% =50% payout of your commission. Your quota will go up every month no matter how much your customers stop spending.",
        "advice": "Develop reps to become consultants with training to back it up, Stop putting people on Pips that have been with the company for three years as if they just stopped learning how to sell. Stop the 2 time decelarator, not getting bonus $$ for not hit 80% is enough punishment.",
        "pros": "Easy money your first two years before you move up to bigger accounts. No questions asked when you have to miss work or take vacation. Stock discount",
        "summary": "Make money and run",
        "role": "Inside Sales Representative",
        "date": "Jun 19, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There seems to be ever-increasing workloads, while compensation is ever-decreasing. As positions are cut in sales, we have to take on more accounts. As positions are cut elsewhere, it becomes harder for us to take care of the customer. We will lose customers over degraded customer support.",
        "advice": "Wake up and take care of your talent. As you lose more people, you will lose customers.",
        "pros": "The benefits are pretty good (4 weeks vacation after 7 years). Insurance is all right (I know other companies pay more of it). 401k is matched 5% and vested from day one.",
        "summary": "Wake up and take care of your talent.",
        "role": "Inside Sales Representative",
        "date": "Jun 19, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Dell is hell. Over worked and under appreciated.",
        "advice": "Listen to your people and read your internal surveys. You state that you hire the best and brightest, so, why not listen to them!",
        "pros": "Bonus plan was the best outside of the Bay area. For management the opportuntiy to work on scope of projects you may not see else where is very alluring. Austin is a wonderful place to live.",
        "summary": "Go to make money and get out when you realize you are selling your soul.",
        "role": "Human Resources Manager.",
        "date": "Jun 20, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "difficult to be promoted and very limited learning and advancement. pressure",
        "advice": "managers should treat IC good",
        "pros": "dell pays well compare to other employers in austin",
        "summary": "time to get out",
        "role": "Engineer",
        "date": "Jun 20, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "1. A lot of people at Dell got hired in with the .com boom and they're still there because they can't find a job that pays as much outside. Needless to say, the reason they can't find a job outside is because they're not worth what they make.2. They expect you to be available 24/7.3. The most bureaucratic company I've ever worked for.4. If you are in IT, don't go there because they want to outsource all o… f it to India.5. You have to work odd hours to be able to talk to the rest of your team, which will be in India.6. Benefits are not that great and the stock purchase program is gone.7. The best way to get promoted is to brown nose your way to the top, not based on hard work or merit.",
        "advice": "1. Get rid of the people that are there because they have nowhere else to go. This might be you!2. People don't like to feel like you want to oursource their job, so either don't hire them or find a way to make them feel like the company actually wants them to work for Dell.3. Stop putting in hurdles to make it harder for people to do their job.4. Find a way to innovate and stop being a one trick pony.",
        "pros": "1. If you want to live in Austin and like working for a big corporation, Dell is one of the few big employers in Austin.2. Pay is average to good. It depends on where you are, but better than many smaller companies.3. They let you work from home.",
        "summary": "The wrong company to work for if you are an IT professional (programmer, SE, DBA, etc.)",
        "role": "Software Engineer IV",
        "date": "Jun 22, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is always a hiring freeze. The opportunities internally are nearly always valued less than if you are hired in off the street. The business is almost famous for \"renting\" talent. Just like customers receive try and buy eval units, the personnel are tried at half price for 6 months. Some eventually get their just due, others... not so much.",
        "advice": "Be equitable to your people. Start striving for a goal, not \"let's not pay more than the median for labor.\" Sure that is a goal, but it reeks of cheapness and avarice. Employee facilities are sub-par in Round Rock. Much time and effort has been spent fencing the campus, removing parking spaces for cars and generally rearranging the deck chairs.",
        "pros": "Strives to be meritocracy. Generally management at +1 level is not bad. The higher up you go. the worse it gets. There are people who have been installed at the VP and above level who are just not leading. Then there is the middle tier that is simply in the way. I suspect there are 2 complete levels of management that are entirely unnecessary.",
        "summary": "Too many processes, not enough results",
        "role": "Complex Systems Analyst",
        "date": "Jun 24, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Excessive internal competition and people don't share knowledge.",
        "advice": "Stop talking and work hard!",
        "pros": "The salary is ok and the benefits package is really good.",
        "summary": "Despite of bad senior managers we have to deal with, there are many valuable talents inside.",
        "role": "Software Developer",
        "date": "Jun 24, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Constant reorganization creates an environment where people are waiting for the next reorg before they contribute significantly. This results in lack of results. On any given day, you will find yourself in a conversation about the newest reorg rumors. These conversations quickly turn in the direction of \"I'm supposed to be working on X, but I'm waiting to see how the upcoming reorg is going to shake out.\" In other wo… rds, the reorgs become the excuse to stop performing for now. And since the reorgs never stop, those who are seeking an excuse to delay (and there are many) have no problems finding the excuse they seek.",
        "advice": "Stop reorganizing constantly and focus on holding people accountable to delivering results on time.",
        "pros": "Freedom to manage work/life balance and lack of micromanagement. However, this positive morphs into a negative: management chooses to simply trust that people will deliver and does not respond to warnings of people-related risks. Anyone raising a risk flag around people issues is viewed negatively, and management loves to shoot the messenger. People know all too well that management will not take definitive action no… r hold them accountable, and the result is the massive bureaucratic attitude that has taken over the company. If you want to work for a company where you can hide behind a lot of talk, then you will love working at Dell.",
        "summary": "Another day, another reorganization",
        "role": "Program Manager",
        "date": "Jun 26, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You never know when your head will be on the chopping block. Also, there are so many bone-headed rules in place and so much red tape; that make it hard to do the right thing.",
        "advice": "Be more receptive to feedback from your subordinates.",
        "pros": "The company is so large, it is relatively easy to expose yourself to a lot of different career paths.",
        "summary": "Hard to do the right thing when no one wants to be held accountable.",
        "role": "Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management. From executive down to team managers, they are all completely out of touch. The recruiting org defines the word \"ineffective\". Hiring managers will wait months or quarters for a requisition to get filled. Both Senior Management and Director level management will show you their lack of ability and competence on a daily basis.",
        "advice": "Please give more consideration to whom you promote into the D1 ranks. My colleagues and I had countless managers that had no idea how to manage, nor any understanding or experience in the field.",
        "pros": "Not many. It's a good brand-name for a resume, and has the ability to work on interesting projects. Not unlike many global companies, the scope of certain projects are much larger than you'll find elsewhere. Good benefits, good pay. Terrible management from the top on down.",
        "summary": "All levels of management have no idea what they're doing.",
        "role": "Consultant, Business Process / Management",
        "date": "Jun 30, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Shrinking benefits packages, upper management making an obscene amount of money in salary and bonus while we're either having layoffs or no pay raises for the individual contributors, lack of collaboration between groups",
        "advice": "Senior Management needs to really understand what it takes to lead people, not just making directives, but getting down in the trenches.",
        "pros": "One the the best reasons to work for Dell (in my position) has to be the flexible schedule and ability to have a voice in the group",
        "summary": "grind 'em up and spit 'em out!",
        "role": "Systems Engineer III",
        "date": "Jul 1, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The executive leadership team is completely disconnected from the employees. Over the last 5 years, benefits and compensation plans for customer-facing employees have been systematically eroded to reduce operating expenses, while at the same time we see unnecessary bonuses and spending on the top tiers of management. The tools we're provided to do our jobs are also notoriously bad and none of them are integrated or s… peak to each other. The HR department has segments on nearly continuous hiring freezes, preventing managers from hiring replacements for lost employees, and preventing employees from seeking out other jobs internally (career advancement). Quotas are abstract and completely unrelated to the accounts or business to which you are assigned, and are often unattainable.",
        "advice": "Come down and walk the rows. Try using our tools. Help us understand how we're expected to achieve your goals when we're understaffed, over-worked, and under paid.",
        "pros": "the benefits, most notable of which is the vacation which is available immediately, and the co-workers. In almost all cases, your immediate manager is a quality person who genuinely cares about you and wants to help you advance.",
        "summary": "Great place to work, if you're a VP",
        "role": "Inside Sales Representative IV",
        "date": "Jul 4, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Disfunctional work environment. They have a set of proposed conduct standards which are flagrantly dismissed and unobserved. The capability of lower and middle management is not as strong as it needs to be. A lack of developed management skills, plus an environment of advancement/recognition facilitated by the failures of others, results in a work environment for individual contributors that is uncertain, chaotic, an… d unpredictable. For managers, the environment makes success difficult in that managers below the Director level do not have much ownership of responsibility. Even when managers want to do something to make things better, they are not equipped or empowered to make it happen. In addition, management grooming and development activities at Dell are insufficient - you may find in your area that managers often come from 2 backgrounds: personal friends/associates of the area Director, or top performing individual contributors promoted into management as a \"career advancement\" (even thought they have no desire to manage people).",
        "advice": "Get a grip on the root causes of organizational breakdown, and take real action to correct them. The recent slate of executive departures was a positive step, but one of many needed. It was my experience that Dell has a predeliction for taking 1-2 big, flashy steps, then losing interest and faltering. This is the time for sustained change and organizational evolution - make sure the engine of change doesnt run out of…  fuel.",
        "pros": "Until a few years ago, you did get a decent amount of cash when you rolled up salary, bonus, and stock grants/options. You do get to work with technology, and the rate of technology adoption is not too slow in certain areas of the firm, so in terms of software engineering roles, you can work with fairly relevant technology and keep abreast of tool/technique developments.",
        "summary": "Dell faces serious organizational challenges",
        "role": "Senior Project Manager",
        "date": "Jul 13, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's a very political environment - not much of the meritocracy they claim. They are currently slashing pay to decrease opex and most everyone (at least in sales) is looking elsewhere. The customer service is horrible and that seems to be okay with mgmt. Morale is very low at this point. Not the company it was 5 years ago.",
        "advice": "Sales people get you paid as do the customers - treat them like it.",
        "pros": "Pay when the market is doing well. There are so many divisions anyone can find something they enjoy and transfer until they do. There is a lot of time off offered - if your manager doesn't make you feel guilty about it.",
        "summary": "Dell Stocks are up but morale is down",
        "role": "Inside Sales Representative",
        "date": "Jul 21, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The expectations tend to be unrealistically high and the pressure to perform beyond those expectations is enormous. Many people suffer from extreme stress and related health problems due to the high demands of the job. It's not unusual to work 60+ hours a week on a regular basis. The environment has become particularly tough since the latest round of layoffs started last year. Many benefits have been reduced or elimi… nated (like annual bonusses and the employee stock purchase plan) and a standard phrase you hear these days is \"If I'm still here... (when the project ends, etc.)\". The culture has really changed over the past few years and it's become an increasingly difficult place to work.",
        "advice": "I can only imagine how challenging it is to run a multi-billion dollar company, especially in these difficult economic times. However, I have to wonder if Senior Management is focussing on the right things. When I was an employee at Dell, there was a lot of talk about becoming a $60 billion company, and then an $80 billion dollar company, and I was never sure why these goals were set. What is the point of being an $8… 0 billion dollar company? I mean, isn't it more important to focus on the quality of the products you're producing and the way you treat the people who work for you and buy from you? I've seen many examples of companies who spent their energy on improving their products, their work environment, and their customer relations and the profits followed naturally. I would suggest the management at Dell consider this type of strategy if they truly want to be successful.",
        "pros": "For the most part, the people are really great and make working at Dell very enjoyable. Work/life balance is supported by most managers and, as long as you get your work done, you can pretty much come and go as you please (within reason of course). In addition, since Dell is such a large company with a global presence, there is a wide range of departments, jobs, and locations, so you have opportunities to not only in… teract with lots of different functions and cultures, but also to potentially work in different areas and locales. (Now, whether or not you're actually able to move to another department or location is a completely different story!)",
        "summary": "Dell is not for the faint of heart!",
        "role": "Product Manager",
        "date": "Jul 26, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "long hours, expected to do the work of at least 3 people in an expedient and exemplary manner. They pay 20% below the market rates. New manageer at least every year so no real time to build relationship, carreer plan. Job outsourcing, everyone I know walks in everyday thinking it might be their last. They are not only laying off the 'slackers' anymore, now it is anyone. Tons of knowledge loss as these layoffs have oc… cured. Sales is unhappy with compensation packages, and so a lot of sales people have 'jumped ship'.",
        "advice": "To revisit how they treat employees and what they expect from them vs. what they give them (the scale has tipped against the employee for quite some time now and I think Dell is suffering from the loss of some very good people).",
        "pros": "flexible work arrangements, extremely dynamic environment (this could be a negative as well though)",
        "summary": "Dell",
        "role": "Anonymous Employee",
        "date": "Aug 4, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Corporate Business Group job will kill you, unless you are given a great account set with an excellent AE who can bring in the big deals. Especially accounts that call you for every little issue and do not want to place orders online. That won't last though because quotas are unreasonable, they will make sure the next quarter's quota is out of reach.",
        "advice": "Corporate business is a huge part of Dell revenue, why treat it like a cash cow to support the other segments. Need to give more support to ISR's and reasonable account/work load and quotas.",
        "pros": "Benefits are above average, the Round Rock campus is convenient to get to and facilities are good.",
        "summary": "Unreasonable quotas and workloads",
        "role": "Inside Sales Representative",
        "date": "Aug 5, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very long work days--7AM to 10PM is very common (although not all in the office--they do let you take calls at home). Very little chance for advancement if you don't fit into their \"mold\" and aren't comfortable constantly promoting yourself to execs. Excelling at your job isn't enough to get ahead; you need to be extremely competitive (one might say \"cut-throat\") and be willing to advance on the backs of others. They…  had made some efforts at work-life balance a few years ago, but now with many of the formerly US-based jobs going overseas, you'll spend a majority of your time on conference calls, early morning and late night.",
        "advice": "Take more time to \"think outside the box\" with employees' skill sets and personalities, and you'll get a much more balanced work force and management team.",
        "pros": "Great learning experience; fast-paced atmosphere; global outlook. It offered me many opportunities for travel and learning about other cultures when working on various projects, which I would not have gotten in other companies. My team members in countries all around the globe were mostly fantastic, motivated, intelligent people who really care about their jobs. Dell also does pay more than most companies; however, y… ou'll spend so much time working, you won't have much time to spend the money! The benefits package is also excellent, with (I think) 4% 401K matching, and good health / vision / dental benefits as well.",
        "summary": "Don't work there if you want a personal life.",
        "role": "Project Manager III",
        "date": "Aug 7, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I found the leadership to be very arrogant. Based on its early successess, some of the old school employees felt like they knew best and were not open to new ideas. I also felt the shift from desktop to laptop computers made our jobs and operations less relevant.",
        "advice": "Treat your employees better. The pervasive cost cutting culture at Dell always had me worried about losing my job.",
        "pros": "Dell was an excellent launching pad for a career in operations or Supply Chain management. Having Dell on my resume has been a great introduction to other jobs. Also, Austin is an awesome place to live.",
        "summary": "Excellent place to launch career in Operations/Supply Chain Management",
        "role": "Project Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You are just a number in the world of Dell. Typical large corporate environment. Getting ahead means knowing someone who has your lip prints on their back side.",
        "advice": "Take a pay cut and get in touch with the people below you. Listen to them and don't pretend to be a member of the \"team\".",
        "pros": "Compensation, benefits, a revolving employment door is job security, warm bodies always needed",
        "summary": "Large company syndrome, a King and his servants",
        "role": "Technical Support Specialist",
        "date": "Aug 10, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Long hours and sometimes unreasonable work demands. They don't seem to care about family. For example, I once brought my 3-year-old in when my wife had an emergency at work, and they hassled me before I even swiped my badge. My manager even talked to me about it the next day and told me it was inappropriate.",
        "advice": "People are your best assets and should be treated with more respect.",
        "pros": "There are a lot of young, smart bright folks there with varied interests. If you have any kind of obscure hobby, you'll likely find someone who will want to play with you on the weekends. Also, the cafeteria is fantastic. I've been around the block a few times, and even the vending machine fare is changed out regularly and fresh.",
        "summary": "It's a great company to work for if you don't have a family.",
        "role": "Senior Development Consultant",
        "date": "Aug 20, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Sr. Management continues to make decisions that are hurting our customers and our stock price. Cutting back to the point that it feels futile to do anything.",
        "advice": "Get some better leadership and focus more on the customer and less on cutting costs.",
        "pros": "The benefits are very good. 5% 401k match, good health, vision and dental coverage. Depending on your manager you have great work/life balance and the vacation is very good the longer you work there. 8 yrs = 4 weeks of vacation plus holiday. The people I work with are very smart and driven and generate a good environment.",
        "summary": "Great benefits, but feels like we're headed in the wrong direction",
        "role": "Inside Sales Representative",
        "date": "Aug 29, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's a large company, and with that comes the inevitable corporate stupidity. Sometimes change seems to happen for no other reason than padding the resumes of executives. People at this company are addicted to e-mail and meetings. It seems like everyone's answer to any kind of problem is to hold a meeting with as many people as possible without regards to the applicability of that meeting to its attendees.The…  organizational structure of the company in a constant state of flux. It seems like there's a reorganization every quarter. The sad part is that my job is reminding me of Initech (from the movie Office Space) more and more each day. There are 7 different people in various levels of leadership positions on our team alone. This has resulted in some unfortunate situations for the average cubicle drone. There was one task our team was working on that we had to reaccomplish 3 separate times because different \"leaders\" on the team couldn't figure out what they wanted.There are days when an argument comes up about some process or task that makes you wonder about the place, since the problem should have been solved several years ago. Usually the argument is over which team should be responsible for a task, or how that team should accomplish that task. When I'm working on a new task or project, it sometimes feels like it has never been done before at Dell. One great quote I heard from a co-worker sums up this situation: \"Is it me or does it feel like Dell just started making computers a couple months ago?\"Keep in mind that everything I have listed here may not apply to everyone at Dell. Within engineering itself, I have heard that some groups definitely have a higer level of employee morale than others.",
        "advice": "Now that you've succeeded in improving our products, you need to turn your attention to employee morale and retention.",
        "pros": "The benefits are decent, even if some have been cut back recently (no more Employee Stock Purchase Plan). The salary seems competitive, although yearly raises aren't keeping up with inflation anymore. There is a fairly large variety of positions at this company and you have an opportunity to switch career fields if you want. There have been engineers that have switched to marketing, for example. This would be a good … place to work if you came here right out of college, but you might have some problems if you've worked somewhere else first.",
        "summary": "Decent pay and benefits, but you have to put up with being at a large company",
        "role": "Development Engineer",
        "date": "Aug 30, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "In the name of diversity and Work Life balance the company has been destroyed. Lot of incopetent females hired and promoted just because they are females. Lack of direction and drive of results among most team mates. Backstabbing work environment fostered by ranking and rating process leading to favouritism to females.",
        "advice": "Have a Drive for Results",
        "pros": "Immediate name recognition and large company environment. Explosive growth in the 90's.",
        "summary": "Dell's okay for making a living",
        "role": "Engineering Manager III",
        "date": "Sep 3, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "A lot of change for change sake vs well thought goals.I have never seen a company react in this reckless manner. Senior management expresses a desire and middle management implements change without any thought put into the process. Often times sub-groups of an organization are in direct conflict with each other.Current downsizing and \"selling off\" of company does not provide any sense of job security.… Employees are the first to be hacked away at when the investors are unhappy.Company does not re-invest in it's largest asset - it's employees.Business grows 3 times faster than head count. There is a saying amongst the lower ranks that Dell is one of the best at forcing attrition through miserable working conditions - no career pathing, no stability, high stress environment (90% of Dell employees on anti-anxiety prescriptions),lack of AC, outdated equipment, etc., etc.Far too many projects that are pushed as policy to pad a managers resume vs solving an actual problem.Real problems are rarely addressed in Dell's BPI process. Usually projects are implemented based on what the current senior management \"buzz\" happens to be at the time.",
        "advice": "Be honest - we are not stupid. Many communications feel like presidential speeches - just flat out lies.Spend some time in the trenches. Your middle managers are NOT effectively managing up. If you only knew.Start taking employee feedback more seriously, or don't ask. If you don't care, we can accept that, but when you \"demand\" feedback then sweep it under the rug, it's like a kick in the face.",
        "pros": "Work-Life balance is excellent.This is a great company to \"earn a living\" at. There is not much push from management, or drive from staff, to do anything outside of M-F 8 to 5. If you have hobbies and/or a family, this is tough to beat in terms of time.Benefits are decent (more expensive to employee each year).Good coverage with many \"customizable\" options. You can taylor a plan to your needs. It is c… ertainly expensive, but still cheaper than you could find on your own.Compensation is fair.Seems to be pretty much middle of the road. Have seen similar jobs for more $$ and for less $$. Other similar companies seem to pay about the same.Company has done a good job jumping on the green bandwagon with several new initiatives.Flexible Work Schedule - Plant a tree - Recycling programs - just to name a few.",
        "summary": "Comfortably numb",
        "role": "Services Account Manager",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "EVERYBODY I talked to was either seriuosly afraid of losing their job or would make half true/ half criptic humor about beign downsized at any time. It did not instil pride in your job or company loyalty if you think that any possbile failure might \"put you on the street.\"",
        "advice": "Management needs to communicate what changes needs to be made and for what reason as soon as they are know. Any delay on management's part cuts into the time that we engineers have to design, calculate, test etc. and you end up with a design that is not as robust.",
        "pros": "Trial by fire. If you make it here, then everywhere else you work will seem slow.",
        "summary": "Too fast, too furious. Seriously, everybody juggles everything.",
        "role": "Mechanical Engineer",
        "date": "Sep 11, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Since the company has not been doing well, employee morale is somewhat low. The company's management team is relatively young and as such it is difficult to come by promotions and opportunities in management. Networking plays a huge role in career progressions, not just merit alone.",
        "advice": "Get back to the basics - focus on execution. The culture of the organization needs to change back to its entrepreneurial roots with a sense of aggressive risk taking.",
        "pros": "Dell pays its employees well - at or above market most of the time. I have also seen that the organization is supportive of peoples' work-life balance needs. Dell is also a leader in its industry and as such affords work experiences that few other companies can provide.",
        "summary": "Significant challenges & opportunities ahead...",
        "role": "IT Architect",
        "date": "Oct 7, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Bureaucracy is prevalent - result of a company that grew very fast and then had to add processes to control the informationPolitics at managment levelDecision based on short term focus - lack of long term strategies",
        "advice": "Make bold decisions for long term success and need to stop reacting to competition and start getting ahead of them by investing in bold new products (accept possibilities of failure) and people - cannot survive on cost cutting - there is so much juice that can be taking out of a piece of lemon.",
        "pros": "Casual environment - reasonable work life balance - reasonably good pay",
        "summary": "Mechanical Engineer's view of life at Dell",
        "role": "Mechanical Engineering Advisor",
        "date": "Oct 21, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Compensation package has really gone down the tubes. Very unrealistic expectations coupled with severe penalties for not hitting are very demoralizing (anything under 90% means you loose a LARGE portion of your total compensation). Managers completely have their hands tied and can't do much to help their reps. Finally it's no fun anymore, people don't like coming to work.",
        "advice": "Quit the lip service and actually do something to make your employees feel special and want to work there.",
        "pros": "Dell is a good place to learn. There are so many people you can kinda hide out. You can find some great co-workers that will let you wallow in misery together. I'm trying to be constructive here, but it's not the same place I started working at over 5 years ago. At least in non-transactional sales you get a decent amount of time off for holidays.",
        "summary": "I used to like it here.",
        "role": "Account Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Very limited chance for advancement. Declining stock values. Limited sales growth prospects",
        "advice": "Figure out how to beat competitors. Value individual employees. Promote from within.",
        "pros": "Dell is a fast paced environment and a great place to learn about technology. It is also a forward thinking company on the environment. Almost everyone who works at Dell is knowledgable and hard working. Lazy and ineffective employees are generally terminated within a reasonable amount of time. Other companies seem to find experience working at Dell very valuable. Competitors and partners regularly hire away Dell emp… loyees.",
        "summary": "Limited opportunities for advancement and compensation at Dell.",
        "role": "Marketing Programs Senior Consultant",
        "date": "Oct 31, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Instability and constant threat of layoffs make it hard to get comfortable. With the high turnover, morale is down. If you are looking for involvement with actual software development it's not the place to be. The business sector is much more stable. With flattening of management layers, the opportunity for career advancement is extremely limited and now even more competitive. Recognition for job well done is absolut… ely there, but I'm guessing in part because of the economic downturn, monetary compensation is not there.",
        "advice": "None. I've had no issues really with senior management.",
        "pros": "Support for flexible work schedule. Management very supportive of working from home when need be. And the time off plan is the best I've seen. With the automatic week off for Christmas, and vacation is awarded at the beginning of the year instead of being earned. And as a whole, Dell pay the higher grades very well.",
        "summary": "Dell - Not the company it used to be",
        "role": "IT Dev Lead",
        "date": "Nov 12, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Promotions are based on office politics and not on merit. Promotions also can happen by seniority instead of people who actually deserve them.",
        "advice": "Senior management is good overall. No real complaints there. Middle management is another story. Most are not qualified and are only in the position based on time with the company.",
        "pros": "There is a friendly culture and most of the people are nice. There is no real formal dress code which is a plus. The benefits are on par for a mid size company, but not overwhelming. Compensation appears to be decent.",
        "summary": "This is a decent place to start your career, but do not expect a well thought out career path.",
        "role": "Inside Sales Representative",
        "date": "Nov 15, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is very little leadership and discipline within the company. It can be very frustrating to see so many people floundering about, when so much more could be accomplished with a little direction.",
        "advice": "Engage your people more. Let us know what you're thinking and lead.",
        "pros": "I've been allowed a lot of freedom to try new things. The company can be progressive in this way. Also, if you land in the right spot you can received above average compensation.",
        "summary": "Dell is great place to learn, but do not plan on making a career with this company. Get what you need an move on.",
        "role": "Senior Consultant",
        "date": "Nov 16, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The pace of work is extreme and the enterprise level tools are limited. You are on your own when it comes to finding solutions. Most of time, the right hand does not know what the left hand is doing.There is no \"management philosophy\"",
        "advice": "Get a global strategy and then follow it. The company seems to be floundering, trying to find its identity for the past few years, especially in the Services business.",
        "pros": "The pay is above average and the work atmosphere is good. Work-life effectiveness is a high priority. Getting time off for personal items is not hard. Feedback from managers is pretty good, at least twice a year (formally) and usually it is more frequent.New managers get a good orientation - once you have been there about 90 days. The orientation includes items like managing time off, employee feedback, writi… ng performance plans, etc.",
        "summary": "If you are looking to keep your sanity, stay away from Dell",
        "role": "Senior Operations Manager",
        "date": "Dec 2, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "DFS management just doesnt care about any of the employees. They announced a \"strategic assesment\" and let 200 (some core) employees leave. None of them realized that a sub-prime meltdown may not be the best time to see a financial services company. The middle management is constantly fighting for position. Senior management seems to think these people have value, but they really just get in the way. The company woul… d be far better off if the management allowed people to do their jobs and just backed them up when things were hectic.",
        "advice": "All the Senior Management needs to be let go. They are only there to collect huge paychecks and play golf on Fridays. Same as every other company, but it needs to change. My first two bosses cared a lot about employees. The last one could care less. Didn't even want to talk when I left the company.",
        "pros": "The people who work at Dell are top notch (senior management excluded). Dell also provides great work-life balance.",
        "summary": "DFS could be a good place to work if Senior Management were to be let go.",
        "role": "Risk Management Analyst",
        "date": "Dec 2, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The constant churn of re-organization and re-direction of strategy can be very tiresome, and breeds a culture of indecisiveness at times. Also, a person's experience at Dell is highly influenced by his/her direct management - having a poor manager can make one's life quite miserable, even in a successful department.",
        "advice": "Dell is quickly becoming a 2nd-tier player in the technology space, due to missed opportunities stemming from a inordinate reliance on the 'Direct Model', which no longer retains the advantages it once did. Recent developments involving in-store sales, ODMs, and acquisitions of other technology companies really appear to be too-little, too late. A dramatic change or acquisition/merger of a large, complementary player…  in the tech space (EMC) is needed.",
        "pros": "Working at Dell can expose you to leading-edge technologies faster than many other non-technology companies. Also, the company is continually re-inventing itself (sometimes for the worse) which may mean a constant refresh of skills, depending on the department and immediate management.",
        "summary": "The pony's one trick is getting rather old...",
        "role": "Anonymous Employee",
        "date": "Dec 18, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management, HR, Management, and HR.Total lack of ethics, morals, and truth-telling.",
        "advice": "You are not NEARLY as smart as you like to think. Common sense is so absent that it's become laughable.",
        "pros": "I can't think of any current good reasons to work there, right off the top of my head--even though I worked there a total of 9 years. Had I answered this question 10 years ago, I could have rattled off 20 good reasons without stopping to think. Enough said.",
        "summary": "Success led to blinding arrogance at this formerly great company.",
        "role": "Senior Project Manager",
        "date": "Dec 28, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Day to day management seems to always be in a crisis mode. Been at Dell less than three years and have experienced 2 major reorganizations, currently working for my 3rd director. Doesn't seem to be a consistent strategy that can be used to plan around and exectued",
        "advice": "Trust your front line managers.",
        "pros": "Big company with name recognition. For the technical folks, tremendous effort provided by the company to provide the best training available. For everyone else, it's a bit hit or miss.Benefits are average to good, salary and bonus tied together make the compensation competitive.Starting to finally realize who the competition is and that serious work is necessary to compete in the global market.",
        "summary": "Looking for the off ramp.",
        "role": "Tech Support Manager",
        "date": "Dec 28, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Nonstop nickel and diming of employees to save a buck in OPEX. Employees are clearly not valued and are treated as commodities. Very much still a TON of dead wood at Dell. People surround you that are happy to be ripping down a paycheck and doing whatever...there is no drive or passion with these folks because they just want to get a check, not interested in developing themselves or a career path other than the next … level to make more pay, be more secure, (because if you are a C3 or a D level employee, typically you are more protected) and get a bigger bonus.Culture of followers, no real innovation.",
        "advice": "Stop wasting money, making bad decisions and asking employees to cover for it. Stop looking between the cushions to save a buck and start from the top down reviewing glaring issues.",
        "pros": "401K program is pretty good. There are good people who work there.",
        "summary": "Dell- A place to go as a stepping stone or resume filler for your career.",
        "role": "Project Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Not much sense in career path development. Management changes constantly, each with different styles, on top of different priorities the company/group has at any time, from cutting head count to building revolutionary products. Constantly receive multiple and contradicting directions from different sources. Politics has been growing very strong. What's important is not what you do but how you present and how you are … perceived. Process is for the sake of having a process. People clash on one thing but leave big gap on another thing.",
        "advice": "Focus on one strategy. Really cut costs, not just in short term which will cost more in long run. Hire the best people.",
        "pros": "Fast pacing working environment with challenging issues. Forced to learn how to deal with constant changes and, ambiguities, make quick decisions with limited information, as well as manage multiple things in parallel. You learng to work hard.",
        "summary": "Lost",
        "role": "Senior Software Consultant",
        "date": "Jan 2, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Dell demands super human efforts from its employees, but only rewards those who are politically connected to senior management.",
        "advice": "Listen to customers and don't assume you know what they want or need. Look at alternatives to the same PC business as 10 years ago.",
        "pros": "Definitely learn on the job and prepares you for the trench warfare of business",
        "summary": "Dell's up and to the right expectations have blinded it to new ways and new markets until it was too late.",
        "role": "Systems Consultant",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There is Very slow vertical growth, slow, political and bereaucratic, not a great new hire program. There are too many re-organizations to stabilize and work productively. However, they are trying to reduce number of layoffs.",
        "advice": "Do not hire more and more new executives from outside and pay them millions. To hire new blood and give them more opportunities.",
        "pros": "Great for Work life balance, work from home facility, time for family, mutual respect, no pressure and chilled culture and environment. They have a good Volunteer separation package and good benefits and compensation in general. Easy to shift teams horizontally.",
        "summary": "Great for family people, not so much for new hires",
        "role": "Software Developer III",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No overall vision/strategy that is consistent over the long term. Also, a maniacal focus on whats wrong and focus on mistakes versus encouraging risk taking. company pays lip service to risk taking and diversity. In action neither are embraced. just look at the senior executive ranks over time for a proof point. Dell is also very inconsistent in promotion policies between different divisions from the junior to execut… ive ranks. If you are in the \"in\" crowd, it can be good. however, if you fall out, you are in deep trouble....",
        "advice": "be more transparent, particularly to middle management. and react quicker.",
        "pros": "Compensation commensurate with other high tech companies. Dell also offers opportunities to really change things and strike out on your own. However, there are downside risks to doing so with almost no upside.",
        "summary": "A once great company that has lost its way and can't seem to find it again....",
        "role": "Director, Engineering",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Dell does a poor job managing talent. When times are tight they freeze promotions which only hurts the highest performers. Massive pay packages used to lure top executives at odds with Dell's stated position of maintaining median pay for all employees and kills morale.There also is way too much complexity. People hide behind process instead of taking ownership of issues.",
        "advice": "Start developing talent within company. Managing employees like they're costs and doing everything to drive down those costs is not a way to win in the long-term. It used to be everyone had stock options so management threw out goals and if employees met them they became rich so the company could push people really hard the the strong performers responded. Now the stock grants are small and Dell cannot treat people p… oorly then push them and expect good results.Also narrow the product lines. 7 laptop brands is WAY too complicated. Think of the money wasted on development, production, and service for all those platforms.",
        "pros": "Great place to get diverse experience before leaving to work for a company that treats their employees better.",
        "summary": "Maybe the next CEO can turn it around...",
        "role": "Project Manager",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No career opportunitiesNo growth path - no development from withinConstant reorganizations leave no room for manager/employee relationship and reduce prospects of professional developmentToo aggressive when negotiating wage/salariesHuman capital is seen simply as a production input - \"everybody is expandable, anyone can do the job\"",
        "advice": "Find a way to promote more people or provide different growth paths. Put more focus on the people and their expectations",
        "pros": "Decent work/life balanceAustin TX is a great place to live",
        "summary": "100% disappointment",
        "role": "Senior Brand Manager",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Managing the organization is extremely difficult. Little opportunity for advancement and rewards not tied to merit. There is an extreme lack of long term planning and strategy.",
        "advice": "Provide a clear vision and lead.",
        "pros": "Ability to move laterally into new fields and have the opportunity to follow new career paths. Employees can move into just about any area without previous experience so long as they prove themselves to be capable and high performers. This is great to explore new areas, develop skills, and fill gaps but does provide very little depth of experience throughout the organization.",
        "summary": "Need clear vision and leadership.",
        "role": "Marketing Manager",
        "date": "Jan 6, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No clear guidance from leadership. No challenge. Too much bureaucracy. Extremely siloed company. No camaraderie. No rewards for taking risks.",
        "advice": "Stop treating employees like boxes on a chart. Give back power to middle and lower management. Reward risk taking and people managers.Make it fun again.Prepare a long term plan for the company and stick with it. Stop reorganizing the company evey year. An old joke at Dell is: Everytime the announce another re-org I don't do anything. If I wait long enough things will the exactly the same they are right now...…",
        "pros": "Good place to learn! It has the potential to return to what it once was.",
        "summary": "The Dell of old is dead! What a shame, I miss the \"Old Dell\".",
        "role": "Finance Manager",
        "date": "Jan 8, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Dell grew very fast and was the darling of The Street. The growth was so fast and little attention or investment in systems or processes that as the company grew it needed more and more people to complete simple processes because they were manually intensive. The lack of IT and process design, as well as limited investment in packaged software leaves Dell with island of IT automation which makes work extra cumbersome…  and processes subject to breaking",
        "advice": "realize you're a big business and you need to implement big business IT tools and business processes",
        "pros": "Name reputation and experience with mega-large company. It's had a great legacy and continues to offer good, solid products. There is a a continued focus on being the lowest cost provider which helps win/maintain market share. The customer facing side of Dell's sales group is great, support is catching up and overall customers are pretty happy",
        "summary": "Living Chaos",
        "role": "Senior Manager",
        "date": "Jan 9, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management is completely disconnected from the real problems, and issues within the company. The continual atmospere of cost cutting and job loss as completely killed all communication between IC and Manager. This means uninformed best guess decision making is taking place all throughout the company, and one bad decision after another is coming down the pipe. This happens in day to day work, and in senior ELT decisio… ns. The entire communication chain is broken down.",
        "advice": "Layoff and be done. Restore trust between leadership and worker.",
        "pros": "Compensation is awesome. Dell does a lot to work to retain talent and keep employees fairly compensated. Dell also is a very progressive company with respect to technology, so working in IT is an awesome place to learn new technology and be on the cutting edge.",
        "summary": "Communication is broken inside the company.",
        "role": "Global Network Engineering Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "culture - Alot of focus on self-promotion with less focus on results",
        "advice": "Learn about their business and their competency. Business should not be run by a series of decisions based on gut-feel or opinion.",
        "pros": "pay and location (Austin, TX)",
        "summary": "Dell - Pays well in Austin, if that's what's important to you...",
        "role": "E-Business Senior Consultant",
        "date": "Jan 13, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Dell has done a great job of attracting a lot of smart, talented people but the work isn't the most intellectually demanding. The biggest challenge comes from navigating the big organization and getting the work done, rather than deep thinking or strategy. Dell also always seems to be in a stat of flux. Reorganizations are routine and information/communication isn't always the best.",
        "advice": "Determine what Dell wants to be and lock down on that strategy and execute it flawlessly. Stay the course and give it a chance to take hold and produce results. Adopt and embrace innovation. Simplify the way you sell - people want innovation not necessarily customization.",
        "pros": "Dell offers the chance to work on a well known brand and global reach. Compensation is pretty competitive and the Austin area is a nice place to live. Products are interesting and the space is dynamic",
        "summary": "Great brand that needs to go to rehab",
        "role": "Senior Consultant",
        "date": "Jan 16, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The cancerous decisions being made at many levels of management are causing issues that will take a complete reversal of these decisions to resolve/remedy. Bad news is, Dell continues to be as arrogant as in the past when it was rampantly successful and can't plan for success in the future. There is a tremendous amount of talent in this company that can make almost anything happen and Dell's success needs to be drive… n from within (grass roots)...not from above.",
        "advice": "Please look to your people for guidance. Not your senior management team, but down, down at the IC level. Most of the people at this level have been with the company for many years, created some of the best products in the industry and can continue to make this company successful if you will let them. You have some of the best engineers in the industry, let them show you what they are made of; you will like the resul… ts.",
        "pros": "Dell is absolutely a great place to learn and grow as a professional...really fun products to work on.",
        "summary": "Dell Engineering is the best in the Industry, but the fruit is rotting on the vine.",
        "role": "Senior Development Engineer",
        "date": "Jan 18, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lack of vision, leadership brought in from outside many times. Motivation to go above and beyond is now lacking.Internal mobility has been recently stifled, yet for some reason external hiring in some areas continues. The company is a good 5 years behind the curve in terms of employee tools and systems (phones, VPN, remote tools, teleconferencing and video conferencing, SIP services, etc).",
        "advice": "Take care to recognize and reward existing employees for a job well done. Halting promotions from within and only bringing in folks from the outside can be demotivating.",
        "pros": "Exposure to new products and technology, diverse backgrounds of folks you work with. Dell has made some good strides on internal communication through intranet and blogs - quite unique versus other companies. While currently in question, the bonus and stock structure is competitive or better.",
        "summary": "The long term vision and strategy is not obvious - it recently appears as though we only manage quarter to quarter.",
        "role": "Product Marketing Manager",
        "date": "Jan 22, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Very small benefits package, very poor 401k, no stock options or stock purchase plans for big majority. Employee recognitions are not always done fairly. Grade levels and projects do not match necessarily, a senior employee might be working on a project that a junior one may do as good.",
        "advice": "Employee evaluations should not be only performed by the managers. Too much dependency on what your manager thinks of you, rather peer feedback should be taken into consideration.",
        "pros": "Being in Texas brings benefits such as being able to live a better life than someone that is earning 50% more in another state. Thanks to lower real estate prices, taxes and less traffic stress.",
        "summary": "not a bad place",
        "role": "Software Engineer",
        "date": "Feb 3, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Management, environment, community, middle managers especially, life work balance, travel, managers with poor people skills that have no business being a manager, in services especially the people making the decisions clearly have no idea how to manager a technical group let alone a technical product. Dell needs to get out of the assembly line mentality, and bring in managers that understand technical environments, a… nd technical resources if they ever hope to be an industry leader in Dell IT Managed services. Furthermore the longer the middle managers are allowed to hamper development and innovation, the further Dell will slide as a whole in the IT Services industry.",
        "advice": "clean house of middle management.",
        "pros": "At one time I believed that a large company with a good reputation would be a great place to work. However after 2 years at Dell I have realized that just like every other company that the environment is only as good as the manager. In my case I have an angry, manipulative , egotistical, condesending manager that constantly hands out thinly veiled threats at the drop of a hat because he consistently over steps his bo… unds, and his managers call him out on it.. To top it off he over promises and then under delivers, which makes for a very hostile working environment to say the least.",
        "summary": "Dell a big let down",
        "role": "Services Consultant",
        "date": "Feb 12, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "outsourcing is rampant. No one is safe and everyone working there should be looking for a job elsewhere.",
        "advice": "Choose a direction and focus; running in so many directions is costly and distracting.",
        "pros": "Largest employer in central TX; one of the higher paying employers in the area.",
        "summary": "Dell Will Outsource Your Job",
        "role": "Development Manager",
        "date": "Feb 20, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The over emphasis on certification on our own time and our own dime. There were a lot of paper MCSEs there who had not common sense when it came to troubleshooting hardware.",
        "advice": "If you want us certified, don't expect us to be working sixty hours a week. Stop taking away lunch breaks. If you are going to take away lunch breaks and feed us junk food, skip the lectures on how unhealthy we are living.",
        "pros": "Second shift differential. Unfortunately, management seemed to think it didn't matter that you were getting a pay cut if they decided to move you to first shift because they needed more experienced techs on that shift.",
        "summary": "Dell Should Regard Front Line Techs as Asset Generators Instead of Budget Drain",
        "role": "Technical Support Specialist",
        "date": "Feb 20, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "NO LOYALTY. No career advancement. No Innovation Communication is always left me in the dark. Dont know what is happening until after it starts or finishes.If you like ambiguity and constant change you will succeed.",
        "advice": "Quit trying to capitalize on trends that have already been done. Look at technology to create a new trend. Quite pushing manufacturing and support out of the country to save a few cents per box.",
        "pros": "Pay and benefits. Use to be you had since of belonging and being a part of something. No it is a cut throat job where everyone is out to protect their own self interest.",
        "summary": "To work at Dell you must give up alot...",
        "role": "Project Manager",
        "date": "Feb 27, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Dell is very transactional. The Dell business model is closely tied to a 90 day/Quarterly measurement period so if you are a strategic and big picture thinker you may become frustrated working at Dell. Management is typically promoted from within and the company does not put much emphasis on training/development so the new managers really struggle with understanding the basic skills of a good manager.",
        "advice": "Improve the training provided to all levels of management, but especially focus on the new managers so that they can develop to a level that will help the company overall.",
        "pros": "High tech industry allows you to get exposure to a unique business model . The primary focus of online custom orders for computers is something that you don't typically see in the high tech industry.",
        "summary": "90 day transactional business model is not the place for strategic minds.",
        "role": "Strategic Alliance Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Right now Dell upper management has no clue what they're doing. They seem to be living in their own castle up in the clouds somewhere, and have no sense of the ground realities. Many times information gets filtered up to them by the lower level execs and it seems that the upper management is not being presented with a clear picture about what actually is going on. Numbers are made up by Directors to present to VPs an… d so on and so forth. The benefits are being cut every quarter which effectively means a reduction in compensation. Job growth is not happening. People are stuck in their roles because of hiring freezes, and there is just no clear path to career development",
        "advice": "Listen to employees at the ground levels, not to your possy of lower level execs. If you need to layoff people, just go ahead and do it, rather than have a sword hanging over their necks all the time",
        "pros": "Good work life balance, Austin is a great city to live in. Not much of a commute to work for most people.",
        "summary": "Dell needs a new experienced CEO that can take this large corporation and turn it around",
        "role": "Marketing Manager",
        "date": "Mar 3, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too much focus on cost reduction. Understaffed, over-worked. Weak IT infrastructure hinders many customer experience efforts. Typical corporate environment does not foster creativity. Layoffs nearly every year. Typical bureaucratic hurdles and absolutely horrible on-line tools. Intranet site is the worst I've ever seen. Impossible to find any information, but easy to waste an hour trying.",
        "advice": "Share your strategy with the rest of us. We don't know where we are going or why. Advertise our products! Twitter is no substute for a real Marketing campaign. We can't compete in the current market by using the same tactics that got us here. We will not succeed by competing on price alone.",
        "pros": "Good compensation, leadership opportunities, few boundaries. You rarely hear someone say, \"That's not your job.\" Young, energetic work-force. Fast-paced environment. You will never be bored if you work here.",
        "summary": "Great place for workaholics.",
        "role": "Senior Usability Engineer",
        "date": "Mar 17, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Job security is nil. As an employee you need to navigate the mine field to avoid layoffs, outsourcing, and the ongoing migration of jobs to low cost locations. Rolling layoffs are a way of life - in any given week there are layoffs somewhere at Dell.",
        "advice": "There needs to be a better way. Respect and loyalty are as low as I have ever seen. As the stock option and bonus bonanza dries up and the job market improves Dell may find it difficult to find good employees. Everyone working at Dell knows (and sees) that no one at Dell is ever \"safe\" regardless of who you are or what you do. Change the environment - it will backfire at some point.",
        "pros": "Pay - until recently. Understandably bonus and stock option reductions have taken a toll this past year threatening the only positive left at this company.",
        "summary": "Employee friendly doe snot apply here",
        "role": "Quality Engineer",
        "date": "Mar 22, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Dell is a good place to work for the first 2 years as a salesperson, especially if you start off in a transactional environment. I made almost 3x my TTC my first year due to overattainment and spiffs. Awesome, right? The problem is that when you move up, it's referred to as a \"Dellmotion\" - i.e. you get more responsibility but make less money. Ask any sales employee and they will agree. It's happened every year i've … been there - \"higher position = less money\"",
        "advice": "Pay your more senior sales reps better than you paid them when they were \"baby\" reps. You'll have a lot happier salesforce, and through that, better sales.",
        "pros": "The cafeteria is really good. The people tend to be very nice and friendly to hang out with. Austin is a great town to live in.",
        "summary": "Dell - Work there for 2 years max!",
        "role": "Technical Sales Representative",
        "date": "Apr 9, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No work life balance, even though upper management loves to speak of its existence. It is all about who you know and whos behind you are willing to kiss. You rarely get praise for a good deed but will sure hear about a mistake made...management knows nothing of what is done and how to get the job done but love to come up with ways to \"streamline\" work so it gets done faster..which makes for more mistakes.",
        "advice": "Listen to the people who are doing the actual work because sometimes they are the ones who have great ideas that make sense for the company...stop making business decisions that make no sense..these only put your employees with more work, less time with family and a huge backlog while they are attempting to do things your way..only to have to change back to the former but with a huge backlog due to your failing idea.… ...",
        "pros": "Great pay, great people you can become friends with and add to your work references.",
        "summary": "work life balance is not only a joke but you are not even allowed to smoke....",
        "role": "Customer Support",
        "date": "May 4, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Dell is losing in the marketplace, losing market share and shrinking revenue. I question the long term path that the company is on.Morale is amazingly low, no one is sure if they will have a job next week, so there is a lot of employees doing the minimum amount to get by.",
        "advice": "Get out of your comfort zone and take some chances. Get layoffs done with, instead of constantly holding them over employees heads.",
        "pros": "Big, well-known company that looks good on a resume. Decent job of providing work and life balance in the majority of roles, but some roles require extensive overtime.",
        "summary": "Dell - If you really need a good resume filler",
        "role": "Finance Consultant",
        "date": "May 15, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No respect for employeesLimited work/life balanceWeird attitude among management that Dell is best company on the planet",
        "advice": "Be more humble, Dell's business results and brain drain over last few years show that Dell is not that great",
        "pros": "Opportunities for varietyGreat name on the resumeGreat salary bump when you leaveSome talented people",
        "summary": "No respect for employees",
        "role": "Senior Marketing Manager",
        "date": "Jun 16, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "In sales, they are extremely quota driven and nothing else matters but hitting the number. Internal promotions are nothing more than lateral moves where you do the same job with different people in another cubical, with a different title, VAR, SMB, 08,05, etc.. If you come into sales, you are therefore forever stuck in sales, regardless of your degree (BA, BS, MBA, ETC.) or skills. If you love sales and never want to…  do anything else but sales, then go for it. Dell is the perfect place for you :).",
        "advice": "Stop treating your employees like mules, offer REAL promotions and allow individuals to use their knowledge, skills, and abilities in other areas besides sales. Anyone can train someone to sale a computer. Don't waste top tier talent on stupid things such as selling desktops, mice, and no margin vostro laptops to \"I want something for nothing\" clients/accounts. This will keep this talent from leaving to join other co… mpanies.",
        "pros": "Dell pays well for the work that you do. Teamwork driven (if you are in a team division) and bonuses can be very lucrative if you over achieve your quota. However, be aware of the \"Dell payback\". If you are in a division where they pay you on a draw (in advance) and you do not hit your quota, you will have to pay dell back a portion of the money they gave you for the month, this amount can vary. If you are interviewi… ng, ask about this and make sure you CLEARLY understand it.",
        "summary": "Good money but no room for serious advancement...",
        "role": "VAR Sales Associate",
        "date": "Jun 28, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is little job growth prospects. Everyone is afraid to lose their jobs and works very hard to show they are better than the rest. There is chaos and confusion due to continual re-orgs. The management treats employees as expendable. Its very hard to break the glass ceiling unless you are one of the chosen few. There is poor process and project management. The decision makers switch their strategy from guard rail … to guard rail depending on the quarterly analyst review. Every department is being monitored by high paying consultants from Mckinsey , Bain and Accenture. Their half assed recommendations are implemented and then undone when the system breaks. It's a nightmare to work for Dell.",
        "advice": "1. Invest in IT systems and resources2. Develop a growth strategy that does not change every week and once decided commit sufficient resources to see it through3. Ban consultants from entering the company, instead LISTEN ( different from HEAR) to what the employees have to suggest and implement4. Freeze org changes for the next 5 years",
        "pros": "1. Open door policy,2. Easy to move across the organization,3. Its great for networking with people from multiple fortune 500 companies4. Salary may be reasonable but bonuses are very good",
        "summary": "A poorly run company",
        "role": "Project Manager",
        "date": "Jul 15, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Treatment of people is the worst - this is what most people say who came to Dell from other companies",
        "advice": "When the layoffs began the culture turned into one of fear (beyond the normal economic fears), the motivating employees by punishment, management by focusing on improving weaknesses is a mistake, and making the company compete ruthlessly internally and not against external competitors is another mistake",
        "pros": "Good reputation in the industry, talented peers, large and well known technologies, interesting projects at times large scale of work, good pay, good benefits, good time off",
        "summary": "Dell must pay a bit more to get and keep talented people. It's not enough - the best leave anyways.",
        "role": "Senior Project Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Company is falling behind the market due to many re-organizations. has no strategy, and lacks the Consumer electronics products to stimulate the sale of its computers. In addition people work in a continuous fear to be fired and it seems that most of the people who work there - it was their last choice.",
        "advice": "better define the work groups and the relationships between them to prevent work duplication and increase efficiency. create strategy and long term planning teams so the market would not be X years before you. stop firing and hiring on a quarterly basis",
        "pros": "it is on of a few computer manufacturers in the US, Austin is a nice place to live in",
        "summary": "Consumer marketing at dell",
        "role": "Marketing Analyst",
        "date": "Jul 27, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Initially, the pay was excellent. I was a top producer and regularly took home some very serious cash. Then, the company started using a \"team\" system, which rewarded those at the bottom and helped the company cut the salaries of those at the top. Also, the company has no problem with working its employees 70 hours a week sometimes. This overtime usually comes with little warning.",
        "advice": "The corporate culture at Dell is based more on fear and less on potential. Despite all their attempts to seem like a progressive company, they still operate with the same principle they've always had: that their employees are as expendable as a sheet of paper. Very old-school Republican attitude and part of the reason their stock sells for about one-tenth what Apple stock sells for. Too bad.",
        "pros": "Lots of young people (in sales.) Fun atmosphere, lots of giveaways via contests (computers, money, etc.) Great work site, with state-of-the-art gym and world-class cuisine at the cafeteria.",
        "summary": "Works You Into the Ground, Steps on your Grave",
        "role": "Sales Associate, Phone Sales",
        "date": "Jul 28, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- lots of ambiguity, difficult to get info you need to do your job- most projects employ backwards scheduling, scarce resources- difficult communications dealing with a WW organization- not much loyalty to US employees- work/life balance is out of whack",
        "advice": "-value US employees, focus on longer term rather than changing directions on a dime only to be abandoned for the next \"big thing\".",
        "pros": "- good pay, benefits- fast paced challenging environment",
        "summary": "Project manager / SW development environment",
        "role": "Project Manager",
        "date": "Jul 30, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lack of drive in many divisions. Excessive outsourcing for many functions cripples productivity. Completely ineffective IT support. Obsessive focus on cost cutting is penny wise and pound foolish.",
        "advice": "Lack of innovation and real investment in new products has resulted in a product lineup that is uncompetitive and weak. Excessive leveraging of ODM's has given Dell no competitive advantage - working for Dell feels like being on the Titanic. The ship is sinking, but it's big enough that it will take a while.",
        "pros": "10-5'ers dream come true - plenty of room for work-life balance. Little oversight and no hard deadlines make for a low pressure work environment.",
        "summary": "Tech industry equivalent of GM",
        "role": "Anonymous Employee",
        "date": "Aug 28, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Below-standard salaries, overworking employees, no work-life balance, little recognition for employee efforts, total lack of regard for customer needs/wants, complete lack of job stability, promoting competition between employees - rather than promoting cooperation (fortunately, most folks do cooperate with each other)",
        "advice": "Promote cooperation, rather than competition between employees. Bring jobs back to the US that support the US - hire Indians to support Indians and Chinese to support Chinese - your customers and employees will be MUCH happier. Stop timing technicians - people call because they want help, not a timed response. Dell used to be known for customer support - you know that's not true anymore. Stop overworking the employee… s you have left - especially when it's not really needed. Pay at least scale wages - if someone has 12 years of experience, pay them for it!",
        "pros": "Quality of people - smart, helpful - have made many close friends at Dell; support from coworkers; never boring; excellent anti-discrimination policies; decent benefits that cover not only \"legal\" families, but same and opposite sex live-in partners as well",
        "summary": "The good, the bad, and a whole lotta ugly",
        "role": "Technical Writer",
        "date": "Sep 9, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Dell makes their employees feel like just \"a number\". You are not a person, just a headcount. Very \"good ole' boy\" environment. You have to fit yourself into the Dell mold in order to be successful.",
        "advice": "Figure out who you really are (Dell), what you're selling, and where you really fit. Then, focus on a smaller scope of products/services and make them better than everyone elses.",
        "pros": "The people, the experience you receive, the ability to move up if you are a top performer",
        "summary": "\"Good Ole' Boy\" Company",
        "role": "Anonymous Employee",
        "date": "Sep 10, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Its not very inspiring place to work. I have an idea is a phrase sure to fall on deaf ears. The most important thing to learn is how to do things at Dell. Meetings, meetings, meetings consist of information exchanges- And the smallest things can take eons. Theres a vague conception that decisions should be based on data but more often than not actions and success are judged on the capricious whims of executives that … you rarely see but who's names loom large. The place is middle heavy, very silo'd and the territory grabs are the greatest impetus to break the organizational inertia.Everyone is \"swamped\" and works hard right til 5 but nothing gets done.Powerpoint.Advancement is based on the ability to politic",
        "advice": "Clear stated vision, fewer reorgs, less process but more definition of success. A training program that teaches enough tools so that people don't have to reinvent the wheel but does inhibit creativity.",
        "pros": "Dell has pretty good pay for Austin and when you take into account benefits its tough to beat. Worklife balance is nice, the people are friendly.The newest",
        "summary": "Trade offs",
        "role": "Project Manager",
        "date": "Oct 7, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Senior leadership seems fragmented in regards to the future direction of the company which results in unnecessary churn at the sales level - both for the sales teams as well as the customers they serve.",
        "advice": "Put together a strategy that is long term in focus rather than attempting to achieve goals within 90 day windows.",
        "pros": "Dell offers competitive compensation and benefits packages and a relatively secure sense of job security for those who perform.",
        "summary": "Lack of Continuity at Executive Level",
        "role": "Anonymous Employee",
        "date": "Oct 25, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lack of promotions for several years is paralyzing. Additionally false costs loaded in system make people feel like they are never winning.",
        "advice": "Use some of the cash reserves to reward and promote people, or there will be mass exits when the economy gets better.",
        "pros": "Like the fast paced environment and quality of team members",
        "summary": "People Don't Matter Much",
        "role": "Senior Marketing Manager",
        "date": "Nov 16, 2009",
        "is_current": true
    }
]