[
    {
        "rating": 4,
        "cons": "This is too much bureaucracy.",
        "advice": "Keep employees more informed on corporate strategy",
        "pros": "The Professionalism level was very high, The benefits were great.",
        "summary": "Dell is an excellent place to work",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "a bit of a click, tend to look down on outsiders.",
        "advice": "Wish they were more open about layoffs and freezes.",
        "pros": "Fair and ethical, performance oriented",
        "summary": "How was Dell?",
        "role": "Talent Acquisition",
        "date": "Nov 26, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Same Cons of working in a big company. HR and Benifits.",
        "advice": null,
        "pros": "Great place, great people, great culture",
        "summary": "Great workplace and great culture.",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "unjust performance reviews is causing a lot of employees to leave.",
        "advice": "keep up the lousy vision for a great company and you will lose all great talent to HP and be considered a mediocre company in the next 5 years.",
        "pros": "There is a great work/life balance",
        "summary": "great company",
        "role": "Anonymous Employee",
        "date": "Dec 6, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Benefits could be better for large company",
        "advice": "communication",
        "pros": "Opportunities to grow within the company are vast.",
        "summary": "Good",
        "role": "Technical Manager",
        "date": "Dec 8, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Aggressive cost cutting measures may hurt morale",
        "advice": "Keep making smart acquisitions in software and services!",
        "pros": "Great pay & great work/life balance",
        "summary": "Great opportunities for employees with skills to transform business",
        "role": "Anonymous Employee",
        "date": "Dec 11, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Little credit for great work or innovation. Almost all innovation is through acquisitions. Internals groups have opposing goals. Employees know if they're on or off 'promotion list.'",
        "advice": "Encourage more movement throughout the organization. Stop having people sit in the same position too long.",
        "pros": "Access to working on large projects that impact many people. Travel is great when available. Great passion for winning.",
        "summary": "Like Playing Russian Roullete Each Quarter",
        "role": "Senior Product Manager",
        "date": "Dec 31, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- promotions are hard to come by, pay increases are almost extinct, benefits seem to be getting a bit more stringent, hard to get sign off on any training or education benefits",
        "advice": "Work to develop and educate your employees, listen and provide guidance and opportunities to move within vs. losing valuable employees to other employers",
        "pros": "- great pay, work/home life balance",
        "summary": "Great Pay, Growth is based on Employee/Manager Relationship",
        "role": "Solultions Architect",
        "date": "Jan 5, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Many organizational changes in a very short time.",
        "advice": "More 1on1 and feedback.",
        "pros": "Personal development tools and work environment.",
        "summary": "Excellent Professional and Personal development (career path)",
        "role": "Senior Business Analyst",
        "date": "Jan 24, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Customer is number 1, but so is money number one and so is perception number 1. which causes one to question what he should do, because no matter what, it can percieved as bad for the company.",
        "advice": "Stop sending directives that contradict one another. You say you want feedback, but reject 98% of it and make your own decisions. You want the customer to be #1, but in my realm, the Cost to make the customer number 1 is way too costly, therefore we have to deny our customers their paid service sla's to save a few bucks.",
        "pros": "Customer is number 1, and people are nice to work with. They are flexible with your work schedule, but then give you 60 hours of work to make up for the flexibility.",
        "summary": "Enjoyable people, but down to business with no fun/excitement in job",
        "role": "Senior Planning Analyst",
        "date": "Feb 9, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell is a really big corporation and with that comes a lot of bureaucratic requirements that seem a bit redundant.",
        "advice": null,
        "pros": "Dell has jobs all over the globe and promotes hiring from within.Management works with employees to help them get to the jobs they want to do.",
        "summary": "Room for growth and good benefits",
        "role": "Software Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Constant change of territories, management and support organizations",
        "advice": "Execution on transformation. Find the right business model and build to it. Continue to invest in core competencies (ie Client and Enterprise development) Don't become distracted from our Brand and the quality for which we are best recognized.",
        "pros": "Dell is undergoing transformation as a hardware provider to a solutions based company. Key to this change is smart acquisition and integration of new solutions which Dell has excelled at. Smooth integration and a challenging work environment keeps successful AE's on their toes with constant learning. Quotas are generally fair and achievable.",
        "summary": "Great company in a dynamic industry",
        "role": "Account Executive",
        "date": "Feb 25, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "software interface / tools are poorly designedExpectation of remembering hundreds of details",
        "advice": "Internal processes need to to be streamlined., Tools are far too complexUnable to remember all of the policies we are expected to recall while on the phone.",
        "pros": "Stable environmentBetter than average pay for region",
        "summary": "Better than avg corporate environment, low strees, good opportunities",
        "role": "Tech Support",
        "date": "Mar 7, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Company management seems lost- Very few career growth opportunities once you reach mid-levels- Will lay you off at a drop of the dime in this economy",
        "advice": "- More loyalty to your employees would be nice.- More opportunities needed at mid-levels",
        "pros": "- Great Benefits and salary- Solid Company- Not afraid to try new technologies- Good severance packages",
        "summary": "Good with the Bad",
        "role": "Applications Management Analyst",
        "date": "Mar 28, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Slow.... Everybody is allowed to say no",
        "advice": "Make folks accountable",
        "pros": "Fun, great technology to play with",
        "summary": "Fun - But slow",
        "role": "Anonymous Employee",
        "date": "Mar 31, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very large company. Their mid-management is not very strong.",
        "advice": null,
        "pros": "Dell is really trying to grow their services group, there are growth opportunities at Dell Services.",
        "summary": "Good",
        "role": "Network Engineer",
        "date": "Apr 5, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Often promotions do not go to the best individual, but this does not mean good people are not promoted. You just may have to wait awhile for your promo to come.Dell is a great place for the young. However, you need to be prepared for lay-offs as you get older. This could be because the older individuals are paid more. After nearly eight years, and two promotions I was laid-off. I was told my position was bein… g terminated, and I was given two weeks to find another position within Dell. Strangely, the other manager that took over my team was male and 20 years younger. Additionally, this manager only had six months management experience compared to my 20 years experience. I was among six people laid-off in my division, all of which were over 40 years of age.",
        "advice": "Dell is very community minded, and encourages their people to volunteer within their community. I would like Dell to drink the kool-aid as well, and think of their staff as a community. In my mind, Dell needs to focus on making employment at Dell more secure for their people, and showing their staff they really care about them.Understanding the need for cutbacks, it seems to me Dell could do a better job of m… oving resources, instead of laying individuals off. This would actually result in even greater savings for Dell; since, there would be very little need for termination packages.I know when I was laid-off, there were many positions that fit my background, but getting an opportunity for an interview was nearly impossible within 15 days.Bottom-line, should there be a performance issue, Dell does need to terminate employment. However, when there is not a performance issue, doesn’t it make sense to simply move your resources from one group to another groups to fill open positions? Dell could really make a difference, and take the lead in this new way of dealing with cutting back to same money.I am just saying…",
        "pros": "Dell pays well, you get to work with some very bright people. Dell does invest in their people, and does try to promote from within.",
        "summary": "Age seems to be an issue at Dell. The older you get the more likely you will be laid-off",
        "role": "Tech Support Senior Manager",
        "date": "Apr 22, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Transparency is an issue.There is no clear cut answer.Some of the Policies are misleading. But it is a good company",
        "advice": null,
        "pros": "opportunity are endless.You have to prove yourself.If you want to improve your Communication skill then this is right choice.",
        "summary": "A good company to work for",
        "role": "Software Developer",
        "date": "Apr 27, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Tough environment with high speed shifts in workload, lots of typical government hurry up and waitDell executive management started cutting heads without regard to lost talent or the value of their contributions. Simple head count cuts. Dell lost the contract due to this.",
        "advice": "This advice is to executive leadership. Listen to your contract managers. Their job is to make you money, they know who is worth more or less for each dollar spent.",
        "pros": "Professional environment, but still friendlycompetitive salary for the regionrecognition for growth efforts",
        "summary": "Was a great place to work until they started cutting heads.",
        "role": "Project Manager",
        "date": "May 3, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "We worked a lot of 7 days a week without a day off. Constantly running out of parts for assembly. The company built a brand new state of the art facility and closed it in 5 years. This disrupted a lot of peoples lives after all the commitment we made with company.",
        "advice": "The company has very talented people with in the company. Don't sell out to Contract Manufacturing in other countries who cares nothing about your product on a personal level.",
        "pros": "Everyone worked as a team when it came to quality and production. We had a new state of art facility with people that worked very hard. There was good communication to employees on a daily basis. We had start of shift meetings everyday.",
        "summary": "The production team members made it a good place to work.",
        "role": "Production Team Leader",
        "date": "May 13, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Senior management (I mean way up) bit off more than they could chew and decided to cancel some projects and move others offshore. I believe you get what you pay for and that will come back to bite them, but that's out of my hands.",
        "advice": "Pay and benefits are good, now just get the red tape out of the way, put mechanisms in place to allow different teams and businesses to work well together, and let the talent you've hired do their work.",
        "pros": "My team was all good to work with. Great people and great benefits. The bonus plan works out well if the company does well and you get a good performance review.",
        "summary": "Very interesting work and good people to work with.",
        "role": "Software Development Engineer II",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company is in such a competitive industry, changing it's focus away from hardware is very difficult. In the conflict between Customer Experience and Cost, the focus on cost is sometimes over emphasized.",
        "advice": null,
        "pros": "90+ % of fellow employees were positive to work with. Managers I had were usually qualified and accommodating and to work/life balance issues. Company has many good programs in place to make it more than just a job.",
        "summary": "Overall good place to work",
        "role": "Buyer/Planner",
        "date": "May 22, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Typical things you'd expect from a very large company - red tape, slow-moving HR, politics, etc.",
        "advice": "Take mundane tasks off the plate of the sales team and actually let them SELL.",
        "pros": "Lots of opportunity for anyone in high-tech sales. Work hard, and you will go far.",
        "summary": "High glass ceiling",
        "role": "Inside Sales Representative",
        "date": "May 24, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Upper management can be guardrail to guardrail and there can be different \"flavor of the weeks\". If the business isn't hitting it's number be prepared for micro management.",
        "advice": "Stick with the long term plan and invest in the resources, processes and compensation structure to truly motivate the workforce.",
        "pros": "Dell gives you a lot of responsibility and you are asked to know a lot. There is never a dull moment and work can be exciting and fast paced. When you're hitting your numbers you can make some good money. It's great experience. You also get work from home options.",
        "summary": "When the business is doing well, it's great...if numbers are off, watch out.",
        "role": "Sales",
        "date": "May 24, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell has a lot of lifers, and you'll find that they have not evolved their thinking with the company topline messaging. Being in software at Dell has its challenges because culturally, hardware still rules. HW is low margin with lots of overhead, and the culture needs to change to put SW and services on top.",
        "advice": "Dell is evolving, and middle management needs to really foster that transition to solution-selling. Help employees move to their next spot in a constructive environment conducive to learning.",
        "pros": "Dell has programs to ensure work/life balance is satisfied like most other large corporations do. I was in marketing, and the workload can be hectic at times, but results from your impact tend to be rewarding. Dell, in practice, is evolving from a hardware pusher with a transactional workforce to a solution provider with a consultative approach.",
        "summary": "Good company to work for",
        "role": "Senior Product Manager",
        "date": "May 31, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Disorganized at times- i think that is what happens at such a large compant. Leadership does seem to becoming more alligned.",
        "advice": null,
        "pros": "Plenty of room for growth, most people are smart and willing to help, great work life balance",
        "summary": "Great place to work for motivated people",
        "role": "Product Manager",
        "date": "May 31, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Little is done in communications from HQ to field offices other than reorgs, which seem to be annual at this point.",
        "advice": "Stop reorganizing and sending out PR on executives to the employees. Dell sometimes seems like a career treadmill for MBAs instead of a technology company.",
        "pros": "The vision of the future that Michael Dell has been pursuing over the last 4 years or so is very compelling, and I think right on track. Benefits are pretty good and overall corporate systems are ok.",
        "summary": "Good benefits, nice bonus plan, good long-term strategy, constant reorgs",
        "role": "Senior Consultant",
        "date": "Jun 6, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Large number of divisions, difficult on-boarding process",
        "advice": null,
        "pros": "Great benefits, work from home encouraged, new Dell service lines geared toward future technology market",
        "summary": "Fantastic Company",
        "role": "Senior Project Manager",
        "date": "Jun 27, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes the management acts like children.",
        "advice": "Try not to be out for yourself and only for yourself think about your employees as well.",
        "pros": "The money is good in the job is rewarding.",
        "summary": "Good money poor management.",
        "role": "Service Desk Associate",
        "date": "Jun 28, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too many hoursLack of supportToo political",
        "advice": null,
        "pros": "Early promotionsWork from home optionsGood people for the most part",
        "summary": "Decent job",
        "role": "Inside Product Specialist",
        "date": "Jun 29, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Treated like a number, not really valued as an individual. Work life balance is not very good, not a pro-family company. Once you reach a certain age you are targeted for reduction in force, they tend to show age-ism when it comes to hiring, preferring young and cheap labor. Not a place you can spend your entire career.",
        "advice": "Need to have a comprehensive enterprise solutions strategy for IT customers. right now the enterprise products are a disjointed collection of various companies that have been acquired. They need to eliminate some of these acquired brands and roll their IP and products into a unified Dell solution offering, much like Cisco's UCS",
        "pros": "High paced environment, plenty of on the job learning and development of very in depth technical skills. Competitive salary in the enterprise space. Has a good long term plan for their enterprise business.",
        "summary": "Career growth and development of professional and engineering skills",
        "role": "Systems Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Depending on your department, may have to work crazy hours. Can be impersonal, highly metrics focused company can mean that there is no allowance for personality differences. If you like to stay in role for longer than 2 years, you may be seen as adverse to change. Embracing change is highly valued.",
        "advice": null,
        "pros": "Salary and benefits are better than average. If you are ambitious and drive forward, you should be successful. Good vacation policies.",
        "summary": "Dell",
        "role": "Project Manager",
        "date": "Jul 15, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Bureaucracy impedes ability for agile processes and productivity. Processes are great until they slow down the accomplishment of goals.",
        "advice": "Internal HR processes need to be more streamlined.",
        "pros": "The ability to have a global impact is fantastic. The level of autonomy in this job lets you get things done.",
        "summary": "Technical Training Development Senior Advisor",
        "role": "Technical Training Development Senior Advisor",
        "date": "Jul 19, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "technology industry is very fluid and jobs are hard to come by at times",
        "advice": null,
        "pros": "Work life balance, Ability to advance your careers",
        "summary": "Very good company to work for",
        "role": "Inside Product Specialist",
        "date": "Jul 29, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The IT industry is going through a rough patch right now, there are constant organizational changes, and only very senior people can become people managers",
        "advice": null,
        "pros": "I've only been here a couple years, but overall things have been good. I've been happy with my salary, location, and colleagues",
        "summary": "Good so far",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Every step toward higher responsibility is very competitive",
        "advice": "Work to improve the People management skills, and working environment to retain key leaders and knowledge workers.",
        "pros": "Work with many knowledgeable people",
        "summary": "Physically and emotionally challenging, diverse, and driven",
        "role": "Engineering, Quality",
        "date": "Aug 7, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell has young management in the consumer department which doesn't provide for the most knowledgable leadership.",
        "advice": "To the younger, less experienced management they should take into account their more experienced peers to enable the best learning process to grow as a leader.",
        "pros": "Dell provides a competitive work environment which results in a high output and employees who strive for results. The leadership has an open door policy and opinions are heard and taken into consideration.",
        "summary": "Dell Review",
        "role": "Sales Support Analyst",
        "date": "Aug 8, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Conflict and overlap between groups doing similar work.",
        "advice": "Ensure there is a career path.",
        "pros": "Intelligent folks to work with",
        "summary": "Happy with the amount of effort they put in for employees",
        "role": "Senior Project Manager",
        "date": "Aug 15, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Constantly changing managers, multi layers office politics, working between groups is next to impossible",
        "advice": null,
        "pros": "Great benefits, matching 401k, work from home/work in office split time",
        "summary": "Dell EMS Support",
        "role": "Senior Technicaql Support Analyst",
        "date": "Aug 16, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pressure, and high sales atmosphere",
        "advice": null,
        "pros": "Vacation, possibility to a good salary, and ability for Work from home",
        "summary": "Work Life Balance",
        "role": "Sales Representative",
        "date": "Aug 22, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Employees not given merit for experience, if you had a degree and new out of college...you were pushed to the top. Those who worked there over 5 years and no degree were pushed aside and ignored. Glad I got out when I did, the Supv. I had got a taste of his own medicine. He was removed from his Project Management position, replaced by a female. What goes around, comes around I say.",
        "advice": null,
        "pros": "Loved woking for the Navy in DC.",
        "summary": "Was a good company....once, then they sold to Dell.",
        "role": "Program Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Like any huge corporation, while hard work and talent do play a part, success is as much about who you know and timing as it is ability or desire. At the end of the day you are easily replaceable and usually by someone just as capable who will do the job for less money. HR is more a hindrance than a help. Upper mgmt makes some truly dumbfounding decisions from time to time, and if stability and dependability are impo… rtant to you, you are at the wrong company. Dealing with ambiguity is the Dell motto. If sales under performs it's always the fault of the sales person or group, never that the goals were unrealistic or mgmt made a mistake or that our lead times for shipping product are ridiculously long due to some natural disaster on the other side of the planet. Nope, none of that could be it, it's that you as a salesperson didn't work hard enough.",
        "advice": "Take a queue from the EMC playbook on developing a salesforce. It's a cutthroat environment but if you can rise to the occasion you can make obscene amounts of money. Dell seems to be worried more about what it might have to pay it's salesforce than how much extra business those reps would strive to bring in if income potential wasn't so limited. With Caps on attainments and bonuses and decreased payouts at higher at… tainment percentages, it's no wonder any sales rep worth his salt is going to sandbag the hell out of his forecast.",
        "pros": "Tele-work option is great. When the business is doing well or there is a new group within sales and quotas are low, the money and bonuses can be quite good. Dell is a top company in IT and there is some pride in being able to say you work for them. Great place to build your resume and despite the cons I'll mention there are many much worse places to work.",
        "summary": "Ups and Downs",
        "role": "Inside Sales Representative",
        "date": "Aug 23, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I've been at Dell for over 10 years, so I have experienced ups and downs. The ups have been greater than the downs, and overall the company is positioned to win in the future.",
        "advice": null,
        "pros": "Positioned to win in the future.",
        "summary": "Long term good experience",
        "role": "Sales Engineer",
        "date": "Aug 27, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The flexibility and energy is very dependent on manager, if you have a bad manager, it is a terrible place to work (but the pro is that change happens quickly, so that will probably change soon). Greatest con is that it is very difficult to see the effect of your work or to feel that you are having an impact or making a real contribution to the huge writhing beast that is Dell.",
        "advice": "Keep working on simplifying processes; some focus on documenting resources and functions would be a big plus for the company.",
        "pros": "Great people, lots of hope and enthusiasm -- at Dell, you can make your career as great or as bad as you want. Totally up to you and your attitude. Can be a very flexible and energetic place to work, and things change often so there isn't the problem of falling into a rut.",
        "summary": "Flexibility and change is the name of the game",
        "role": "Marketing Consultant",
        "date": "Aug 29, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "tough. opex savings. long hours. work life balance not good",
        "advice": "na",
        "pros": "learned a lot. pnl management. strong financial statements analysis. marketing.",
        "summary": "dell",
        "role": "Controller",
        "date": "Aug 30, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Fear of layoffs from the company",
        "advice": "Keep doing what you're doing",
        "pros": "Good teamwork and management style",
        "summary": "good experience at Dell Financial Services",
        "role": "Outside Sales Representative",
        "date": "Sep 7, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too many Indians and not enough Chiefs.Very silo'dReward the wrong behaviors",
        "advice": "Stop panicking - Change doesn’t happen overnight.",
        "pros": "Great exposure to mutiple business groups & segmentsGreat flexible work benefits",
        "summary": "Opportunity",
        "role": "Senior Manager",
        "date": "Sep 10, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work/life balance is minimal, expect long work days and OT depending on the position. Aggressive growth strategy and ongoing integration into Dell will continue to foster this type of environment for employees",
        "advice": null,
        "pros": "Minimal red tape and employees are generally good team players. Executives are active members invested in the company's success.",
        "summary": "Small team collaboration allows things to get done quickly",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I see no downside as of yet",
        "advice": "Stay the course",
        "pros": "Busy, challenging environment that makes work interesting and enjoyable",
        "summary": "Busy atmosphere with top rank Management",
        "role": "Project Coordinator",
        "date": "Sep 12, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "LONG hours and constant change in organization structures across the company; churn.",
        "advice": "Don't re-org ever quarter - it's awful for productivity.",
        "pros": "Opportunity to work on various financial functions, flexible remote / work from hom; career advancement",
        "summary": "Very professional and hard working team at DFS",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "metric heavy. very top down management style with little room for flexibility",
        "advice": "invest in a flat heirarchy",
        "pros": "Benefits and room to grow. Dell gives you the opportunity to take control of your own future",
        "summary": "Good",
        "role": "Product Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Extremely reactive to external forces - market trends, company financials, etc.Constant change -- Every Half (cannot stress this one enough)Can't innovate and acquire at the same time",
        "advice": "Don't shuffle the deck every single time someone at the VP level changes jobs or leaves. It's ridiculous how little consistency there is in leadership under MSD.",
        "pros": "Very well compensated outside sales forceNo micromanagementMiddle mgmt generally shields you from a lot of the BSDecent work/life balance",
        "summary": "Great place to work until the stock price drops",
        "role": "Sales Engineer",
        "date": "Sep 19, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of growth opportunity for remote employees",
        "advice": "Need stronger HR presence for remote locations",
        "pros": "Pays good bonus to senior management",
        "summary": "Director",
        "role": "Director",
        "date": "Sep 21, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You would need to work in client office and sometimes feel disconnected from main office.",
        "advice": null,
        "pros": "very good professional environment and good for learning technology",
        "summary": "Had quick good time",
        "role": "Software Engineer",
        "date": "Sep 25, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell is constantly re-organizing, segmented, merging, acquiring, hiring and laying off. Always know your value and be able to articulate it very well and without notice",
        "advice": "Encourage more communication between departments and leaders",
        "pros": "Great company to start off a career, very flexible with regard to schedule and remote opportunities",
        "summary": "Dell is a great company to work for but is too large for its own good",
        "role": "Senior Analyst",
        "date": "Oct 1, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Typical cube farm, not much upward mobility, management not very organized",
        "advice": "Be more interactive/motivational",
        "pros": "Competitive salary, very friendly office environment, laid back (jeans), great benefits, super flexible hours",
        "summary": "Great cube life",
        "role": "Mechanical Engineer",
        "date": "Oct 8, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Management was very political on the lower levels and looked for ways to get rid of employees they did not like or who would not play by their rules.",
        "advice": "Upper management needs to manage the lower levels better.",
        "pros": "Compensation was very good along with working side by side with some great folks",
        "summary": "Many perks but very politically managed",
        "role": "Sales Representative",
        "date": "Oct 8, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Tough economic times for the PC business.",
        "advice": null,
        "pros": "Very competitive and challenging. Top name recognition.",
        "summary": "Overall, Dell was a great place to work. Good benefits and fair salary.",
        "role": "Account Executive",
        "date": "Oct 8, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Heavy workload and poor work/life balance at times.",
        "advice": null,
        "pros": "Good pay and lots of opportunity for growth and advancement",
        "summary": "Great place to work",
        "role": "Human Resources",
        "date": "Oct 18, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "very long hours and comp is low for the industry",
        "advice": null,
        "pros": "People that I have worked with are great",
        "summary": "overall, great place to work, the people are awesome to work with",
        "role": "Account Executive",
        "date": "Oct 18, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Tons of layoffs drove fear into the equation making everyone unhappy--you never knew if you were next.Kevin Rollins as the CEO made some mistakes that drove negative growth and layoffs.Very large sprawling HQ campus with poor facilities planning--good for walking 1/2 mile to your car in the Texas heat.You can never get a meeting room and all are double-booked. Also, too many meetings :)A little cheap … on the compensation, but good benefits.",
        "advice": "Encourage risk taking and for pete's sake get rid of the old AMEX middle-management layer that just goes around making the same mistakes year after year. Get a company historian to document the last time you \"tried x-as a solution\" and see how that worked/failed. Lack of lessons learned mean that re-organizations just put new people to solve the same problem in the same way since nobody learns/talks to their predeces… sors if they even know they exist.",
        "pros": "Amazing depth of problems with near limitless complexity.Very good opportunities to work with dynamic teams solving large problems.Good management with tech-focus--in Texas; foundation for Austin tech-boom.Willing to recognize talent and allow internal promotion if you seek it.",
        "summary": "A decade of lessons learned",
        "role": "Various",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Way to many emails that do not pertain to my job",
        "advice": "Less emails",
        "pros": "Great to work for. Discounts on Dell products",
        "summary": "Great Company to work for",
        "role": "Revenue Cycle Solutions Supervisor",
        "date": "Nov 7, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Unstable environmentWork load can be demanding",
        "advice": null,
        "pros": "Flexible work scheduleWork from homeGood payAustin",
        "summary": "Great place to work but facing difficult times",
        "role": "Audit Advisor",
        "date": "Nov 25, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Current management appears panicked by the continual downward spiral of the stock price. Consequently the pressure on the salesforce is focused on sales execution but also dilutes the efforts with a maniacal focus on attainment of sometimes spurious KPI's. This results in more time spent on activities aimed at hitting KPI scores rather than on successful salesmaking.Recent leadership changes in the Large Ente… rprise space resulted in a situation where salesmakers no longer know the Executive Leadership Team and the ELT does not know them, so Individual Contributors not only have no visibility up and down the management chain, they know that the ELT does not know them and consequently, the current thinking is, that the ELT cannot value them and their efforts. This also implies that upward mobility is fairly limited since a new management team was put in place along with the recent RIFs.",
        "advice": "Consider putting employees and customers first and share price at a distant third. This will, over time, result in a stronger workplace, greater employee loyalty, and ultimately a much stronger stock price.",
        "pros": "Depth and breadth of technology; ability to move margin and take deals negative in order to gain top line revenue is still strong. The specialist organization is very talented although in some geographies recent reductions in force have spread individuals extremely thin. Once one gets to network across cross-functional teams there are significant resources one can bring to bear for sales campaigns.",
        "summary": "Formerly Dynamic, Currently Confused, possibly Floundering",
        "role": "AE III",
        "date": "Nov 29, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Have to wait a year between internal promotions. Grading scale for annual reviews. Must have a specific number of people in each scale regardless of success and failure.",
        "advice": "none",
        "pros": "Able to work remotely. Larger workplace with more opportunities for advancement.",
        "summary": "Project Coordinator",
        "role": "Project Coordinator",
        "date": "Dec 3, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell can be a full-contact employer where, if you're not prepared for the tempo and quality level standards, your experience at Dell will suffer.",
        "advice": null,
        "pros": "Dell is large enough where you can develop a robust, diverse career over time. The people at Dell are very intelligent and highly driven to succeed.",
        "summary": "Dell is a high tempo place to work where the ability to adapt and deliver results are premium skills.",
        "role": "Financial Analyst",
        "date": "Dec 6, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "compensation package changed almost every 4 months and usually made it harder to make commissions.",
        "advice": null,
        "pros": "Great benefits good compensation great atmosphere",
        "summary": "Good Company",
        "role": "Sales Representative",
        "date": "Dec 6, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very political, matrixed organization can create challengfes",
        "advice": null,
        "pros": "Opportunity rotate roles frequently, fast-paced environment",
        "summary": "Pay is good but you earn every penny!",
        "role": "Program Manager",
        "date": "Dec 11, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Figuring out compensation is sometimes difficult. Dell executive leadership may be to far detached from the sales professionals that really keep them in business.",
        "advice": null,
        "pros": "I've been there 10 years. That should tell you something. I enjoy it, and would recommend it to anybody in sales.",
        "summary": "Working at Dell in Nashville",
        "role": "Anonymous Employee",
        "date": "Dec 18, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Low pay. Excessive barriers to information and red tape. Large disconnect between high-level management and lower-level workers. Excessive departmental interdependence, leading to frequent delays in projects.",
        "advice": "Advice to Senior Management – Be more open to suggestions from lower-level employees as to how day-to-day activities can be more productive. Allow departments greater autonomy with regards to access to information.",
        "pros": "Great atmosphere and relatively laid-back at lower levels. Lots of opportunity to develop innovative solutions to problems. Large opportunity to take on more responsibilities.",
        "summary": "good place to work",
        "role": "Senior Financial Analyst",
        "date": "Dec 21, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Current Sales Leadership (Felice) seems over their head. First time I've ever heard a salesforce blamed on an open investor's conference call. By all accounts an effective manager prior to this role, but certainly no Paul Bell.",
        "advice": "Transition Felice back into a more tactical role.",
        "pros": "Have had several managers at Dell, and with the short exception of one (only lasted a month), all have been excellent.",
        "summary": "Good company, facing some challenging times",
        "role": "Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The more your target compensation increases, the harder it becomes to consistently attain quota. Hard to know which are the right moves and get the timing right.Felt very much like just another cog in the corporate machine. People get lost in the equation.",
        "advice": "Meritocracy should not be just about who landed a lucky big deal this quarter. Please make some effort to recognize consistent performers and high NPS scores. They are really more critical to Dell's long-term success.",
        "pros": "Great entry-level salary, and opportunity for promotion if you're careful about directing your own internal career progression.",
        "summary": "Career growth opportunities are great, but tenure and success don't equate to job security",
        "role": "Business Sales",
        "date": "Jan 4, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Most people work 50-60 hours per week, especially around deadlinesVery demanding workPeople are promoted based on friendships with their manager and not necessarily on meritManagement is ADD -- they can't stick to an idea to save their lives",
        "advice": "Stick with one idea and see it through to the endStop trying to copy Apple, you'll never succeed in that endeavorListen to your employees",
        "pros": "Outstanding pay and bonus structureTalented and nice co-workersThe ability to fix a problem without having to ask",
        "summary": "Hard Work, Great Pay",
        "role": "Director",
        "date": "Jan 11, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "They've invented something called a \"movement freeze\" which kills morale. I had the opportunity to take a 25% raise in a different segment of Dell but was shut down because my particular segment wasn't profitable enough to let me go. I felt that was borderline unethical and certainly nonsensical (trust me, I can out argue upper managements' reasoning for this one, lol). There aren't a ton of promotional opportunities… , even for someone who scales very quickly as I did, so to have one right in front of me and not be able to take it was infuriating. To reiterate, though, I left with no bad blood - this instance actually gave me great motivation to branch out and do what I'm doing now (running my own company).",
        "advice": "It seemed to me that as the economy eroded, so did morale and culture. While seemingly natural, it's completely avoidable and Dell would get itself out of the hole much more quickly if it figured out ways to foster culture amidst struggle. People first, not the bottle line. And by people first, I believe that speaking value and worth into their lives goes much further than a spiff or bonus.Lead, don't manage.… Another note is to get better at filtering. When all of the negative outlook attitude from executive leadership trickles down to the individual contributors, the result is terrible. The GM needs to filter some to the RSM who needs to filter more to the ISM who needs to be the final filter to the ISR - hope that makes sense.",
        "pros": "For the most part, employees are shown value and there is a healthy culture & work/life balance. I had my share of positive and negative experiences there and left on good terms with no bad blood at all. It is refreshing to know that at a moment's notice, there are multiple folks who would be willing and able to help me get a job there or somewhere else in their network.",
        "summary": "Not bad for a corporate environment",
        "role": "Solutions Specialist",
        "date": "Jan 11, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very large company and teams can get silo'ed, roles and responsibilities can be ambiguous, management turns over frequently, frequent reorganization of the business (1x a year or year and half)",
        "advice": "Love the focus on career development and getting alignment on process development, what I expect in good management is business strategy guidance and help with personal career growth. Not all people managers can do both - but they need to do at least one.",
        "pros": "EXCELLENT benefits, wide range of opportunities for professional growth, attracts educated and experienced people that help me in my own professional development, networking across team promoted, great opportunities to develop leadership roles",
        "summary": "Happy with employment at Dell",
        "role": "Marketing Manager",
        "date": "Jan 18, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company, need to navigate people to get decisions made",
        "advice": null,
        "pros": "ability to pick up any problem and solve it",
        "summary": "Flexible work options",
        "role": "Software Engineer II",
        "date": "Jan 21, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "company is constantly changing the initives and goals it gives employees that can make reaching goals complex",
        "advice": null,
        "pros": "Dell is a good company to work for, good benefits and descent pay for the job demands",
        "summary": "Account Manager",
        "role": "Account Manager",
        "date": "Jan 21, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A lot of redundancy. Working environments vary greatly within different departments. A lot of job insecurity.",
        "advice": "Upper management should take a closer look at productivity and job description. Work loads vary extremely. People are let go and others get double the workload while some are not affected and have ample free time. It's also extremely insulting to take away someone's job who is extremely skilled and have them train people from other countries to take their place.",
        "pros": "Friendly environment. Many benefits. Good pay. Flex schedules and work from home availability.",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Feb 5, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "promotability for top performers - over time the company became a bit top-heavy",
        "advice": null,
        "pros": "people. the people have always been the reason it was a great place to work. I could always find hard working people, whether in sales or operations or finance. I also thought there was a decent amount of leader development training and investment.",
        "summary": "Great People and teams, lots of willingness to wok together",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "none to share at this moment",
        "advice": "none to share at this moment",
        "pros": "great employer, will recommend to all",
        "summary": "none to share at this moment",
        "role": "Senior Systems Engineer",
        "date": "Feb 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Disorganized, not enough career focus, rich get richer",
        "advice": "Focus on geniunely building careers",
        "pros": "High Pace, Challenging, Corp. Citizenship, Good Benefits",
        "summary": "A Solid Company",
        "role": "Senior Program Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very large company with some growing pains. Really trying to define Dell 2.0 and not be seen a s PC maker.",
        "advice": "Some of the business process improvements and money saving tactics are a bit much. Let's think longer term and do what is right for the company in the future, not just now.",
        "pros": "Learn something new everyday and get stretched by your management team. Very open door with direct access to executives. Perfect for people that are in high career growth and want visibility. Solid rewards with good benefits and bonus program. Great, smart people to work with make the hard work worth it!",
        "summary": "Challenging with great people",
        "role": "Anonymous Employee",
        "date": "Feb 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Once the contract ended good luck with what you do next.",
        "advice": null,
        "pros": "Nothing really, a normal contracting company",
        "summary": "Contractor experience with Dell Services",
        "role": "Client Tech Support Specialist",
        "date": "Feb 11, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Corporate once again, internal games that keep you planted sometimes for long periods of time. Hard to move around due to sheer competition, internal politics, and workforce reductions.Work in a city full of people, sometimes you feel disconnected and small.Career pathing is sometimes a huge fog of war and tough to get to where you want.",
        "advice": "Keep up the 1 x 1s and communication about how your work contributes to the bigger picture. Also where we are going, recognition for great work and, keep the career track conversations going!",
        "pros": "Very good resume builder, if you can last here you can make it pretty much anywhere lets be honest. Management seems to care about you on an individual basis.Great teammates make coming to work fun and not incrediably bad.Lots of job possibilities and plenty of departments to choose from.",
        "summary": "Very Corporate here, you will learn a lot and it moves quick. Great opportunity to grow personally and professionally!",
        "role": "Online Marketing",
        "date": "Feb 13, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Incremental salary increases and bonuses",
        "advice": "Sold to Dell",
        "pros": "Great culture and entrepeneurial feel",
        "summary": "Project Manager",
        "role": "Senior Project Manager",
        "date": "Feb 13, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not much complaints. However, my team has so much politics at the top level. Managers and account executives were not capable of finding new business, instead they put pressure on the subordinate to suggest new business plans.",
        "advice": null,
        "pros": "Benefits..Good internal study materials, good for the self starters",
        "summary": "Project Lead",
        "role": "Project Lead",
        "date": "Feb 13, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "More about dollars than relationships.Manegement I worked for did not care about our goals.Management. Does not realize that we are in a new generation of relationship building methodologies.",
        "advice": "Fire Executive Director \"Lee\"der of Dell Solutions Centers and reevaluate his managers that came to \"Phil\" in.",
        "pros": "Great products. Acquisitions keep things interesting. Great people all over the world. Top shelf office productivity tools to do the work.",
        "summary": "Dell is cool,. Solution Centers need new management across the board.",
        "role": "Solutions Architect",
        "date": "Feb 15, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "sometimes come across high bureaucracy",
        "advice": null,
        "pros": "many chances for growth and opportunity",
        "summary": "Great work enviornment and people",
        "role": "Anonymous Employee",
        "date": "Feb 15, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor training - esp for new hires.Constant change.Budget constraints impacting support groups in turn impacting success for best customer experience.Unsure what will occur once Dell goes Private.",
        "advice": "Try sticking with something for a little longer vs. constantly launching new ideas, new focuses, new metrics, new directions all the time.Realize that the support groups (ie. Customer Care, Order Processing, Spare Parts, etc) need more budget dollars so that they can provide the best customer experience possible.",
        "pros": "Many options for job choices since such a large company.Benefits (ie. vacation, 401k, work from home options, etc)Great people to work with.",
        "summary": "Fast paced, challenging, great people, great benefits.",
        "role": "Project Manager",
        "date": "Feb 19, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Increasingly harder to make six figures in sales. Too many reorgs due to acquisitions and changes in direction.",
        "advice": null,
        "pros": "Internal mobility, talent of fellow employees, technology",
        "summary": "Good internal mobility for my career, but became very hard to make good money as time went on.",
        "role": "Various Sales and Marketing",
        "date": "Feb 19, 2013",
        "is_current": false
    }
]