[
    {
        "rating": 1,
        "cons": "Management continuously erodes employee compensation. Employee morale is at an all time low. Workers are given unrealistic job expectations to meet due to downsizing and then told that compensation is cut because Dell is a \"meritocracy\". There is no longer such a thing as \"work-life\" balance, yet senior management seems surprised that there is a mass exodus of long term employees jumping ship.",
        "advice": "Look back at what originally made Dell great -- the workers. Stop focusing so much on impressing wall street with a turn around story.",
        "pros": "The best reason to work at Dell is as a resume builder to get a job with a better company. It has often been said that Dell is a good \"first or third\" place to work, but not somewhere from which you retire.",
        "summary": "Run from Dell!",
        "role": "Product Manager",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The managers don't care about you as an individual, you are treated like a number. They just fire people knowing more will apply.",
        "advice": "Treat employees with respect.",
        "pros": "The benefits, but they don't outway the cons.",
        "summary": "Dell Hell",
        "role": "Senior Sales Specialist",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The management team had no idea what to do when the times got tough other than cut heads. They got the company into the terrible mess it was in by being uncreative, irresponsible and uncompassionate about what impact their same decisions to do the same things over and over again have on employees and their families. It always was a tough place to work, which isnt bad when the compensation matches and you are being re… warded for the hard work. They didnt care about anything other than hitting the number. When no one could figure out what or why the business wasnt doing well they repspond with even more ludicrous goals that nobody will be able to hit. Equivalent to just completing a mile run in 4 minutes, then they turn around and want you to run the mile in 2 minutes with a straight face.",
        "advice": "Take some responsibility for the negative culture that they created. You have bled and chased off the most professional and talented pool of sales and management team that I have ever worked with; now you are left with people who are either too desparate that cant quit, or with managers and people that are still just interested in a golden parachute that still cant figure out how they got into the mess into the first…  place, let alone how they will get out of it. You have ruined a great company by unrealistic goals, uncreative people and absolutely zero compassion for any person who gives their best to the company.",
        "pros": "It did provide a solid education about the direct business model and great supply chain management. Most of my peers were people I respected and worked extremely hard to be successful in a difficult environment.",
        "summary": "How to chase off your best talent",
        "role": "Inside Sales Manager",
        "date": "Jun 12, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The culture at Dell is terrible. The environment is similar to the military in that people are supposed to just do what they are told without question and without thinking. It is a very top down driven company, which stifles creativity, great ideas, and even common sense business decisions. \"just do what you're told\"In addition, there is no respect for work life balance. Everyone is expected to work long hour… s and weekends---then head home and work on email. All companies demand long hours from their workers, but one major difference at Dell is that people spend all this time working on valueless activities just because some exec or manager said so.The leadership is terrible with no clear direction and strategy. The company is in a death seizure, where it is flopping from one strategy to the next. The company is controlled from the top and has hired very few good leaders and a work force that only knows how to take orders. This creates only ideas that are \"me too\", where Dell has become a company that only copies others---now both in process and product.The company is really broken from all sides. The infrastructure (IT, Phone, SW) has been underfunded and neglected. The workforce moral is terrible and the leadership (and pipeline) are completely inept. There is no clear process or standards for anything, which creates tons of bureaucracy and inefficiencies. I'm surprised the company is doing as well as it is. Don't be fooled by the lies and spin---it is a terrible culture and company.",
        "advice": "Get rid of Michael Dell, rehire true leaders, and decide a strategy and stick to it.",
        "pros": "Dell is a fast paced work environment in an exciting industry.Austin is a great town with very low cost of living.",
        "summary": "Dell is a terrible place to work.",
        "role": "Business Development Senior Consultant",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The bureacracy; the fact that no one individual can make a decision without having a meeting about it; how poorly employees are treated by their supervisors. This company will work you to the brink of exhaustion and then expect more from you - if you want a bonus.",
        "advice": "Start treating employees like human beings or you will continue to have difficulty hiring and retaining good people.",
        "pros": "They have cafeterias in some of the buildings...???",
        "summary": "Stay away from Dell if you want a satisfying job and the opportunity for a career.",
        "role": "Former Employee",
        "date": "Jun 25, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The substandard pay, slowly diminishing benefits, and general negative atmosphere create a frustrating workplace, but those aren't what bother me most. The fact that the most important criteria is how long a person has been in their current position for promotions is aggravating. It ends up making all supervisory and managerial positions fill with people who aren't qualified to get jobs elsewhere so they stuck with D… ell, while all good employees get fed up with this and leave.If you're thinking of joining, be sure you get hired at where you're qualified to be hired, pay-wise. If you get in too low, you won't be able to skip pay grades and will need to be in each pay grade for at least a year. I've known many people who quit because of this.The tools and software used for the job are pitiful. Half the time they are down, and when they are up they resemble something a high school student put together 20 years ago.The company claims the customer is important, but all support contracts are poorly written, intentionally misleading, and leading to numerous lawsuits. Beyond this, employees are constantly insulting customers while they're on hold to one-another.There is no managerial support to get unhappy employees to stay, regardless of how well employees are doing. Wages for new hires are constantly falling lower and lower below industry average, while Dell explains this by saying the \"great\" benefits make up for it.If you are at all driven, want to get ahead, and work hard then do not, for any reason, under any circumstances, apply for Dell tech support, it's the worst thing you can do for your career.",
        "advice": "Emphasize performance and accomplishments rather than seniority for \"promotions.\" Better yet, implement promotions rather just allowing employees to apply for certain jobs when their time in their current one is long enough. Have front line managers get to know their employees and what their employees are supposed to be doing day-to-day.",
        "pros": "The company does make some aesthetically pleasing computer products. There are also a lot of very fun to work with employees at the company. Having tuition reimbursement is nice.",
        "summary": "Look elsewhere for a career",
        "role": "Server Tech Support",
        "date": "Jul 2, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They lie to you. Micro managed. Promised things that dont happen. Treated like a piece of meat. pressured to work a lot of overtime that you are not fairly compensated for. Screwed out of spiffs. Pressured to use dishonest sales techniques.",
        "advice": "Clean house and start over with the type of people who run Strabucks or Chick file'. Instead of trying to stick a cattle prod up every reps rectum to squeeze one more hour out of them, treat them like truly valued assets and recognize that a good days work is nothing to be ashamed of.",
        "pros": "You are a used car salesman type which means you can make pretty good commissions until they shut the plant down.",
        "summary": "Dell Leadership the Problem, But Employees Take the Punishment",
        "role": "Sales Representative",
        "date": "Jul 3, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They lie, cheat, work you to death for no reason, etc.",
        "advice": "Don't lie your way into getting someone to sign on - chances are if they are good enough for you to lie to their face, they are good enough to get a job elsewhere and you just spent major bucks training them for no reason.",
        "pros": "There are none except for its a job if you don't have one. But at this point I would choose to be unemployed over working at Dell.",
        "summary": "Worst job ever.",
        "role": "Inside Sales Representative IV",
        "date": "Jul 24, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Employee are not respected. The only time Senior Management will talk to you is to let you go. Beware of one on one meeting with senior Management. You will use old and obsolete technologies. My experience with DELL was for me a dead end job, part of a losing team with no possibility of grow. Most of my time was spend in meeting, talking on the phone, replying to email and creating reports for management that no one … care reading.",
        "advice": "Listen employees and stop treat them like they worth less than nothing.",
        "pros": "I had the chance to work with different cultures.",
        "summary": "Worst experience ever",
        "role": "Software Testing Analyst IV",
        "date": "Jul 26, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "One was treated like if one were ignorant and a slave.",
        "advice": "You do not communicate timely and you treat people like your servants implying that they should be thankful they have a job.",
        "pros": "If you are in need of overtime.",
        "summary": "learn from the experience and find a respectful company who treats people like human beings.",
        "role": "Material Handler",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Extremely limited career growth. Like IBM of old, Dell employees have to wait for someone up the line to leave in order to be promoted. Recent requirements for management scope and layering mean that many people who could grow their careers in leadership opportunities cannot do so.Very constrained innovation environment. The focus on cost continues, at the expense of pleasing the customer.",
        "advice": "Turn in your badge and leave. Take your stock options and just go. So many talented people behind you; just go",
        "pros": "AustinMany people are out the door at 5Brand recognition on the resumeRemarkably good work / life balance",
        "summary": "Squandered opportunity",
        "role": "Product Marketing Manager",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Just about everything else...I've been rated good or best every year but I'm still the same level that I was 13 years ago.Management is deeply involved in every decision but makes them without the experts or data in the room...and never tells employees their decisions until some issue comes up with it that the employee has to fix.Senior leadership is lost in the wilderness. There is no diligence to findin… g out what's wrong and working to fix it. Everthing is a blind shot in the dark based on \"gut feel\".",
        "advice": "Get back to basic execution. Stop following the next shiny object or new toy. HP has not been kicking our tail with new niche products...they have been executing on the mainstream products.",
        "pros": "I love the computer industry. It's a hobby as much as a job.",
        "summary": "Great pay but not worth the money. Skip it, if you're looking.",
        "role": "Product Marketing Manager",
        "date": "Aug 21, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Dell failed to invest in infrastructure as the company grew. There are no processes or tools which makes each and every job very difficult, very manual, and inefficient. You spend most of your time focusing on the trivial many instead of the important few.",
        "advice": "Focus on profitability.",
        "pros": "Very talented and high caliber employees that you interact with, although good people seem to be leaving every day.",
        "summary": "Turnaround Taking Time",
        "role": "Finance Manager",
        "date": "Sep 17, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I worked 60 hours a week on my last project. They eliminated my team a day after a launch.",
        "advice": "Respect your employees.",
        "pros": "Can't tell you. I had a great work group. Supportive manager (at first) but still ended my career at Dell by getting worked over by management. Unfortunate.",
        "summary": "Avoid Dell as an employer in this economy",
        "role": "Engineer.",
        "date": "Nov 7, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor planning from the top on down. Strategic areas for the business are identified but long-term objectives and programs are not clearly defined. Results in a \"flavor of the month\" environment with shifting priorities and due dates. If you need support from other teams to complete a project - good luck! You may have commitment from them for now, but that could fall away overnight. Successful management and comp… letion of projects is a rarity. A very frustrating environment.",
        "advice": "Get more involved in projects and programs, and lend support to see that they get completed. Kill off those programs that don't add the necessary value.",
        "pros": "On the job learning opportunities are great because of the chaos that reigns. Have to be creative and figure out how to work the system and get around roundblocks on an ongoing basis!",
        "summary": "Driving the business in the ground in order to do leveraged buyout?",
        "role": "Rather Not Say",
        "date": "Dec 14, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Poisonous and combative work environment. Enemies are all within, not the competition. Kill or be killed is the way to be seen. Zero loyalty. Ex-pats do not advance (despite sr. management reassurances) and often don't have a home when they return. Innovation is squashed. True respect does not exist.",
        "advice": "Get rid of Michael (sorry - you may be a legend but your style no longer works) and begin to change the culture. Highly reward innovation and creative thought. Get rid of the \"antibodies\" that attack all new things.",
        "pros": "Good pay, interesting products, very good global experiences and global management opportunities.",
        "summary": "Good pay and looks interesting from the outside, but the old fun Dell does not exist and has become a poisonous trap.",
        "role": "Director",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Because of the downsizing and lack of growth there is little to no advancement opportunities. Finance controls your compensation via quotas, which leads to very unrealistic quotas. There's little to no training unless you do it online and who has time for that when you're chasing a huge quota? The current management that's left doesn't have a clue how to manage since they were never trained and treat senior outside s… ales people like they're inside sales reps. Options are all but worthless and they did away with the employee stock purchase plan. Dell will not allow you to interview with vendor partners which severely limits any opportunity to better yourself unless you quit first.",
        "advice": "Somebody needs to realize that people make up a company, along with products and services. If you treat your employees badly they will in turn not care about customers. Why keep the lousy VP's, Directors, RSM's, etc. and let the better ones go? Sure, they've been successful and now struggle to make their numbers but they're also the ones that got you where you needed to be when times were better. No wonder they're le… aving in droves.",
        "pros": "It used to be a great place to work. As previous comments have said, there were lots of reasons to be here 9 to 10 years ago but it's not much more than a job now. Most of my best managers and good friends have left for other companies and the rest of us are treated like we're a drag to the bottom line.",
        "summary": "Certainly not what it used to be",
        "role": "Account Executive",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The management is incompetent. They are racist, sexist and very much a good boys club. They lean on employees and most of them do nothing. Good luck getting promotions and credit for what you do. Unless of course you drink or play golf with the right people.",
        "advice": "All of you should quit.",
        "pros": "Work life balance is very good. You usually are pretty flexible. The company feels young. It has a refreshing casual feel. It can feel like a cool place to work. You have a chance to make impact on the business and see results. You can expect to get great benefits (though those have worsened) and great vacation time. The DELL perks are also very good.",
        "summary": "DFS it could have been a great place, if it wasn't for the management.",
        "role": "Data Analysis Advisor",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you have a social life (or want a social life), find some place else to work. During my eight plus years at Dell, the emphasis was ALWAYS Dell first; your family, friends, etc. were always a distant second. Work/Life balance is an EXTREMELY bad joke unless you either work in one of the administrative divisions of Dell or you are a C-level or higher manager. Work schedules can (and often are changed) with less than…  24 hours notice and overtime is always considered \"scheduled time\" (aka MANDATORY).The primary motivational tool that Dell management uses can be summed up in one word: FEAR and the management team knows how to use this \"tool\" to the fullest of its ability.When head count reductions are needed, the people that are on work restrictions (most of the time because of medical conditions caused by the job) are normally targeted.More often than not the facilities and equipment are poorly maintained combine this with long shifts for many days in a row and these are the leading causes of work related injuries.The most common medical conditions for Dell employees are bad knees, bad feet, stress or depression and every admitting nurse in Austin normally asks a question to this affect when they see Dell on the employees insurance card.Management is a joke. Almost all of the lower level managers are either fresh out of college with no management experience (and in many cases no people skills) or new from a different industry with no idea about the Dell corporate culture. During my time a Dell, I only know of five people that were promoted to the management ranks from the production floor.Dell tells all of their new hires that promotions are based on Merit. This has been an out right lie since November 2000 when Dell changed the promotion policies from merit to a policy based seniority, skill sets and \"office politics\" (stick your favorite cliche between the quotes).",
        "advice": "If you wish to regain your title as the Number One PC maker in the world, you need to return to emphasizing producing quality products with great customer service and technical support.Instead of recruiting new managers from outside of Dell, promote people from the lower ranks that already know the corporate culture and those that are willing to help Dell regain it's former status.Start treating your people l… ike they are \"assets\" not \"resources\". We are not machines, robots or parts that come from the suppliers every two hours. We are humans.",
        "pros": "There are only two good reasons to work for Dell's manufacturing and distribution division. The first is a steady paycheck every two weeks. The second is an okay benefits package; not a great benefits package but not as bad as some.",
        "summary": "If your are considering a job with Dell, RUN like the Devil is chasing you, because HE IS!!!!!",
        "role": "Materials Shipping/Receiving Assistant",
        "date": "Jan 6, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Incompetent and unethical senior management and board of directors. Michael's last name is on the building and he runs the company like a dictatorship. He tells his \"leaders\" what to do, they tell their managers what to do, and so on. There is zero tolerance for anyone to question or challenge anything Michael wants to do. See the long list of departed executives who have tried to suggest improving the company. This … culture impacts the entire company -- if you are not a \"yes man\" you will be miserable working at Dell. I've never met an employee who wants to stay at Dell for the long run.",
        "advice": "Dell is horribly positioned for the direction that the industry is moving. Michael Dell may be the only one in the IT industry that doesn't understand that virtualization, thin client, and cloud computing will make PCs, servers, and laptops a zero profit commodity. Dell is not even trying to position itself for the inevitable future, where the only value-added parts of IT are software and services. Michael believes t… hat cutting costs is a strategy. It is not.",
        "pros": "There are a wide range of jobs available at Dell and most managers provide employees with the flexibility to try new things. Moving up can be difficult but Dell is a pretty good place to gain broad experience. Most employees stay at Dell (in spite of the downsides) because Austin is a great city.",
        "summary": "OK place to gain experience, but don't plan on making Dell a final career destination.",
        "role": "Senior Marketing Consultant",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The stress, especially for those in customer facing roles. Opportunities for advancement do not exist anymore. One always has to be on guard because ever since the first round of layoffs the needs of the business will outweigh yours. Promotions do not go to the most qualified. Brown nosers seem to do the best. Having Dell on your resume just isn't what it used to be. Sometimes multitasking isn't the most efficient wa… y to be doing things.No raise this year but I guess that is ok Dell needs that nickel more than I do",
        "advice": "You are all fired! Management puts on the big show to suck up to the street and to the media but but seem stuck in a frame of mind that it is still 1999. There needs to be an injection of New Blood with new big ideas to turn things around. Bring back quality to the products. Listen to what the customers really want not what you think they will want and maybe they will buy a system from Dell rather than Apple or HP or…  Acer.",
        "pros": "Some of the people that work there are great people to be around. The pay is not great but just ok. My now overpriced medical insurance. There is more available parking these days.",
        "summary": "Dark days ahead and the ship is taking on water, where are the rats?",
        "role": "Technical Support Representative",
        "date": "Jan 23, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No leadership. No trust. No growth. No constructive work. No respect. Backstabbers everywhere and ass kissers all along the management chain. Get ready to brown your nose if you want in... btw- you'll be ankle deep in it and head first no less! For the love of humanity, just say no to (D)HELL!",
        "advice": "Do something like fire yourself or at least place yourself on a PIP (Performance Improvement Plan) and return your compensation+bonus for stinking it up. Stop talking and earn your pay. You're not entitled to STEAL that paycheck while doing nothing.",
        "pros": "It pays the bills right now.",
        "summary": "No leadership, no direction, no respect, no growth equates to a huge dead zone in central TX where careers go to die!",
        "role": "Systems Consultant",
        "date": "Jan 28, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Invisible management, office politics like I've never seen before, and the only way I knew I was fired was that my badge didn't work anymore. The jockeying for position to be seen by management when they do show their faces is ridiculous. I felt like I was in high school again. I've never EVER seen so many people try and throw co-workers under the bus in my life. it was almost a sport to them.",
        "advice": "Try answering emails and phone calls from the people under you. They are there for a reason.",
        "pros": "The compensation package was very satisfying. The cafe had good food. There are very cool and talented people working there. The ones not trying to stab you in the back, that is.",
        "summary": "Dell: In it for the money.",
        "role": "Anonymous Employee",
        "date": "Mar 10, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lack of Strategy and vision. Excessively focused in short term performance and lose sight of the longer term picture. No value for people, culture, loyalty. Uncompetitive and inconsistent pay structure. No focus on grooming talent internally and providing them growth opportunities.",
        "advice": "Need to get a focused strategy and vision. Employees are assets and need to be valued more.",
        "pros": "Experience in a global setup. Exposure to top class operations and supply chain. Opportunities to learn. Fast paced work environment. Opportunities to move within groups and functions.",
        "summary": "Good for learning but lack of career growth",
        "role": "Anonymous Employee",
        "date": "Mar 24, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "constant fear of being laid off, continually reducing employee benefits, extreme frustration amongst employees regarding the extravagant compensation packagages offered to senior execs and outrageous exit packages when they're fired",
        "advice": "apprecaiate and value your employees much more than you do today. . Frustration toward executives and fear off layoffs are dramatically impacting productivity.",
        "pros": "good pay, talented employees, lots of flex time",
        "summary": "Burn out employer, be forewarned",
        "role": "Senior Project Manager",
        "date": "Apr 4, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "management is not interested in outside of Dell experience nor are they interested in what you did at Dell before taking on whatever role you are currently in.",
        "advice": "Have a 1x1 more than once a year. Allow for leadership opportunities from the front line. Focus on developing your people instead of only driving to a number",
        "pros": "Great place for getting paid if you started more than 3 years ago for growth. under the right department, you can also progress with your career",
        "summary": "Looking for greener pastures",
        "role": "Anonymous Employee",
        "date": "Jun 3, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Good people strangled by management caprice. Frustrating place to work.",
        "advice": "Too much middle management. Organizational structures do not complement each other because there is no clear definition of relative responsibilities. Decisions such in review gridlock as people are not empowered.",
        "pros": "Company has lots of market opportunity to grow",
        "summary": "Opportunity comes with frustration",
        "role": "Anonymous Employee",
        "date": "Jul 28, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Way to many assigned accounts. Unrealistic quotas. My manager has 36 direct reports. As a result he can't manage people or the business he can only manage for exceptions (meaning you dont want to get on anyones radar).I wish the job market was better so i could quit.",
        "advice": "I am so down on Dell management. In my situation my dell manager has more headcount than a person could realistically manage. Hard for me to give advice.",
        "pros": "Dell gives you alot of freedom and the tools to build your business. As Long as you make your number you dont get to much grief. If you dont make your # start looking for a new job asap. Sometimes you dont have alot of contol over your quota and how realitic it is in terms of the current economy. Essentially Dell as a company doesn't want to hear excuse. They want to get paid.",
        "summary": "Long Hours Ok Pay",
        "role": "Systems Consultant",
        "date": "Sep 13, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Our company was purchased by Dell, with the intent of fully integrating the company into the Dell structure. There was very poor or non-existent communication with regard to which positions would be kept and which would be eliminated.",
        "advice": "Allow for more informal procedures for everyday problem solving. For example, the simplest desktop PC problems require entering a trouble ticket, which is often routed to an offshore team.",
        "pros": "Good benefits, including vacation, health and vacation. Quick responses to HR questions. Opportunities to purchase Dell hardware at a discount.",
        "summary": "Poor communication",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "A great raise is 3%, however in 2009 no raises were given.85% of all work will be sent offshore to India, the Phillipines and soon to be China.Having to train your offshore replacement and then be seperated from the company.No communication from Senior Management.",
        "advice": "Respect and listen to your associates. You will only be as successful as they make you!",
        "pros": "The relationships I made with my peers.",
        "summary": "Want to Lose your job to someone in India and not receive adequate pay? If yes, Dell Perot Systems is right for you!",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They believe they are a meritocracy. I worked in half a dozen groups over 10 years. That may have been true early on. Its simply not anymore.",
        "advice": "Dell used to believe in high quality products, fantastic customer service, and they used to place a high value on their employees. Somewhere along the line they lost sight of those three basics and decided that customers will buy a Dell no matter what and that employees were interchangeable head counts. Now they continually lose both and that won't change until they change their culture to make those three basics imp… ortant again.",
        "pros": "They have a pretty lax dress code.",
        "summary": "Not happy with Dell",
        "role": "Software Developer III",
        "date": "Jan 21, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Like many others that have commented in reviews, compensation is on the low side- Pay scale structure is complex and designed to justify keeping you at a lower salary- Performance reviews are a joke and bogus! Managers are given \"quotas\" of employees they need to \"fit\" in the respective performance categories.- Promotions with a pay raise are non-existent. You are given more and additional responsibilit… ies but no corresponding pay raise.- Don't ever get close to the bench.",
        "advice": "Reward people for their performance and honestly and objectively evaluate and categorize your associates. If you claim to attain to the \"most respected IT organization in the industry\" you can only get there with a majority of talented, distinguished, and exceptional team members. I'm talking front line folks too, and not just top heavy management. Make your performance rating curves reflect this reality. The majorit… y of your employess are \"distinguished and exceptional\", not just successful or partially successful. This attitude toward your performance ratings is making your best people leave or actively looking to leave at the first available opportunity and you will likely be at the point where your bell curves will eventually reflect the reality you are currently portraying!",
        "pros": "- Great team members- Genuinely good people and talented associates- Fitness center on site- Buddy up with senior management to progress",
        "summary": "Poor Compensation, Bogus Performance Reviews, Worthless Values Card",
        "role": "Systems Integration Senior Specialist",
        "date": "Jan 28, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "low pay, no bonuses, incompetent management, lack of education and training but an expected to implement anyway, lack of support from management, unrealistic SLAs, being asked to work overtime off the clock without pay, being paged every 15 minutes for a bogus alert and still expected to respond, unethical company, asked to lie, lack of trust between management and employees, people being terminated with no cause, hi… gh turnover rate, employees not being able to discuss issues for fear of being terminated. They give you a values card........don't believe one word of it.",
        "advice": "go back to working at Burger King or whever it was you were working before. Technology is not the same industry and should not be managed the same. The clients hate you, the employees hate you. Does that give you a clue?",
        "pros": "the client and some of my co-workers.",
        "summary": "If you like bad management at it's finest, want no bonuses, pay increases, lack of values then this is the place to work",
        "role": "Senior Systems Engineer",
        "date": "Feb 7, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Employee morale down the tubesQuality nonexistentCustomer service deemed too expensiveJust about everything outsourced, Dell doesn't actually make much themselves anymore",
        "advice": "Resign, that's the best advice I can give all upper management. You are the people who have ruined this once great company, you are the ones that need to go instead of the loyal employees you have laid off by the tens of thousands.",
        "pros": "Austin area is a great place to beWorking hours are fairly flexible for some positionsA place to learn while on your way to a better position elsewhere",
        "summary": "Nothing but a death spiral",
        "role": "Senior Consultant",
        "date": "Apr 18, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "In two years we went through 3 different business plans, and 4 different incentive programs. Each cutting into the amount of target incentives we could obtain.Dell owns you, you will have no outside life because of schedule conflicts. expect 60 hour work weeks, and six days a week with as little as one day notice.No chance of seeing your children, even though management has you working 8 to 8 they will still … slip out early to get their kids home...",
        "advice": "pick a course and stick with it. half the time the employees haven't a clue because management is confused with the game plan.",
        "pros": "the people you work with are about the only thing they have going for them.",
        "summary": "Something of doubtful meaning: am·bi·gu·i·ty",
        "role": "Inside Sales Representative II",
        "date": "Apr 22, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Constant reorganization. Constant rumors of more layoffs on the way. Stabs to the back by co-workers fearful of loosing their job. Extreme lack of innovation. Ethics . . . OMG, there are NONE. Dell is a company in decline. I'm gone and I would never, ever go back.",
        "advice": "I wouldn't know where to begin. Dell needs ETHICS. They need redone from top to bottom. Get rid of the constant chaos so that your best employees WANT to stay.",
        "pros": "The pay and benefits were pretty good and work hours and days pretty flexible, but I value my sanity too much to ever go back.",
        "summary": "Chaos, Chaos, Chaos",
        "role": "Engineer",
        "date": "Jun 11, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Constant reorganization. I have 20+ direct reports so I really don't have the cycles to do any one aspect of my job well. Dell is a technical company hard to stay sharp on the latest and greatest.",
        "advice": "I need a secretary",
        "pros": "Dell allowed flexibility in my schedule to allow for military reserve (retired) duties. Dell promoted me beyond my abilities and allowed me to grow into the position tolerated my mistakes along the way. Pay and bonuses are terrific. Lots of time off. Most people don't take all the time off Dell gives them but I do. Region is so big it is hard for anyone to keep track of what i really do. Lots of time to work from hom… e.",
        "summary": "To much reorganization",
        "role": "Regional Manager",
        "date": "Jun 22, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Everything Else. No Promotions. No Opportunities. Offshoring all functions. Nothing gets completed. Constant Management Shuffle. Consistent \"HURRY UP AND WAIT\"",
        "advice": "Vision of Leadership is not cascaded to all employees. Demotivated workforce. Internal models not working. Stock price indicative of future.",
        "pros": "Salary. Pay is competitive. However, Total Compensation is below average. Cost of Health Benefits increasing. Took Away Annual Cash Bonus.",
        "summary": "Not Memorable",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Downsizing employee base without downsizing workload. Prior to 2001, Dell wasn't a bad place to work because tech stocks were still over-inflated. Once the tech stocks bombed, Dell started it's cutbacks. Lay-offs became more common and when your department was downsized, you simply took on a greater workload. 70 hour weeks were the norm (as a salaried employee, the pay is the same for 40 hours or 140 hours a week). P… erformance plan goals are impossible to achieve, which gives Dell the opportunity to rate your performance poorly, which equates to no annual raise or bonus if you are even eligible to begin with.Dell is still a good ole boy network and diversity among the most upper management is non existent.The atmosphere within my department was very immature and several employees were bullied by their coworkers. Management and HR refused to do anything about it.It turned out to be the absolute worst working environment I have ever endured..",
        "advice": "Folks, you need to get your act together. Perhaps those multi-million dollar salaries of the higher ups could be cut instead of downsizing the employees that do the real work.",
        "pros": "Pay and benefits are very competitive.",
        "summary": "Workload is overwhelming while upper management rakes in the big bucks.",
        "role": "Want A Nervous Breakdown, Get A Job At Dell",
        "date": "Jul 28, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very competitive, to the point that you aren't sure who to trust. I had a manager title, but did not manage anyone. All of the people managers had an agenda and were ready to step on anyone who got in their way.",
        "advice": "Managers at Dell need to learn to do more than pretend they care about their employees, they need to realize they are people.",
        "pros": "Benefits/ pay. Very bright workforce",
        "summary": "Dog eat dog",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "the work culture embraces divide and conquor mentality, does not embrace intellectual reasoning and sound logic (rather: the leader of the pack has the final say, often based on politics, not science). extremely dense political atmosphere: you either play the game and brown nose management, and pray that if the stars are all aligned, you'll get the promotion you have been hoping for, or remain at the same level for y… ears. total lack of talent management. non-intellectually challenging environment. anyone with higher degrees are advised to avoid working there. managers do not know how to supervise staff with higher degrees.",
        "advice": "culture needs a total over-haul: the zero-sum game played by employees and management alike is detrimental to the company, stock holders and technology innovation. why is no one embracing the win-win strategy? :O in fact, there's a total absence of technology innovation and incentive for employees to work in the best interest of the company (complete lack of: metritocracy, people management skills and talent manageme… nt skills). change the culture (from top to bottom; esp. top!) to a win-win culture from an internal zero-sum game culture and you'll see the company turn around.",
        "pros": "average pay and benefits. good flex time.",
        "summary": "why the company is failing",
        "role": "Engineer",
        "date": "Sep 6, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Despite employees with years of experience in this industry and with higher degrees, senior management cannot stay ahead of competitors. Until it can free manage its rich resources, Dell will be a \"me too\" company.",
        "advice": "Because expertise by their managers is not of great depth, there is a lag in finding and integrating innovations. Thus, Dell will play catch up to others. It is losing ground in designing innovative products. Dell's services are not really experts in their industries. Dell should learn to find and evaluate talent in its corp of employees.",
        "pros": "Work Life balance is exceptional. There is great organization around productizing hardware. Dell can attract interest by clients. Young manager can have opportunities if they are aggressive.",
        "summary": "Dell is a \"me too\" organization.",
        "role": "Management Consultant",
        "date": "Sep 12, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "extremely political and reviews are not based on meritunstable, layoffs are expected at any timevery difficult to move ahead in your career if your manager does not like you",
        "advice": "require your managers to actually do work and not delegate to the lowest workerexpect accountability and ethics from managersprovide career growth that does not require permission from the manager first",
        "pros": "good networkinglearn what not to dopeople usually stay because of the benefitsemployee perks are not too bad",
        "summary": "political not by merit",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "People are expendable - and the way temporaries are treated is shamefulThe culture rewards stepping on your peers or managers to move ahead - it's very cut throatIf you think you can't take any more work - they will show you that you can - to a very bad extremeWork just doesn't have to be that way",
        "advice": "Fire the entire HR organization and get HR Pros who are willing to fight to do the right thing",
        "pros": "Time off from the first dayPay and benefits were really goodIt really is a meritocracy - if you work hard, you will be rewardedI learned SO MUCH while I was there",
        "summary": "My fist job out of college - I didn't even realize how horrible it was until I left....",
        "role": "Senior Human Resources Analyst",
        "date": "Sep 30, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "the management sucks. the entire set up should be overhauled!",
        "advice": "get your act together!",
        "pros": "great food and great work place",
        "summary": "i dont like the job",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Dell is slowly outsourcing and offshoring all Engineering functions. They are transferring all test and validation functions to twin divisions that they are bringing up to speed overseas.They are especially ridding themselves of technicians.",
        "advice": "advice to Dell: Just go ahead and relocate your company overseas so that you can become a foreign corporation instead of calling yourself an american company. From what I saw, outsourcing the analyzation of field return failures to the vendors who make your products resulted in a decline in quality and safety failures. Of course that seems like a no-brainer to the those on the front lines.",
        "pros": "Good bonus structure although it keeps changing. Managers are great about giving time off as needed. Outside of manufacturing, they can be very flexible with start times and time away.",
        "summary": "Outsource central",
        "role": "Anonymous Employee",
        "date": "Oct 29, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you have a family say goodbye to them now because they will not see you again. They work you to death. Management from the Perot merger is disconnected and cannot manage people. They will continually loose good people because HR has the mindset that if you loose the account loose the people as well! Upper management is also directing a 50/50 mix of US to off shore workers. Last year it was 70/30 in favor of US wor… kers. Next year it could be 70/30 in favor of offshore workers.",
        "advice": "The profit margin you seek will only get destroyed by missed SLA's and penalties. Keep the good people and pay them fairly for the work they do. It gets old hearing VP's say thanks for the effort and profit gains but we can do better! How about be satisfied with the huge profits your getting already and share some of that profitability with the people in the trenches that grind it out daily for you.",
        "pros": "benefits are ok but are not the best. They are constantly changing them and it seems to keep getting more expensive for the employee. I guess it's a job.",
        "summary": "The phrase \"Dell is Hell\" holds true. Stay away. Unless you live in TX you will not get treated fairly",
        "role": "Systems Specialist",
        "date": "Dec 24, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "inexperience manager promotoed inexperince manager to run the department.",
        "advice": "Investiage the internal promotion practice.",
        "pros": "Nothing worth to say about the company.",
        "summary": "No work there",
        "role": "Employee",
        "date": "Dec 27, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Managers and senior level assets will cheat, lie, and steal to get ahead. It's a very toxic culture where you have to look and act like the guy above you to get ahead. Otherwise they treat you like a tool that they can use to get to the next level.",
        "advice": "Dell should be more selective when bringing on new talent. Empowerment turns into power-drunkeness for a lot of the new senior level and middle managers. The culture of boosting the numbers to get good quarterly stats long enough to get to the next level has to be changed.",
        "pros": "Dell as a company provides good health benefits, time off, travel allowances, verbal recognition, and paid training.",
        "summary": "Good Ol' Boy network discriminates against non-whites and women",
        "role": "Infrastructure Consultant",
        "date": "Jan 17, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Terrible compensation, no opportunity for advancement. They'll ask you to take on additional responsibilities and do work that is not encompassed in your job description. They want you to have all of the responsibility and accountability, but won't give you any of the power to access the resources you need to be successful. They will tell you that they can't give you a pay raise or a promotion at this time \"due to th… e economy\" even though you are taking on more responsibility, but then go on to say that if you do the extra work, it will look good for you when promotions, pay raises and bonuses are available. Don't hold your breath waiting for those empty promises to be fulfilled. All the jobs are going off-shore and there are not opportunities for advancement, to be promoted, and any profit goes straight into the pockets of the executive management team, who still received 5 figure bonuses when the economy was crashing, while everyone else went without pay raises or bonuses. This company has no business sense, no ethics, and certainly does not care about their employees. Most people in management positions have no college education and it shows. They have no business sense, don't understand the difference between leading and managing and clearly are not familiar with the concept of organizational behavior. Their sales strategy is to over promise and under deliver to their clients which puts those who are accountable to the client for those promises in a bad situation.Benefits are expensive!",
        "advice": "Fire everyone on the executive management and start over with people who care.",
        "pros": "The employees are great people to work with!",
        "summary": "Wouldn't go back...",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They make you work mandatory overtime 55 hours when its busy",
        "advice": null,
        "pros": "Benefits package when you start",
        "summary": "The worst experience of my life",
        "role": "Sales Associate",
        "date": "Mar 31, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Although a large company, this does not mean job security. Dell has layoffs on a regular basis, every quarter.Still a male dominated company, very limited opportunities in leadership for women even though they speak of diversity. Some of it is just to check a box.Very business oriented but not very good about allowing employees to have a work/life balance or recognizing for the sacrifices made by the employee… s.",
        "advice": "Train your management team better. There is training there, make sure they leaders are taking the training and get real measurements on how they are doing. A greater focus on the employees will yield better working results and happier employees will drive for better overall experience for the clients.",
        "pros": "Large Company, lots of different divisionsIf you are in Round Rock, one of the only main employersStock options",
        "summary": "Lots of opportunities if you are part of the old boys network, the culture does not care much about the employees",
        "role": "Operations",
        "date": "Apr 10, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Salaries are WAY below market rates. impossible to determine \"published\" salary ranges. they treat this information like its a state secret; maybe their salary scales will get posted on wikileaks someday?!! I was strung along for more than a year with a promise to increase my rate to \"midlevel\" from where it was (\"below scale\"). Eventually \"HR\" said it wasn't approved. Same old Perot Systems nonsense here... this is … the operation that Dell computers bought from that Ross Perot guy.",
        "advice": "Keep your promises confined to the realm of actually deliverable.",
        "pros": "Fast paced environment, wide variety of issues to resolve. independence in workflow",
        "summary": "unkept promises; lots of hyperbole",
        "role": "Desktop Support Analyst",
        "date": "May 23, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Low pay, unfairness amongst all employees, unequal pay amongst employees, won't get anywhere unless you know someone up high, supervisors will talk about you to other people, small raises and lack of",
        "advice": "Listen to your employees, treat each employee equally, across the entire company, give larger raises",
        "pros": "The best thing about Dell is security in the building.",
        "summary": "In Lincoln location, don't plan on getting anywhere",
        "role": "Anonymous Employee",
        "date": "Jun 4, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Too bureaucratic. Michael Dell doesnt really doesn't care about the company anymore. The firm does not hire bright people. Pay is under the market for MBA new hires.",
        "advice": "pay for top talent. This company can do better if they hire better.",
        "pros": "Easy lifestyle, lot of people without a college education, so no creativity. Mediocre performance is the norm. So if you put in a little effort. You are a super star.",
        "summary": "Strong leadership experience in starting and leading global teams at Dell",
        "role": "Software Developer III",
        "date": "Jul 13, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Since you don't have much to do then they would have excuse not giving you a raise. Then you would resign on your own.",
        "advice": "preform internet audit on HR and senior management and make sure they follow the company's policies on EEO.",
        "pros": "Get paid and not much work to do and sit around to gossips.",
        "summary": "If you are knowledgeable employees, the management would steal your ideas and limit your career growth.",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No career growth. No job training. Manager manage their strategy based on quarterly result. No strategic direction in market place. They have not own any market in the high profit margin area(phones, tablets). Company as a whole is struggling with dwindling product pipeline. Apple has been and will continue to eat Dell's market share for lunch",
        "advice": "Got to spend money to make money. If the only strategy you have is cut cost, you will never be the leader in any product segment",
        "pros": "Good brand name. Salary is better than average",
        "summary": "Please think twice if you are going into IT. No support from manager. No clear future planning nor direction. Low Morale",
        "role": "Senior Advisor",
        "date": "Sep 15, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Positions are misrepresented. I was submitted as a QA automation tester working in Wellesley. After starting the assignment it suddenly turned into a manual tester working in Quincy, an additional 30 minutes each way. When myself and others mentioned their assignments were misrepresented, they were fired the same day.",
        "advice": null,
        "pros": "Pay is good, plenty of parking, clean and modern facility. Lunchroom staff are friendly. A shuttle is available that connects to public transportation.",
        "summary": "Zero Regard for the Human Element",
        "role": "Software Quality Assurance",
        "date": "Oct 4, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "BLOATED MANAGEMENT is the worst. There are way too many people in upper management. Nepotism seems to be very high where it seems like friends bring other friends into high management positions when it is clearly obvious they are not qualified and don't do anything on a day-to-day basis. If you ask someone what they do at the company and they say \"strategy\" - that means they do nothing! All of these people are riding…  on the backs of a few smart engineers who are doing all the work!There are a few brilliant engineers within engineering/development/support that are literally holding the entire company up. My guess is these engineers are just here to learn and will move on to better things eventually in which case Force10 will really be in trouble. Some advice for Dell is to take control - get rid of bloated management immediately - especially the management who have no technical knowledge; they are just a waste. I know of one director in one of the technical departments that doesn't even know what a router is. Wow!!!!! is all I can say! How would you feel if you were a super smart engineer and had to report to this guy who is probably making twice your salary and doesn't even know what a router is?",
        "advice": "This advice goes out to Dell - please get rid of the bloated management. Also, if you do not have any technical knowledge of networking and the products, you should not be in management in any of the technical departments; there is nothing more frustrating then having to report to a clueless so-called strategist!",
        "pros": "Force10 is a good place to learn; there are some really smart engineers here and you can learn a lot if you make the effort; it is a good resume builder for sure. Further, you have access to a lot of cutting edge equipment that allows you to learn new technology. Also, the pay is pretty decent and competitive. The company is located in the heart of Silicon Valley right by other networking giants like Cisco and Brocad… e. Another positive is that the company just got bought by Dell so there hopefully will be a lot more investment towards the technical functions and a cut in the bloated management.",
        "summary": "Some brilliant engineers and good place to learn but bloated and incompetent management",
        "role": "Engineer",
        "date": "Oct 6, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "All sales and no execution. Gets the sale but doesn't integrate with the client with workflow or procedures to satisfy the legal requirements of the contract.This is the third time I've seen Perot/Dell services fail a customerCommunication style: Negative and demeaning. No recognition for positive contributions or job well doneUpper management refuses to take responsibility; will scapegoat anyone they can…  findDoesn't follow good project management practices. Won't allow people with knowledge to helpUnable on-board employees well; many areas but you'd think they could give you a computer with the COTS productivity tools loaded.Plays bait 'n switch with compensation; below the going rate; users - will take advantage",
        "advice": "Man up. You're the reason for high attrition rate on contracts, not the employees or contractorsListen. Conduct lessons learned. You should know how to execute if you've been on the customer site for 18 mo. You have experienced, knowledgeable people who remain silent because they know you will punish them if they try to help youEither curb your sales people or integrate them with the team that has to execute … the legal contract. You are headed for contractual court actionAn employee is not a chair to be bought and inserted into a contract. Onboard properly and supply a mentor / shadow. Most employees want to do a good job and will if they can find your policy, proceedures and methodologies with examples in a single place for that particular client or client engagement. I've seen others use collaboration sites well (no, not as a file share). Perhaps try a buddy system for the first 3 weeks.Stop lying to the corporations who are your customers",
        "pros": "Front line Program Managers experienced and knowledgeableHave ability to do a good job, if they wantedCompany has reach into many industries; good if you are transitioning laterallyLarge contracts",
        "summary": "You're expendable; they set you up to fail.",
        "role": "Project Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor communication. Management has little respect for employees and overly political. Being a pet and favorite is more important than the ability to do the job. Senior management (non-local) are two-faced and will lie directly to your face, even when faced with contradicting information from their offices.",
        "advice": "Be honest and speak the truth. Listening to your employees will bring value back to their work and increase profits. Simply running everyone into the ground until they leave is a very poor way to manage your business.",
        "pros": "Benefits package is good, mostly the vacation. 4 weeks to start, but use or lose. Keep that in mind.",
        "summary": "Miserable",
        "role": "Anonymous Employee",
        "date": "Dec 22, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management is chaotic and constantly starting fire drills. Management is out of touch with employees. Engaement with management is very disconnected.",
        "advice": "Understand the business, and get closer to the customer. Treat all employees equally. Try and give more life balance allowances.",
        "pros": "Dell employee discounts on computers. Bonus plan is good. Most people are good to work with. Good benefits for employees.",
        "summary": "Good people, hostile work environment",
        "role": "Director",
        "date": "Dec 23, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Dell has been adding \"services\" to their hardware/software mix for some time. In layman's terms this means call centers/customer service help desks for outside clients, some quite large. With over 20 years of exemplary work in various facets of IT, I was a casualty of the recession and was hired by the first company I applied to, Dell. I had never worked in a call center environment before and hoped for the best but … I was not prepared for the actuality.Every call center stereotype you may have heard of is there: literally chained to a 3x6 desk by a headset; calls, breaks and lunches timed to the millisecond; absolutely no privacy as you are only separated from your co-worker by an 8\" divider; very often no time to breathe between calls, etc. There are agents who concentrate on email/web inquiries instead of the phones and that is seen as a perk and is relative heaven compared to the phone agents' world, but a web ticketer may still be tossed into the phone mix when they are short-staffed; even if not trained in that realm they are still audited/graded on the same standard as normal phone agents. Standards/requirements can change on a daily basis, making something that was correct one day be counted off for the next. We are required to have several certifications and even a year later a large minority of co-workers still do not have them yet they are still around.Actual competence is not rewarded but sticking as close to the metrics as possible is. Innovation/real world experience from the few \"adults\" on the floor who seek to improve processes is not sought out nor appreciated. Mandatory overtime is required more than most would like. A cursory walk along the building will show desks with jackets, blankets and gloves worn by agents trying to stay warm year-round due to wacky climate control.One changes schedules, managers and tier 2 agents every three months which doesn't give one much time to build a relationship with someone who will champion you. Audits are handled by tier 2 agents who can either stick to the letter of the law or give out blanket top scores depending on who it is; their rankings are affected by how good/bad their agents' scores are and some pad the results while some are so hyper-critical one cannot compete fairly with the fluffed-up ones. As a person who strives for perfection and fairness, this disparity upsets me to no end. After bringing up examples of this to management ad nauseum, nothing changes and I am finding myself worn down from trying and from even caring. Anecdotally, with rare exception, all managers and tier 2 agents are married males, under 35 with small children. Take that as you will.To be fair to Dell, this is probably how all large call centers are run; agents are numbers, metrics and rankings. In a company of over 100,000, how much is one person going to matter? This is not an atmosphere for anyone who has ever held a real career-type job where one is treated like an adult, allowed to think and contribute. It will kill any enthusiasm you hold for doing an excellent job and it will kill your spirit. If quality of work life means anything to you, don't be lulled by the (sadly) decent wages by today's standards; keep looking. And if you are over 40, RUN!",
        "advice": "Realize that even some lowly customer services agents may have experience worth utilizing. Some of us only landed at Dell because of the recession yet bring years, sometimes decades, of experience that is being squelched and in turn the professional pride you hope to engender in your employees dies instead.",
        "pros": "Dell offers an above average benefits package, (surprisingly) higher pay than others for similar work and does walk their \"diversity talk\", at least as far as hiring goes. (If you have piercings, green hair or tattoos it's no problem.)It is very hard to be fired for incompetence but one will be let go for things like attendance issues. They offer a lot of educational opportunities. Relative web-surfing freedo… m within reason. Casual dress is taken to a pretty liberal degree, especially in the summer.This is a good first step in the IT field for someone right out of school and for someone who wants to be \"molded\" into a company's image. If you are under 30, male and live to play XBox or PS3 you will fit in very nicely.",
        "summary": "Call center purgatory not meant for a professional adult",
        "role": "Technical Support Specialist",
        "date": "Jan 3, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- This place has been going down the hill rapidly probably due to the lack of \"real\" management.- The Engineering department is better than some of the others as they seem to be a bit more respected but unfortunately are overworked. Although I have to say there are some engineers and groups that I know of that I'm not very clear on what their responsibilities are and to me seem to be just living off the work of o… thers. Some management is good and some are bad - depends where you land. Hard to find good new hires.- The sales team brings in the money so the sales engineers also are somewhat respected. Management in this group seems to be better than some of the other areas.- Stay away from the support organization. There are only a few good people left and I suspect they will be leaving soon. Management is totally incompetent. Recent new hires are a joke and seem to be under-qualified due to the fact of management trying to fill positions to keep their own jobs.",
        "advice": "I would ask Dell to replace all of the management (from managers on up) at Force10 unless they want the company to keep going down the toilet like it was prior to the acquisition. Realize management at Force10 seems to be only interested in protecting themselves - not the company.",
        "pros": "- Opportunity to learn about networking if you have the desire- Can learn off the few good engineer left before they leave- Good places to eat nearby- Other than the above there honestly isn't much good left to say about this company.",
        "summary": "Very disappointed - no motivation to work harder and unethical practices are rampant",
        "role": "Anonymous Employee",
        "date": "Jan 10, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you've no family interests, want to come here for a year for the money and the name on your CV I would. Other than that I highly discourage anyone from Dell. There's a disturbing breed here I've never come across in my years of management - hard people who have forgone a work life balance or family, especially women. I work 14 hours 7 days which is not unusual, and I have great empathy for the worker bees internat… ionally, unaware of the type of company this really is. Work related stress and constructive dismissal are rife. Dell offers little help for staff and unless you're well connected in Austin, help is never going to happen.I'm leaving of my own decision to lead another brand at a high level, but have learnt in surviving Dell Hell. I've heard many people say you breathe an awesome sigh of relief the last time you walk out the door, I can't wait!",
        "advice": "A wise man once said do unto others as you would want done onto yourself",
        "pros": "I laughed when I saw another review here saying 'if you can survive Dell you can survive anywhere!' That's absolutely true! Some good folks on the ground here. You'll find inner strengths in yourself which will help your career.",
        "summary": "Dell - a lesson in survival",
        "role": "Director",
        "date": "Jan 27, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The Company lacks a strategy that is accepted through out the organization. Every decision is based on the idea of not losing rather than a culture that is trying to win.",
        "advice": "The company is uninspiring and out of touch with the industry as a whole",
        "pros": "Very large organization that a person could spend their entire career at. The fact that it is the largest company in Austin makes it a logical place if someone would like to live in Austin",
        "summary": "Dell is an uninspiring place to work that lacks accountability",
        "role": "Consultant",
        "date": "Feb 11, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All they do is lay people off and restructure the organization.",
        "advice": null,
        "pros": "They offer decent work/life balance.",
        "summary": "Dell specializes in LAY OFFS-do not work here!",
        "role": "Anonymous Employee",
        "date": "Feb 21, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Literally ZERO work/life balance.Unreasonable expectations in terms of workload; especially with strong lack of support/information with which to accomplish assigned tasks.Extremely high stress level.Constant reorganization.Lack of support from management.",
        "advice": "Spend a little more time planning the implementation part of the process before rolling out the next reorganization. The confusion that results from constant reorganizing creates an environment of ambiguity and severe lack of accountability.",
        "pros": "Good BenefitsGet to live in AustinCan often work from home",
        "summary": "Don't Do It",
        "role": "Anonymous Employee",
        "date": "Mar 17, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "One common word is Confusion. No-one effectively understands the business strategy, no-one works to ensure teams are aligned. Lots of duplicated effort. People are forever cycling in and out. I asked my boss-to-be about the high turnover rate before I joined and he said it was getting better. 2 weeks after I joined, he left!! In one year, I had 7 managers. It is very difficult to run projects when every 4 weeks or so… , 50% of the people sitting around the table are new.",
        "advice": "Focus on your people. Work on retaining talent. Be sure that everyone understands what the key strategies are, all the way down to the IC software engineer.",
        "pros": "Lots of time off, ability to work on some large projects, lots of funding for major projects, work with people from a lot of cultural backgrounds.",
        "summary": "Unpleasant",
        "role": "Strategy, Technology and Governance Office",
        "date": "Mar 30, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Pool planning and management of upper mgmt.",
        "advice": "Plan . hire people, and Plan and communicate your plans",
        "pros": "Like the work that I am dooing",
        "summary": "Disorganized",
        "role": "Senior Systems Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Part of the reason for the flexibility stated above is a lack of leadership and care with human resources. Employees are moved around frequently without regard for skills and interests. As a result, roles are highly ambiguous and responsibilities often overlap. Combined with widespread pessimism about the direction of the company, many employees are more interested in themselves than co-workers and customers.",
        "advice": "Take time to focus on employees by properly defining and scoping roles; ensuring people managers have leadership abilities; and enabling them to focus on what matters to customers instead of what matters to meet the quarter.",
        "pros": "Many people have the flexibility to drive the scope and responsibilities of their roles. It is somewhat entrepreneurial in that sense.",
        "summary": "Depressing Place to Be",
        "role": "Marketing Manager",
        "date": "Apr 14, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Long hoursDifficult to use all your vacation timeNot enough staff to handle workloadE-mail is used over phone",
        "advice": "Talk to your employees. Don't assume.",
        "pros": "401k matching is goodDecent holiday time offNo one works on Fridays",
        "summary": "Mixed",
        "role": "Anonymous Employee",
        "date": "May 18, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Top Heavy Procurement ORganization. No growth opptys",
        "advice": "Look in the Mirror. If it were YOUR COMPANY, what would YOU do? Not continue to collect a paycheck and bonus for minimal work.",
        "pros": "Good Pay and Benefits and Work Remote program",
        "summary": "Commodity Manager",
        "role": "Senior Commodity Manager",
        "date": "Jun 12, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Disorganized, ineffective managementToo much focus on offshore activities and offshore business modelStaff turnover is very high, likely to translate into loss of some major accounts",
        "advice": "Your rush to embrace the WIPRO model by hiring their execs continues to alienate your customers and employees. If you continue, you will be successful at destroying what once was a quality service organization - Perot Systems",
        "pros": "So-so health benefitsAdvancement potentialOrganizational structureLarge accounts with diverse job opportunitiesRemote work from home is possible",
        "summary": "Dell Services Heading South in a landslide",
        "role": "Software Engineer",
        "date": "Jun 28, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Coworkers have low-intellect, not innovative, no sense of competition/market forces, execs not willing to take risks to grow business, complicated MATRIX organization where simple decisions take months & still don't get made. Customer is not first priority. No \"common sense\".",
        "advice": "Embrace the competitive spirit. Be honest with yourself & take risks. Prioritize from the top & align to the few. There's no heart at Dell, most people are checked out - going through the motions.",
        "pros": "Austin, TX is a wonderful location, low cost of living, huge homes for cheap, easy transportation, good salary.",
        "summary": "Not a competitive culture, no creativity - no risk taking, decision making requires 50 people",
        "role": "Senior Analytics Manager",
        "date": "Jul 21, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "High employee turnover. Lot of engineers from various teams have left - Very low morale in technical teams. Lack of leadership at executive level. Expect to work 65-70 hours per week as an employee. I was a contractor and was allowed to work no more than 45 hours. After I went full time my hours went through the roof - now I work days, weekends, weeknights - its very tough. I need to find another job. There are a lot…  of conflicting directions since they are trying to stomp fires all the time. Frustrating at times due to lot of paperwork and form filling. Lately training programs have been limited due to cost cutting. Management and HR do not seem to take action to salvage the situation.My 2 cents - Good place to be if you're single and want to learn and earn and nothing else. Else find another job or bid your family goodbye and join us in Hell ..errr Dell.",
        "advice": "Need more engineers and not managers. Stop the brain drain.",
        "pros": "I am part of a great technical team in Cincinnati that works very hard. Getting exposure to a lot of technologies. Benefits are average. Flexible work schedule / work remote opportunity. Compensation is below average.",
        "summary": "Hoping for the best preparing for the worst - very disappointed with Dell",
        "role": "Senior Advisor",
        "date": "Jul 22, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Where to start...morale is very low, as we face another round of layoffs after missing our H1 number (and yes, we're on a half system, which minimizes your chances to blow out your number.). I have to fight to get credit on every single order I sell. Reporting is nonexistent and the sales support staff who should handle this kind of thing are long gone. Dell HR exists only as a phone queue, and one based in India at … that. We're supposed to have generalists we can meet in person, but I've never seen one. The Perot 'integration' is a sham--we've laid off just about all former Perot employees, and those guys knew there stuff for the most part. Our move to be a services company is a wreck, in my opinion...unreasonable margin floors for deals, inadequate staff, lack of commitment and understanding up and down the line. I've been with dell for quite some time and it is sad to see what it has become.",
        "advice": "If we are truly to be a services company, the current mangement team just ain't cutting it. I know Dell will never pay in line with the industry, but at least you can start paying us for that which we actually sell. instead of stripping to the bone during lean times, why not double down on your commitment to your employees? Do you not have faith in us?",
        "pros": "Layoffs have made it where managers are responsible for a very large number of reps, meaning oversight is minimal. I can concentrate on my job for the most part and sell, not worry about Mickey mouse busy work form micro mangers.",
        "summary": "Going downhill, fast in Dell Healthcare",
        "role": "Account Executive",
        "date": "Aug 5, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Focus is always on the bottom line. Nepotism. Reverse discrimination. No career path. Lying to employees about future. Top performers one day are shown the door the very next day.",
        "advice": "Quit poisning the well with very angry alumni. I've never seen a company with such a large group of ex employees that hate the company. It will come back to haunt you.",
        "pros": "Some good people. Some dedicated leaders. Ability to impact results.",
        "summary": "Worst decision of my professional life.",
        "role": "Human Resources Director",
        "date": "Sep 11, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management is reactive. No people strategy. People are considered expendable. Accounting / Finance functions are corrupt. Company keeps pet businesses that are Michael's little screw-ups running just so they don't have to report Michael's bad business decisions in acquiring a family owned company....etc.",
        "advice": "Focus on integration of what you acquire. Focus on updating all systems. SaaS businesses and the computer \"box\" business require different billing systems, etc. Take note that even all SaaS businesses even require different systems. There isn't any \"one-size-fits-all\" solution for all the systems needs. The company's focus to try and produce one is futile. Trials to do so have lasted infinitely longer than that which…  a reasonable investor would find reasonable.",
        "pros": "Brand Name - That's it....but the equity there is falling sharply.",
        "summary": "This company is headed for disaster....just take a look at their bipolar acquisition/layoff \"strategy\"",
        "role": "Financial Analyst",
        "date": "Sep 12, 2012",
        "is_current": true
    }
]