[
    {
        "rating": 2,
        "cons": "I have to say that the biggest con here is that there is no doubt that your life is your work.",
        "advice": "Take some courses regarding productivity level rather than endless demanding. Employees need a time for advancement. You need to give employees a chance at jobs within company instead of always seeking outsiders.",
        "pros": "For me it is quite clear that the best thing about working at EBay is where the company is located.",
        "summary": "Working at EBay is like being in a battlefield.",
        "role": "Senior Product Manager",
        "date": "Apr 3, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It is a fairly young group of people, the majority of whom came to eBay straight from business school with no significant prior management experience. They seem to underestimate the complexity of projects and when they blow up two extremes seem to result: a) infighting and finger pointing or b) they back down and the projects die on the vine. Overall, solid planning and communication are sorely lacking at eBay. This … can be seen in John Donahoe's strategies that are aspirational in nature rather than actionable. (i.e. 1) Re-ignite the core, 2) Grow adjacencies, 3) Plant seeds. That basically translates to: 1) tend to the base business, 2) tend to recently started businesses, 3) invest in new businesses. What! Work on the current business, and invest in some new stuff? That's not very prescriptive!)",
        "advice": "Learn how to set, and communicate, and ACTIONABLE strategy.",
        "pros": "SOME of the people are great. And with such a large user base, small ideas can show sizeable results. I think I stay for these two reasons.",
        "summary": "eBay - a company struggling to find it's way.",
        "role": "Senior Manager",
        "date": "May 25, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The new senior management team.",
        "advice": "Go back to the roots of eBay. You have gotten rid of all the knowledge in the company and look at what John D has done to the stock in his tenure....great job John!",
        "pros": "The mission of the company!",
        "summary": "How a weak senior management can ruin a once great company",
        "role": "Director, NA",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lots of politics and, as a result, management is not always selected based on competence. Slow career advancement and development. High stress environment. Frequent re-org's (every 9 months or so) reflect management's inability to provide clear vision or build a strong organization. As a result, you can easily find yourself in a job you don't want or aren't necessarily qualified for, and you aren't set up for success… .",
        "advice": "Empower people more and allow them to do their jobs.",
        "pros": "Smart people, still one of the premier Internet brands. If you can connect with eBay's business model and mission, then that can make it a fun place to work because you see how the community of eBay buyers and sellers make sure eBay continues to be relevant.",
        "summary": "eBay will use you and lose you.",
        "role": "Product Marketing Manager",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Ebay has some significant downsides - in theory management has attempted to address them in the couple years since I left but from second hand info it sounds like it has had mixed results. Functions are very siloed - the company works like a machine but the by product of that is that workers generally feel like cogs in the machine with very little ability to affect big change. Not uncommon in companies of its size ob… viously. Cash comp is on the low side in my estimation, at least when I was there, and stock has gone nowhere but down or sideways taking away much of the motivation that was inherent in that part of the comp package earlier in the company's lifecycle. Skype and other management decisions seemed to decrease confidence in senior management's vision and skillset though there are many new faces now. Career growth was probably the single biggest gripe for many of the talented folks there - eBay hired many folks in at below market rates and wasn't quick to change their tact as the market got very good. As a result, many quality folks left.",
        "advice": "Focus on innovative projects and worker morale - both areas that sorely needed it when I was there. Pay over market rates. Give people some leeway to create new products and businesses. Make it a great place to work otherwise the decline in talent will continue.",
        "pros": "While less so today, eBay has been one of the large consumer web companies that has held some prestige as a place of employment amongst the tech industry. It's a stop on a career path that's not going to hurt to have on your resume. There are some very smart people to work with and the environment is generally good - people respect one another.",
        "summary": "EBay - doesn't hurt the resume but not a great place to work.",
        "role": "Senior Product Manager",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "eBay is the flagship brand, but the other companies (PayPal, especially) are the tugs that pull the big ass eBay tanker through the narrows to boost profitability. Everyone expects you to drink the eBay Kool-Aid, and look askance at you if you question the big fat rah-rah-rah. On the development side, there are WAY too many managers. The product development process if horribly inefficient. Schedules across groups and…  projects are continually out of sync. The audit trail is ridiculous - for every bit of code you touch or test, you have to fill out at least 3 checklists. There are more employees dedicated to tracking status than testing for many projects. This company works you to the bone, is cheap, pushes deadlines over quality and tries to do too much with too little. But the benefits are good.",
        "advice": "Get a grip on your development schedules. Give people time and training to learn their jobs. Get tools that work so engineers don't spend their days rebuilding ad infinitum. Hire middle management that knows how to deal with people.",
        "pros": "Tons of smart people, great benefits, nice physical environment. Customers really do love the product and let you know what you've done right and wrong. There are good chances to advance, if you like limiting yourself to company niches, and can hack no life outside of work.",
        "summary": "The place has potential but it's lost my faith.",
        "role": "Software Engineer",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Inexperienced middle management. Frequent change in direction/strategy. Frequent re-orgs (significant reorgs every 6 - 9 months). Expect that most of the projects you work on either won't see the light of day or will be killed shortly after they release. Don't expect to get promoted no matter how fantastic your performance unless you're very skilled at navigating the politics.",
        "advice": "Train your Senior Managers, Directors & VPs to be better managers. Identify clear strategies & communicate to teams how their objectives fit within these. Better communication. You once had an SVP in Marketing who was exceptional at all of these - take a lesson from his management playbook.",
        "pros": "Great opportunities for learning if you take the initiative to do so (don't expect this to come from your management). Rock star coworkers. Good work/life balance + perks like the cafe, gym, SF shuttle, etc.",
        "summary": "Great opportunities for self-drive learning, but don't expect anything from the company for your efforts.",
        "role": "Senior Manager",
        "date": "Jun 12, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The work environment can be a grind. People are packed in, and they're shoe-horning in even more. I think the only reason why they might tolerate you working at home is if you have leprosy.",
        "advice": "Management flip-flops too often. The company needs technical leadership. It seems like the place is run by a bunch of numbers-driven MBAs whose vision doesn't extend beyond yesterday's sales reports. The marketing is TERRIBLE - TERRIBLE. I can't imagine why we pay top dollar to marketers who actively degrade the eBay brand.",
        "pros": "eBay is one of the largest internet sites, so you can learn a lot here. I also found most of my co-workers are quite competent.",
        "summary": "Good co-workers, but the environment can be a grind.",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's a sweatshop and a very political environment. If you don't play the game, you won't advance. It is also a very male dominated company - women who have children are almost always knocked off the track. There was a several year period where approx. 40 people made VP - only one of which was a woman.The morale is very low, with most employees under water on their stock. There have been a lot of management sh… akeups and people are waiting to see if they will deliver. What once was one of the most cutting edge websites got lapped by a lot of other companies - now they are trying to play catch up.It depends on the department, but there are some very bad managers at senior levels who are tolerated/ignored by the rest. The company is also very stingy - 2-3% raises, no childcare, no subsidized meals, no holiday parties for many departments (with $4 billion in cash in the bank).",
        "advice": "You have to fix morale and kick a lot of people in the seat of the pants and you have to fix the US business - people got arrogant and sat on their laurels while other companies out there (Amazon) ran laps around them. You have to get management to do more than talk the talk. You have to fire people up!",
        "pros": "eBay is an exciting environment with a lot of cutting edge issues. There are a lot of really smart people who work there. It's fun to work for a company that is in the news every day. They have a lot of great subsidiaries.",
        "summary": "eBay - a missed opportunity",
        "role": "Legal Department",
        "date": "Jun 17, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you are at a senior level, you will not find much to learn here. The opportunities to have design discussions and do work with other designers in your field are very limited. This also means you have almost no chance to mentor a younger designer either. Projects are routinely scheduled to be much too short or way too long. Scoping of a project has not quite been figured out. There will be many things at eBay like … that. You will not be able to understand why so many small companies have figured out various communications and project planning and eBay is still trying to get it right. The atmosphere is extremely meeting heavy. Reviews for projects are routinely sent to entire distribution lists making it hard to find out which ones you might actually need to be in. Products are not owned by one designer and the excessive use of external contractors means the section of the site you are working on could have other projects you would not see going on at the same time. Engineering will often find it difficult to make projects as you design them since eBay tries to keep back end developers and cares little about GUI programming. Although testing by researchers is available for some projects, there is no easy to use central repository to help you when the project does not have a long time line, so it is hard to learn from others' work. One of the most frustrating things is the review process, which is both very, very long and completely useless. Peer reviews take forever to write since you have to convert all text to 'business, values' speak. The majority of people will come out as 'average' and when someone does over perform, they often do not deserve it and seem to get the promotion not for actual innovative work, but for making up some 'new' way to design, or some other 'outside your usual job' type of project. This means the designers hoping for promotion will 'phone in' their projects and reserve their energy for these extra projects that don't translate to a better UI on the site. If your goal is to make the site easier to use for the actual users, you will be disappointed at your inability to get your designs through the review process. Which is extensive. Further they have jumped on the patterns bandwagon a little too hard. If you have a design out of the pattern, extensive justification is required. Although you might think this makes the site more consistent, it doesn't. And it makes you avoid innovation.",
        "advice": "Listen to the lower level managers and try to solve some of those problems. Stop trying to come up with a grand scheme and develop an easy to use, internal communication system that would allow us to search previous work and documentation. If you are going to have 'fun' events, maybe spread them out a little bit, people have work to do. Maybe have less and get food that doesn't come from the cafe - we have that every…  day. People who work here (at least in UED) already focus on the customer, you are just catching up. If you want to have the corporate 'values' worn on each badge, read them and follow them. I don't ever want to work at a place that is beating out 'Capital One' for worst company of the year - people know we own Paypal, they will never believe you are not taking their money twice. Solve that problem would you?",
        "pros": "eBay treats you like an adult and that can be nice if you come from a small company where they are constantly involving themselves in your work. You are given general information and expected to run with it and create a solution. There are some great employee amenities on site including massage and car wash and a nice size cafe. Fun events are a regular happening, sometimes once a week. If you have the right Manager … - I do - many of the difficulties will seem less difficult. As far as I can tell, there is only the one so be careful which group you choose. The campus has on site parking (get here early) and nice size cubicles. The outside areas are really excellent and have places for gathering and having meetings when the weather is nice. There are many good places to eat nearby.",
        "summary": "Does look good on the resume, but not a good place to learn or teach.",
        "role": "Interaction Designer",
        "date": "Jun 17, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The culture is incredibly bureaucratic and there are an exorbitant about of meetings. \"Fast\" at eBay is six months and when it's released it will be unstable and bug ridden. Quite a bit of the design and development relies on off shore agencies which can be quite frustrating and impacts the quality of the end product.The culture is extremely buzzword-rich and there's quite a bit of talk and very little action… . Employees who are good at talking the talk are often heralded but those are the ones that rarely deliver. I've been told many times the outcome is not important as long as everyone gets along. It's very much a culture of not rocking the boat.They are about 4 years behind in terms of design and technology. The development process is so fat and lumbering that it's going to be nearly impossible to catch up. I believe that they want to innovate and move faster, but the current system actually makes that extremely difficult and expensive.There's a lot of people with good ideas but they are buried under layers of management and \"stakeholders\" that often water ideas down until they are shadows of what they were supposed to be. The design review process is quite thick and in my opinion counter-intuitive to getting anything innovative or even evolutionary out there. There's a lot of old blood who haven't caught up with the times and are unwilling to try something different simply for fear of change. It's a shame because there's so much room for improvement.",
        "advice": "Take a look at how fat the company has become and ask yourself how many employees are actually important to getting the job done and how many are just bolstering the corporate phases and standing in the way of making progress. Slim down the process, allow and encourage your employees to take more risks. The talent is already at eBay to do so, it's just buried.Flatten out the reporting structure, make it easie… r and faster to make a decision. There's no need to break a department down to 2-3 people per manager. Reward and recognize employees who like to try new things and aren't afraid to speak up when something is wrong. It's so hard to do this and the impact is lost when you have to go through numerous managers.",
        "pros": "Great brand recognition and being associated with one of the original dot-com success stories. Working on a large scale site with millions of users and being able to affect the lives of many people in many different ways. It's a relatively fun culture - if you make it one. At the lower levels there's great people who are passionate about what they are doing which makes you want to work that much harder. I have a grea… t sense of camaraderie with my co-workers and it's one of my favorite things about eBay.Outside of that, if you are into trite things there are free sodas and bagels on Wednesdays and typical dot-com things like ping pong, fooseball, fitness center, basketball and bocce courts. It's a relatively laid back environment.",
        "summary": "Good hearted company with a time tested business model that has become slow and bloated in it's age.",
        "role": "Visual Designer",
        "date": "Jun 17, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Not the smartest co-workers ... The company's adoption of new technologies is somewhat slow. The environment is not conducive for innovation.",
        "advice": "Run this more like an engineering organization than a consumer company.",
        "pros": "Friendly people, some really smart",
        "summary": "EBay as a workplace",
        "role": "Senior Software Engineer",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "horrible management external recruits ! bad decisions by management to pay exorbitantly for Skype, lost most of the cash and long term value through bad acquisition decisions. Management largely incompetent but masks it by re-orgs and frequent powerpoint presentations via \"ALL-HAND\" meetings.",
        "advice": "focus on cloud computing, stop putting money into skype! divest paypal, you will not be able to grow paypal any more, as amazon is stepping into that arena and will perform much better, focus paypal on being the next VISA or MASTERCARD!",
        "pros": "good time off days relative to industry, bonuses were good but now is deteoriating due to weakening profit and revenue growth, supports education upgrading",
        "summary": "BAD MIDDLE MANAGEMENT, incompetent directors and senior managers.",
        "role": "Senior Finance Manager",
        "date": "Jun 18, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Compensation here is lower than average. Promotions are given based more on politics (who used to work with whom at a previous company) than actual job performance.",
        "advice": "Pay more attention to actual perfomance and less attention to how well someone is able to \"report up\". Pay more attention to (and solicit more) feedback from \"lower level\" employees. We could have told you that a lot of your decisions were bad before you spent millions and watched the s**t hit the fan, because instead of sitting in a conference room all day and watching Powerpoints, we actually use the site and have … some contact with the members. (Cases in point: eBay Express, Skype, recent changes to the Feedback system...)",
        "pros": "The benefits package is good. My team is reasonable in their expectations when it comes to work/life balance.",
        "summary": "eBay is too top heavy and political",
        "role": "Anonymous Employee",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The process is very rigid there, slowing down progress. As a result, people are essentially unable to make individual contributions in their free time not explicitly planned or documented as part of a project.",
        "advice": "Either better communications at the reasons for what appear to be arbitrary large scale changes, or a better discussion process.",
        "pros": "Pretty relaxed in general. All engineering time is well documented preventing situations where engineers need to work a significant amount of overtime.",
        "summary": "Relaxed but Unimpressive workplace",
        "role": "Software Engineer III",
        "date": "Jun 23, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Three words: politics, politics & politics. The working environment reflects Meg Whitman's own political style ... which is to say ruthless and passive-aggressive. Meg and her leadership team managed to transform Pierre's utopian vision and great business idea into a sharp-edged organization feeding the Street quarter to quarter. What a shame. Meg's gone now but the die is cast ... I'm still in touch with lots of…  friends at eBay and nothing's really changed -- except they renamed eBay Park \"Whitman Campus\" and now there's a Hooters across the street. I'll bet Meg's blueblooded sensibilities are deeply offended by that ... hilarious. Anyway, I ultimately left eBay because I couldn't square the incredible opportunity there with how they've sucked all the life out of Pierre's original vision. That, and because it's a sweatshop that inevitably burns people out and then tells them they seem less engaged. Wha??",
        "advice": "Recognize that the eBay marketplace is going away ... e-commerce has grown up all around eBay (while Meg was absorbed with the business of being Meg), and the typical online buyer's tolerance for Amateur Hour is dwindling fast. PayPal is the only real strategic asset going forward. Dump Skype -- what a turkey. I'd sell the whole mess to Google while you can still get a good price.",
        "pros": "Great brand, and a great business, still, even though the business model has been effectively outmoded by the changes that have swept thru e-commerce in the past 5 years. Pierre Omidyar was and is a visionary with a truly unique business idea and a singular view of what the Internet can do for our society. It looks good on your resume -- even with the recent tarnishing of eBay's image and relevance, people still resp… ect you for having worked there. There are some really fantastic people at eBay, at all levels of the company, even after many/most of the really great folks have moved on.",
        "summary": "A Story of What Could Have Been -- But Isn't and Won't Be",
        "role": "Vice President",
        "date": "Jun 27, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very stressful environment due to multitasking and too many releases. Very thin opportunites for growth inspite of putting lot of hard work. Verd bad medical and other perks. No constant motivation or financial rewards for people who work very hard and make a difference. Recently to many mangement changes and politics.",
        "advice": "They need to improve the downsides that I have mentioned in order not to loose people and also make ebay a great place to work.",
        "pros": "To get the experience of working on a highly scalable architecture. Learn about processes, ability to multitask, work with different functional and development teams, collobrate.",
        "summary": "Good to have on your resume. But not a place to work after 2 or 3 years.",
        "role": "Staff Software Engineer",
        "date": "Jul 4, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "All work with criticism but no praise. There is a strong tendency to add work without really checking to evaluate the load already on a person. Deadlines are imposed, not collaboratively developed. Management does not encourage employees to innovate. In fact, innovation is beaten back. The entire atmosphere is process driven--serve the process, but the process does not serve the organization. Does not seem to be much…  opportunity for advancement. Few people get promoted. Become good at the job you do and you will stay in it for months, even years. Pay does not seem to be competitive with similary types of companies.",
        "advice": "Treat everyone with respect. Contractors are treated as second class citizens and left out of important informational meetings. Even the employees recognize the difficulty with everyone not being fully informed on company direction.",
        "pros": "Working with leading edge technologies. eBay is a leader in the industry and trying hard to keep up with the competition. There is a lot of youthful energy at eBay that, if channelled correctly, would help push the company ahead. The facilities are unique and always kept neat. Even though it does not always include everyone, campus life is varied. Internal training is helpful and employees are encouraged to take adva… ntage of it. For those who like structure, the Product Development Life Cycle PDLC is perfect for them. Serve the process, and management is happy with the way things are going.",
        "summary": "Learn the business at eBay, but not a good place to work long term.",
        "role": "Senior Project Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Bloated infrastructure and organization. Change is slow and by the time it happens is often outdated. Executive buy-in on projects is difficult to maintain throughout the life of projects especially large long term projects. Lot's of red tape to cut through to get projects approved, too many departments. Very few opportunities for career advancement.",
        "advice": "Find and back quality projects with a proven ROI instead of just backing ideas. Move quickly and keep momentum going until the project / new feature is completed and implemented.",
        "pros": "Good Benefits- medical, dental, stock options (for management), matching 401(k), exercise facility. Opportunities for training and building your personal skills. The company is full of intelligent people to learn from. A good place to learn about how internet business works. Very fast paced organization, never a dull moment.",
        "summary": "eBay- a great place to learn the online business but not one where you want to stay long term.",
        "role": "Project Manager",
        "date": "Jul 23, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The middle management is very incompetent and totally screwed up. They are busy in too many useless meetings and keep dishing out BS to employees.Too much politics.Compensation here is lower than average. Promotions are given based more on politics than actual job performance.Bloated infrastructure and organization. Change is slow and by the time it happens is often outdated. Very few opportunities for career…  advancement.",
        "advice": "Clean up the fat layer from the middle. Get rid of middle layer instead of getting rid of engineers. There are way too many directors and VPs for a company this size",
        "pros": "The brand is well recognized. The company is full of intelligent people to learn from. A good place to learn about how internet business works.",
        "summary": "eBay stuck in a wheel which goes round and round but never goes up :(",
        "role": "Senior Software Engineer",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Upper management is inept and tends to \"swoop\" in and make arbitrary changes to projects without supporting data. Politics is nasty, especially on the business side of things. There is significant favoritism given towards skinny blonde chicks by some senior managers. It takes a lot of work to get products out. John Donahoe is, I expect, going to run the company into the ground; he doesn't understand the eBay ecosyste… m, and driving Rajiv Dutta out of the company was a truly crazy thing for him to do.",
        "advice": "Ditch your CEO and start LISTENING to your wailing employees.",
        "pros": "It's a good name to have on your resume, and you will be working for a company that provides a living to millions of people. Bonus structure is good for a tech company.",
        "summary": "eBay attracts a lot of great people, then the company culture beats them down and they leave within a couple of years.",
        "role": "Senior Product Manager",
        "date": "Aug 22, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Incompetant supervisors who micro-manage rather than encourage and support.",
        "advice": "Trust and respect of employees could result in a more loyal and dedicated workforce.",
        "pros": "Good benefits package. Great coworkers.",
        "summary": "Corporate politics is rewarded over hard work and dedication.",
        "role": "Account Manager",
        "date": "Aug 22, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Unclear decision-making, lack of accountability and disregard for critical functions that aren't directly driving the business, but are still indispensible.",
        "advice": "Articulate a vision and get people invested in it. Right now, people are operating in crisis mode, but there isn't a lot of compelling reasons to stay. As the good folks hit the road with more and more frequency, \"put your head down and get your work done\" is less a rallying cry and more a threat. And even if the job market is so-so right now, attrition isn't going to get any better without inspiration from the leade… rs of the company.",
        "pros": "Used to be the quality of the team - smart, vibrant people and a clear, defined mission for the business. Those things are changing, so now I'd say it's still a company with potential, as soon as the \"turnaround\" is over.",
        "summary": "Wounded company that needs to find its way again",
        "role": "Senior Marketing Manager",
        "date": "Aug 24, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management couldn't care less about ideas for improvement. Only senior management is listened to but rarely has real input since Donahoe came on board. His ego is tremendous and he truly believes that his disruptive innovation will work. Unfortunately he refuses to admit it hasn't worked.",
        "advice": "eBay is going downhill since the changes this year. Reverse them and get our sellers/buyers back. It is apparent to Wall street that things are dismal for eBay's future hence the rapid stock decline. Employees morale is in the dumps due to the fact we have to toe the company line even when we know it is wrong.",
        "pros": "When you can't find a position anywhere else. Ebay was much better under Meg...not perfect just better.",
        "summary": "Ebay can be better with changes.",
        "role": "Software Engineer",
        "date": "Sep 2, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Hard work and brains don't get you promoted.",
        "advice": "#1 - We need more worker bees and less chiefs. #2 - Have a solid long-term plan instead of chasing our competitors. #3 - Recognize and reward your hard working employees.",
        "pros": "You'll be surrounded by some of the brightest people in this industry.",
        "summary": "If you're bright, passionate, and energetic, you'll eventually become drained and resent everything you ever worked for.",
        "role": "Marketing Manager",
        "date": "Sep 3, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many layers of managers/exec, not enough people doing the work. It used to be a place where people can be innovative, but given how the company has been running in past couple of years, it's a place with too many problems incurred from the past and no time to think ahead.",
        "advice": "Trim company size by 25%, reduce the management layers and have the people focus on few initiatives and not 1000..",
        "pros": "Pays well compare to other companies.",
        "summary": "Too many talkers, not enough doers..",
        "role": "Software QA Manager",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Long hours; low base pay - compensation based on model when the company stock was returning 20% or more per year; management a bunch of MBA gear heads who do not understand the business and rarely use the auction site",
        "advice": "Get back to the basics and remember what made the site great in the first place - fun place to shop; neat items; mom and pop sellers; level playing field; HIRE PEOPLE who are active eBay users!",
        "pros": "Brand recognition; the auction site is a great \"equalizer\" for mom-and-pop sellers against bigger companies on the web; great people - smart, passionate, caring; great corporate value, which are: (1) Lead Completely (2) Keep It Human (3) Trust One Another (4) Practice Judgment",
        "summary": "One eBay insider's point of view",
        "role": "Program Manager",
        "date": "Sep 8, 2008",
        "is_current": true
    }
]