[
    {
        "rating": 4,
        "cons": "First level management is miss and hit.Hard to come by a good opportunity.",
        "advice": null,
        "pros": "Direct impacts on millions of people.Use of latest technologies.Strong focus on open source.",
        "summary": "A decent company",
        "role": "Member of Technical Staff",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor work life balance. Typical week was min 60 hours, it was hard to break away from work.",
        "advice": null,
        "pros": "Amazing culture with great people!",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Mar 17, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "1. Too much red tape.2. Salary lower than market rates for the same position. I mean fairly low, really low.",
        "advice": "Need to ensure that projects are done in an agile manner.",
        "pros": "1. Excellent work life balance.2. You can leave at 6 PM and be done for the day.3. Flexible work hours.4. Frequent parties for employees keeps the morale up.",
        "summary": "Good Company to work for.",
        "role": "Member of Technical Staff",
        "date": "Mar 28, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Need a little more action orientation.",
        "advice": "Let's fix the existing bugs with just as much energy and motivation.",
        "pros": "Encouraging management, focus on what matters.",
        "summary": "Great company to build a career",
        "role": "Anonymous Employee",
        "date": "Apr 2, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work-life balanceToo many passive aggressive characters",
        "advice": null,
        "pros": "Great CEO trying to build lasting companyGreat career opportunities",
        "summary": "Excellent Company",
        "role": "Director",
        "date": "May 1, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It is getting large and there is more office politics than needed.",
        "advice": "Do a better job of keeping early employees at eBay instead of hiring from outside the company when there are plenty of loyal employees waiting to move up after years of hard work.",
        "pros": "Well known company that is not going away. Global leader in eCommerce. PayPal also continues to shine.",
        "summary": "Great company and smart employees.",
        "role": "Program Manager",
        "date": "May 5, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Change and innovation may not happen as quickly as you would like. eBay is a big company and can take a while to adopt or understand that there is a change that's needed (although it's lessening as they adopt new methodology, technology and infrastructure).",
        "advice": null,
        "pros": "You will be rewarded for your efforts, and you will be able to be heard by management. There is a growing culture of innovation, too.",
        "summary": "Well positioned and growing, with good leadership",
        "role": "Member of Technical Staff",
        "date": "May 17, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Engineering culture is bad at its best.",
        "advice": "Engineering is not an hour to hour management.",
        "pros": "dynamic, fast paced, people have good career growth",
        "summary": "Over all good place to work but poor engineering culture",
        "role": "Anonymous Employee",
        "date": "May 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "highly competitive internally. I worked for 2 years and couldnt move up in positions or depts.",
        "advice": "More opportunities to advancement or have a better structure",
        "pros": "great health plans, free sodas and fun environment.",
        "summary": "Great benefits",
        "role": "Customer Service Representative",
        "date": "May 28, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Such a big company, takes time for teams to get some things accomplished.",
        "advice": "Better training and clarity at beginning of projects for new contract people.",
        "pros": "Work environment is very flexibility",
        "summary": "Good Work Environment",
        "role": "Content Implementation Specialist",
        "date": "Jul 5, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Takes a long time to get changes made, politics play a part in decision making",
        "advice": null,
        "pros": "Good customer focus, great leadership, opportunities to try new things",
        "summary": "Great company with an amazing mission, but hard to get big things done",
        "role": "Director of Product Management",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "CXO vision and ideals not internalized by next level of leadership; silos and duplication; islands; vindictive personalities and petty politics; constant restructuring leads to apprehension among junior employees",
        "advice": "Audit the cost to the company of project delivery and scrutinize all build versus buy decisions",
        "pros": "Company with a moral compass; very good compensation; leading edge technology; Xtreme scale; large geo footprint; great bubsiness model and huge potential in worldwide online and offline commerce",
        "summary": "Great learning experience",
        "role": "Senior Director",
        "date": "Aug 2, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not even across the board with attendance policies.",
        "advice": "Everyone needs to be on the same page with policies and procedures.",
        "pros": "Incentive, flexibility, prizes, games and growth.",
        "summary": "Great place, people and the environment.",
        "role": "Customer Support Agent",
        "date": "Aug 6, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lacks consistency in the assessment of performance of people",
        "advice": null,
        "pros": "Smart people, fun environment, global, job opportunities",
        "summary": "Fun, smart and you will work hard",
        "role": "Human Resources",
        "date": "Aug 6, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Long work hours, work life balance can be difficult to achieve",
        "advice": null,
        "pros": "Good work, plenty of different technologies to work on",
        "summary": "Senior software engineer",
        "role": "Senior Software Engineer",
        "date": "Aug 10, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Pay could be better, seems a little top heavy",
        "advice": null,
        "pros": "Perks and group activities are great",
        "summary": "Great benefits, treat people awesome",
        "role": "Anonymous Employee",
        "date": "Aug 14, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "overall not much growth and career opportunity but also depends on place",
        "advice": null,
        "pros": "great company, work environment good. flexible work hours for some job good benefits,",
        "summary": "software engineer",
        "role": "Anonymous Employee",
        "date": "Aug 16, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can be political at times. Promotions not always merit based especially when comparing across groups.",
        "advice": "Continue to invest in your people. Respect institutional knowledge.",
        "pros": "Amazing business model that generates lots of cash. Complexity of two sided marketplace makes problem solving fun and challenging.",
        "summary": "Solid company that attracts strong talent. Ability to learn and grow.",
        "role": "Anonymous Employee",
        "date": "Aug 18, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "very political, loudest person in the room wins",
        "advice": null,
        "pros": "Very talented technology team, high expectations, very complex technologies",
        "summary": "Technology Operations",
        "role": "Anonymous Employee",
        "date": "Aug 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "benefits are not that good",
        "advice": null,
        "pros": "good salary and opportunity to work on latest cutting edge technologies.",
        "summary": "Member of Technical Staff",
        "role": "Member of Technical Staff",
        "date": "Aug 26, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The backbiting taking place in some groups is absolutely astonishing. The first time I witnessed it I was floored - and very uncomfortable. It's as if these folks think that this type of behavior is actually an acceptable way of doing business. I've seen reputations destroyed with the flick of the mute button, as a SENIOR MANAGER mutes a conference call, bad-mouths the speaker to a full conference room, and then turn… s the audio back on. If you EVER get on the wrong side of anyone who has any influence over your work, you will find it very difficult to overcome the negative trash-talk that will instantly take place and propagate all around you - but never to your face. Your manager will base your reviews on hear-say, and you will be destroyed. If this happens to you, you should start looking for another role at another company immediately, because you won't be able to overcome this here.",
        "advice": "Hire someone exactly like David Marcus to take over and direct eBay core. I think the back-biting culture might be just too far gone for a turnaround, but you could take a shot at it.",
        "pros": "eBay is going through an interesting transition right now, as it tries to bring the old marketplace site up to modern retail standards. There are a lot of projects and various efforts around the company to improve look, feel, voice and tone, as well as modernize the engineering and UX of the site tools themselves. Challenges make for opportunities, and for those of us who enjoy change, this is a cool place to be. The… re are a lot of very sharp people here working very hard to make things better.The company seems to genuinely care about employees, which is refreshing after some of the turns I've seen being taken at other companies in this economy (Netflix, I'm looking at you). Fitness centers, cafeterias, ESPP, decent pay and other programs definitely make a difference as far as feeling valued by the company. Work-life balance is there, and while working from home is usually up to your manager, as a whole the company is open to it. The San Jose Hamilton campus is really pleasant, and the PayPal campus, while trickier to get to, is also very nice. Parking is an issue everywhere, but the company has provided free valet services to help with that.",
        "summary": "Nice place to work, except for one thing",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "not great, location, money is not great, at times, manager",
        "advice": null,
        "pros": "great work life balance, enough challenges and great career path",
        "summary": "great",
        "role": "Anonymous Employee",
        "date": "Sep 7, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "People could be nicer. It can be a tense work environment with lots of stressed out people snapping at each other.",
        "advice": "Keep it up, you are moving in the right direction. I would love to see some of our long term projects come to fruition, I'm tired of my friends asking me when the digital wallet is coming.",
        "pros": "Good company with great leadership. John Donahoe is the unsung hero of SV. The compensation is good and they are generous with Restricted Stock Units. Nice work environment.",
        "summary": "Good place to work, great compensation, people could be nicer",
        "role": "Senior Manager",
        "date": "Sep 10, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Rather strict top-down management. Natural conservatism due to the nature of the company business and scale of operations. Cyclical demand for engineering talent driven by \"big bang\" business initiatives. Highly political environment, natural for a large hierarchical organization. Consulting companies sometimes distorting the company culture by caring less than permanent employees about the long-term business consequ… ences of their decisions.",
        "advice": null,
        "pros": "Top-notch people. Enormous scale of operations. Attention to detail and operational excellence very much appreciated. Excellent project management and resource planning. Advanced technology. Adequate work-life balance. Competitive pay. Good, conveniently located offices. Somewhat flexible work schedule.",
        "summary": "Great company, yet big, with all that it entails",
        "role": "Senior Software Engineer",
        "date": "Sep 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- PayPal is San Jose centric.They need to understand that talent is not location specific.- More communication to managers regarding making return offers.Some of them were caught unawares.",
        "advice": "Keep up the great work!",
        "pros": "I worked as an intern for PayPal. The intern program from eBay was one of the best in the industry. The people I worked with were some of the best in the industry. Extremely talented and knowledgable.Perks were one of the best in the country.",
        "summary": "Great experience from eBay Inc.! PayPal not so much.",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A little behind the times, somewhat slow",
        "advice": null,
        "pros": "flexible environment, room for growth,",
        "summary": "No complaints",
        "role": "Anonymous Employee",
        "date": "Sep 18, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "lack of organisation and information exchange",
        "advice": "Please be more clear with offer at the end of the internship",
        "pros": "friendly, good pay and easy access to top managers",
        "summary": "awesome",
        "role": "Anonymous Employee",
        "date": "Sep 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You are a tiny cog in a HUGE machine!",
        "advice": null,
        "pros": "Benefits and time off were great.",
        "summary": "A great place to work for benefits.",
        "role": "TSAM",
        "date": "Sep 30, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Too many things to rollout a feaute- Process is slow.- Work/life balance is just okay.",
        "advice": null,
        "pros": "- Great Place to Work for.-WIll learn a lot- Hands on many new technologies",
        "summary": "Good Company to work for",
        "role": "Software QA Engineer",
        "date": "Sep 30, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Marketplace has lot of baggage if you like to code, Old platforms, everything is proprietary, you will get to maintain old code on old platform and its frustrating at times. San Jose and Seattle get all the good work, Austin gets all the left over, not enough commitment from management to grow Austin Site.Way too many folks with H1B.",
        "advice": "Jon Danahue is a super hero .... awesome leader for eBay no doubt.1) Grow the Austin site, there is way too much talent here.2) Remove the tools and platform teams, there are enough resources in open source these days to reinvent and create overheads on those open source technologies by hiring tools and platform engineers.3) Simplify and increase your cycle times to move features to the site.",
        "pros": "Good perks, Good people and easy access to work from North Austin. Online commerce is the place to be today, eBay is in middle of making huge strides.",
        "summary": "MTS1 Software Engineer",
        "role": "MTS1 Software Engineer",
        "date": "Oct 5, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A game to get promoted.If you don't play the politics you don't get anywhere.",
        "advice": "Address the politics!",
        "pros": "Free soda, bagels, etc.Plenty of fun competitions.Great facilities.",
        "summary": "Get rid of the politics and it's FIVE star all the way",
        "role": "Customer Service Representative",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Politics. Limited growth depending on what team you are on.",
        "advice": "Recognize the work done by all employees",
        "pros": "Great people to work with.",
        "summary": "Overall I have been enjoying my time at eBay",
        "role": "Senior Software QA Engineer",
        "date": "Oct 16, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "General competition among peers could create unnecessary stress",
        "advice": "keep hiring the top talent",
        "pros": "A lot of talented and hardworking folks",
        "summary": "Great company to work for",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very easy to get lost among all the people",
        "advice": null,
        "pros": "Very flexible, friendly culture, equal opportunities for women",
        "summary": "Great place for work life balance",
        "role": "Anonymous Employee",
        "date": "Oct 23, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As with any corporation - politics.Managers who shouldn't be managers, but once there no one removes them, but rather tries to grow them at the expense of direct reportsMaybe not a con, but lots of reorgs to increase innovation and shake things up. You won't have the same manager for more than year (maybe a good thing)For an established company it appears that Sr. Mgmt still can't find the right compass h… eading",
        "advice": null,
        "pros": "Open and collaborative environmentCurrently growing by riding the mobile waveEncouraged to innovate and take one's own initiativeGood work life balance - very few people working the weekends",
        "summary": "Overall good place to work, lots of long timers, relatively low turnover, good friendly people",
        "role": "Manager",
        "date": "Nov 14, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Became extremely corporate and full of politics",
        "advice": null,
        "pros": "Awesome Founder and great CEO",
        "summary": "Great Company!",
        "role": "Senior Director",
        "date": "Nov 14, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Getting more difficult to get things done as the company is growing",
        "advice": "Do more to create opportunities for existing employees. Company started to do more hiring from outside versus promote from within in certain organizations.",
        "pros": "Great people, leading edge technology, opens doors because it is recognized as a great company",
        "summary": "Working at eBay",
        "role": "Director",
        "date": "Nov 26, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The biggest downfall is change. eBay is constantly changing, and for the average employee it makes it unnecessarily difficult to perform the basic functions of the job.",
        "advice": null,
        "pros": "eBay is a fun company to work for. The benefits are awesome, the perks are great, and the culture is pretty cool too.",
        "summary": "Great Company, severely mismanaged",
        "role": "CSA III",
        "date": "Dec 3, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "As the company became more mature, the vision was lost, most of the new hires came fresh from Business School with a goal of resumé building. Rather than engage with the company, these employees looked to climbing the ladder up and out, and treated their jobs and co-workers as temporary, but aggressively sought recognition and remuneration.",
        "advice": "Decide what eBay is going to be for the future. Develop a vision of where you want to take eBay and the best (or better) way to get there. Stop trying so many different approaches without letting any of them continue to maturity. Don't buy any more companies without thoroughly investigating them and considering how they fit in with the overall picture.",
        "pros": "The Founder had great ideas, a vision for the future, and built a company that supported employees to enable them to do their jobs and encouraged innovation. Pay was adequate, low for Silicon Valley, but employee stock purchase opportunities and option grants were good, and sabbaticals were regularly scheduled.",
        "summary": "Weak leadership",
        "role": "Project Manager",
        "date": "Dec 14, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Sometimes take a lot of time and effort to execute things.",
        "advice": null,
        "pros": "The company supports employee development.",
        "summary": "Great Work Culture",
        "role": "Anonymous Employee",
        "date": "Dec 23, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Time off is not the best setup... no sick leave.",
        "advice": null,
        "pros": "food, great compensation and great upper management",
        "summary": "Great Company to work for",
        "role": "Customer Service Representative",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Work life balance is not that good.",
        "advice": null,
        "pros": "Good Leaders, Good teams, good projects",
        "summary": "Good Company, good People",
        "role": "Software QA Engineer",
        "date": "Jan 6, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "no work life balance, seems like tied to work all the time",
        "advice": null,
        "pros": "hackathons,quality awards,exposure to latest technology, changing trends, fast paced",
        "summary": "awesome!",
        "role": "Senior Software Engineer",
        "date": "Jan 16, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Once you reach manager level or higher, work-life balance will suffer. You may lose any sense of family or leisure time as demonstrated by countless managers, Sr. Managers, and Directors working 12+ hrs/day. Most of the time your manager won't be sensitive to it either and burnout is commonplace. I hear the same for Amazon and other tech companies, so it's probably commonplace in the industry. It's a fast-paced and i… ntense culture where they promote innovating and moving quickly to capture market share, but most of the time that translates into very early mornings, late nights, calls from your boss over the weekends, being expected to check email over the weekends, frequent sacrifice of family time, etc.To be fair, any company where you want to earn a significant financial reward will demand a lot and so some of this comes with the territory. But I find it slightly odd that the company promotes work-life balance so much when it's really non-existent for higher-level employees.",
        "advice": "There are some leaders who don't add value and they don't get booted fast enough, which really slows down the valuable employees. I've seen many arrive at 10 and leave by 3 day after day. I've seen some highly paid folks disappear for days even weeks at a time without coordinating with their teams. And there are even some who--when they are present--don't do much more than talk a good game. I've come to the conclusio… n that some positions are more 'cushy' than others and some bosses are more demanding than others, but either way it's bad for morale, especially to those working 10+ hrs each day.",
        "pros": "Lots of opportunity to shine. The company is so large that there are always opportunities to get promoted if you can add value in some way. Have patience while working in lower level positions, learn the ins and outs of eBay, and within a year or two you will be a very knowledgable asset to the company and a smart leader will be happy to promote and offer you a great opportunity and likely more money.Once you… 're in the higher roles, you really need to be able to execute and achieve results. If you can set realistic goals that help the company achieve top-level targets, then you will go far. Be critical to a degree, but not too cynical or negative. If you are critical, try to offer something proactive and helpful in exchange. Be thoughtful in meetings and when working with senior leaders. eBay needs proactive, high-energy, highly intelligent folks who can adapt quickly to changing market dynamics and execute.I've been very impressed by most of the directors I've worked with and eBay has some very sharp VPs and Sr VPs in place who know what they are doing. This is a company that wants to be around for a long time, not just a quick bump in the stock price. They are passionate about the culture of eBay and laser focused on improving it. I am fully confident in the leaders we have currently and it's very easy to buy in and support them.",
        "summary": "Lots of opportunity if you are sharp; You can stand out and make a difference",
        "role": "Program Manager",
        "date": "Jan 30, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you start at the bottom, it can take several years to start moving up. High paying, career jobs are somewhat limited in the call centers.",
        "advice": "Invest a little more cash to keep the good people, and focus on improving the hiring process to reduce turnover.",
        "pros": "Great benefits (stock plan, tuition assistance, healthcare). Laid back culture. Seems a little more results oriented than political in terms of who gets promoted. Upper management and executive leadership makes a real effort to visit and listen to concerns from all levels of workers.",
        "summary": "Great company, not a log of advancement opportunity in call centers",
        "role": "Customer Service Representative",
        "date": "Feb 1, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not much room to try different kinds of new technology",
        "advice": null,
        "pros": "In eBay, there are lots of talented people. They respect each other. And the dev env and processes are streamlined and well documented. A developer could be very productive with minimum training.",
        "summary": "Great place to work! \"",
        "role": "Member of Technical Staff",
        "date": "Feb 10, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Supervisors, Managers, and Directors - if you get one supervisor that does not think highly of you it will destroy your career.",
        "advice": "In cases where someone was a \"star\" employee for over 4 years, and then under the supervision of just one manager starts to be a \"poor employee,\" (especially when this is the case with a whole team, other than who that person hired specifically), maybe it's time to re-evaluate your choice in managers.",
        "pros": "Amazing people, incredible benefits, fun environment. I loved working for eBay initially, but they started to pull back benefits, and trust from all employees. I have heard they have reversed some of this, but it was not the same.",
        "summary": "Wonderful - except for management",
        "role": "Motors TSAM",
        "date": "Feb 22, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lots of red tape to get projects moving.",
        "advice": null,
        "pros": "Company 5 week paid sabbatical. Merit reviews twice a year",
        "summary": "Growing Technology",
        "role": "Director",
        "date": "Feb 26, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some managers don't seem to be familiar with all of internal structure and rules, especially in regards to HR, and thus can make life difficult",
        "advice": "Follow the rules. You're not above them",
        "pros": "Fun colleagues, great benefits, well structured company, opportunities to move up the ladder",
        "summary": "Trust and Safety Agent",
        "role": "Trust and Safety Agent",
        "date": "Feb 28, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Like any other big company, growth is very competitive.",
        "advice": null,
        "pros": "Massive scale of technologies. Amazing user focus. Technology stack has matured and adopts latest technologies and open source standard.",
        "summary": "So far so good.",
        "role": "Member of Technical Staff",
        "date": "Mar 1, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Only works on small component",
        "advice": null,
        "pros": "Work life balance is good",
        "summary": "Work life balance is good",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work Life Balance can suffer",
        "advice": "Allow your people time for family life, and help hires with career path",
        "pros": "It is a strong company, financially speaking",
        "summary": "eBay",
        "role": "Anonymous Employee",
        "date": "Mar 3, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Work life (im)balance-Promotion process is political in nature, not much transparency",
        "advice": null,
        "pros": "-Excellent technical challenges-Opportunity to work on latest products-Nice teammates",
        "summary": "Software Engineer 3",
        "role": "Software Engineer III Quality",
        "date": "Mar 4, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Everyone has a different and non-additive agendaNeed to be political to succeed at workMatrix organization, so setting goals are not sharedRather than being creative & customer centric, financial results alone measures product decisions",
        "advice": "Set a vision and the company will come together as a glue to contribute towards that vision",
        "pros": "Open work culture, Great benefits, Compensation is very competitiveWould recommend the company for learning eCommerce and how to work in a matrix organizationLots of growth opportunities and avenues of growth",
        "summary": "Senior Product Manager",
        "role": "Senior Product Manager",
        "date": "Mar 6, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Compensation lower than market; bureaucratic promotions process.",
        "advice": null,
        "pros": "Great career opportunities, mobility, flexibility",
        "summary": "Good career opportunities",
        "role": "Anonymous Employee",
        "date": "Mar 10, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Micro management, not a lot of growth yet for the new Austin call center",
        "advice": "Be consistent and human.",
        "pros": "Good starting Pay, good benefits",
        "summary": "TCC Teammate",
        "role": "Anonymous Employee",
        "date": "Mar 16, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "don't really have complains about this company",
        "advice": null,
        "pros": "Plentify of opportunities to work with and learn different applications and technologies",
        "summary": "Overall a nice company to work for",
        "role": "Senior Software QA Engineer",
        "date": "Mar 17, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "big company working environment, many levels of hierarchy",
        "advice": null,
        "pros": "better pay, bigger company, convenient location",
        "summary": "eBay MarketPlaces Finance",
        "role": "Anonymous Employee",
        "date": "Mar 18, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Its primarily a call center so don't expect to get your foot in the door and then move up. There is a huge bottle neck of customer service reps trying to get professional positions and most of those are filled by external candidates. If you get highered as a customer service rep, don't plan on getting promoted.",
        "advice": "Why do you pay for everyone's school degree's and then not give them an opportunity to use it? I would love to give back to the company after getting 3 years of tuition reimbursement but not as a teammate on the phone.",
        "pros": "Great pay, great benefits. Will find ways to make the job work with your life.",
        "summary": "Great company but not vertical growth",
        "role": "Anonymous Employee",
        "date": "Mar 27, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "very poor decision making by top managementpoor accountability and ownership",
        "advice": null,
        "pros": "great work-life balanceopportunity to try several different things",
        "summary": "best place to work but very weak leadership",
        "role": "Anonymous Employee",
        "date": "Mar 30, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Depending on which group you belong to, sometimes the message doesn't get to you. Some groups are just not that good at communicating.",
        "advice": "Train your managers on the basics: Interviewing, leadership, etc.",
        "pros": "eBay is competitive, or does its best, with competing offers... surprising to me. RSUs are competitive. Bonus plans are usually good and payout; 2013 was the exception as the company didn't meet its goals so payout was below 100%. However if you exceed then you can bring it back up to 100%.",
        "summary": "Good large org experience",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "eBay has heavily overloaded and complex hierarchical structure with multiple tiers of management. It might be interesting for people who want to grow in management ranks. But it's definitely not the right culture for majority of start-up folks which are acquired by eBay year over year.If you need a real-life application of Parkinson's law on bureaucracies that multiply themselves - this is a place to come and see…  it. Self-sustained manager cohort grows, projects could be turned down the \"next day\" they started, the same thing could worked on by multiple independent teams in different departments, rewards are often given to unrelated but favored managers and people in front lines in the actual teams who do the work are ignored - all of this can be found here.",
        "advice": "I wish the leadership team initiatives started in the couple of last year come true one day, and the currently \"rather good\" company becomes a great and enduring company. I believe this is the right thing to do, yet there's still a long road to go.",
        "pros": "Good benefits, a lot of great people, some interesting and challenging projects on the cutting edge of technology.The company provides a lot of training and free access to a lot of valuable resources for personal and professional growth for both the technologists and managers. There's a lot of opportunities to grow in the company or make a lateral shift by moving to other team or project.",
        "summary": "Sometimes the best, sometimes the worst",
        "role": "Director, Software Development",
        "date": "Apr 4, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "a bit stovepiped and with some people being promoted that did not have good management skills",
        "advice": "don't do processes for the sake of doing processes, make sure they count",
        "pros": "very collegial, smart people, with some great ideas and passion",
        "summary": "project manager",
        "role": "Senior Project Manager",
        "date": "Apr 7, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very fast paced (I like it though).",
        "advice": null,
        "pros": "Lot of opportunities. Proud to be part of this great organization",
        "summary": "Wide verity of technologies.",
        "role": "Systems Engineer",
        "date": "Apr 13, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You need to be able to really focus and prioritize what you're working on because there are many ways to get distracted.",
        "advice": null,
        "pros": "It's a company that does right by its employees. They are flexible and encourage transfer amongst teams. There are plenty of opportunities to stretch and grow.",
        "summary": "Great place to work.",
        "role": "Anonymous Employee",
        "date": "Apr 17, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not a lot of promotions",
        "advice": "More internal Promotions",
        "pros": "Great health benefitsGreat team members to work with",
        "summary": "Customer service",
        "role": "Anonymous Employee",
        "date": "Apr 21, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Empire building by some middle level leadership. Stacked ranking calibration led to unhealthy back stabbing. Morale suffered and to meet the criteria for stack ranking some good people were targeted and dismissed.",
        "advice": "Invest in and build your people, not tear them down.",
        "pros": "Challenges, rewards, compensation was solid. At the beginning of my time with the company team work was great and enthusiasm was high.",
        "summary": "Positive experience overall, the best of my professional career. Lots of opportunity for technical growth.",
        "role": "Middle Management",
        "date": "Apr 22, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The company moves too slow! Competition is gaining a lot of ground and eBay responds very slowly",
        "advice": null,
        "pros": "Great people, very smart, lots of empowerment. Relaxed culture and decent salaries. Flexible hours and great work life balance",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Apr 23, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Needs more organization and faster decision making.",
        "advice": null,
        "pros": "Financially stable company which provides great value to commerce. eBay provides flexibility to working parents.",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Apr 28, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "dog eat dog mentality is very present",
        "advice": null,
        "pros": "environment is wonderful and fun",
        "summary": "Love them!",
        "role": "Anonymous Employee",
        "date": "Apr 29, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Could be a little stressful at times",
        "advice": null,
        "pros": "Very smart people to work with and learn from",
        "summary": "Amazing fast paced work environment",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The organization from the top down sometimes have conflicting goals, and prioritization of work from a management position could be better.",
        "advice": "Start with a goal from the top down, and leverage the talented people you have to reach those goals. consolidate the goals and make sure the company is moving in a singular direction.",
        "pros": "Ever evolving work, nothing is the same day to day, always chasing down different leads.The People are great to work with.A results driven job, working with good, fun people.Upward mobility is possible, and the managers Encourage learning and training to get you in a better place professionally.Work-Life balance is important on a company level. The accrual of time off is good, and a bonus is the month…  long Paid Sabbatical after you have been working for the company for a set number of years.",
        "summary": "Great Work Environment and fun to be a part of a true world wide company",
        "role": "Global Rules Analyst III",
        "date": "May 5, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Iteration is slower because of red tape",
        "advice": "Be okay with letting go of dead weight",
        "pros": "Very positive work environment, very engaged in career growth.",
        "summary": "John Donahoe Rocks",
        "role": "Sales Engineer",
        "date": "May 11, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "limited progression for the ambitious",
        "advice": null,
        "pros": "Cool people to work with",
        "summary": "Awesome",
        "role": "Finance Manager",
        "date": "May 26, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Many areas lack sufficient management, either due to attrition or difficultly hiring candidates playing at our level.",
        "advice": "We have to tackle our technical debt head on!",
        "pros": "Love my coworkers and going into work every day. Lots of interesting work and technical management open to new ideas and directions. It has ambitious technical plans and is finally starting to adopt open-source genuinely. Depending on your area in the company, there is a real emphasis on work-life balance. Many employees are in the 5-10 year range, which for a valley company speaks to it's comfort (both good and bad)… .",
        "summary": "Great work environment but what's the big picture?",
        "role": "Member of Technical Staff II, Software Engineer",
        "date": "Jun 8, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company is past it's prime and showing. No longer an innovator and slow to implement necessary changes. Feels out of touch with customer base.",
        "advice": "Get to know your customer and truly center them I each decision made - none of the current lip service, but truly identify customer profiles and work to serve multiple customers at the same time. No more one size fits all approaches.",
        "pros": "Personal development, diverse culture, great job benefits with tuition reimbursement, 401k, solid healthcare, stock options, and other optimal options such as pet insurance and adoption assistance",
        "summary": "Great opportunities",
        "role": "Business Analyst",
        "date": "Jun 9, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Like every company there are some folks that hold up progress to advance their own agenda. At times passive aggression can be a problem. Getting promoted involves a group discussion, so if you've crossed someone it can come back to haunt you,",
        "advice": "There is still a lot of \"us and them\" between two of the core business units. It impacts the forward motion and it wont stop until it is resolved at the management level - starting at the Director levels. No matter what the Presidents of the divisions say - lower management is not playing along.",
        "pros": "Flexibility of schedule, interesting projects, decisions can be made at all levels. Personal accountability is a valued.The sabbatical program is a great perk, and pretty effective handcuffs.",
        "summary": "Innovation at every turn",
        "role": "Information Security Engineer III",
        "date": "Jun 10, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Playing catchup to other competitorsLimited growth opportunities. Maybe manager to blameManager never groomed anybody from within the team to step up to the next level",
        "advice": "Give people chance & opportunities to grow",
        "pros": "Some really good projects to work on. Get to know the eCommerce domainGreat engineering team to work withInnovation happening but at a slower pace",
        "summary": "Overall great experience but limited growth opportunity",
        "role": "Senior Product Manager",
        "date": "Jun 10, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Depending on your area, a lot of domains will end up with similar work.Massive legacy code base and redundant functionality on site.",
        "advice": null,
        "pros": "Great customer impact. Great management, team work is well appreciated and a good place to develop people and technical skills.Sometimes you reach career flats where you want to consider moving around, but depending on manager, its relatively easy to change teams. Lots of opportunities within eBay and Paypal.Relatively new tech stack completely based on open source standards.",
        "summary": "Great place to work",
        "role": "Member of Technical Staff I Software Engineer",
        "date": "Jun 16, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As soon as you learn your job the process or tool or policy is changed. This causes both customer ans employee frustration.",
        "advice": "As soon as you learn your job the process or tool or policy is changed. This causes both customer ans employee frustration.",
        "pros": "competitive pay and benefits. great facilities.",
        "summary": "Amazing benefits, you need to be flexible",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too much time on politics and reorgs",
        "advice": null,
        "pros": "nice benefit,lots opportunity,lots work.so many project s,smart co-worker",
        "summary": "risk analyst",
        "role": "Senior Risk Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not family friendly as a working mother",
        "advice": "Invest in current employees and promote within.",
        "pros": "Interesting industry to work in - very dynamic and cutting edge silicon valley buzz.",
        "summary": "Good",
        "role": "Finance Manager",
        "date": "Jun 20, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Leadership, a lot of people in charge of things they don't even understand. To many hierarchy levels, to many managers, duplicated efforts everywhere, bureaucracy, trivial knowledge and lack of documentation.",
        "advice": null,
        "pros": "Compensation and perks are ok",
        "summary": "Overall good company",
        "role": "Anonymous Employee",
        "date": "Jun 28, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Leadership is a bit slow to make hard decisions that rationalize multiple conflicting projects. Figuring out the linkage of your work to the big picture strategies is a bit difficult (as in any large organization). There appears to be a reluctance to pull the company together and forcefully breakdown personal (VP-level) kingdoms.",
        "advice": "Don't coddle the VP's if you want to have a successful \"One Company\", as you claim. If they won't work together (after sufficient time at the effort), fire them and get leaders who will work towards the overall good rather than just their own domain.",
        "pros": "Leadership and management are focused on developing people as the means of achieving great results. People are not just cogs in a machine (as in many tech companies). Also, a fascinating foray into one of the largest online marketplaces in the world.",
        "summary": "A culture that values people and commerce over technology for its own sake.",
        "role": "Senior Business Analyst",
        "date": "Jul 1, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor training. Slow decision making.",
        "advice": "Too slow to make decisions. At times, doing whats best for the customer and/or long-term benefit of the company is sacrificed for whats best for the company in the short term.",
        "pros": "Excellent work/life balance. Great benefits. Fair pay. Decent career advancement opportunities.",
        "summary": "Love the job and environment",
        "role": "Key Account Manager",
        "date": "Jul 7, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Career development opportunities are less.No Scope to learn great technologies.Lot of re-orgs.",
        "advice": null,
        "pros": "Lot of domains and fast paced learning. Active environment to work for. Good facilities.",
        "summary": "Software Engineer 2, Quality",
        "role": "Software Engineer II",
        "date": "Jul 14, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "After a number of promotions and over 10 years of working there, I barely got a pat on the back when I left. I went in and felt like a contributor that mattered for a number of years and left feeling like a number.",
        "advice": "Hire better people managers. There are a lot of smart people out there, but you're suffering in the morale and productivity departments because of the lack of true mentors at the company. Don't throw new programs at the problem (I know there's a mentoring program.). You need to hire people that actually inspire others. And please start showing those that have stuck with the company through good and bad some appreciat… ion, instead of operating a culture that makes that loyalty feel like a negative.",
        "pros": "There are wonderful people to work with around the company. The sabbatical program is of course a plus (after having worked there 5 years). I found a lot of opportunities for advancement and learned a lot during my time there.",
        "summary": "Great place when you start, not so great when you have been there a long time. They don't value employee loyalty.",
        "role": "Anonymous Employee",
        "date": "Jul 18, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There was zero work like balance at eBay Enterprise (formerly GSI Commerce). There were integration pains in relation to corporate culture. eBay Enterprise's leadership not quite on board with corporate leadership priorities as it related to work/life balance. Employees did not feel comfortable taking advantage of any internal program that didn't result in more GMV for their clients and management did little to disco… urage this behavior. Also, clients were unhappy with continued delays to technology platform, which created strained relations for those managing client relationships.",
        "advice": "Get on board with encouraging employees to take time to recharge.",
        "pros": "eBay is an innovative, forward thinking company with a very positive corporate culture, strong executive leadership at corporate level (in San Jose), excellent benefits and internal employee programs, and very smart people.",
        "summary": "Immerse yourself in eCommerce",
        "role": "Director",
        "date": "Jul 21, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- There are truly incompetent people still around, though that appears to be changing- Matrix org structure has killed any hope of doing anything innovative unless you can carve out a team outside of that structure- If you don't play the political game, you'll be passed over for promotions, etc.",
        "advice": "Part of change is cleaning out the dead wood. In three years I've seen exactly one person let go, which is not healthy. I know you want to make everyone feel good and not make anyone nervous, but you won't keep good people around for long if you don't show the strength to remove people who are stopping progress.",
        "pros": "- The opportunity for e-commerce scale is unmatched except at Amazon- High performers are given generous compensation packages- Work life balance is a key value of leadership",
        "summary": "Mixed bag, but pockets of great people.",
        "role": "Anonymous Employee",
        "date": "Aug 3, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too many middle managements, not enough individual contributors",
        "advice": null,
        "pros": "Good compensation, benefit and corporate culture - strong business outlook for PayPal business",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2014",
        "is_current": true
    }
]