[
    {
        "rating": 3,
        "cons": "work and life balance, fairness",
        "advice": null,
        "pros": "The compensation is quite good compared to other companies",
        "summary": "interesting platform and infrastructure but not top smart technology",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no real career advancement and hard to get promotions",
        "advice": "please promote people who deserve it",
        "pros": "It is nice to have comfortable job",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Apr 25, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too many re org changes and too often, constantly changing priorities, duplication of work across teams, promotions are not frequent",
        "advice": "Encourage career development, promote more often, rather than hiring from outside for senior roles, promote internal employes to new role",
        "pros": "get to work on different projects, faced with challenging problems quite often, good company culture, on the job opportunity to learn.",
        "summary": "Interesting and challenging",
        "role": "Software Engineer",
        "date": "May 11, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- upper management does not have good understanding of technology and  software development in particular - thus not really able/willing to fully commit  to the related long-term investments- too formalized performance evaluation process - probably in attempt to make  it accurate and unbiased, even at the cost of depriving it of the real substance- being a lar… ge and not-so-attractive company anymore, the quality of employees  can sometimes make a collaboration more challenging and inefficient- project planning and task scheduling can make one feel just as a relatively expensive piece  of equipment that needs to be \"optimally\" deployed, and immediate managers don't pay  enough attention to the individual needs and strengths; further on, the excessive movement  from one software task/module to another sometimes leaves no one directly in charge of  the software quality and its conceptual/architectural integrity, and can make developers feel  too distanced from the results of their work, and consequently less passionate and responsible  for the future of that software- actual software development process is too much controlled by project managers,  with a tendency to micromanage and put a premium on hitting sometimes  arbitrary and/or inconsequential deadlines over the engineering concerns- very feature-centric and fragmented software development, with insufficient attention to   the inherent software development issues, and lacking the adequate processes and resources   for the general software improvements - from simple refactoring to infrastructure upgrades - being empowered as an individual contributor is a mixed blessing - sometimes there is too much of   \"distractions\" from getting the most important things done, and lack of support from a software manager   with enough clout, will and attention to step in and argue for your side when really needed- some of the cons mentioned contribute to the insufficient software quality, making the software hard to fix,   maintain and evolve, with too much time spent on dealing with production issues - and that often leads to   a vicious cycle of not having enough time to spend on vital improvements and technology upgrades- lower management, although technically competent, mostly lacks a clout and/or backbone  to make significant changes to the prevailing software development culture- in spite of opportunities to work on some interesting things, the cons mentioned make  the job of software developer less satisfying and impede the professional growth as well",
        "advice": "- most of the old guard should leave, starting from the top- have a vision, courage and integrity to do what is right in the long-term- give more influence to the people who really understand technology  and particularly software development- allow or even encourage lower management to challenge the existing practices  and make exceptions to the rules and procedures when it mak… es sense- although individual contributors are generally replaceable, make sure your assessment  of the demand and supply is right, and keep in mind that outsourcing them out of the sight  does not automatically resolve the related issues",
        "pros": "- relatively nice campus; good, convenient location- good overall compensation and benefits- hard work somewhat recognized and even rewarded- work-life balance seems to be getting better; flexible working hours- overall friendly environment, with good collaboration among the teams  and not much politics at the level of individual contributors- some very smart people and sometimes qui… te interesting things to work on  (scalability, data mining, search, ...)- experience with the entire dev. cycle - from requirements to code release (see cons, though)- empowered to address directly most of the project-related issues (see cons, though)- some helpful processes in place (see cons, though)",
        "summary": "Some smart people and things to work on, but overall not quite satisfying experience",
        "role": "Software Engineer",
        "date": "Jul 25, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "You will spend more time doing power points for Sr. Management than actually doing your job. Do what is right for the customer - both internal (your associates) and external customers. eBay was once a great customer focused company, they have lost that focus. Too many decisions are made based upon costs. In a CS environment, that is tough.",
        "advice": "Get focused back on the customer. In CS it should be all about the customer.Listen to your leaders - you have lost a lot of great CS leaders in the past 12-18 months, and it will continue if you don't listen to your front line managers.",
        "pros": "innovation, change, excitement, passion, did I mention change. If you enjoy a fast paced environment, it is a great place to work.",
        "summary": "eBay was once a great place to work",
        "role": "Senior Manager Customer Service",
        "date": "Aug 3, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not a lot of room for career development. Opportunity of growing is limited. Company structure is confusing, job title is highly inflated. Low efficiency.",
        "advice": null,
        "pros": "Working environment is good, Working time is flexible. Salary is attractive. Compensation and benefit is competitor compared with other campaniles in bay area.",
        "summary": "Neutral",
        "role": "Anonymous Employee",
        "date": "Sep 25, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "1. weird career progression paths, people value more 'flexibility' than actual expertise in one specific area2. reasons to promote are unorthodox to say the least, tenure, expertise and academia are not part of them3. knowledge management (in certain areas) is absent, it just leaves with the employee4. eight different managers in five years5. acquisitions occur so fast that many times is hard to under… stand the potential synergies6. shared services DO NOT scale with the ever growing size of the company, in five years I saw HR go from \"decent\" to \"totally unacceptable\"",
        "advice": "Silicon Valley is not a fun place to have a talent crisis.",
        "pros": "1. Great campuses2. great talent3. fast paced4. ever growing company5. decent (industry average) benefits6. sabbatical",
        "summary": "Great place to work, weird career progression opportunities",
        "role": "Sourcing Manager",
        "date": "Dec 14, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bad management, chaotic arrangements, erratic behavior by some senior managers, causing confusion on decision making and often too many conflicting signals while hiring on one hand, laying off on the other.",
        "advice": "Need to straighten out the management and the top-down messaging is rather confusing and sometimes in denial with the ground reality.",
        "pros": "Good place to work with a lot of talented people, nice to work in order to update your technical skills as there are a lot of opportunites for education, etc.",
        "summary": "Good place to work at.",
        "role": "Anonymous Employee",
        "date": "Jan 24, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "They focus on the small issues and ignore huge opportunities for improvement; they ignore issues until they grow to the point that it requires immediate attention and a legal/ financial risk. Little accountability ( positive or negative - Management takes \"Feedback\" from employees as personal attacks and sometimes have retaliated in an unprifessional/childish manner. Instead of making necessary changes to excel, it s… eems like the problem areas in the company are covered-up and somehow twisted in a positive light and turned into promotions or other bonuses. Too many conflicts of interest to count.",
        "advice": "Feedback is part of the eBay product and internal feedback to management should be viewed as an opportunity to improvethe customer experience and improvements for the shareholders. Don't take feedback personally and instead make the changes to improve our brand. Stop \"coasting\" and strive for excellence in the workplace. eBay employees are over worked, under-paid, and feedback is not considered - stop getting defensi… ve about things and make positive changes instead.",
        "pros": "Free soda - some tuition reimbursement - stock options - 401k match - dental - medical - life insurance -",
        "summary": "Just a paycheck - minimal incentives for hard work or results",
        "role": "Fraud Investigator",
        "date": "Jan 24, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too much re organization, politics is not healthy",
        "advice": "improve cross team work",
        "pros": "new management, customer centric, encourage employee to grow",
        "summary": "ok",
        "role": "Anonymous Employee",
        "date": "Feb 2, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "bad planning from higher mangement",
        "advice": "plan efficiently to make use of resource",
        "pros": "flexible to work in this environment",
        "summary": "nice to work here. Work environment is too open",
        "role": "Senior Eng",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's now a big company. It's slow to move. While they consider themselves innovative and cutting edge, there's plenty of bureaucracy that will hamper nimbleness and ability to react to the market changes.Minuses:-some executives and managers are just completely incompetent-hours are long, especially if you are in product development or QA-can be egotistical attitudes-highly political environme… nt",
        "advice": "Better delivery on strategy. More transparency to employees about changes in strategic direction. Make sure executives are qualified to lead respective areas. Don't force fit employees from acquisitions into positions they aren't qualified to lead.",
        "pros": "eBay was the internet darling, and every company wanted to be them. Through my 10+ year career I had the chance to move to different areas of the business including PayPal and learn a lot about how the business functions, the technology, and innerworkings.Pluses:-technology is leading edge-opportunity is there, if you are career minded and watch out for yourself-on the whole, most managers are oka… y-pay is above average",
        "summary": "YMMV: highly dependent on your function, management, and executive support",
        "role": "Senior Manager",
        "date": "Mar 6, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "not doing much to reward good workers.",
        "advice": null,
        "pros": "good people, good benefits, good direction for the company",
        "summary": "It is a good place to work.",
        "role": "Anonymous Employee",
        "date": "Mar 19, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Still behind a lot of competitors sites. i e. the cart functionality wasn't available until recently. Still struggling to remove the 'auction only' website from customers minds",
        "advice": null,
        "pros": "Positive attitude across the company. People are excited to work on making eBay successful. Great acquisitions are providing some competitive advantage",
        "summary": "Good company to work for, constant innovation and ambitious goals",
        "role": "Anonymous Employee",
        "date": "Mar 20, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Career advancementProfessional growthThrifty on investing in employees",
        "advice": "Invest in employeesTruly promote from within",
        "pros": "Benefits & perksGrowing companyFlexible work hours",
        "summary": "Relaxed working environment, slow decision-by-consensus culture",
        "role": "Senior Technical Architect",
        "date": "Mar 23, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Hard to get promoted as there a lot of people sitting in roles with out upward progression. Need to join one of the bought companies to advance.",
        "advice": "Measure people on results and not the politics of their situation. Good people are being overlooked and pushed aside.",
        "pros": "Status if company and people as every one is very talented. However, it is many ivy league folks. Great ree t trajectory of the business",
        "summary": "Great without money reward",
        "role": "Senior Director",
        "date": "Apr 10, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too many reorganizations caused many people to get reshuffled to work for different managers and some were transferred to cities that were far away",
        "advice": null,
        "pros": "Work-life balance is great and support for professional growth is given through education assistance",
        "summary": "Good company to work for but there are too many reorganizations.",
        "role": "Software Engineer II",
        "date": "May 9, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "While the many of the managers are very good technically, they aren't so great people managers. Re-orgs and management shuffling happens a lot. The leadership doesn't really inspire people.",
        "advice": "To middle-management: stop micromanaging your employees. Empower them by staying out of their way and letting them be the decision-makers. To upper-management: get some managers with people skills.",
        "pros": "There's a lot of smart people to learn from here. Management takes an active role in career development. If you get into the right group you have opportunities to work on cutting-edge stuff.",
        "summary": "It's been a roller-coaster",
        "role": "Software Engineer III",
        "date": "May 25, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "dull environment, slow development cycle",
        "advice": null,
        "pros": "stable business, turn-around strategy seems to be working",
        "summary": "engineer",
        "role": "Software Engineer",
        "date": "Jun 7, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Product decisions are driven by engineering team, they're not interested in any idea they didn't come up with -- Product does not own the productNO work/life balance at all. I work nights, weekends, holidays, and even a little on PTO days. I spend all day in useless meetings so the only time I have to do work is nights/weekends/holidays.Roadmap changes every single month. No consistency, no plan, noth… ingWe have an analystics team, yet I spend all my time studying analytics.. We have a BU team, but I'm still the one defining the business justifications",
        "advice": "If you burn people out with these crazy hours, you will lose your best asset -- people!Please talk to your managers about working smart, not toughNo meetings after 3 pm would be a great start!",
        "pros": "Smart peopleEasy access to dataOpportunity to play a leadership role",
        "summary": "Good company but NO work/life balance",
        "role": "Senior Product Manager",
        "date": "Jul 15, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Very difficult to get a promotion.If you are a post graduate and have significant industry experience , then also you will be considered a newbie. You will be given work of a experienced guy, but compensation of a newbie.",
        "advice": "Fix your hiring policies.",
        "pros": "Good Work Life balanceLot of opportunity to learn if you are in the right team , like mobile, search.",
        "summary": "SO-So",
        "role": "Software Engineer II",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "* eBay as a marketplace is easy to game unfairly, likewise excellent contributions within the organization will likely be attributed to somebody else, or more likely ignored or significantly under supported and appreciated. Success is not what you can do but, \"how you play the game.\"* \"Playing the game,\" means supporting upper management initiatives the technological or methodological flavor of the d… ay initiatives and getting credit for being the loudest and most loyal proponent. Many of these initiatives are absurd on the face of it, others eventually play out to some kind of clearly detrimental effect. The principals behind the initiative are simply lost, people thoughtlessly apply what they are told to to the point of actual contradiction with those principals.* When you read about a demoralizing management practice at amy large American software company, you know its an issue at eBay ( e.g. stacked ranking of individual contributors, over reliance on contractors, too many layers of management, frequent meaningless changes in structure and responsibility, not-intented-here syndrome, innovation only by acquisition).* eBay is so successful at metrics of the 0.5% accumulative gain, that it simply cannot see significant opportunity before it. Its as though game changing ideas simply do not apply at eBay because 500% better just does not fit on their scale or a community member or another technology group will object to the change.",
        "advice": "Congratulations for achieving your level of success, but this is not about you and your accepting credit for market and community that has been developing for 15 years. Success is not manufactured at the top of the organization but rather it is the sum of the efforts lowest rank and file members. You simply cannot innovate from where you are in the organization, except of course by getting out of the way and allowing…  others to do your innovating for you. The best you can do is insist that your subordinates do excellent work and then work yourself as diligently as you can to determine which efforts are working out best and support them.",
        "pros": "* First to market as significant online market.* Has huge market volume, trading data, and user community.* Has significant resources to employ, and commands many aspects of trading (finance, advertising, inventory (via seller community), international expertise).* eBay supports the community. A lot of people can make their living off this marketplace, and many more people can supplement themselves, or th… eir businesses. Its a great venue for a good many different niche markets.* eBay is a pretty green company, if anything this might be a little understated.",
        "summary": "eBay as a marketplace, has great potential but managerial baggage that prevents it from game changing innovation",
        "role": "Software Engineer",
        "date": "Sep 9, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "technology can be cumbersome.too big.some organization's management really suck",
        "advice": null,
        "pros": "well known high tech companysome real good co-workersdepends on the projects, some interesting technologies",
        "summary": "great company if all you need is a paycheck",
        "role": "Senior Software Engineer",
        "date": "Oct 7, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too much legacy code, disorganized information / organizations. Some frequent re-organizations. Don't see much professional growth working there",
        "advice": "The management needs to go beyond managing people to investing in people on a personal level. Please try to motivate people as much as possible.",
        "pros": "eBay is the biggest e-commerce company. Some smart and hard working people worked there. Some challenging problems needs to be solved. Unique web search company",
        "summary": "eBay is the biggest e-commerce company.",
        "role": "Member of Technical Staff",
        "date": "Oct 14, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Very difficult to get promoted at the Draper office. Odd office politics. Promotions and recognition given on criteria that seemed to have nothing to do with tenure, work competence, or education. Focus on strict productivity requirements, rather than quality or innovation in work. Uneven competence in management.",
        "advice": "Invest in training and retaining good talent. My department was FULL of creative and talented people that had no outlet or opportunity with which to further the business. Time and again great ideas were ignored, and frustrations were allowed to continue to the detriment of the customers and the company.",
        "pros": "Good benefits, free drinks, casual dress code, recognizable name on your resume.",
        "summary": "Get the name on your resume, and then move on.",
        "role": "Seller Vetting/Merchant Fraud",
        "date": "Nov 14, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Management politics at all levels between and within groups gets in the way of progress.Cumbersome internal planning and decision processes that senior management override in the end anyway.Poor continuity in resourcing programs and products.Individual contributors treated as expendable resources.",
        "advice": "Work as a team instead of competing with each other for recognition and advancement.",
        "pros": "Interesting high-scale global marketing, business, and product challenges to work on.Strong balance sheet and willingness to invest in internal and external growth.Reasonable compensation and benefits.",
        "summary": "Interesting opportunities, but internal politics frustrate progress",
        "role": "Senior Marketing Manager",
        "date": "Dec 2, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Compensation $ did not reflect actual know how or years with companyLack of \"real\" career opportunities, internal career advancement/path is non-existentLack of innovation on the site itself and policies - to maintain/increase market shareReinvention of the wheel...yet things did not improve",
        "advice": "Recommendations provided over multiple years through feedback and survey's.",
        "pros": "Health benefitsStability (generally speaking) not so much in 2010-2012Extras: food, gift card recognition, fun, etc...Tuition reimbursement!Convenient location in the south of S.L. valley",
        "summary": "A good experience that helped increase my career opportunities - outside of the company.",
        "role": "Account Manager",
        "date": "Dec 12, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Long hours, no upper management support. Decisions that affect UX are made by executives with little to no user data behind them.",
        "advice": "Hire the best, pay them well, and let them do what they do best.",
        "pros": "Fast-paced, smart and friendly people, nice campus.",
        "summary": "Chaotic, but there is opportunity to do good work if you can get it approved and built.",
        "role": "Senior Design Manager",
        "date": "Jan 11, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "lots of turnover in management, annual layoffs",
        "advice": "show interest in day to day operations",
        "pros": "great pay, nice perks, flex hours",
        "summary": "know what you are getting into. long hours high expectations",
        "role": "Software Consultant",
        "date": "Jan 28, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "less salary for the work you do",
        "advice": null,
        "pros": "Good work environment, fast paced development",
        "summary": "presentation engineer js, css, html5, java",
        "role": "Anonymous Employee",
        "date": "Feb 16, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "big corp, lots of constrains if you want to chance something. And some of the employees have been there for over 10 years and actually knows very little about current tech trend.",
        "advice": null,
        "pros": "People are really nice, lots of Indians ( no offense) so get used to Indian food during off site. some really cool innovation is going on, but still move somehow slow due to the big corp nature",
        "summary": "Good company for people who prefer easy but boring life",
        "role": "Business Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Strong resistance to change, streamlining, team work. If you're happy maintaining status quo you'll be fine with this company. If you want to make a change, and be a part of something dynamic and synergistic this is not the place for you. Lots of people made a lot of $$ with eBay (stock splits of the early 2000's), politics a bit thick for my taste.",
        "advice": "eBay has lost a lot of truly great people due to above Cons.",
        "pros": "Excellent benefits, compensation, beautiful environment.",
        "summary": "Best company I've worked for, worst job I've ever had",
        "role": "Support Staff",
        "date": "Mar 1, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They haven't been able to figure out how to integrate Quality into the Engineering process yet. Even though people are open to new things, the skill of the average engineer within the organization is much lower than at any high tech company I've been exposed to. It often seems like they have 10 mediocre people working where one really good person would do better. The code is so convoluted, so deeply coupled, so disas… trously unreadable, It is difficult to imagine how they can implement features at all",
        "advice": "When I left, it appeared as though things were headed in the right direction, with more focus on true SOA implementation and a unified presentation layer. As long as that keeps up, things will probably improve. My biggest problem was, the rug was pulled out from under me not once but twice in 5 months, as directions and plans and technology stacks were re-thought and re-argued endlessly. If things stabilize, eBay cou… ld be a formidable engineering organization. At the moment I think it's more momentum keeping you afloat than innovation.",
        "pros": "Ideas win, data wins, people are exceedingly friendly, the entire organization seems to be rowing in the same direction. The culture is almost deceptively open--you get the feeling at first that you'll be able to change the company in big ways, and everyone listens to you. The compensation was extremely competitive, particularly the RSUs, given the trajectory of the stock as of late",
        "summary": "Frustrating, given management changes and overall turmoil",
        "role": "Staff Software Engineer",
        "date": "Mar 29, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "If you want to do something other than customer service, you better have atleast Bachelor's degree better if you have an MBA. No matter the the customers don't speak that language.",
        "advice": "Don't focus so much on educational degrees for positions that are in direct contact with the eBay sellers, this is not the biggest priority.",
        "pros": "Fun environment. Some of the supervisors are really great. The pay is decent.",
        "summary": "Better have a degree",
        "role": "Account Manager",
        "date": "Mar 29, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Internal conflicts are still present. Tension between Product and the Business is unhealthy. Everything moves very slow and turnover is high. Surprisingly hard to move around internally unless you've already built up the relationship.",
        "advice": "Crack down on the internal politics. Product vs BU needs to be resolved.",
        "pros": "Smart people in general. New president making the right decision in my opinion. They tend to pay above market due to the lower brand reputation.",
        "summary": "Good company trending upwards, but relatively hard to build a career there",
        "role": "Manager",
        "date": "Apr 10, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "A company that has too much money and wins despite itself. Sad to see eBay make so much money when they have no clue what their customers really want. We have so many people working on the same things that its just chaos half the time. If you know how to do a good Powerpoint you can live the dream job. If you know politics even better and make sure you are a yes sir person",
        "advice": "Focus more on Technology in CS. Duplication and tools are mediocre. Several People in Management need to go. Mostly in the Manager/Director level at CS. Water cooler gang that keeps control and doesn't focus on real customer issues as long as they look good and get credit for nonsense.",
        "pros": "Bagels, Pop, People, Benefits, Anti Religion and Pro Gay",
        "summary": "A lot of Smart People Doing the Same Job in different channels",
        "role": "Development Manager",
        "date": "Apr 16, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Physical environment was awful for software development.Salary was not competitive, even when compared to those performing similar work in the company.I got decent performance bonuses, however I object to distribution \"on a curve\", where managers essentially have to duke it out so their reports can get decent bonuses. This ingrains a belief that you can't have a team where multiple people are performi… ng at \"exceeds expectations\"-- which isn't true.",
        "advice": "The millions of dollars that were spent constructing the new Draper facility will be dwarfed by the millions of dollars in lost productivity over the life of the building. You really should have built in some quiet areas (offices) where people doing thought-work could concentrate.I left for a 50% salary increase; I didn't feel I could accept eBay's offers to match it because I didn't feel I would be able to d… eliver 50% more in the environment I was asked to work.",
        "pros": "My manager and (most of my) colleagues were professionals, and it was a pleasure to work with them.Great benefits.Good work life balance. My manager was fine with me working from 6-8 at home, and then from 9-4 at the office.",
        "summary": "Maybe we can cram a few more desks in here somewhere..",
        "role": "Software Engineer",
        "date": "Apr 18, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There are some areas of the business with chaotic management and unrealistic expectations causing everyone to try too many different things haphazardly, resulting in increased stress levels and lowered productivity.In certain areas of the organization there is huge imbalance in the number of employees asking questions vs. those answering them or implementing changes. For instance - for some products there are gre… ater number of BU and PMs vs. PD and analytics. In these teams work life balance can be hard to come by if you are part of the latter two teams.",
        "advice": "Very glad to see we are spending more time and energy on innovation. Please continue to encourage this. I think it is the right focus for a business close to its saturation point looking for a step function increase in growth.",
        "pros": "Great people to work with. I’ve had the opportunity to work with some of the brightest, fairest and down to earth managers throughout my working life.If you have the potential then you do have a clear path to progress in your career, within your domain or cross functionally.",
        "summary": "Great people to work with, but chaotic management.",
        "role": "Anonymous Employee",
        "date": "May 4, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "some tech in prod should be up to date",
        "advice": null,
        "pros": "stock is ok recently, salary is ok",
        "summary": "worked for ebay 6+ yrs",
        "role": "Anonymous Employee",
        "date": "May 16, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Too much work for one person to handle- Not enough resources- Growth is shunted by mid-level managers",
        "advice": "Look at your mid-level managers and ensure they are engaging employees to the maximum.",
        "pros": "- Okay pay- Great atmosphere- Team collaboration- Very developed programs",
        "summary": "Overall Review",
        "role": "Staff Engineer",
        "date": "May 22, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Chaotic environmentToo many meetingsNot strong lower level management",
        "advice": "More communication - especially skip-level one on one meetings.",
        "pros": "Highly energetic intelligent peopleInteresting projects, including some new complete rewrites",
        "summary": "Good company - excellent service for small businesses",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "lots of re-orgsmanagement being very political and inconsistent decisionsbad work life balance",
        "advice": "more respect to the employeesthink about long-term goals",
        "pros": "good compensation, benefits, training & travel",
        "summary": "political not-so-good wlb",
        "role": "Anonymous Employee",
        "date": "Jun 28, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Legacy employees drag everyone else down. Marketing dept is technologically and creatively stuck in 2001.",
        "advice": "Invest in improving internal tools and realize it's 2013.",
        "pros": "eBay treats their people really well and the compensation is great. The company itself does enable people all over the world to buy and sell to anyone. It's really a remarkable slate of mobile apps and seller tools.",
        "summary": "Great company. Impossible to get things done.",
        "role": "Marketing Manager",
        "date": "Jun 28, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "May not be a perfect place for more senior level people.",
        "advice": null,
        "pros": "Good for new and fresh graduates.",
        "summary": "Good for fresh graduate.",
        "role": "Anonymous Employee",
        "date": "Jul 14, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Relatively slow moving organization.- Relatively risk averse. New, interesting ideas take a long time to get off the ground because many groups that need to sign off have no incentive to support new improvements - they're there to support the status quo.- Mostly a hierarchical organization with power for decision making concentrated at the top. Depending on the project this can cause some churn, minor decis… ions get revisited because someone upstairs wants their say.- Quality of co-workers is a bit uneven. Some are great to learn from, others make you wonder how they got in.",
        "advice": "Streamline the organizations even more and empower employees to make quick decisions.",
        "pros": "- Great place to learn how a large e-commerce site is run and all the issues (data infrastructure, seller relationships, user experience, etc) it faces.- Many smart people with pretty diverse industry backgrounds.- Lot of opportunities to move within the company to experience different roles.- The products you work on have the potential to become high visibility because eBay has so many users.",
        "summary": "Big opportunities but slow moving",
        "role": "Product Manager",
        "date": "Jul 22, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "sometime is there is too much work",
        "advice": "they are good",
        "pros": "nice people and nice boss",
        "summary": "great company and nice people",
        "role": "Staff Software Engineer",
        "date": "Aug 15, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Broken processPoor work life balance",
        "advice": "Invest more in employees",
        "pros": "Great customer focusVariety of workFreedom to do the job",
        "summary": "Politics",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "don't really like the work there",
        "advice": null,
        "pros": "ok company to work with",
        "summary": "ok",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Working with different time zone- Long hours- frequent org changes- stake ranking- no free food",
        "advice": null,
        "pros": "- Good Salaries- Good benefits- Gym- Training program- 401k match",
        "summary": "Sr. Product Manager",
        "role": "Senior Product Manager",
        "date": "Oct 7, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Long hoursHigh stressShort time lines",
        "advice": "Work on providing employees with better work life balance.",
        "pros": "Great benefitsFair payGreat people to work for who appreciate their employees.",
        "summary": "Nice company to work for",
        "role": "Software Engineer",
        "date": "Oct 8, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lack of alignment from senior management and lack of decision making ability. Cafeteria's on-campus have good quality food but you have to pay for it and choices become boring after awhile. And due to parking issues (difficult to find parking), it is rare that anyone leaves campus for lunch.",
        "advice": "Crack the code on how to get better alignment with senior leaders, which will allow groups to work more smoothly without the \"hurry up and stop\" mentality. Also, trust your middle management and let them make decisions.",
        "pros": "Great pay and benefits provided at all levels. Very generous! Amazing HR folks! The CEO of the company is smart, passionate and sincere. John Donahoe is the real deal and a great leader. He may be the most approachable CEO I've ever met.",
        "summary": "Great Company ... ok people",
        "role": "Director",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Always changing and not in a good way. Will change something that is working and it will fail and you will end up going back to the previous way of completing your job. Very educated upper management but have no work ethic or experience. Layoffs are not uncommon.",
        "advice": null,
        "pros": "Awesome benefits and great stock option.Friendly coworkers, it's like a family.Even though it's a large corporation they do try to keep you more then just a number.Great worklife balance after being there for 5yrs",
        "summary": "Fun atmosphere but always laying off and changing policies and positions",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Limited career growth, often unclear direction on projects (with goals that keep shifting)",
        "advice": "More promotion from within.",
        "pros": "Co-workers are friendly, and most employees can work remotely on Fridays.",
        "summary": "Ok Place to Work",
        "role": "Marketing Manager",
        "date": "Oct 27, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Compensation not commensurate with work",
        "advice": null,
        "pros": "Innovation encouraged but not appreciated",
        "summary": "eBay",
        "role": "Anonymous Employee",
        "date": "Oct 29, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "1. little slow to adopt new technologies",
        "advice": null,
        "pros": "1. good work life balance",
        "summary": "experience at ebay",
        "role": "Senior Software Engineer",
        "date": "Nov 1, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Still a lot of legacy technology, which is useful only in eBay, and hindered productivity. Work load can be very high. Beauracy prevent you moving forward faster.",
        "advice": null,
        "pros": "Good benefit. Moving to latest cutting-edge technology.",
        "summary": "Intense workload",
        "role": "Anonymous Employee",
        "date": "Nov 2, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "lack of direction & processes, misinformation freely given out",
        "advice": null,
        "pros": "lots of swag, free coffee/snacks",
        "summary": "tread carefully",
        "role": "Anonymous Employee",
        "date": "Nov 5, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Bad hiring decisions and letting mediocre people stick around",
        "advice": null,
        "pros": "Cool portfolio of companies under the ebay inc. umbrellaThe people I've networked with are incredibleI love my position, but the politics get in the way",
        "summary": "Pretty Good, Not Amazing",
        "role": "Project Manager",
        "date": "Nov 12, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "A UPH is more important then safety at times",
        "advice": "Say what you mean don't lie to your employees",
        "pros": "They try to listen to complaints at lower levels and some changes are made, but most about safety.",
        "summary": "they care more about profit then the employee less and less incentives with each passing year",
        "role": "Anonymous Employee",
        "date": "Nov 20, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor management. Make sure to be in the right team if you want to learn something for career development.",
        "advice": "Too much hierarchy.",
        "pros": "Work-life balance. Good environment. Good chance to meet talented people at large company.",
        "summary": "Work-life balance but analyst has limited impact on business.",
        "role": "Marketing Analyst",
        "date": "Nov 22, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "as far as I seen, not a lot of job security. they withdraw offers weeks before scheduled starting date, and i've seen 3 people let go for 'performance' issues while personally, I don't buy it.",
        "advice": "upper managements from wall street/consultings, so there isn't a lot of vertical movements within the company",
        "pros": "relative generous since it's a silicon valily IT company. good company if you are running out of choices.",
        "summary": "not good job security, and exit strategy is bad if you are not IT person",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management is literally a revolving door. Every few months they will \"re-structure\" an entire department, which means the management and sometimes the reps all have to re-apply for their jobs. They often change the job responsibilities and combine/separate entire departments.",
        "advice": "Determine what departments handle what, and then don't change it every 6 months. Keep management in place who knows the department they work in, instead of bringing in a new, clueless \"cheerleader\". Keep the management who cares about their people instead of management who will say yes to anything to advance their careers.",
        "pros": "The company pays well, depending on your skills it can be easy to move up in the company. Great insurance, 401K matching, employee stock purchase plans, flex spending etc. Potential for really good quarterly bonuses.",
        "summary": "Overall it's a good company, their management strategy leaves a lot to be desired.",
        "role": "Customer Solutions Agent",
        "date": "Jan 4, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Felt like management only cared that an employee could fit a particular role and would not allow them to move up if they were a key part of their team.",
        "advice": "I am sure that has changed since I have left however I would say nurture your ambitious employees and mold them into what they would like to be rather and then forcing a particular role one them that fits the companies needs",
        "pros": "People that would there are always striving for excellence",
        "summary": "Great Environment, great people however management could use some better training on soft people skills",
        "role": "Business Analyst",
        "date": "Jan 27, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Products are not very inspiring. The organisation is highly political given their multiple business units. US centric - the company is not as global as it thinks it is.",
        "advice": null,
        "pros": "Good perks and benefits - generous health, dental and stock purchase schemes. Nice, friendly people who enjoy their mission.",
        "summary": "Nice people but a little disorganised.",
        "role": "Business Development Manager",
        "date": "Feb 10, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not a tech focused company.Lot of red tap. Focus is not on building a solid software.Quality of engineers varies a lot by team.Attracting super developers is a challenge and have to choose from B players.Overall not a company to stay for too long.",
        "advice": "We need to be more tech focused and improve quality of hires and management.",
        "pros": "One of the few e commerce giants out in the world impacting life of millions of small sellers.",
        "summary": "Mediocre",
        "role": "Anonymous Employee",
        "date": "Mar 4, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management is erratic. Goals are never clear. Continuous changes in organization.",
        "advice": "Hire good engineers. Do not baby sit average engineers.",
        "pros": "Good talent. Work is great, lot of exposure to high scale. Right project and Right group can give you good exposure.",
        "summary": "Good Company, Confused Business Model",
        "role": "Senior Software Engineer",
        "date": "Mar 13, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Majority of new positions are being filled by outside candidates. Ability to move up is VERY limited.",
        "advice": "Look inward. You have a ton of talented people working there that are disillusioned because you continue to bring more and more people in from the outside instead of building and developing your existing talent.",
        "pros": "Great benefits and work life balance.",
        "summary": "Great company to work for - four years ago. Has now gotten very cutthroat and political.",
        "role": "Anonymous Employee",
        "date": "Mar 18, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "limit future, you dont know what you expect",
        "advice": null,
        "pros": "good company , big name",
        "summary": "software engineer",
        "role": "Anonymous Employee",
        "date": "Mar 20, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "* Its a call center, which means back to back to back calls, which is not for everyone. A lot of calls require action and project time, which leadership looks down on anytime spent off calls but you're also graded on resolution.* Leadership in my department was not good at all, they were very negative reinforcement and weren't there to work with your or help you.* Nobody will help you with your develo… pment, you have to take charge of it on your own. (which could be a good or bad thing)* Lots of contradictions such as company believes \"People are generally good\" but department leadership believes \"everyone is up to no good\". Company invests a lot of time and money on each employee's training, they would rather correct poor behavior than lay off and start over, but when it actually came down to it, all team leads were letting go one (or more) person(s) from their team regardless if they have had sufficient warning.* Big corporation claims to value each employee but when it comes down to it they really don't and everyone is replaceable.* I was let go for \"excessive time offline\" but my shrink, the number that gauges the time spent offline was within an acceptable range and all offline time was legitimate time spent for customers, and I received no warnings for it so I had no idea it was unsatisfactory, until it was too late.* There are opportunities for advancement but hundreds of employees are competing with each other for those opportunities which actually makes advancement very hard to do. A lot of lateral movement between departments but very difficult to move up.* Recently they starting using \"sports\" terms for performance, you're either winning or losing, and for those people who aren't quite hitting their metrics, hearing that you are a loser isn't exactly a motivator, it is actually the opposite. (I think I already mentioned negative reinforcement)",
        "advice": "1. Don't say one thing and then make a business decision to do exactly the opposite of what you believe.2. Rethink the way your team leaders lead, its very down putting and not just for me, but everyone I talk to feel very unmotivated when they speak to their team leader. The coach is a good balance because they are uplifting and motivational but not quite enough to balance out the team lead. Its a lot like b… eing sent to the principal's office in school, talking to your team lead is never a good thing, even if you are doing well because they always pinpoint what is not good or what needs to be better and they don't recognize anything good. They also all have their own system (not just styles), my last team lead was a micro-manager and he spent a big majority of his time looking over shoulders and digging to catch people doing things they aren't supposed to be doing. (he actually had a 15 minute huddle with our team to tell us that he is good at \"catching\" things and that he will catch us, its only a matter of time) Coming from a strong management background, he was everything a manger shouldn't be.",
        "pros": "* Excellent company with high values. Believes in doing the right thing and shows employees they care in many different ways from benefits, to pay, to quarterly bonuses, to high achievement bonuses, to great amenities on campus.*Amenities include unlimited free soda, gym, cafe, Starbucks gift shop, basketball courts, tennis court, shipping centers with free shipping supplies, sell your item stations where you…  can use an ipad, mannequin and backdrops to take quality photos for your ebay listings.",
        "summary": "Excellent company overall - poor leadership in department",
        "role": "Customer Service Representative",
        "date": "Mar 22, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They will try to get rid of you as you get more tenure. Raises are horrible. Convoluted management that is highly unqualified. Often management has no functional understanding of operations but continues to make poor choices.",
        "advice": "While benefits are good, they get worse every year. Our industry peers are far better at taking care of employees. You dont value tenure. Your management plays favorites and hides a lot. Honesty is lacking and the employee voices are rarely heard or acted on. Career advancement opportunities are horrible...",
        "pros": "The benefits are pretty good.",
        "summary": "Fun at first but highly political",
        "role": "Anonymous Employee",
        "date": "Mar 26, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Cons include also having to meet quotas.",
        "advice": "Less fees.",
        "pros": "Work on your own and make quotas.",
        "summary": "It is a good experience and an easy way laid back job.",
        "role": "Online Sales Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work life balance, Senior management, Too much levels in management",
        "advice": null,
        "pros": "Overall a Good Company to work!",
        "summary": "Engineer @ eBay",
        "role": "MTS1 Staff Engineer",
        "date": "Apr 3, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Processes and Systems are not as seamless and easy to work with.",
        "advice": "Keep it up.",
        "pros": "Great work environment, never a dull moment for Talent Acquisition.",
        "summary": "GTA",
        "role": "Senior Recruiter",
        "date": "Apr 6, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Overwhelming amount of work, work life balance very hard to maintain",
        "advice": "Unload admin duties from supervisors who should be spending their time coaching and mentoring instead of processing payroll. Very difficult to maintain work life balance with so many responsibilities while taking escalated calls from members constantly",
        "pros": "Great atmosphere, promote from within, benefits",
        "summary": "Customer Service Supervisor Role",
        "role": "CS Supervisor",
        "date": "Apr 13, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Although the company has stated mission and values, I don't think actions of senior management always align with those values, i.e. do the righ thing, develop people, be open, honest and direct. Unfortunately, as with many companies, people who are not good managers or leaders are rewarded. This is a matrix org; when there is not goal alignment, it is extremley hard to meet goals and get things done. Likewise, the co… mpany would like to invest in 'innovative' products, but these are the first ones being cut. The folks that are rewarded are the ones that work on 'core' businesses and are optimizing at the edges, not building the new stuff. There is a lot of bureaucracy and 'churn'. The people who get ahead are the folks that have been at the company a long time and are political. As you get more senior, the work-life balance is not good.",
        "advice": null,
        "pros": "Ebay is trying to do the right thing. Senior management has created a mission, values and behaviors. John Donahoe is sincere and approachable. The company has good benefits and competitive compensation.",
        "summary": "Tough environment to get things done",
        "role": "Director",
        "date": "Apr 17, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too many levels of management, full of people who please managers and get promotion instead of doing work, afraid to make drastic changes or introduce game changers due to size of traffic and possible impact",
        "advice": "Focus on better evaluation for promotions by discussing with more than just manager and actually checking deliverablesCafe sucks, dont make it free, but make it good",
        "pros": "Interesting projects, exposure to real world heavy traffic, few smart people to work with, good work life balance , resources available to learn new stuff",
        "summary": "Too many levels of management promotes politics",
        "role": "Software Engineer II",
        "date": "Apr 19, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Top heavy. Process heavy. Politics",
        "advice": null,
        "pros": "Great business model. Some great leaders. Great turn around.",
        "summary": "eBay review",
        "role": "Anonymous Employee",
        "date": "May 8, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "No training provided, communication lacks and your given little direction. Your expected to read minds.",
        "advice": "All Departments are different, they need to have a better top down training with all employees, so there is a clear view of company standards, expectations and requirements. Use the trainers to fix the gaps, it will cost the company less to retain employees rather than the amount spent on posting, interviewing and retraining for that position again and again.",
        "pros": "Office setup I think is the best, benefits are average, and being able to work from anywhere is amazing.",
        "summary": "People are great to work with, lack training",
        "role": "Anonymous Employee",
        "date": "May 12, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Becoming more and more corporate and less human.",
        "advice": "Keep it human.",
        "pros": "Good benefitsGood hoursNice work place",
        "summary": "Good company gone corporate",
        "role": "Pro Fraud Investigation",
        "date": "May 13, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too many politics and not ideal for person who pursue the latest technology and innovation",
        "advice": null,
        "pros": "Great campus and good benefits and work is not so challenge...",
        "summary": "eBay is a great company",
        "role": "MTS2 Software Engineer",
        "date": "May 18, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "complex organization structure, slow and archaic",
        "advice": "simplify org structure",
        "pros": "work like compensation, good effort",
        "summary": "Ok",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lacks diversity big time.. And, since its a big company, politics and domination play quite a big role here... Its always true here that the first impression stays...",
        "advice": null,
        "pros": "Moving towards a technology company so a lot of new innovations being tried out. Gives you the pleasure of building a product that't used by a LOT of people. Adds a big value to your resume.",
        "summary": "Good, bad and the Ugly",
        "role": "Anonymous Employee",
        "date": "May 29, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lots of unnecessary politics. Developers needed to work for many years to be up for promotion. Went through a re-org every couple of months.",
        "advice": "Do not tolerate jerks no matter how brilliant they may appear (in the words of the Netflix CEO). Stop re-orging so often: Appreciate your employees and they will deliver; it does not matter which org they belong to.",
        "pros": "Joined when the company was going through big changes. Largely under-appreciated company and what it offers. Lots of projects to contribute to. Amazing scale. Had ample chance to deal with big data. Lots of interesting and challenging problems to solve. Chance to make direct impact in people's lives. Reasonable work-life balance.",
        "summary": "Enjoyed working with lots of good people at Ebay.",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lack of coordinated efforts, disjointed attempts at World Class, operates like a Bank",
        "advice": "Act Like a Tech Company, Think Like one too",
        "pros": "Lots of opportunity to do work. Usually flexible arrangements",
        "summary": "Program Manager",
        "role": "Program Manager",
        "date": "Jun 4, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not enough training. It's sink or swim in a very deep pool of information. Work ambiance not great. Not enough cubicles, loud neighbors, meetings breaking out spontaneously next to desks, too-warm temperatures",
        "advice": "More training. Don't just leave people to fend for themselves.",
        "pros": "Great people and facilities. Company seems more focused than the first time I worked there. I felt like I was actually contributing to something.",
        "summary": "Good people, tedious work",
        "role": "Taxonomy Consultant",
        "date": "Jun 14, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The organization is very flat and not a lot of opportunities for vertical growth.",
        "advice": null,
        "pros": "If you are interested in exploring new career opportunities, for example, moving from from a tech to product organization, the organization is very supportive.",
        "summary": "Flexible with horizontal career moves.",
        "role": "Anonymous Employee",
        "date": "Jun 18, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "2 tiered review, where you are often shot in the foot by being compared with people having more experience than you.",
        "advice": "be more interactive with the common workers",
        "pros": "at the HQ they have a gym, cafe, nice campus.good people, good work culture",
        "summary": "very good for a newbie QA engineer",
        "role": "Software QA Engineer II",
        "date": "Jun 18, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Poor senior leadership. No alignment. Review process is political and unfair.",
        "advice": "People who report to you will leave because of the failed structure you set up. If you really believe in retention, change it.",
        "pros": "Lots of different kinds of work to do. Good first experience.",
        "summary": "Mediocre company with good people",
        "role": "Program Manager",
        "date": "Jul 4, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Very biased in favor of gay community who get promoted even when they aren't the best workers, lack of communication with employees, deceitful behavior of management. Micromanagement to extreme.",
        "advice": "Be up front and honest with employees, be fair with judging performance of all employees, improve management",
        "pros": "Interesting, fast moving, good benefits, chances to move up in the company if you are favored.",
        "summary": "Fun and interesting job, but managers play favorites, and are unavailable",
        "role": "Fraud Investigator",
        "date": "Jul 11, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Culture is changing...more hierarchical than ever. Not culturally diverse as other Bay Area tech companies. Also, career growth limited - not much room to move up.",
        "advice": null,
        "pros": "Friendly, open people, and always something challenging going on.",
        "summary": "Great place, but culture is changing",
        "role": "Attorney",
        "date": "Jul 17, 2014",
        "is_current": true
    }
]