[
    {
        "rating": 1,
        "cons": "-Frontend work (i.e. work done in most of the product-oriented teams) is mostly mundane PHP and nothing that really intellectually challenging from a Computer Science perspective. (Backend may be different but I never tried that.)-Potential to get judged too quickly for performance. They are less willing than other companies to let you try something different which may be a better fit if you are not performing we… ll enough on your current project.-Chaos that may hurt you--you may start out on one project but be expected to do something else for no good reason, that may not be the best fit for your skills.-Some managers are too busy to give useful frequent feedback.-I get the impression that they manage by a bell curve, but are not not being transparent about it.",
        "advice": "Be absolutely honest to new hires about where Facebook stands in the spectrum between 'severe' and 'forgiving' for performance reviews, especially when you let new engineers choose their initial team, so that they can choose their teams carefully and pick a project they know they will do well instead of just one that catches their interest but is not necessarily a good fit for their experience and skills.",
        "pros": "-Opportunity to write software that gets used by hundreds of millions of people-Opportunity to see how a successful company is run-Opportunity to launch often-Potential IPO",
        "summary": "Very competitive work environment but not accurately advertised as such",
        "role": "Software Engineer",
        "date": "May 3, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Grueling hoursRude managementAngry colleagues who are disillusioned with the company",
        "advice": "You need to work this out otherwise more stories like this are going to leak out and then there will be trouble",
        "pros": "Working at a world leading companyExcellent pay",
        "summary": "Not all it's cracked up to be",
        "role": "Software Engineer",
        "date": "Mar 20, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management lacking in leadership and communication. Blamed is passed down to front line employee's. Very poor work life balance. Half the department left due to politics.",
        "advice": null,
        "pros": "Amazing food, great campus and latest technology.",
        "summary": "Extremely cliquey, political, poor culture, lacking in communication and career growth.",
        "role": "Finance",
        "date": "Jun 9, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "As company grows they are trying to cut costs, objectives are unrealistically set, bonuses and promotions are considerably lower.If you work here on visa, pay increases and promotions are slowed down even more.Mid management gets packed with responsibilities, the individual contribution is no longer relevant, the general philosophy seems to be \"it's normal for people to leave the company\" and that happens reg… ularly after every performance cycle or stock vesting time.To counterbalance this, company seems to brainwash employees with slogans, posters are everywhere around the office to make \"the culture\", many company employees believe and talk with slogans.Life/work balance is simply set to \"no life\".I've seen managers complain if someone takes more than one week off in a row, or making jokes about family duties the first day someone returns from parental leave.",
        "advice": "managers promoted from engineering are not always able to deal with people.",
        "pros": "The office environment is good in general, also having a big name on your resume may be good for the future.Most of the colleagues are very prepared technically.",
        "summary": "slow career and bad management",
        "role": "Software Engineering",
        "date": "Aug 23, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I have many but I'll keep this short. I'd say the biggest problem is the recruiting managment and also the lack of growth opportunities.",
        "advice": "Wow, so much to say here. Again to keep it short and sweet, I'd say stop treating people like they are work horses and move away from the belief that the more you beat them down the more you think you'll get out them.On a side note, this is only for the recruiting team. The rest of Facebook's teams actually seemed pretty great with the exception of a few.",
        "pros": "There are tons of perks but after 3yrs it doesn't matter if you are not happy with the team, job or the way you are treated.",
        "summary": "Do not join the recruiting team, the rest of company is pretty good.",
        "role": "Recruiter",
        "date": "Sep 16, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1. the company hires experienced talent but do not want to learn or respect their opinion2. people who know next to nothing but have been at Facebook for longer are the people who call shots3. the bi-yearly reviews are just a medium to back stab fellow employees",
        "advice": null,
        "pros": "1. great benefits for people who want to have a family2. better pay3. no lack of parties",
        "summary": "No room for industry experts",
        "role": "Anonymous Employee",
        "date": "Oct 30, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you're a manager, this place will drive you nuts. Employees are snarky, entitled, and disrespectful brats. They have no concept of critical thinking or any desire to do real work.Unlimited sick days in the hands of overpaid children is impossible to manage, my team would somehow always manage to catch a \"cold\" on Fridays and Mondays. (Interesting that they would Tweet and post about their weekend party bin… ges though.)While Facebook does a great job recruiting Ivy League talent, I was underwhelmed by the level of intelligence of \"Facebookers.\" They are so busy congratulating themselves on being \"awesome\" that they never stop to consider they didn't have any real world work experience to back that assertion up. It's really hard to manage and lead people who \"know it all.\"Kitchy inspirational posters everywhere you look. \"Be Bold!\" \"Dare Greatly!\" Yet, I didn't see any substantive work or product coming out of anyone, which makes sense since Facebook really is just a glorified website - users are the product.Communication is an absolute nightmare. You are forced to \"friend\" everyone you work with and join an incessant amount of internal group pages where you had to filter through all the BS people would post (memes, YouTube videos, snarky hipster comments…clearly these people didn't have enough work to do) to get to any relevant work related information you needed to know for your job. I actually thought I was going to get dumber working there.Meetings - the sheer volume was mind bending. None of them critical to doing actual work, more self congratulating on unearned awesomeness. Being social at Facebook was far more important than doing anything meaningful while you were there.Anyone serious about doing meaningful work need not apply. You'll make it a few months and then quit out of frustration.",
        "advice": "Grow up!!! You're not in Zuck's dorm room anymore.",
        "pros": "Looks great on your resume. Lots of perks (if that's what moves you). Interesting story to tell your friends.",
        "summary": "A Management Nightmare",
        "role": "Manager",
        "date": "Nov 9, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "In many teams, the manager is the czar who is powerful to control everything, of course including the performance review. Be careful, don't annoy the manager, otherwise, you will be very painful no matter how good your performance is.",
        "advice": "Please scrutinize the behavior of the managers in some teams.",
        "pros": "good benefit, and packages.. You can learn some good stuff.",
        "summary": "blood factory with high pressure and intensive workload",
        "role": "Software Engineer",
        "date": "Jan 14, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "This company sucks now. People are not good there.",
        "advice": "Not to put too much pressure to employee",
        "pros": "nothing apart from surrounded by many stubborn, hot head",
        "summary": "software engineer",
        "role": "Anonymous Employee",
        "date": "Apr 8, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "they allowed team members to descriminate against members.. to punish members for violations of community standards, that were not violations, because friends of theirs had reported posts, yet allow their friends to post obvious violations with absolutelyno repurcussions.",
        "advice": "stop allowing community standards team members to practice favoritism when friends report others or are reported. i have seen it firsthand. it happens every day.",
        "pros": "none. they allowed many things that were not good and that was why i left",
        "summary": "community standards team",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "too much work. People work too much. Some people are arrogant as well. Full of people who like to show off on FB by having pic on like button or some personality",
        "advice": "Don't be harsh on employee. Please understand there is life outside work",
        "pros": "good free food, good campus, good perks, good show off :P",
        "summary": "Work life balance is bad",
        "role": "Anonymous Employee",
        "date": "May 20, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you want to devote 50+ hrs a week to helping your Aunt Ginny post photos of her cat all so that Frito Lay can sell more Cheetos; then it's where you need to be. Nothing more than a sophisticated digital billboard slinging crap we don't need. Working at Facebook is like shoving a handful of Jolly Ranchers in your mouth while drinking orange soda; sickeningly sweet and eventually regrettable.",
        "advice": "Invest in leader development programs. Facebook is a prime example of Putt's Law in action.",
        "pros": "Good Benefits, Beautiful Campus, Good Food. The company really does a good job of providing every resource you need to do your job.",
        "summary": "Program Manager",
        "role": "Program Manager",
        "date": "May 20, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "but the hr is not so good. The food there is so-so. The environment is not charming. So I decide to other companies.",
        "advice": "hr should be good to us. manage should not be too hashed. The managers are not honesty enough, sometime they can't do sometime they promise to.",
        "pros": "I think the employees there are prominent, the salary is good and I learnt much. I like its product and creativity.",
        "summary": "facebook software developer",
        "role": "Software Development Engineer",
        "date": "Jul 9, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No work life balance, culture is so bad. It almost squeezed you all your time and give you a great pressure.",
        "advice": "Need to change the culture to be more friendly to the engineer.",
        "pros": "No Pros for the people join in after ipo.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Jul 12, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not good employees, rude managers, just so so cultures.",
        "advice": null,
        "pros": "Big Name. Big Name. Big Name. Big Name. Big Name.",
        "summary": "Intern",
        "role": "Anonymous Employee",
        "date": "Sep 2, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Was attracted to FB because of its Diversity message but it was a sad illusion. I'm HIspanic and women and since I joined the company they put me this HIspanic tag. Don't feel included by my peers and even by my manager, who is a global leader. Internally the company believes they include the people but never dare to deeply talk about the non inclusive culture we have here (Maning Bias training and tribes are only th… e top of this iceberg). Some Latinos friend already left the company and I might be the next.",
        "advice": "Be honest to yourselfs and face the true, we are not ready to bring diverse to the company.",
        "pros": "Great employment brand and perks",
        "summary": "Not a Diverse Company",
        "role": "Anonymous Employee",
        "date": "Oct 27, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "It feels like a cult for young, single people. Mature professionals with families need not apply. If you do manage to join, be prepared to be surrounded by rah rah rah, lots of brown nosing, politics, eating, drinking, and going to the gym with your co-workers is almost required if you want to get ahead here. If you don't join the herd with a smile on your face, you'll certainly feel like an outcast and will be on th… e black list. Manager smile to your face, tell you what you want to hear, then will stab you in the back. Extremely immature organization. They also make it nearly impossible to hit your goals once you are at a senior level, and then they will fine a way to phase you out and replace you with someone younger.",
        "advice": "Provide management/leadership training prior to promoting someone to a leadership role.",
        "pros": "Great for young kids with almost no experience, where they can program you into their FB cult. Terrible place if you are a mature, serious professional. The environment rewards people who like to brag, boast, and broadcast their awesomeness. If you work hard but humble and quiet, you will not succeed here. Also, management in general, refuses to fix problems with the process. Performance reviews are geared towards th… ose brown nose the best.",
        "summary": "Great company, terrible recruiting organization",
        "role": "Technical Recruiter",
        "date": "Jan 19, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Week I moved across the country for the job, I was told the team I joined to be on no longer existed. Forth manager I had in my first four months later kept from me that the work I was hired to do was being removed from Facebook's objectives.Some seniors managers keep secrets and are horrible to work for. There's lots of truth to the saying, \"I joined for the company and left because of my manager.\" Facebook … a really, really good at selling its kool-aid story to employees. (It's why they have great ratings on Glassdoor IMO.) If you are in a position or team that is dissolved, you only have 4 weeks to find a new job, which isn't much time at all.",
        "advice": "Don't ever offer someone a job and have them move only to tell them the job doesn't exist.Hire more ethical people. Not cool that the person that hired me left in my first two months because he saw the writing on the wall.",
        "pros": "Great people in Engineering and Product organizations,Learning how Facebook has scaled/ growth strategies was rewarding especially once I left Facebook",
        "summary": "Unethical employer",
        "role": "Anonymous Employee",
        "date": "Jan 30, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The people in the Austin office are brutal. I felt like I was in high school again. They bash each other, gossip and belittle 'outsiders' or people they don't know. I overheard the 'senior' employees belittling me and making fun of a physical condition I have SEVERAL times. They smile to your face but they are passive aggressive and outright mean. And I performed very well at my job, loved my team in CA, and loved th… e company. But some of those 'lifetime' FB people are poisoning the culture. I had to leave after a year. And good luck telling anyone. It's career suicide",
        "advice": "Hold everyone accountable for how they treat others, especially people who are different, people coming from different cities and people with physical and social challenges.",
        "pros": "Fun, exciting, challenging, dynamic, a lot of smart people, good training offered, free food and amenities. Good growth opportunities, some genuinely good people there",
        "summary": "HR Admin- Austin",
        "role": "HRIS Analyst",
        "date": "Jul 12, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The company \"culture\", if exists, is a culture of a sweatshop. Developers are forced to work overtime, and there is an overall atmosphere of fear and uncertainty.Developers are usually treated like a second-class by management. The engineering levels are arranged in such a way that one cannot simply stay at a junior or mid- engineering levels; there are mandatory time limits by when an engineer should move up. On… ce he/she reaches level 5, the bar is set very high: an engineer is expected to drive big projects, work very efficiently. This is very similar to \"up or out\" scheme. Every half a year is a review cycle, which everyone is dreading. It is an unpredictable quagmire of getting peer quotes, which managers twist in any way they want. Anything that is taught at bootcamp is usually a lie. This place is full of hypocrisy.",
        "advice": "You are useless.",
        "pros": "Pays very well, fun events, free food, overall largesse",
        "summary": "Been taken for a ride",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I was into BizApps team at Facebook. Facebook is an amazing company to work but the team is not.All the above was only to an extent and the critical part which had really kept me under pressure wasThere were three people who were asked to develop three Modules. later they asked me to integrate the other Modules into mine. What others developed is just an initial version and UI, Javascript wasn`t follo… wing any standard. Later when I was integrating I had to rework everything from level 0. project manager, Manager, Team Lead, UI Expert were all supervising my work. When ever they pass by my desk, they would ask me to make few changes may it be to the Layouts, data to be displayed etc. the worst part is that their opinions do not match at all.for instance .. Project Manager would stop by my desk and asks me to change the layout and I obey and customize the layout to include that change. Later team lead would stop by and says \"This is disgusting Layout. better change it. when I change it taking his suggestions. Manager would stop by and says its the worst that he has ever seen in his life and asks me to include his recommendations. Later UI expert comes and commands me not to follow instructions of any others and to just follow his recommendations as he is the UI expert. When I do that Others (Project Manager, Manager etc) hate the changes and I was evaluated low in performance.In the due course I was evaluated low in performance and I was blamed for missing the dead line.I did try to convey my situation to people but no action was taken.",
        "advice": null,
        "pros": "Its an amazing company to work. Though the team is not.People will be given option to choose the team after they are hired.The Company shuttles are extremely helpful in working even while we commute.(No Fun)The IT Support is extremely quick and very helpful.The Food and rest are very yummy. Every day You might have to think what cuisine should I choose today. What ever you choose, It will just be ther… e on campus.",
        "summary": "BiZ Apps Team in Facebook",
        "role": "Anonymous Employee",
        "date": "Sep 24, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The customer is a commodity. Complain or try and expose the scams advertisers are engaging in and you are removed.",
        "advice": "Customer service is not to be dispensed with a computer algorithm. Real people exist. It matters",
        "pros": "Looks good on resume. Free food",
        "summary": "Don't speak up. Sit quietly and don't rock the boat. Be happy",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "not as open culture as people might think, very hierarcial, no support from management or HR if you disagree. You have to suck up to the right people and play a \"game\" if you want to succeed and get support for your career development at Facebook.",
        "advice": "Be very careful when you hire middle managers. Listen to your employees.",
        "pros": "People think you work for a great company.",
        "summary": "Do \"lean in\"...as long as it isn't at Facebook.",
        "role": "Anonymous Employee",
        "date": "Dec 12, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "People managers don't care if your suffering with being down, if this is effecting your performance Facebook isn't the place for you. They'll push you out and won't care to listen to you.",
        "advice": "Be more HUMAN",
        "pros": "Free food, travel and laptop... People are nice but people managers have to be rootless.",
        "summary": "Not a place if your ever down, or suffer with mental health. You gotta be 100% positive or they'll get rid of you or simply say, you're not ready for the next level.",
        "role": "User Operations Analyst",
        "date": "Feb 7, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Full of hypocrites, hyper unfriendly to female workers because you have to respond to your boss 24 hours a day. NO KIDDING, those effective communication tools simply make you a salve by hi-tech, and you are supposed to take care of your work every single minute even you are a mother with a 18-month baby.",
        "advice": "Cease the inhumane ways to treat your employees! Gimmick and great PR won't cover the evilness for too long.",
        "pros": "Renowned company name, a good stepping stone to next career.",
        "summary": "Work and life \"integration\" means NO life.",
        "role": "Technical Program Manager",
        "date": "Mar 22, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "None none none none none",
        "advice": null,
        "pros": "Free thinkers, great perks, smart people",
        "summary": "Great",
        "role": "Anonymous Employee",
        "date": "Nov 26, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very intimidating environment. Feedback is only negative, never positiveOlder facebook people are very cliquey and not very welcoming to the noobies.American culture seeps through every market and there is no understanding the world is actually global and not American. Local employment laws are not observed. Little diversityPoor leadership who focus on their personal book launch rather than run the compan… y.Poor training. Expectations that performance is expected from day one, without time to bed in.The product evolves purely for commercial reasons and not the user experience",
        "advice": "Change the culture of the company.Treat employees as adults.Understand every person is different and there is room for all to thrive -extroverts and introvertsNot what you expect from Facebook who's ethos is to connect the world! That doesn't mean make it American.Focus on creating a good experience for the consumer and not the Ad Model and making money.",
        "pros": "Young, dynamic organisation that scales globally very wellSome amazing peopleGood packages, good bonusGood recruitment process, fast and efficient",
        "summary": "Global Relations",
        "role": "Global Director",
        "date": "Jul 20, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "High pressureSexist managers with such a disregard for females",
        "advice": null,
        "pros": "Great young vibrant teamDecent money but Dublin so expensive",
        "summary": "sexist idiots",
        "role": "Ads Integrity Analyst",
        "date": "Oct 21, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1. The Hiring department of the company is below par. Only importance is given to Work experience not essentially in the area of expertise required. Employees coming from Premier graduation and Post graduate insitutes are considered at the same level as that of candidates from local institutes(probably done to save cost of relcoation, not expected of such a big brand)2. The talent across Hyderabad floor and acros… s international offices (I have visited 2) are extremely mediocre, essentially because of point number 1.3. The attitude of collaboration and working as a team, is severly lacking in most hires in the company.4. The middle and senior management is hogwash and power rests in the hands of 1/2 managers who play office politics well.5. Middle level managers are totally impotent, Because essentially they have no power which is attributed to managers in a usual organizational set up.",
        "advice": "1. Improving hiring techniques, more experience =! Good hire, Education Pedigree is equally important2. Do not undergo Reorganization frequently, classic strategy to lose good talent, Though one may be arrogant enough to attract good talent time and again but things do cap off and Name spreads like fire in the market!",
        "pros": "Facilities given to the employee, to travel to work and at work are very good. They try to provide a very comfortable enviornment to work.",
        "summary": "Community Operations - Hyderabad",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": true
    }
]