[
    {
        "rating": 4,
        "cons": "i cant say anything about that because i personally feel that this is avery good comapny s o personally no downsides for working at facebook.",
        "advice": "just chill and my heartfelt request is that employ a few cola macines for the recreation and good mood of the employees.",
        "pros": "it is rthe best place to work on this earth probably thwe best employer for te century. that is the best complement i can give to a company in palo alto,claifornia,USA,North America,Earth,Solar System,Milky Way Galaxy.",
        "summary": "amazing",
        "role": "Product Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You have to write lots of code",
        "advice": "Be prepared to hack",
        "pros": "You got to write lots of code",
        "summary": "Engineer heaven",
        "role": "Anonymous Employee",
        "date": "Mar 4, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A stretched thin workforce makes for lots of pressure and heavy workload; it's hard to get everything done. Sometimes it's difficult to strike a work/life balance. There's a clique-ish aspect to the place, where the \"cool kids\" get the recognition and more opportunity to move around and advance.",
        "advice": "You're doing a great job strategically. I'm happy with the overall direction of the company and our products. I just wish there were a little less favoritism shown by middle management.",
        "pros": "In general, there is a high level of autonomy given to employees. We're treated like adults and given lots of responsibility. The perks are unreal compared to other places I've worked. The atmosphere is fun yet serious. We're very lucky to work here overall.",
        "summary": "The toughest job you'll ever love.",
        "role": "Anonymous Employee",
        "date": "May 27, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "incompetent managers are the downsides of FB.",
        "advice": "follow the google management rules and stop hiring incompetent middle management from google",
        "pros": "great product, great benefits, great colleagues",
        "summary": "fine",
        "role": "Specialist",
        "date": "May 30, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Long hours- No clear path for advancement. I'd been told I'd get promoted if I achieved xyz. I achieved xyz with flying colors, and still no advancement. Despite being a top performer in my group, I was not promoted once in nearly 4 years.- Great PTO plan, but difficult to get time off. Often you're made to feel unpatriotic to the company if you request a whole week off. One manager actually told his team t… hey could only take long weekends.- The Mach 5 pace is exhilarating, but maintaining that pace 24/7 takes a toll. Several people I know developed heart issues from the constant stress.- Terrible middle management. Very out of touch with their teams, only looking out for their career.- Questioning company policies or products is frowned upon. They want you to drink the KoolAid, versus have a constructive discussion.- In my group, promotions were given to unqualified people simply because they were buddies with the manager. It was very much an old boys club.- Too many meetings and interviews. I spent a solid 7 hours a week in company/team meetings, and another 3 hours a week in interviews. That doesn't sound too terrible, until you realize the massive workload given to each employee.",
        "advice": "- Promote from within, create more transparency with promotions- Encourage employees to use their PTO - we work hard, we need to recharge.- Encourage employees to speak up and question product design or policies. We may have new perspective. It doesn't mean we aren't still 100% dedicated to the company.",
        "pros": "- Working for a product that's changing the world- Working alongside brilliant people- Casual dress!- Amazing benefits (food, PTO, laundry)- Lots of nice people- Celebrity encounters almost weekly (Oprah, Katy Perry, Tyra Banks, Obama)- Everything you do has a direct impact on the company's success- FB really tries to be a fun place to work- Despite the cons below, this is the best, mo… st rewarding and memorable job I've ever had. I would do it all over again.",
        "summary": "Busiest but most rewarding time of my career",
        "role": "Anonymous Employee",
        "date": "Sep 9, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "you need to be prepared to work hard and compete with very smart people. unstable decisions at the management level.",
        "advice": "lack of bureaucracy and the flat friendly organization sometimes has a downside that a lot of agreements and decisions are verbal and unofficial. which lead to unstable decisions. changes in design and waste of effort.",
        "pros": "good perks, great environment. high respect for engineers and high salaries. you can develop your ideas and own your project",
        "summary": "It was very good",
        "role": "Anonymous Employee",
        "date": "Sep 15, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "As the company grows, it's losing the 'startup' feel. You can definitely still get exposed to multiple areas of the business.",
        "advice": "Keep culture alive, reward for jobs well done within their core roles. Do better at finding career opportunities within Facebook!",
        "pros": "Fast paced, smart people, innovative, great perks and benefits! The challenges presented ahead are still very compelling things to work on.",
        "summary": "Change is the norm",
        "role": "Anonymous Employee",
        "date": "Feb 29, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "1. Company is growing up fast and it'll be tricky to maintain the culture.",
        "advice": "Keep hiring the best talent.",
        "pros": "You work along some of the brightest talent in the Silicon Valley. There are hardly any politics around you and get to make an impact in your first few days. Great perks + benefits.",
        "summary": "The best place to work for an engineer in the bay area",
        "role": "Release Engineer",
        "date": "Mar 2, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Move so fast, a little bit tired.",
        "advice": "Keep on as before.",
        "pros": "Best people, Best idea, Best product.",
        "summary": "Excited.",
        "role": "Storage Hardware Design Engineer",
        "date": "Apr 25, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not team oriented.Fast moving, but not always doing what is best for the company",
        "advice": null,
        "pros": "great perks and friendly people",
        "summary": "Great energy, but not always focused",
        "role": "Vendor Manager",
        "date": "May 23, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "not so healthy food options everywheremore college kids building hacky stuff that doesn't sustain long term growth",
        "advice": "Don't focus on competitors",
        "pros": "move fast, be bold, social company, good opportunities to make a big impact",
        "summary": "A good workplace with a startup-like feel to it",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company moves to fast and not enough documentation during training.",
        "advice": "Learn how to train new hires in a classroom like environment.",
        "pros": "Benefits, Opportunities to move up.",
        "summary": "Very faced paced",
        "role": "Helpdesk",
        "date": "Aug 15, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "sometimes can be long hours",
        "advice": "none",
        "pros": "Doing things that have never been done before",
        "summary": "really smart people here",
        "role": "Analyst",
        "date": "Aug 21, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The hours were very tough, but it may depend on the department. Budget is strict on certain departments so there is a risk of feeling short staffed and working very long hours. With young blood there, some folks do not have to sacrifice time away from family, so the expectation there is pretty high.",
        "advice": null,
        "pros": "The perks were a huge pro, especially the health benefits. The food was amazing and any corner you turned, there was something that helped you feel comfortable there. The company clearly tries to take care of its employees when it comes to making them feel right at home.",
        "summary": "Fast-paced and exciting",
        "role": "Anonymous Employee",
        "date": "Sep 4, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Tireless hours. The work never stops.",
        "advice": "Management is hit or miss.",
        "pros": "Unlimited opportunity: you define your path.Surrounded by the best and the brightest. Moving fast. Amazing perks.",
        "summary": "Best place I've ever worked.",
        "role": "Anonymous Employee",
        "date": "Sep 6, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- hectic and chaotic- constant reorgs",
        "advice": null,
        "pros": "- good learning experience- fun culture",
        "summary": "Good learning experience, fun culture",
        "role": "Software Engineer",
        "date": "Oct 12, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's still a big company. With that comes some of the big company downsides. Being smart politically can advance your career. If you keep your head down and just do a good job it's less likely to be noticed. For example, I see good engineers not going anywhere with their career even though they do good work, while I see average ones advance up the ranks if they make it a point to post in FYI for every feature they cr… eate.You also have less of a chance to make an impact as a new hire since you're more likely to work on existing features rather than new ones.If you joined about a year ago, your stock grant was over valued (by about 2x), so you're making a lot less than if you go to another company.None of the cons are unexpected at a large company. If you're looking to work for a larger, post IPO company, then you're not going to do better anywhere else.",
        "advice": null,
        "pros": "* Great benefits (medical, pto, etc)* Flexible hours* Lots of food options, free drinks, etc. All usually very good* Smart people* Open culture* Great coworkers",
        "summary": "The best large company you'll find",
        "role": "Software Engineer",
        "date": "Nov 13, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Open space setup for all. It's loud, sometimes over packed (it's better now). I've never been as unproductive.- Changes are sometimes hard to track.- Your project might be \"reformulated\" along the way...- Very young. The least \"social\" of the places I've ever worked at.",
        "advice": "Perks are great, people are better. People might come for the perks, but eventually, they'll stay if they connect with their peers.",
        "pros": "- Many projects in many very different specialties.- Very good engineering level.- Fast moving, changing, adapting.",
        "summary": "A powerful company, with lots of opportunities to make a difference.",
        "role": "Senior Software Engineer",
        "date": "Nov 13, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Now eating too many sweets because they're readily available.- Sometimes feel like I joined too late (e.g., hear Proposition 30 complaints from coworkers, doesn't apply to me).- Continued growth has decreased the small company feel somewhat. Beginning to develop internal politics.- There is some tendency among some folks to prefer a quick hack instead of the Right Thing in the name of moving fast.",
        "advice": "Need to set expectations for new engineers that they will have to be comfortable reading and grepping our fast-moving codebase from day 1.",
        "pros": "- Pervasive focus on impact.- Plenty of opportunity to make an impact, as we ship to millions of users on a short cycle with very little red tape. Not afraid to make mistakes, though of course we strongly prefer to avoid them.- Strong overall compensation.- Excellent on-site food options. I eat here at every opportunity.- Fun \"work hard play hard\" internal culture. Coworkers tend to be \"from the Inter… net\". Many lolz are had.",
        "summary": "Rarely a dull moment",
        "role": "Software Engineer",
        "date": "Nov 14, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of the internal systems can be flaky. Scale is more important than reliability or consistency in some cases, which makes building reliable apps frustrating.",
        "advice": "Put more focus on engineering quality and many issues will right themselves.",
        "pros": "There is little friction between developing product improvements and shipping them. Engineers are generally given lots of authority to figure out the right thing to do and just do it. When people come from other companies they are often shocked by this, but even as the company has grown there are still very few gatekeepers between an engineer and getting their code into production.",
        "summary": "A place where engineers can be amazingly effective...",
        "role": "Software Engineer",
        "date": "Nov 19, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- We don't do a great job of setting goals for the team- Most of the company have no idea the work we put in to keep the site up and reliable everyday",
        "advice": "Need more frequent, and direct criticism from managers on how to improve and grow within the team.",
        "pros": "- Freedom to work on tough issues that are important to you- Free food from micro kitchens, two cafeterias, a burrito bar, pizza bar, burger bar, BBQ shack, and sweet shop- On site gym- Lots of company discounts- You'll work around some of the brightest people in the industry",
        "summary": "Operations Engineer",
        "role": "Operations Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Facebook gives you hard time when it comes to working time, you need to put in a lot of efforts as a lot of responsibilities will be on you, so it will be tough",
        "advice": "Make it more easy goig",
        "pros": "Facebook is very flexible, you get to work on many projects there, the team is very young and dynamic and the work is very challenging",
        "summary": "Excellent",
        "role": "Software Engineer",
        "date": "Dec 15, 2012",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes, people compete too much internally, which could be put stress on some people. The infrastructure still needs some work to be more robust.",
        "advice": null,
        "pros": "As titled. Also, the company is still growing pretty fast, so there is plenty of opportunities to make big impact.",
        "summary": "Exciting, innovative work. Great colleagues.",
        "role": "Research Scientist",
        "date": "Jan 17, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "busy life and rigorous setting and much more",
        "advice": "nothing",
        "pros": "great place to work for",
        "summary": "graet",
        "role": "Software Engineer",
        "date": "Feb 4, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- no 401(k) matching;- some teams work around the clock;- things are constantly changing in the development process;- preference for \"generalists\", who know a little bit of everything and nothing particularly well; it might be hard for \"specialists\" to find a good team that favors depth vs breadth",
        "advice": null,
        "pros": "- you can choose your team, and, later, you can change it;- the company is a significant contributor to open source;- there are lots of smart people around you;- plenty of perks (great and varied food, company shuttles, public transportation, bike repair, laundry & dry cleaning, banking, ...)- powerful hardware to develop on",
        "summary": "One of the best places to work",
        "role": "Software Engineer V",
        "date": "Mar 24, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "friends of sheryl sandberg, over 4k employees",
        "advice": "listen to your employees when they tell you something's wrong",
        "pros": "free food, laundry service, gym, shuttles, coworkers",
        "summary": "It was good to a point, and then too bureaucratic.",
        "role": "Anonymous Employee",
        "date": "Apr 21, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Constant inflow into upper management chain from other companies, so harder to move up the ladder if you're not on a crucial project.",
        "advice": "Recognize engineering contributions in non-product areas for promotion as well.",
        "pros": "Lot of independence in choosing your projects, recognition for innovation, complex problems, daily code pushes to production, awesome peers.",
        "summary": "Experience of a lifetime",
        "role": "Software Engineer",
        "date": "May 21, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Engineers get the most priority and respect.",
        "advice": "None.",
        "pros": "The culture is fantastic. Everyone is smart and passionate about what they do. It really feels like we are changing the world.",
        "summary": "Facebook is inspiring",
        "role": "IT Analyst",
        "date": "Jun 26, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Long hours; lots of red tape; too many meetings.",
        "advice": "Streamline things.",
        "pros": "Free food; high energy environment.",
        "summary": "Okay",
        "role": "Network Engineer",
        "date": "Jul 3, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "less promotion and severe competition",
        "advice": "more mobility between different department",
        "pros": "high salary and growth rate",
        "summary": "Great place to work",
        "role": "Software Engineer",
        "date": "Jul 8, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Inevitable bureaucracy that comes when a company gets larger. Hard to avoid, especially outside of engineering.",
        "advice": null,
        "pros": "Career growth as the company grew. Zuck had a big vision that resonated and was true to it the entire time I was there.",
        "summary": "proud to have been a part of this company",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "overall coding style not so elegant",
        "advice": "pay more attention to design pattern and coding style",
        "pros": "good food and campus, smart engineers",
        "summary": "good company",
        "role": "Anonymous Employee",
        "date": "Aug 3, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- learning might get skewed towards internal tools, FB-specific libraries of popular languages, etc- a little chance of learning about the complete stack, more likely to work on a particular component of a bigger project/product",
        "advice": null,
        "pros": "- Fast paced learning- Freedom to work on what interests you- You can make big impact- Everything based on merit and performance, no politics- openness in culture- perks are awesome",
        "summary": "A good place to be",
        "role": "Software Engineer",
        "date": "Aug 18, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "it's becoming more like a big company now",
        "advice": null,
        "pros": "Passionate and smart people; company brand value; lots of different projects/areas to work on",
        "summary": "Great company in general, but too big now if you are looking for a startup",
        "role": "Product Manager",
        "date": "Sep 11, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-No longer a place for the inexperienced-but-motivated worker to learn on the job. The company is taking far fewer risks on new hires, preferring to bring people in from larger companies (e.g. Google) or more established backgrounds (e.g. business school, consulting firms). In aggregate, this means less creativity, more politics, and more fear of failure.-Large contractor population. If you're coming in entry… -level, you will most likely come in as a contractor rather than a full-time employee. Contractor hiring at Facebook is typically used as a way to get around headcount limits, not as a thoughtful or strategic approach to staffing, and you will probably feel that. There are limited opportunities for conversion (though it's still a great way to get your foot in the technology door).-Poor investment in and accountability for managers. Many managers at Facebook were thrust into a management role because they were of an appropriate level - not because they are good managers. There is very little accountability for bad managers, and good management skills are rarely counted as notable. Early on, the company set a culture around managers not being different than anyone else - they just happened to manage. It's treated as a side project more than a full role, so there's no particular incentive to develop your people, nor are there any consequences if you're bad for your people.",
        "advice": "Make managers accountable for unhappy, under-developed, or high-attrition teams. Set a universal philosophy around contractor hiring. And bring back 3pm margaritas - your employees need them! (This probably spoils my anonymity, doesn't it?)",
        "pros": "-Unparalleled impact. Facebook is the only place where your work will affect over a billion people every day. That is ridiculous and awesome.-Excellent benefits. Many people have elaborated on this below, and I will just confirm that it's great.-Travel opportunities. With so many global offices, even the lowest-level employees often have a chance to travel for work. You get to meet a lot of really gre… at people and see the world a bit this way.-Strong professional network. Facebook still attracts many of the best and brightest, and it's a privilege to get to work with them.-Engaging and interesting work. I can't think of a single boring job at Facebook. The company is still tackling some of the most interesting and challenging problems in technology today.-Great internal communication. Not many people talk about this, but Facebook runs almost entirely on Facebook groups, which is surprisingly efficient. Between that and their task-tracking solution (similar to Asana), internal communication is really good at scale.",
        "summary": "Can't speak for engineering, but the business side has become unexceptional",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2013",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The workload was challenging at times and sometimes during deadlines the work could become stressful but overall it was good",
        "advice": null,
        "pros": "The atmosphere was great at facebook, my team was very friendly and the culture was great to work with",
        "summary": "It was great",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Can be very messy- Limited career opportunities outside of sales- Extreme differences in perks and compensation between HQ and international offices- High workload not matched by compensation",
        "advice": "Take care of non-sales, non-engineering and international employees",
        "pros": "- Energizing mission to connect the world- Great business outlook- Perks (but only in large offices like Menlo Park, Dublin, Sao Paulo)- Still keeps some of its original hacker culture- Great CEO",
        "summary": "Great but very messy company",
        "role": "Business Development",
        "date": "Nov 24, 2013",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Average leaders are coddled by senior leadership and protected by HR. For very autonomous self-starters, this will drive you nuts. If you are working under one of these managers, you'll have to leave your position before you are able to \"move fast and break things,\" which is disappointing.",
        "advice": "Sniff out the feet-draggers in management and cut the dead weight. This is hard, because generally those leaders manage up the best.",
        "pros": "Smart people. Amazing opportunities for impact. Challenging roles. Great benefits.As close to a startup in a big company as you can get. Generally, you are heralded for pushing the limits of today's solutions and thinking about the bigger picture.",
        "summary": "An awesome place to begin a career in the tech world.",
        "role": "Anonymous Employee",
        "date": "Jan 13, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "wrote code in a sloppy manner and were too insistent on shipping weekly",
        "advice": null,
        "pros": "smart engineers who worked hard and played hard. There was also really good food most of the time, and a fun sense of family. I enjoyed the location in the bay area.",
        "summary": "valuable experience because of the people i met",
        "role": "Anonymous Employee",
        "date": "Jan 20, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lots of boring problems to solve.",
        "advice": "Keep on keepin on.",
        "pros": "Lots of interesting problems to solve.",
        "summary": "Fun company, bad product in my opinion.",
        "role": "Software Engineer",
        "date": "Jan 26, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Can't think of any bad things on my company...",
        "advice": "Continue on what you are doing.",
        "pros": "Social interactions with different people from the IT industry.",
        "summary": "The best company I had...",
        "role": "Systems Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Long Hours and some times you cant balance work and your personal life.",
        "advice": "They should identify the young talents",
        "pros": "Amazing work culture, you never see it as a work place",
        "summary": "The Best Place to learn",
        "role": "Software Developer",
        "date": "Feb 11, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The company is growing big really fast. If you aren't in product teams, it's hard to get much love and as the size increases this is more apparent.It's not a small company anymore and over the time I was here, I have seen the start up culture slowly mature.",
        "advice": null,
        "pros": "You get to meet a lot of really smart people. Also, there are a lot of benefits and there's more coming.",
        "summary": "It's a rocky ride",
        "role": "Software Engineer",
        "date": "Feb 28, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company has grown a lot and with that came politics and an unusual (at least for me) level of competitiveness amongst colleagues. Constant re-orgs make it a little difficult to grow, as you end up changing managers all the time and you role changes as well. The advertising product is far from stable and they keep changing everything all the time, which confuses the team and the marketplace (and makes the sales pr… ocess more challenging).",
        "advice": null,
        "pros": "The campus is insane, great place to be, delicious food, positive environment overall. Young team overall, great benefits.",
        "summary": "Pretty good place to work",
        "role": "Account Manager",
        "date": "Mar 5, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "only have 2 prime locations centralized around the engineering division",
        "advice": null,
        "pros": "great opportunity to do work that impacts an incredibly large demographic",
        "summary": "facebook from a ui design perspective",
        "role": "Anonymous Employee",
        "date": "Mar 25, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Working in a remote location makes it difficult for career advancement. A lot of meetings, and less action. The company has grown very large and decision making is a slower process.",
        "advice": null,
        "pros": "The company is run well. I don't feel over-managed and I have a clear view of the company's objectives and goals. Pretty cool perks, even with working in a remote location.",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Apr 4, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Depending on department, there are a lot of cliques. Being close friends with employees in the company is definitely a huge plus to advance in the company.",
        "advice": "Remain subjective. Put aside friendships when evaluating people.",
        "pros": "Innovative, hard-working, fast paced, friendly, fun, challenging work environment",
        "summary": "Facebook is a great place to work!",
        "role": "User Operations Specialist",
        "date": "Apr 17, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "No cons, this company was great to work with.",
        "advice": "No issues with upper mangement.",
        "pros": "Working Conditions are great, the perks are also very good.",
        "summary": "Great Perks and Great Pay",
        "role": "Technical Project Manager",
        "date": "Apr 18, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Miss the small company atmosphere of knowing everyone and getting down and dirty on multiple projects at once.",
        "advice": null,
        "pros": "Even after 4.5 years, the work is inspiring and the new challenges are exciting. Still the smartest employees in the business with a broad view of the world, which allows the company to serve many different cultures.",
        "summary": "Still a great place to work",
        "role": "Software Engineer",
        "date": "Apr 28, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Really don't have any cons to mention",
        "advice": null,
        "pros": "Good cultureFood is awesomeBenefits are awesome",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "May 9, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "work life balance takes a hit",
        "advice": null,
        "pros": "Awesome perksSmart colleaguesChallenging problems to work on",
        "summary": "A good company",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work/life balance not great, overarching \"connect the world\" goal pretty consistent and clear, but specific direction is often lacking and/or inconsistent.",
        "advice": "Too much stress on things that are really just minutiae",
        "pros": "Fast paced, high impact, lots of freedom to pursue directions you find interesting, awesome data set, the ability to have an idea and see it implemented and affecting real people in weeks or months instead of years",
        "summary": "Startup-up culture still evident, but hitting growing pains",
        "role": "Product Analyst",
        "date": "Jun 12, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Workload can be heavy and gruelling for some people",
        "advice": "Improve training and other things",
        "pros": "Have a great experience and meet new people",
        "summary": "Interesting",
        "role": "Software Engineer",
        "date": "Jun 16, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Depending on site, it can be pretty boring",
        "advice": null,
        "pros": "Fun and laid back atmosphere",
        "summary": "Great atmosphere to work in.",
        "role": "Security Officer",
        "date": "Jun 28, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You have to undergo high pressureboth from your collegue and the project. In most case, you have to deal with the inflexible deadlines",
        "advice": null,
        "pros": "Free working environment. You can notice that your code are really making some contribution to others and the product are possibly to be used by millions of people.",
        "summary": "Both Challenging and fascinating",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The work atmosphere is intense and too engineering centric. Some employees have risen quickly as they have been in the right place at the right time but are not necessarily the best for their role.",
        "advice": null,
        "pros": "Facebook has amazing perks for employees and tried really hard to be the best employer in the valley. Their benefits are next to none and the company is genuinely interested in ensuring that people are happy and stay for the long run. Also the people in the company are really smart and hence it is easy to have a super enriching experience working here.",
        "summary": "Amazing company where engineers rule",
        "role": "Anonymous Employee",
        "date": "Jul 14, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The compensation was a bit lower than I felt it should have been.",
        "advice": "Be extroverted, open to teamwork, etc.",
        "pros": "One of the most recognizable companies in the business, laid-back, high influx of determined/capable young professionals.",
        "summary": "Very informative learning experience for early entry post-graduates.",
        "role": "Human Operations Analyst",
        "date": "Jul 20, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The reward structure is becoming increasingly political.",
        "advice": null,
        "pros": "Exciting projects, minimal bureaucracy, focus on impact, great learning and development programs, autonomy to make decisions for effective production.",
        "summary": "Great Company",
        "role": "Recruiter",
        "date": "Jul 31, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The atmosphere is not exactly the most professional, but I suppose that makes sense as it does fit the overall vibe of Austin.",
        "advice": "I honestly have nothing but positive things to say about my experience there as well as the managers that I worked with! Highly recommended job.",
        "pros": "Very good way to launch a career. Very mission driven company that has lots of benefits. Highly recommended for someone about to graduate or post-graduate in their first year.",
        "summary": "Entry-level Facebook Experience",
        "role": "Human Operations Analyst",
        "date": "Aug 6, 2014",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Demanding job if you want to advance; requires long hours.",
        "advice": null,
        "pros": "Very positive atmosphere that challenges you, good camaraderie between workers. Very competitive compensation and benefits.",
        "summary": "Great company to work for",
        "role": "Software Engineer",
        "date": "Aug 12, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Getting bigger. Remote offices not as much as fun as headquarters in menlo park.",
        "advice": "blah",
        "pros": "Get lots of responsibility, freedom to pursue what you want to and have high impact. Great place to work.. free food and swag",
        "summary": "Great company to work for",
        "role": "Software Engineering",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "promotion process unclear, becoming political, no real freedom of speech, not so great work/life balance",
        "advice": "change the performance review process, it hurts motivation and it generates high false negatives.",
        "pros": "huge scale challenges, compensation, brilliant coworkers, perks and benefits, high degree of freedom to do what you like",
        "summary": "One of the best learning experiences a software engineer can hope for",
        "role": "Senior Software Engineer",
        "date": "Nov 2, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some of the mid-level management don't seem to know what they're doing - many/most of them are technical managers, and don't necessarily know how to organize, direct or motivate people. The biannual employee calibration cycle is absurdly excessive in scope, and literally absorbs managers' attention for 3-4 months out of the year. The internal organization is largely ad hoc and sorely missing in some of the fundamenta… ls that would help the company scale more effectively - this is a consequence of the commitment to light structure.",
        "advice": "Not every technical problem can be solved by a hackathon or its equivalent. Sometimes changes in culture and attitude are needed, and getting everyone in a room for a day or a week to focus intensively on solving an issue does not work for many kinds of problems.",
        "pros": "The company's focus on mission is extraordinary. At every level of the company (at least on the technical side), the emphasis is overwhelmingly on supporting its brilliant engineers in delivering on tools that move to company forward in its deeply-felt goal of making the world more open and connected. There is an absolute minimum of bureaucratic crap. Compensation is generous and the perks are preposterous - well mor… e than I want or need, really, but hey, if they're going to provide nearly free dry cleaning, I guess I'll use it.",
        "summary": "Great focus on mission, skimping on some of the fundamentals",
        "role": "Anonymous Employee",
        "date": "Nov 24, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "i was almost murdered 5 times",
        "advice": "you guys need to chillax my broskis and then we can all get along",
        "pros": "funfreegood foodnice peopleniceriendsand thensome",
        "summary": "good",
        "role": "Computer Programmer",
        "date": "Jan 2, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "not much choice for meals",
        "advice": null,
        "pros": "good pay, great people and project",
        "summary": "full time",
        "role": "Anonymous Employee",
        "date": "Jan 20, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Slowly getting big and probably slow",
        "advice": null,
        "pros": "Great company and smart people",
        "summary": "Great company. Slowly getting big.",
        "role": "Anonymous Employee",
        "date": "Jan 20, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too crowded, need to valet parkingThe location isn't ideal. It's kind of a not-so-nice part of town. Many people commute an hour each way, since they don't want to live in the area.",
        "advice": "Overall is goodYour path to success is to hire good people and stay out of their way.",
        "pros": "Good foo, good envirmentThe people are all really great and the company really trains you well. Maybe the most structured training program I've seen. Very professional but friendly environment.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Jan 24, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Takes a while to earn credibility if not senior when you sign on",
        "advice": null,
        "pros": "Engineers First, Period.Code ships fast.Bored, easy transfer to other internal teams.Easy to take lead on new projects.",
        "summary": "Great Culture",
        "role": "Anonymous Employee",
        "date": "Jan 24, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Loose some sharpness in execution when team gets bigger",
        "advice": null,
        "pros": "Good culture overall. Good career path for my personal experience.Very good benefits",
        "summary": "Positive experience overall; good choice compare to most companies, and probably one of the best in large companies.",
        "role": "Hardware Engineer",
        "date": "Jan 30, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As the company grows the culture changes a little which is expected but the politics in certain areas has gotten to be unbearable.",
        "advice": "Hiring from larger companies that Facebook openly says are slow doesn't make sense. If we think xxx company is slow and lacks innovation why would we hire so many people from those companies?",
        "pros": "The mission is incredible. Make the world more open and connected.From the delivery of the product to the infrastructure the company focuses on impact and truly is disrupting the industry.",
        "summary": "Great company with some issues",
        "role": "Infra Group",
        "date": "Feb 7, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work / life balance is a bit off here especially if you live in the city. The perks are great but the expectation is to stay at the office for ridiculous hours. Also, as the company has grown so have the politics.",
        "advice": "Fix some of the culture and politics, but overall doing a good job",
        "pros": "Facebook was a cool place to work, but the company is a behemoth now. The perks are great and there are some really incredible people and projects at Facebook.",
        "summary": "Big but cool place to work",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Like most companies, your experience will largely depend on your manager and your team-Working with teams can be very disorganized or frustrating due to lack of anyone following the same process-Personally, don't feel the compensation at FB can compare to the other large tech companies, including Google and LinkedIn",
        "advice": null,
        "pros": "-Relatively flat company-Most teams I know report they work pretty autonomously and are not micromanaged-Really talented people and I never feel like I'm competing with anyone for projects or time with leadership-Personally I feel like I have a good work/life balance minus the commute",
        "summary": "I work on the communications team at Facebook",
        "role": "Anonymous Employee",
        "date": "Feb 12, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I found myself in search of more work. I felt that I was an intern was not efficiently used to help push the company forward.",
        "advice": null,
        "pros": "The work culture here, at the time I interned was what kept me motivated due to its highly structured and efficient coordination with several departments. Work life balance was brought into, and meshed well with the Facebook environment to keep things interesting in HQ by having several company events,",
        "summary": "I was a former facebook intern",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Guidance is slight, and you have to convince people to ship things after you've already built them, not before. It's a difficult thing to get used to.",
        "advice": null,
        "pros": "You can make almost any change you really want to the most popular apps on the planet. How much you do is really a function of how much you're capable of and how much you can back up your decisions.",
        "summary": "Really does move fast, and you have to keep up.",
        "role": "Software Engineer IV",
        "date": "Mar 1, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "nothing all good to go!",
        "advice": "keep it up!",
        "pros": "company culture ceo friends work environment",
        "summary": "great job",
        "role": "Anonymous Employee",
        "date": "Mar 3, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "crazy atmosphere, crowded desks, too much candy",
        "advice": null,
        "pros": "amazing infrastructure, great people, rocking campus",
        "summary": "Amaze-balls",
        "role": "Senior Software Engineer",
        "date": "Mar 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- A lot is still being figured out, teams are frequently re-organized, and people come and go frequently- You have to make your own way, not a lot of training or managerial support",
        "advice": "- The transparency is great - keep it up!",
        "pros": "- Everybody is really smart and dedicated to their work- The perks are amazing- Morale is high, the company is on an awesome trajectory",
        "summary": "Smart team, interesting company",
        "role": "Marketing Intern",
        "date": "Apr 1, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Some huge, out-of-control egos in management, especially at the middle layers. Couple that with the general immaturity of the company and you'll see some very poor judgement and \"Game of Thrones\" style politics in a few departments.Average tenure of a staff engineer is about 4 years - mostly because after the initial stock grants vest there is near zero incentive for anyone under a Director level to stay any … longer.Culture creates and fosters entitled whiners - so much so that it is a running joke inside the company, with groups such as \"Patently Absurd Requests for Facebook Offices\" making fun of it all. But then again, this company is largely made up of the \"participation trophy\" generation, who have been told they were super-special since they were born. Being hired by Facebook amplifies that self-esteem level well beyond eleven.It is never spoken about, but staff turnover is huge. The washout rate of n00bs is likely around 40%. Truly talented staff move around, so team continuity is rare.Zero work-life balance - unless you happen to have a kid while working there.",
        "advice": "Fix the broken review and calibration cycle, especially the schedule and unspoken stack ranking. Strive for higher competence levels in departments outside of Engineering - starting with HR.Stop heaping huge rewards on people who ship shiny, Zuck-pleasing products that utterly fail in the marketplace.",
        "pros": "Smart people. Cutting edge technologies. Amazing food.",
        "summary": "Team Lead",
        "role": "Team Lead",
        "date": "Apr 10, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Management is really immature and lack training",
        "advice": null,
        "pros": "Lots of talented people to work with",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Apr 18, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Politics entered the company when it reached a certain scale. Bigger teams were more difficult to ship work as fast as it used to.",
        "advice": "keep innovating and making bold decisions. focus on the people that use the product, and making a meaningful experience.",
        "pros": "It was a great culture and great people. The mission of the company was huge, and they encouraged big thinking. Lots of fun things happened on a daily basis.",
        "summary": "Environmental Design Manager",
        "role": "Environmental Design Manager",
        "date": "Apr 21, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Nothing I can think of in regards to the company itself",
        "advice": null,
        "pros": "- Passionate work environment. The people obviously care about the products they ship and the people they ship it to. Definitely an environment where growth is encouraged and pushed for.- Perks, perks, perks. I seriously gained some weight here.-",
        "summary": "Passion matters",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "All consuming, easy for overachievers to burn out, some clueless people have snuck in over the past couple of years and we are less prone to firing them as we were in the past.",
        "advice": "Fire culture killers.",
        "pros": "Coworkers, tough challenges, endless opportunities, fantastic benefits, world travel.",
        "summary": "Amazing",
        "role": "Anonymous Employee",
        "date": "Apr 26, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "High pressure environment, people work too much",
        "advice": "keep making decisions taking into account everyones opinions",
        "pros": "Open culture, awesome campus, free food",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "May 2, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes the project could be a bit grindy, and I didn't always feel like my mentor was available, so there was occasionally a lapse in support.",
        "advice": "Monitor how the intern projects are going more closely to make sure that nobody is falling through the cracks. Other than that, keep doing what you're doing.",
        "pros": "Good overall culture, plenty of fun things for interns to do, and lots of freedom. Pretty flexible hours as well!",
        "summary": "Software Engineering Intern",
        "role": "Anonymous Employee",
        "date": "May 7, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Employees stretched too thin- Startup-like culture has been diminished almost completely",
        "advice": "More transparency and conversation around career advancement and compensation would be nice. While the benefits are great, the general compensation feels a bit lower than other companies in the Silicon Valley. The overall package when you include benefits/perks might be comparable, but these things don't matter much when employees are stretched too thin and don't even have a time to take advantage of facilities like … Wood Shop, Analog Research Lab, and Arcade.",
        "pros": "- Great benefits and perks- Work with some of the smartest people alive- Fast paced, impactful work",
        "summary": "Difficult to maintain work/life balance",
        "role": "Technical Program Manager",
        "date": "May 12, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too fast paced. Easy to burn out!I didn't have a good experience with my managers.",
        "advice": "I think there are small subteams within Facebook which may not be very well managed.",
        "pros": "Great workplaceWorking on very interesting problemsReally smart and motivated people",
        "summary": "Intern",
        "role": "Anonymous Employee",
        "date": "May 17, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- very hands off management approach (some might like this)- frequent reorganizations (maybe due to frequent manager changes because of growth)- lacking a diverse workforce (although this is changing)",
        "advice": null,
        "pros": "- Great Benefits- Collaborative Environment- Transparency from leadership- High hiring bar - you really are working with the best and the brightest!- Strong company mission that is truly reflected throughout the company",
        "summary": "Overall Happy",
        "role": "Technical Sourcer",
        "date": "May 29, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management tends to over complicate things. A lot more layers of management then when I first started two years ago.",
        "advice": "Promote employees that deserved to be promoted and not the ones that suck up.",
        "pros": "Facebook is a great company with awesome perks. Perks are similar to Google's so you will be well taken care of in those terms. Also, the pay is very good.",
        "summary": "Work",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "For me personally, the only down-side I see is there can be a lack of career growth/advancement opportunities. Some of that has to do with the relative \"flatness\" of the organization, but it's still a CON.",
        "advice": "As we continue to grow, please hold on tight to all the things that have made this company an amazing place to work.",
        "pros": "I've been in this field (recruiting) for quite some time...I've worked for start-ups and large, F50 companies and Facebook is by far the best place I've ever worked. This is one of the only companies I've worked for were you live and breathe the mission/values and you can see how they are a part of your daily life. In my team, I'm treated like a professional and given the freedom to work with my clients the best way … for me to have the most impact. I'm not going to speak for eveyone, but work-life balance is here for me. The benefits and compensation are ultra-competitive and I feel the company really listens to our needs. I trust in Mark and the rest of the leadership team to put Facebook in a position to succeed.",
        "summary": "Get up excited to go to work!",
        "role": "Recruiter",
        "date": "Jun 10, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too much work, no real life balance",
        "advice": null,
        "pros": "Good paycheck and great experience",
        "summary": "great place",
        "role": "Anonymous Employee",
        "date": "Jun 23, 2015",
        "is_current": false
    }
]