[
    {
        "rating": 1,
        "cons": "This is no longer a startup. You can't expect to go to Google these days and become a millionaire. As some reviewers have said, there is basically no room for advancement so it is a deadend job. They do discriminate by schools. Say if you attended Arizona State you would get paid $20k less than the same person graduating from Berkeley or Stanford. It is pretty ridiculous like that.",
        "advice": "Stop hiring people and do something new. All your money is from Adsense and that's pathetic.",
        "pros": "The reputation of the company is great, and so is the free food.",
        "summary": "It's not what it's cracked up to be.",
        "role": "Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lots !1. We only say that we have free food, and all other crap, how does it help me as a person ?2. Peers are arrogant, and i have seen its like stanford etc are great .. (ps i am from stanford too though), but the general attitude around is like every other place is bad ..3. recruitment process is not good, though i did get it due to my background, i dont think they see skillsets, they see only backgrou… nd.4. An air of arrogance ...5. Too competitive -- good for people who have nothing better in life except work ! (yes sort of geeks .. and geeks SUCK isnt it ..)",
        "advice": "Get down to earth and stop thinking you are GOD !",
        "pros": "Its famous, its been \"best employer\" for 2 years now !",
        "summary": "arrogance in the air ....",
        "role": "Senior Software Engineer",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lack of respect toward other employees, domineering behavior, inappropriate initial placement in the company, extremely poor treatment of employees by management, lack of recognition, barbaric management style, unprofessionalism, sense of entitlement, and generally very poor human behavior. On my first day on the job, I was horrified to find my new manager yelling and treating me in a demeaning way in front of other … employees while others simply continued to work. Many employees tend to have a false sense of confidence about their smarts and knowledge base, as evidenced by the smug and arrogant attitudes they seem to have about matters even outside of their fields of expertise. Most employees know only their limited field and role, and do not stop to consider the extent to which life exists outside of their tiny contribution, and Google itself. An extreme emphasis is placed on wealth and material possessions, such that the company culture feels empty, sterile, and mindlessly capitalistic. Chatter around the workplace is vapid and mimics the austere, white-walled atmosphere--this is a company for kids who dare not to dream larger than owning the latest model ipod and roadbike and eventually buying that Tesla and McMansion.",
        "advice": "Respect your employees and you won't need to spend millions of dollars on food and massages. Employees who love their jobs and want to contribute great things to the company will want to do so not for an extra serving of lemon panna cotta, but because they are valued for their accomplishments, and never treated in a way that precludes them from doing great work. Belittlement, intimidation, and hostility are not trait… s that any good manager should have, and should be promptly addressed as problems arise. Be the leader in truly valuing your employees, not in external rewards, and you'll see exponential success.",
        "pros": "One of the best reasons to work for Google is the educational opportunities it provides. On any given day, there are multiple educational events happening on campus (tech talks, author talks, poltical appearances, job-related educational seminars, etc.), and many attend while simultaneously working on their laptops. Benefits (insurance, food, on-site services) are excellent, and campus-sponsored events (holiday parti… es, wine tastings) are added bonuses.",
        "summary": "Unbelievable lack of respect for employees at shallow-minded, though smart, company.",
        "role": "Anonymous Employee",
        "date": "Dec 26, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "underpaid, interview process takes too long, the work and place is not as cool as it may seem, cutting perks and benefits",
        "advice": "please get rid of all the management that have no work to do",
        "pros": "hip, people are easy going and the campus is pretty cool",
        "summary": "not cool to work here anymore",
        "role": "Product Marketing Manager",
        "date": "Jan 19, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Google, fortunately, is the worst company I have ever worked for. It attracts so many talent people to work for this company, but in fact, the only give software engineers the special treatment. I've seen so many great engineers in operation team were treated like nothing.1. management sucksMy manager is the root cause that every engineer suffers. He is the best politician I have ever seen in my life. Eve… r since he promoted to be a manager, he started to play all the dirty games among us.He spent $20 mil per year on some equipments which melt down network connectivity so many times every month. He claimed that the equipments would save Google for 10 millions per year, but in fact, we spent a lot more work hours on trying to solve the problems these junks caused. The main problem is, there is no test base for these junks. Aren't we supposed to test all the equipment before we implement or even purchase them? Not these junks... how does it happen? pick ur guess!How about we go the manger above him. Too bad.. the upper manager is his buddy. There is no complain or any bad thing would ever leak out through these 2 layers of managers. They cover everything up very well. In fact, one of the manager's jobs should ensure the fairness. Well... \"fairness\" is NEVER been seen at this team.2. politics tricksMy manager has this policy: all the engineers under level III can not talk to the engineers above level IV. Well.... before I join google, I thought anyone could talk directly to anyone, even to CEO. But my manager fired a person who asked questions to a level IV.His recently move was - promoted two of his favorites to be managers and directly reported to him. You know what it means? He just promoted himself since there are two managers reporting to him now. That was the exact trick his upper manager did a couple years ago. Now... there are 3 levels of management under one director. How does this director allow this happen?? well.. that's the politics. So, when the new engineer join the team, how many levels above him?? It's IMPOSSIBLE that you get promoted if there is one new layer added. Most likely, you got downgraded every year!!3. STEALING/CHEATINGI've never seen so many cheating cases ever since I graduated from college, but here, at Google. We have two level IV engineers responsible for designing networks with one stealing ideas/credits from the other one's work!! And this cheating is permitted by the upper manager!! How did it happen? well... the managers playing the games. The two (now three) levels managers ensures that none of outside team could work with the talent engineer alone. When they steals, those seniors all lined up and the upper manager would give pressure down to turn in the design and the credits. Whoever on the same side of this level IV engineer would suffer a hard time and have bad reviews from those managers. So, we watched the stealing and cheating happening every day but no one dare to say anything.<to be continued>",
        "advice": "I thought Google was not a place for the politician to play games with every day. When there were so many evil people running this company, how can it not to be evil?",
        "pros": "I think most ppl r proud of working for Google. I was too...at least for the beginning of two months. So, I don't need to repeat the good things about working for Google here. But, remember, all the good things are mostly posted by \"software engineers\". They are like king of the world in Google versus operation engineers (including me) are like slavers of the king.",
        "summary": "Google is NOT for NONE-Software Engineers",
        "role": "Network Engineer",
        "date": "Jul 14, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "all benefits at Google are provided so as to keep you at work as long as possible. Serious egotism is a problem.",
        "advice": "Google leadership needs to remove themselves from their self created pedestal. The world would not end if Google suddenly no longer existed.",
        "pros": "great side benefits, free food, nice setting for a corporation. Some of the people were nice to work with, young atmosphere",
        "summary": "Poor ethics, cult-like atmosphere",
        "role": "Adwords Associate",
        "date": "Oct 14, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Never get to see my product make it to launch",
        "advice": "Please, please, please pay me 10% more...oh wait, you did",
        "pros": "Free Food, Easy work hours",
        "summary": "I hate myself",
        "role": "Software Engineering",
        "date": "Nov 22, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "unorganized no focus to individual efforts",
        "advice": "get real - stop pursuing pipe dream projects",
        "pros": "stock is doing well so i am happy",
        "summary": "taxing",
        "role": "Product Tmanager",
        "date": "Jan 24, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "#1- Current Recruiting practice has some very strange practices and the rather junior, mediocre recruiting staff are afraid to challenge#2-Inflexible recruiting practices that hire against a set of ideals vs business needs. At least 1,000 people a day are screened out due to ridiculous ideals that are never questioned#3-Recruiting practices that do not improve without 18 layers of approvals and weak r… ecruiting leadership.#4-Strong recruiters leave. Mediocre recruiters stay so that they can provide more convolution to an already convoluted process.",
        "advice": "Hire for the business, creativity and potential, not academic credentials or schools. Get rid of the current recruiting leadership.",
        "pros": "Great food, amenities and good compensation.Excellent location in Chelsea.",
        "summary": "Elitist, Arrogant Managers with low self-awareness",
        "role": "Anonymous Employee",
        "date": "Mar 15, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lack of proper work life balance, deadlines! deadlines! deadlines! Conference calls can be weird times of the day, but overall satisfying.",
        "advice": "Schedule conference call at more decent hours of the daysFeedback could be better receivedPay be made more competitive",
        "pros": "One of the best experiences in my life, nothing can or probably will come to these few years of my life at Google.",
        "summary": "Thrilling and Satisfying",
        "role": "Anonymous Employee",
        "date": "Apr 6, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Poor communications between software development uniits were tolerated by management. Management never communicated its goals leaving engineering and consulting in the dark. Software quality was so poor that customers were dissatisfied and continuously threatening to halt the projects. Payment was withheld leading to more pressure to cut costs and diminished software quality. There was no QA on software prior to inst… allation at the customer site. There were many problems with benefits administration caused by the third party firm hired to manage those items.",
        "advice": "Learn how to communicate with your staff. Set some objectives. Take advice from people that understand software development processes. Try to get a grip on project management.",
        "pros": "There is a lot of interesting work and customers with challenging problems. The company is a large portfolio of hardware and software solutions to work with.",
        "summary": "Interesting work but poorly managed",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Shocked by the rather incompetent recruiting leadership on the sales team supporting at best a rather mediocre experience for hiring managers and candidates.Rote, robot like recruiting process which is driven by levels and espouses \"in the box\" thinking.Middle managers (Staffing Managers) are the epitomy of let's do things to please Larry vs. let's question and innovate.Google Recruiting is li… ke a big filter. Mediocre Staffing Managers that measure against silly metrics and measure the team on a curve they themselves could never meet.Everyone is afraid to question the process or make changes. HR is a puppet at best with no strong recruiting leaders pushing innovation.",
        "advice": "Bring in a consultant to revamp the entire recruiting philosophy, map the right team based on this revised strategy. Get rid of middle managers more concerned about their upward mobility vs. smarter ways to hire. No one has questioned the hiring process @ Google and yet that's exactly what needs to be done.",
        "pros": "Amazing perks, benefits and payInteresting work and smart colleagues (middle managers are the exception).Concern for change is there, empowerment to do so unfortunately isn't given to the recruiting team.",
        "summary": "Recruiting Process shockingly incompetent",
        "role": "Marketing Manager",
        "date": "Jan 21, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management, co-workers, try to directly copy other products, location",
        "advice": "Hired skilled managers before trying to build a team",
        "pros": "Many Cafeterias to chose from",
        "summary": "No focus or direction",
        "role": "Product Engineer",
        "date": "Mar 20, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "You are encouraged to work against your \"teammates\" in your fight to the top and talk bad about them; Building a sense of community is discouraged",
        "advice": "Stand behind your word: Don't be Evil. Lead by example. Evil is prevalent in the way you make us fight each other.",
        "pros": "Lots and lots of money thrown around to bring in celebrities and authors to keep you interested; the space is very clean",
        "summary": "Nothing is ever good enough",
        "role": "Technical Program Manager",
        "date": "Apr 13, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Google sucks when it comes to bringing on board new talent with a strong and accomplished caliber and assisting its integration into the operations. Instead of making the younger and less experienced work-force absorb the experience and Know-How, Google embraced a weak and overly flat environment which allows the least experienced ones set the tone and fight off external Know-How and experience. That's not really a c… ompany that wants to change but rather a company that it suffers from massive turn-over in sales and business operations and instead of fighting it off with a confident infusion of experience operations leader, it created an overly flat and 'fuzzy' environment, where everyone is obsessed with trying to please others and be sweet on the expense of doing the right thing.",
        "advice": "All this 'we are all loving each other and having fun together' is good for a young company but it is just not enough for building up a stronger and more mature and experienced caliber that would be able to sustain the company's growth, once it turns gigantic.Overly flat and collaborate corporate environment to the level young and clueless account managers sitting and raising ideas in senior management team meeti… ngs is showing weakness to establish a clear and confident reporting and development environment.No one wants to turn into the new Microsoft but going overly 'flat' won't solve it",
        "pros": "Google is an amazing company. Innovative, passionate, insisting and investing to stay young, and continuously trying to improve",
        "summary": "Terrible experience",
        "role": "Global Partnerships Management",
        "date": "Jul 16, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Ex mcKinsey folks become sheep like here and forget that their insights could be used to affect change at aRecruiting function that is lackluster (take them out of The gplex) they couldnt recruit top talent. Several recruiting leaders from the UK and seem to lack basic strategy skills but excel at their own PRRecruiting is a protracted process that doesn't need to beHiring Managers take mediocre results a… nd lack ability to sniff good recruiting talent from folks that talk a good gameRecruiters cow tow to a team of paper pushers that review Packets to the detriment of great candidates and candidate experience",
        "advice": "40k employees, time to reinvent your recruiting process as Google competes for \"startup\" talentThe lens by which recruiters are measured should used for lead recruiters and managers as wellYou can't expect mediocre recruiting leaders, esp in Nikesh's org to hire top talentRecruiting leaders protecting their turf, not innovating and siphon work they should be doing to jr staffIt's embarrassing that Goo… gle allows such weak leadership in recruiting, but rarely anywhere else in the organization.Yes, I was a Recruiter that wasn't treated well but it's clear that I'm not in the minority. I hope Glassdoor is a good vehicle for change in The Global Business Organization's recruiting leadership. It's rather disheartening that it hasn't been addressed and the Director of that team is opposed to hearing potential issues on his team.Heard of candidate experience?Time to fix it and this time with force. it's beyond broken.",
        "pros": "FoodLots of primary colored campusesMcKinsey folks around campus ignore all they learned to lead Google (great for ineffective leaders, bad for those that stand for change)PR team is a well oiled machineGoogle is in its own reality, outside opinions that don't agree are ignored / rebuffed",
        "summary": "Good benefits, very political and ineffective recruiting team supporting global business org",
        "role": "Recruiter",
        "date": "Oct 6, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "too much work, too much stress, politics is growing. hyper competetive know it alls abound in this company. not even the best conpany to work for in bay read",
        "advice": "where do i start",
        "pros": "nothing good to say about this company. works you to death. too much back stabbing and politics",
        "summary": "horrible",
        "role": "Program Manager",
        "date": "Feb 20, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "People here don't know how to program.",
        "advice": "Purge the ranks. Get people who actually get stuff done, not be whimsical all day working on projects that don't matter to the bottom line.",
        "pros": "Food. I think I have gained about 15 pounds since I have been here :)",
        "summary": "Bad programmers",
        "role": "Software Engineer",
        "date": "Feb 26, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "-my manager was aggressive-my manager illegally harassed me-HR did nothing about it-I ended up seeking counseling about the problems I was having with my manager-when I told her manager what was going on he told me I should man-up and grow a pair-when I confided in a colleague for advice, that person decided to gossip to the rest of the team about the problem",
        "advice": "Sexual harassment is illegal.",
        "pros": "-lunches were provided-the schedule was flexible-incredibly smart people",
        "summary": "The worst job I've ever had",
        "role": "Anonymous Employee",
        "date": "Jul 4, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Unless you are a SWE you should not work at Google. Lots of red tape and a complete lack of regard for dogfooder feedback",
        "advice": "Google promotes the wrong people over and over, while the good managers are not rewarded. very sad.",
        "pros": "Free food, great hardware, cool campus, amazing benefits",
        "summary": "Not as good inside as it looks outside",
        "role": "Senior Manager",
        "date": "Jul 9, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The competition for the job is extremely intense. You will get some very tough interview questions, but as long as you get through those interviews you are okay",
        "advice": "The environment is so snobbish...",
        "pros": "The job is good, food is good, money is okay. It is a great place to start your career since the company is so reputable.",
        "summary": "Okay",
        "role": "Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "very slow to get anything done; you work for your OKR's not for your passion. 20% time is a myth :(",
        "advice": "the best way to get something done at google is to disregard company policy as much as possible :( The internal social caste system is fairly striated, as well - it's easy to tell the difference between 'haves' and 'have nots' on the campus.",
        "pros": "Good salary, Excellent Benefits, Excellent Campus",
        "summary": "Google stinks at aqui-hires",
        "role": "Server Operations Manager",
        "date": "Sep 19, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Most of what you hear about working at Google is just hype. The reality doesn't live up to it.Shitty passive-aggressive middle management.Systematically rewards only short term results, which leads to exponential compounding of code cruft. I mean they give explicit instructions for calibration and promo to consider only demonstrable benefits of the last 6 months of work, and nothing earlier than that … which had a delayed benefit. So the rank and file are forced to be like shitty mutual fund managers obsessed with quarterly results, in contrast to the upper management's supposed long term focus.When you start they flip a coin and if it comes up tails you are stuck in ads for years against your will.20% time is a lie. 20% time is essentially unpaid overtime and if god forbid your 20% time takes a risk and fails you will be calibrated as if you had spent that time doing nothing.Every creative idea is shot down in favor of the same old safe but inefficient crap. All the projects come from the top down. There is no bottom-up innovation in ads because they try to keep everyone 110% busy with top down mandates. The company hasn't really innovated much in years. All their fast growing products are acquisitions or \"me too\" and the ads infrastructure is bloated and ossified.There's a lot of witness-tampering when it comes to peer reviews and stack ranks. You aren't allowed to rate your experience working with a person. You're supposed to somehow rate their entire accomplishment including stuff that you had nothing to do with. And if your stack ranks differ greatly from your manager's opinion of the latter they will passive aggressively hint that it will be a reason for firing you.Valve has a much better stack ranking system where people just rate their own experience working with a person and all feedback is anonymous. Also unlike Valve, Google has no freedom of association with whatever projects you want to do. It's all top-down mandates and selfish horse-trading by psychopathic middle managers.I've read about the toxic culture that killed Microsoft and it sounds very similar to Google in my experience. A lot of the managers were hired from outside the company and tracked their shitty culture in with them. Perhaps that explains it.",
        "advice": "Fix the incentive structures to reward behavior that furthers the long term interests of the company and the employees. Fire managers that get bad Googlegeist results and promote from within. Make all peer reviews anonymous. Abolish calibration or force the cabal to write a justification for each score. Don't take avoiding conflict to the extreme of being passive-aggressive and failing to communicate.",
        "pros": "It pays well and it has a lot of resources to support big projects. Many of your coworkers will be smart. A few will be brilliant.",
        "summary": "Bait and switch",
        "role": "SWE",
        "date": "Sep 27, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you get stuck with a bad manager, in a chain of people who aim to protect that person, good luck.Low base salary.Very hard to advance.Some groups can be very political.",
        "advice": "Get serious about insisting on having great managers. Managers who have proven themselves incapable of great management (or even good or neutral management) should be dealt with accordingly, not protected.",
        "pros": "Great benefits, smart people, interesting challenges, great brand.",
        "summary": "Google protects bad managers.",
        "role": "Anonymous Employee",
        "date": "Mar 28, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I came in under an acquisition, excited to take on a new role! I found the acquisition team to be unprepared and without answers. My team members were confused about who even their new managers would be. While no one expected handouts, it was hard to find someone even interested in assisting those who came on with temporary roles. It was starting from scratch to find a place in the big Google world.",
        "advice": "stop acquiring companies when you don't know what to do with the employees",
        "pros": "excellent marketing to it's employees. great benefits, onsite perks",
        "summary": "came in excited, left very disappointed",
        "role": "Human Resources Generalist",
        "date": "May 5, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Google opened the Kirkland office to poach from Microsoft and Amazon. Looks like they got what they wished for. The office and Google internally is just brimming with politics and useless processes now. All the good Engineers have/will leave very shortly.",
        "advice": null,
        "pros": "All the usual good stuff about Google: free food and good comp.",
        "summary": "Full of the worst people from Microsoft",
        "role": "Software Engineer",
        "date": "Jun 1, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very corporate now. The company is hierarchical and there is little to no access to management at the top. Long hours and no work life balance.",
        "advice": null,
        "pros": "Free food and snacks.",
        "summary": "Google underpays when it comes to staffing and recruiting. They are way below the market. There is no work life balance.",
        "role": "Technical Sourcer",
        "date": "Jul 29, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Entitlement, damaging competitiveness, and misogyny just to name a few. Throw an ineffective HR team in the mix and it is actually not a very supportive or pleasant place to work. I worked in a group that was dominated by men who actively did not like women. My male boss actually stated in a 1:1 with me once that he though several recent promotions were to fill some sort of \"promote women quota\" and that some of the … women promoted did not actually deserve it based on their performance or skills. He actually said this to me, a woman. I did mention this to my HRBP and her response was \"do you want me to do something about that?\" A completely inappropriate response. Only young white men from top level universities and very masculine women were hired into our group, I was reorganized into the group my second year at Google and was shocked and disturbed by the environment on the team i joined. Work life balance was a joke and the only appreciation and recognition I received was from the internal client groups I supported. I would not recommend working at Google to anyone and would say that women in particular need to think long and hard before going to work there. I think there is a lot of bullying, bias and harassment happening in the group I was in and HR should know about this as many people have raised it and no action towards improvements are being taken.",
        "advice": "The HR team needs to be stronger and take appropriate action on items raised to them. I also think more unconscious bias training and more honest conversations about gender issues is necessary.",
        "pros": "The perks, benefits and prestige of working here are the most significant pro's. Having Google on your resume does open other doors for you, but first you have to survive working there. Another pro is the variety of interesting products they are working on, there is very interesting work happening at Google in a variety of areas.",
        "summary": "Not the best company to work for despite the reports",
        "role": "Program Manager",
        "date": "Oct 24, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not a good company to work for.",
        "advice": null,
        "pros": "They pay a good salary except that they have very lousy work environment. I am no longer interested in working here.",
        "summary": "Not a good company to work for",
        "role": "Anonymous Employee",
        "date": "Nov 7, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "horrible management, no training, too many people and not enough hours to work",
        "advice": "better management of hours given to employees",
        "pros": "the management girls are nice and appreciative",
        "summary": "Ask a stylist app",
        "role": "Stylist Consultant",
        "date": "Dec 15, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No Union, no sense of security, horrible working conditions, your not allowed to have a voice. No one seems to know what's going on, rules change every week. There are non stop emails and sometimes even phone calls during your personal time. Even after a 10 hour shift you only get 30 minutes lunch. You often have to perform the role of 3 people at once.",
        "advice": "Stop depending on a daily feedback form from each operator & actually spend some time in store to witness 1st hand what is going on, rather than sitting behind a computer all day dictating.",
        "pros": "The Pay was great, when you got hours.",
        "summary": "Most stressful job ever. You get fired if you even sneeze too loud.",
        "role": "GSX Operator",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Management - I personally experienced the worst management. My boss didn't know how to be a manager, and would always try and steal my work, and then take credit for it later. Super micromanager. His boss way just as bad, and the director of our department is a joke. A lot of favoritism and politics, and ego filled people who think they are entitled.- Constant reorgs, and the fear of wondering if you will l… ose you job.- No growth advancement.- Bonus was less then promised in offer letter.",
        "advice": "Be more down to earth, and loose the attitude.",
        "pros": "The perks, (obviously). hmmm... thats really the only positive thing I can think of.",
        "summary": "Interactive Designer",
        "role": "Interactive Designer",
        "date": "Feb 4, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Overhyped. Not nearly as fun to work in as it seems",
        "advice": null,
        "pros": "None that I can think of",
        "summary": "Not worth your time. Avoid.",
        "role": "Anonymous Employee",
        "date": "Feb 14, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Be aware that internal mobility between ladders/locations are very difficult in some departments where internal recruiting is low. CorpEng (Corporate Engineering Department) is one of the top department that is applying this policy since management is only interested in their own benefits. Even you agree with some manager for mobility in other departments, they'll try to interrupt the process. They don't look at empl… oyee's career/family perspective. Be aware about department you're joining after interviews.",
        "advice": null,
        "pros": "Development tools are perfect. Engineering Excellence is peak and you'll improve your coding skills significantly.",
        "summary": "Internal mobility is difficult in some departments.",
        "role": "Anonymous Employee",
        "date": "Mar 1, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Nothing to do. Once you get there you could relax.",
        "advice": null,
        "pros": "Biggest company to work for. Good benefits.",
        "summary": "Famous company with nothing but the name.",
        "role": "Anonymous Employee",
        "date": "Mar 4, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Discriminate the lower level. May be not the owner but the management is. As signed paperwork, it said equal opportunities but really is not. Like myself, I work myself off and willing to go extra mile but at the end, they used all of your talent then said end of my contract.",
        "advice": "Try not to control by yourself but have to think of others. Don't try to manipulated it.",
        "pros": "Only serve food for free. That's it",
        "summary": "Technician",
        "role": "Technician",
        "date": "Apr 12, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Be aware of the Google fairy tale. The reality that I experienced is:1. The so called \"20% project\" is already gone. The first day I joined the team, I was explicitly told there is no such thing called \"20% project\". I was told to focus on this team's jobs.2. The legend of \"developer come up with ideas and had freedom to execute\" does not exist. When I interviewed and was in the orientation, in multiple t… imes I was told \"Google works bottom up\", \"Gmail was a bottom-up idea\", \"you have the freedom to use your time to test out your idea\". But the reality is: the boss \"suggested\" a direction that you \"may\" work on, it was actually an authoritative direction, an order. I once tried to divert a little bit and have my own direction, then that one incident caused pretty bad half year review.3. Management is fake, hypocritical: a) they say you can have your own direction and your own creativity, but at the end of the day they judge your performance just like a worker, on how much your \"throughput\" is b) they say \"Google takes a long time to ramp up\" but actually they count your output and rate at day 1, not considering the ramp up time. c) they pretend Google had a relaxed culture, but they took notes of exactly what you said and used that months later as bullets against you.4. Politics, politics: under the disguise of \"Google is bottom-up\", \"Developers in Google are autonomous\", there is just tons of politics, power struggle going on. The design meetings become a place for power struggle, and speaking/advocating a design requires taking risk of jumping to the wrong boat.",
        "advice": "Google pays great, had great brand value. But please just let the myth go, don't misguide prospect employees anymore.",
        "pros": "1. Great office decoration. Very nice to show off to your friends about the working environment.2. Decent compensation.3. Great brand value all around the world, immediately respect from strangers once mention your employer name as it's so famous. Also Google brand is useful to land next jobs.4. Still relevant development technologies, useful to future software jobs.",
        "summary": "End of the Google Fairy Tale",
        "role": "Software Engineer",
        "date": "May 1, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Does anyone in management or in the company as a whole have an EQ over 5? Forgot any ideas about equality, respect and cultural sensitivity. Also forget working here if you have anything more than about 5 years of experience -- they'll try to exploit the hell out of you and take advantage of any knowledge or experience that you have that isn't part of your job. And they'll bully and harass you on and off campus if yo… u don't give them what they want. Then again, they bully and harass the local community and the local service workers -- the ones who keep the company running on a daily basis, so why would it be any different for someone over the age of 30 who actually has valuable life experience. Not a recommended place to work for anyone seeking job satisfaction of any kind.",
        "advice": "Grow up and learn what respect really means. Also, just because you haven't been out in the real world in your entire spoiled, privileged life doesn't mean that you know what's really going on or what the world really needs. You don't. And that becomes more and more apparent with each product you develop. You're all about serving the narcissist rich and powerful -- in sum, the people you like to recruit. Did everyone…  there go to stuck-up Stanford or what?",
        "pros": "Well, you might say that it's the on-site perks that are great, but really it's all an illusion because this company operates like the Borg and expects everyone to come in, conform, and become appendages to each other and the company as a whole. Also, having free food at work is nice, if only they offered heart-healthy, diabetic-friendly options. Too bad the campus isn't in a better location -- like a downtown San Fr… ancisco one where you at least had other options within walking distance. You can take the shuttle to work, true, but that keeps you trapped in a confined space for a long period of time with other Googlers. Not a pleasant experience.",
        "summary": "Lack of Respect, Superficial & Self-Entitled People, Lowest EQ Around Silicon Valley",
        "role": "Writing",
        "date": "May 7, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "6 bosses, one task, 6 different results. Horrible leadership and communications process. Internally dysfunctional and misleading.Additionally they don't honor written contracts to pay employees.",
        "advice": "Check yourself' sand pay your financial debts to former employees. Do what you say you'll do and stop lying to customers.",
        "pros": "They have some very talented staff that Is There just for the money. Great jingle commercials and good partnerships with product manufacturers, lots and lots of great backdoor deals.",
        "summary": "Horrible experience and not so white gloved internally",
        "role": "Anonymous Employee",
        "date": "May 20, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Engineering culture, lack of seasoned business management, immature",
        "advice": "Need also to hire seasoned professional not just technical engineers",
        "pros": "Perks and benefits, free food",
        "summary": "Director",
        "role": "Anonymous Employee",
        "date": "May 25, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Racist company towards minorities and females.",
        "advice": null,
        "pros": "Good only for white people",
        "summary": "Racist",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All housing near HQ is priced for the top wage earners at Google so you can't buy a house and renting will eat your entire paycheck. Google's coding environment is designed for the lowest common denominator and twisted to support a nearly infinitely large codebase. 95% of your time will be waiting for spaghetti code to build, fighting code review trolls, following Google code style, trying to figure out bone-headed n… on-standard architectures, debugging your Google-modified world, wading through endless obsolete documents, and dealing with the politics of egomaniacs pushing their dumb new framework/storage/language/whatever in an attempt to gain recognition within a nearly infinite megacorp. Google uses almost nothing from the outside world so almost nothing learned can be applied to your career elsewhere. There are insufferable KoolAid guzzlers saying they love the \"startup culture,\" as if it was normal to write 100 lines of code in a day, wait a week for it to be committed, and then attend a party of 1000 strangers texting while a computerized DJ blasts retro pop music. For all of this effort, regardless of the official project title, what you're really doing is enabling the creepy collection of marketing data.",
        "advice": "Ditch the suffocating levels or process.",
        "pros": "There are enough free food, amenities, and parties that you never need leave campus. Everybody is friendly. Lots of things to work on.",
        "summary": "Be a cog",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "You are not really aloud to work on any if your ideas. It takes years for the company to start a new project. They do not volume anything you say. Pay is not as good as competitors! The offices look nice in ads but they are really cramped.",
        "advice": "Stop growing you can handle the growth. Stay true to your owne saying and just do one thing and do it ver well. Cut back on all the different projects you are working on",
        "pros": "Decent perks,free food, transportation(although somewhat in-convent and slow) you don't have to work very hard compared to other competitors",
        "summary": "It looks better in the ads",
        "role": "Advanced Product Team Manager",
        "date": "Jun 14, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "too much politics. no matter how much you try to do your best, it doesn't beat office politics. no promotion unless you know how to play politics.",
        "advice": "don't hire too many managers, it creates micromanagement",
        "pros": "competitive environment, you learn a lot from people with different background.",
        "summary": "Operations",
        "role": "Operations Coordinator",
        "date": "Jun 22, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Snobby, childish \"one upmanship\" work culture. Endless meetings. Large campus creating an \"in crowd\" mentality. It is a rotating door of temps & contractors.",
        "advice": "A workforce of nameless, faceless, disposable \"temps\" and \"contractors\" will never give you their full talent, energy, or dedication.",
        "pros": "Free food, close to CalTrain and Light rail, name recognition, and easy access by hwy 101 & Central Expressway, google bus possibly available",
        "summary": "Terrible",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "You work for a company that has no values what so ever and is doing all it can to violate customer's privacy",
        "advice": null,
        "pros": "You live in the magical google campus and get free food",
        "summary": "No values",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-Poor management-There is really weird politics on this team-Scheduling is HORRIBLE. There is absolutely no work/life balance: you get your schedule 3 days before you start working it for the week and there is no PTO since it is an hourly job-Management does not treat you well; there is little acknowledgment for great ideas and great performance-there is a uniform and it is not comfortable-there i… s no room for real growth: this is definitely an in between job-they say they are all about transparency, but there is actually VERY little transparency-This is not a 9-5, you will work weird hours and you will not have weekends off. Instead you will have a random Monday or Wednesday off and rarely a consecutive two days off-You will be penalized for requesting a weekend off, meaning that you will receive less hoursThis is the type of job you get when you just really need a job, but be prepared to be treated badly, disrespected, unappreciated, asked to do ridiculous things in bad weather conditions, etc.",
        "advice": "Care more about turnover rate and treat your employees with respect and maybe it will turn into a positive work environment",
        "pros": "-There are occasionally some snacks in the MK, but they run out really quickly-You get decent pay for sitting around the downtown office most of the time-We have some cool events that can be fun to participate in-You get to meet a lot of people in the Austin community that you will run into multiple times-Great learning experience if you aren't the best at approaching/interacting with people-- you wil… l be talking to people often",
        "summary": "Brand Ambassadors / Field Sales",
        "role": "Field Sales Representative",
        "date": "Aug 22, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Working at Google as a contractor is like working in a assembly line, NO appreciation at all. Even though contractors add to the more the same or more than regular employees. Very disappointing, I wouldn't recommend anyone to work as a contractor here.",
        "advice": "Please get trained. Very poor management, most go by who they like to promote rather than who does a good job. I would recommend Google to pay attention to their managers and their lack of skills and this is at every level.",
        "pros": "Free food unless it is an employee event if so you are denied of food. flexible schedule.",
        "summary": "Contractor",
        "role": "Contractor",
        "date": "Sep 3, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Despite what's official, the work expected of you and thus the hours that go into the job are ridiculous and not one that you can expect any sane company to expect.",
        "advice": null,
        "pros": "Decent pay, and the facilities are great as expected. If there's one thing that I find that's good about this place it's the actual place. Other than that, nothing really.",
        "summary": "Not as great as people make it out to be",
        "role": "Anonymous Employee",
        "date": "Sep 21, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "You actually were 1/50000 employees and GSX employees receive none of the \"google campus\" benefits.",
        "advice": "use a better staffing firm!",
        "pros": "You got to tell people you worked for google.",
        "summary": "Blah blah blah",
        "role": "Store Operator",
        "date": "Sep 24, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not being treated as an equal employee when contractors contribute same if not more than regular full time employees. Very discouraging.",
        "advice": "Get train in management. Google management lacks basic management skills, all they care is for them to look good rather than improving team moral.",
        "pros": "Free food, gym, laundry and flexible schedule.",
        "summary": "Contractor",
        "role": "Contractor",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The place smell like mold, the pay isn't enough, they tell you that your full-time and only put you on the schedule 1 or 2 days a week. The management sucks and their very unorganized.",
        "advice": "Treat your employees how you work like to be treated. Clean the place up, pay your employees a better salary and give employees benefits",
        "pros": "The resident at the facility was very nice. My Co-workers were also nice. There was good teamwork even though we were short staff.",
        "summary": "CNA",
        "role": "CNA",
        "date": "Oct 30, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "the politics, the pressure, the stress, the backstabbing, cutthroat colleagues, the lack of transparency, constant reorgs, lack of job security, the disposability of employees, lies from management. Human Resources team is a ship of fools.",
        "advice": "Don't be evil. Don't lie about reorgs just to get rid of people you want to dispose of but can't find a legit reason to. Don't change the rules and hold employees accountable to the new rules retroactively--literally the worst thing ever, totally un-business-like.",
        "pros": "money, money, money, money, money. and the free food. free trainings. money. I would have quit a long time ago were it not for the money.",
        "summary": "inhospitable place to work",
        "role": "Anonymous Employee",
        "date": "Nov 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Horrible place to work and management is completely removed from employees. I would not recommend working here.",
        "advice": "Listen to your employees",
        "pros": "Nothing to add here unfortunately",
        "summary": "Part-time work hre",
        "role": "Anonymous Employee",
        "date": "Dec 29, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The interviewer asks for dates of college graduation and number of years of experience. Then I was told that Google would not consider people with too much experience.The Google employees treat contractors like second class citizens who have nothing to contribute.",
        "advice": null,
        "pros": "There are no good points working for Google.",
        "summary": "Google discriminates on age",
        "role": "Data Architect/Data Modeler",
        "date": "Mar 31, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Horrible Management and downward communication",
        "advice": "get rid of the weak",
        "pros": "Good people with good hearts",
        "summary": "Trying to Make Sense",
        "role": "Anonymous Employee",
        "date": "May 3, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you are a contractor, don't expect career growth. Take your experience and leave. If you are a vendor, then expect to be in hell because you will not have any hopes for promotion or conversion. If a full time position opens up on your team, expect management to block your application (even if you are qualified) and once they hire a full time employee, expect to have to train that person.Full time and vendo… r management tends to micromanage and is generally unappreciative and suspicious if you work under them with a red badge. Don't expect any work flexibility or autonomy. Expect to be treated like a second class citizen and don't expect to get any respect.The Google perks like food, gym, etc really depends on where your office is located. If you are a TVC, then likely you will not get easy access to these perks because you may be located on a \"vendor only\" office that is specially set up without these amenities.",
        "advice": "Treat your contractors like people instead of like cattle or robots.",
        "pros": "Great people to work with on your team and good opportunity to network since people leave so fast to other companies.",
        "summary": "Great place to work if you are a full time",
        "role": "Anonymous Employee",
        "date": "Jun 15, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No clarity, politics, no feedback, you're on your own.",
        "advice": "Stop the nonsense reviews.",
        "pros": "Food, benefits, location, colleagues, great for cv.",
        "summary": "Horrible",
        "role": "Account Executive",
        "date": "Jun 26, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "management is not that great. they never back up their employees but rather throw them under the bus",
        "advice": null,
        "pros": "food and other benefits.. are great",
        "summary": "resume review",
        "role": "Senior Program Manager",
        "date": "Jun 27, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Too many layers of no-op managers- No tooling to do your job (e.g. iOS development on Mac)- \"Free\" lunch is low quality, poor selection- 20% time is a straight up lie",
        "advice": "Stop launching poor products and assuming people will go for them because of the Google brand. That strategy only works so long...",
        "pros": "- Great pay- Opportunities to travel to intl. offices- Free coffee and snacks- Onsite gym and other perks",
        "summary": "Nothing like advertised",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "long work hours. Very hard to maintain a good work life balance. Constant fear of being fired. Too much of a bureaucracy, you feel like dont contribute to anything.",
        "advice": "dont fire me. Im just a little boy. I have nowhere else. Please dont fire me. Dont fire me.",
        "pros": "Good pay. Nice benefits. location in new york city, free transportation to and from the company. Good fresh food also.",
        "summary": "Nice",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you don't fit a certain mold, you will only go so far.",
        "advice": "Revamp them.",
        "pros": "Great salary, benefits and perks.",
        "summary": "Glass Ceiling",
        "role": "Anonymous Employee",
        "date": "Jul 28, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Limited perks: I get that TVCs can't have the same perks as FTE, but as a TVC you are constantly reminded of your lack of privilege by both Google and your peers. True story: as a designer at Google, I once had to design a t-shirt for a team outing I could not attend (because of my TVC status) and then I wasn't given a t-shirt (despite having designed it) because swag is a FTE perk only. Really guys?- People: d… epending on the team you get, people are extremely cliquey and treat TVCs like second-class citizens / borderline work slaves. I have been disrespected and downright mistreated many times at Google.- Growth: as a TVC you do not get to have growth and management does not care about it.- Work: the work is boring and repetitive. I was hired to do a job that sounded interesting, exciting, and creative. I ended up getting a series of the same tasks because that's what my team needed from me. Despite having asked for different projects and complained about being burned out, I am still asked to perform the same tasks.- Design: as a contract designer, you will not get any portfolio-worthy projects. I know many contract designers at Google and they all feel the exact same way that I do. We feel like the help and it's awful.",
        "advice": "Invest in your TVCs and their wellbeing. We are hardworking people and we care about the company as much as a FTE. When I started out at Google, I was passionate and excited about coming into work and now I am burned out and as you can probably tell, a bit bitter. A lot of contractors have mentioned the same thing here: please treat us with the respect and professionalism that we deserve. Thank you.",
        "pros": "- Perks: free food, free gym, nice offices, massage chairs, bikes.- People: you meet a lot of smart and interesting people at Google. Great for networking.- Pay/hours: the pay is great and the hours are very reasonable (despite the long commute).- Resume title: it's Google. People find it impressive.",
        "summary": "Great for full-time employees, horrible place for contractors",
        "role": "Graphic Designer",
        "date": "Aug 8, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Being programmer means being creative. Well, not at Google. You will have artificially created restraints in almost every aspect of your work.Here is an example: readability. In order to being able to commit some code at Google you would need to have a \"readability\" in a language you're writing this piece of a code. It doesn't matter if you have 10 years of experience in that language. It doesn't matter if yo… u have certificate from the company that developed this language. And in order to get readability you would need to write a lot of code in that language. Catch-22. Also, you would have to wait for a pretty long time in the readability queue in order to just start with process. You fill like you lost all the experience you had before with this language. Somebody who has readability and has less experience in this language than you will have power over you. You would have to persuade this other person that your code is OK.Hypocrisy. They still have courses at Google where they teach you that it is important to have a rest, it is important to manage your energy, it is important to work when you are excited and energized and not work when you're not. This is why they have all those massage chairs. It used to be the company that valued all this. It all changed. I saw my manager writing in 2am and then writing in 6am again. Manager sets an example for it's subordinates and this example is terrible. I also remember my manager writing email about his current state that he is sick. At the same email he tells that \"he will do his best to do some work\". At the same time this same manager tells everybody else that \"if you're sick - go home and take a rest and don't work\". I lost respect for my manager long time ago.They want you to deliver results as soon as possible and yet they don't give you the ability to do it. Instead of JUST DOING IT you would have to write design docs with the future possible architecture (which will always be different because we can't predict software development) and persuade people who have more power than you. Those people will do their best to make sure you don't just start working on your code. You would have to pass several rounds of this absurd.They told me it is very important to predict how much time it would take to finish the project. I asked them what is the technique to predict unpredictable and got no answer in return. They told me it is very important to make sure you did your project as close to your predictions as possible. I asked them what stops people from deliberately giving very large estimates, completing a project sooner and just do nothing for the rest of the time. I got no answer in return. I completely lost respect this company. This is absurd. The management don't think about what they are doing and why. They don't think about their own behavior and they own words.",
        "advice": null,
        "pros": "Overall compensation, although it is getting worse and worse every year.",
        "summary": "Google is not the company we all loved any more. It lost it's values.",
        "role": "Software Engineer III",
        "date": "Nov 27, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "There is no clear career progression, and senior management is arrogant.",
        "advice": "Reward employees based on achievements as opposed to favoritism by one's direct line manager. Ensure that rewards / bonuses / promotions are not entirely up to one person (ie the specific team manager), and instead need to factor in feedback and opinions that the direct line manager cannot overrule.",
        "pros": "2 types of people that will find a great place to work: (1) recent college or B-school graduates looking for a first job where they can learn a lot, and (2) more senior corporate executives with many years of experience who aren't overly ambitious and are looking for a role where they can put life on auto-pilot and glide through their day-to-day activities.",
        "summary": "Google: change is needed to avoid complacency & loss of competitive edge",
        "role": "Strategic Partner Development Manager",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Where do I start? If you have completed more than 5 years work in your career, don't even consider joining this glorified telesales centre. It is mind-numbing work, filled with smart people bored out of their heads and quitely killing time to get the 2 year stint onto their CV.The place is full of politics. My line manager did not address me for more than one sentence at a time for the first FOUR MONTHS I worked … there there. It simply was not going to bring her any benefit or kudos to be seen fraternising with an inferior.The arrogance of the place is pretty astounding too. 'You should be honoured to be working there'. My peers were great people, but it's the kind of place you have to be sure you are going to fit in, because if you don't (in my team about 20% of us) you will not last more than a year before slowly losing the will to live.If fussball, free food and a great social life is high on your agenda, go for it.If self-development, career progression, nurturing and supportive environment and understanding management are important to you, look elsewhere",
        "advice": "Show some respect to your team - they are not drones in a hive, but smart educated people looking to develop their career",
        "pros": "The free food is fantastic, Google grabs attention on your C.V.",
        "summary": "In your 20's looking for a headline for your resume? Go for it. Otherwise think very very carefully",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "As it has grown big, Google has become miserably stagnant when it comes to giving proper recognition to employees, during perf-cycles and promotion. They manage to suck the top brains from fresh college grads (from IITs, IISc) at a low package and yet quoting an attractive package which differs from CTC by at least 12000$ (yearly). Needless to say, these include the cost of \"perks\" shown at a exaggerated rate and som… e components which are never realized. Whereas in off-campus recruitment they make reasonably good offer (often more than double, triple the amount offered to college hires of same level) to get a candidate, even if it maybe for test-engineer position.Work is often monotonous, and rarely helps to your career growth. Even after working for years on so-called \"cool\" products, but that hardly sells outside google. And if you think you're going to spend your entire career in Google until retirement, it's going to be a sure-shot peril to your technical career. So, ret rid of the pride of working in the \"best company\" and look for a better career for yourself.",
        "advice": "Instead of pulling \"great\" people from outside at overpaid compensation, invest on retaining the great people you already have working in your organization.",
        "pros": "Perks. Free food and other facilities.You'll work on something that is used by millions of people. Opportunity to work with some of the best people in country.",
        "summary": "Great place to be, but not to great to stay.",
        "role": "Software Engineer II",
        "date": "Oct 23, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is no clear career progression, and management is arrogant.",
        "advice": "Reward employees based on achievements as opposed to favoritism by one's direct line manager. Ensure that rewards / bonuses / promotions are not entirely up to one person (ie the specific team manager)",
        "pros": "2 types of people that will find a great place to work: (1) recent college or B-school graduates looking for a first job where they can learn a lot, and (2) more senior corporate executives with many years of experience who aren't overly ambitious and are looking for a role where they can put life on auto-pilot and glide through their day-to-day activities.",
        "summary": "Google: change is needed to avoid complacency & loss of competitive edge",
        "role": "Product Manager",
        "date": "May 23, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Neverending workload and hours, constant firedrill - change for change's sake, lack of recognition, very limited career opportunities for many (all of whom are used to being high achievers), highly political, company rests on its laurels regarding its reputation as a great employer",
        "advice": "Too many leaders who contradict the company \"values\" every day are promoted and recognized - sets a bad example to the rest of the organization",
        "pros": "Many colleagues are good people and good at their job, it's exciting to work at somewhere so influential, it's good on the resume, great food",
        "summary": "Not all it's cracked up to be",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not happy with current boss. No free drink anymore. Less benefit",
        "advice": "Hope they will hire more professional people",
        "pros": "Famous place to work with the latest technology",
        "summary": "Working for about 5 years at Google",
        "role": "Senior Web Developer",
        "date": "Aug 25, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Google is the only company I've ever worked for where I've had to put up with an endless supply of childish and disrespectful behavior coming from coworkers. It's also the only workplace I've been to where my manager behaves like a 12 year old.The amount of hypocrisy is appalling as well. You have people who have been brainwashed into the \"Googley\" way and then the hypocrites who piss on the company's core va… lues while expecting the rest to be nice and googley all they long.Google prides itself in having a peer review system which means hard work is recognized and high performers get promoted. Really far from the truth, if your manager doesn't like you, for whatever reason, you will be left there to rot while other get promoted in front of you, no matter how high your performance review scores are.",
        "advice": "Stop behaving like a 12 year old and start acting professionally. Stop alienating hard working people and driving them away just because you don't like them. Don't be surprise about the high attrition level when it's all your fault.",
        "pros": "You will be able to work in some of the most advanced datacenters in the world. Good exposure to a lot interesting technologies",
        "summary": "Looks good on your CV and that's about it",
        "role": "Datacenter Technician",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "too much pressureneed to work over timebenefit is not as good as beforecancel some projects since they are not promising",
        "advice": "reduce the workloadincrease the salaryreduce the pressurehiring more people to work on the projectgive employee more private space",
        "pros": "awesome peopleawesome work environmentnice projects to work ongood foodmanagers are talented and good at management skillmanagers are nice",
        "summary": "good place to work",
        "role": "Anonymous Employee",
        "date": "Jan 24, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "you cannot focus on the actual work cos reorgs are happening all the time, everything is so disorganized and chaotic.",
        "advice": "stop acting like a child, recognize those who actually do the job...",
        "pros": "good on resume free food and that's about it.Salary is not as high as I'd expected",
        "summary": "cult-like atmosphere..",
        "role": "Anonymous Employee",
        "date": "Feb 15, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Unprofessional. Poor leadership. No career growth. Poor planning. Unstructured. No rewards or acknowledgment for doing good work.",
        "advice": "Treat your employee's with respect. Reward them for the work they do. Provide feedback. Hire professional managers. Create a structure for employee's to grow and prosper. Appreciate your employee's. Use professional business practices when creating your organization, and hire people who know how to manage people.",
        "pros": "Lots of talented people. Nice chairs.",
        "summary": "Unprofessional. Poor leadership. Lots of talented people. No career growth.",
        "role": "Anonymous Employee",
        "date": "May 3, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Since Larry became CEO, things have changed. Things have become more and more top-down and even the SVPs have assumed \"dictatorial\" role. Starting anything new requires approval, distributed offices are treated like filth.",
        "advice": "Don't go paranoid about G+ & social. Take good care of distributed offices.",
        "pros": "Good brand, great products, good compensation, still innovating though at a lesser pace than 3 years back. Like the fact that Google is always willing to take big risks and make big bets.",
        "summary": "Too big, full of politics!",
        "role": "Anonymous Employee",
        "date": "May 27, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- The spirit is gone- Unengaged, unless it's an OKR of course, employees- Devoid of passion- People-hostile- The business is not focused on clients one bit at all,- The business main focus is on visibility, creating endless trix (excel) sheets and meaningless presentations- The success algorithm (yeah, so sue me Google for revealing the secret): manipulate as much as you can, never speak the t… ruth, learn how to wear as many masks as possible (except your own authentic self of course), produce many slides and many trix sheets, fill them with McKinsey-like business gibberish and clichés that mean absolutely nothing, join lots of meetings and just say something (preferably McKinskey-like business gibberish), smile a lot and make sure to please the dictat ... sorry, managers at all cost, typically by participating in their projects carrying out tasks that you are by far vastly overqualified so they can look good in front of their bosses, who in turn can look good in front of their boss and so on. Carrying out orders, mindlessly, is much more rewarded than actually doing something meaningful and innovative and thinking for yourself.- By no means think for yourself- Very little transparency- Extremely poor management- Hell, if you thought management sucked wait 'til you get a closer look at their leadership qualities and what goes on behind closed doors ...- False smiles and a sense of \"things are great and perky\"- Fear of speaking the truth- Performance system which is constantly being sold in one way by HRBP but in reality is the complete opposite which everyone knows is unfair, unbalanced, subjective, tyrannical, biased, playing out one employee against another, obliterates corporation and serves as the only control mechanism for shitty managers that fail to motivate their teams- Trust me, the list goes on and on at \"the best place to work\" but I'll stop here for now",
        "advice": "- Fire yourselves- So many fundamental aspects of the business are wrong- No magic automated algorithm will save us in 2013 and onward- You will actually need to work. You know, produce something. For clients. For your employees. Like value. I know it must sound shocking. Because it will be the end of your reign of terror.- Nothing will change unless you get rid of many people at the top",
        "pros": "- Bright clever people- Some of them are still good- Free food? Please.",
        "summary": "Come join us (if you are a mindless, robotic drone without a will to live)",
        "role": "Manager, Online Sales & Operations",
        "date": "Sep 7, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They've become puppets of the corporate culture of the bottom line mentality at cost to their clients. All they do now is fight legal battles and gouge clients budgets. Sad. Lots of turnover there. If you don't do what they want-they let you go-even if it's unethical.",
        "advice": "It's too late to save these guys-they've been swallowed up by the greed.",
        "pros": "Bring innovation to the table",
        "summary": "Corporate Victims",
        "role": "Anonymous Employee",
        "date": "Jan 15, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I work at YouTube. It is run like an army camp. Instructions come from top management which have not been well thought through but need to be obeyed, the caliber of some folks in senior management (esp. in functional support teams) is mediocre, protectionism (some folks incl. seniors still there and move ahead because they are protected by their seniors), 360 degree feedback is non existent i.e. promotions are at the…  whims and fancies of what 1 person perceives/thinks i.e. manager (no collective inputs taken from different stakeholders), territorial wars being fought inside partner management teams, megalomaniacal leadership, complete dismantling of meritocracy (faster promos if you sit in US)......the list goes on and on",
        "advice": "You are just riding on the Google brand. If YouTube was a standalone company, most talented folks would have left. Your employees are unhappy but don't speak up since they want to remain at Google, your partners are unhappy because you cant sell well, the product sucks (comments are the worst, discovery is second worst, you have not innovated anything significant). Revive a culture of meritocracy and innovation.",
        "pros": "All the usual (i) Lifestyle (ii) Perks (iii) Flexibility (iv) Brand name etc.,",
        "summary": "All that glitters is not gold (YouTube)",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Bad Chairs , bad place for growth and i think people may get more depress after going to posh.",
        "advice": "Please learn from MNC's for management and not from politics.",
        "pros": "I would never advice anyone to work for posh, I Think the environment is full or negativity or office politics . You can't breadth there freely. Country head just poke here and there .so basically no pros.",
        "summary": "Bad place to work",
        "role": "Systems Engineer",
        "date": "Sep 30, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management sucks. Lots of medicore managers waiting to get their stock options. Lack of direction. Lots office politics. Salary is average",
        "advice": "Fire underperforming managers. Raise salary.",
        "pros": "Lots of outstanding colleagues. Food is great",
        "summary": "Place is overrated",
        "role": "Senior Software Engineer",
        "date": "Nov 22, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Everyone is overqualified. Projects you work on are not suited with your experiences",
        "advice": null,
        "pros": "Good Salary and great people to work with",
        "summary": "Having a good manager makes a huge difference",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Completely inflexible approach put a lot of stress on me and my family. Terrible communications from HR department.",
        "advice": null,
        "pros": "New starter / learning programmes are very good",
        "summary": "Not a great time",
        "role": "Anonymous Employee",
        "date": "Jan 17, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "there were no cons, I just got bored easy",
        "advice": "no advise.",
        "pros": "it was so great, good pay package, friendly people. I loved it",
        "summary": "google",
        "role": "Anonymous Employee",
        "date": "Apr 13, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Too much politics especially in the Dublin office. The management is so bad that people leave out of desperation, frustration, and so so much disappointment.Stress and anxiety are very common among Googlers, where everyone wants to excel. It is you against them and you are pushed to work harder and harder and harder every day.Google knew no competition till a few years ago, but things are changing and man… agement need to understand that it is not through pushing their employees to the extreme that they are going to bring more revenue in, eventually people will leave and talents will go to the competition.. is it really worth it?",
        "advice": "Change your mentality! Do not push everyone to their limits and really focus on retaining your talents, you are not doing this!",
        "pros": "Google is a great company and I feel its values and its mission is still what it makes such a great company. You feel that the work that you do really have an impact on people, that's the most beautiful thing about working at Google.",
        "summary": "Too much Politics and Bad Management",
        "role": "Marketing Manager",
        "date": "Jun 24, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Politics!Politic!politics!and erSmart people.Free food.Lots of interesting work.",
        "advice": null,
        "pros": "Smart people.Free food.Lots of interesting work.",
        "summary": "Interesting place to work, let down by politics",
        "role": "Anonymous Employee",
        "date": "Aug 16, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I have no any cons about companny",
        "advice": "No",
        "pros": "I suggest it is very good company",
        "summary": "Good",
        "role": "Anonymous Employee",
        "date": "Aug 25, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Politics overshadow work and managers and co-workers are empowered to cut each other down to compete for projects and promotions. There is an unfair treatment of technical women with families, where co-workers and managers are empowered to question your abilities based on family obligations even though it's unrelated to work. You will be expected to walk in the door a technical expert and you won't be given adequate … time to complete work. You will spend the majority of your time playing politics to management on down to entry level staff. Senior managers and human resources don't have any empathy for building teams, rather their focus is on maintaining a facade of efficiencies.",
        "advice": "Invest in leadership and processes to support your staff to break up the hierarchy within teams. Employees who have given up so much to work for the tech giant need fair employment that includes no retaliation, equal access to training and on-boarding, right to speak up and right to contribute.",
        "pros": "Technical opportunities are there if you seek out the opportunities to prove yourself, despite what you may be hired to do. Hard work toward technical results can be showcased if you continue to build your own professional network within the company. Although Dublin is removed from Engineering, you may be lucky enough to get a 20% project with MTV. You will meet people from all different cultures and background, alth… ough they are typically single, young, and unexperienced, which doesn't fully equate to a diverse workplace.",
        "summary": "Unfair Treatment",
        "role": "Project Manager",
        "date": "Nov 2, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you enjoy your individuality and time alone, Google is not the place for you (keep in mind I’m not an engineer). Google pushes a highly \"googley\" atmosphere, which is something akin to what the Brady Bunch would be like if they lived in communist Russia. Everything from the carpet to the bathroom tiles incorporate the Google colors into its design. People are encouraged to have googley attitudes, wear plastic smil… es, and not to question the infallible nature of the executive management group. Marathon hours are the standard because, after all, employees are practically encouraged to bring a cot and sleep there…barracks coming soon (really?! no, not really). If you like feeling awkward during forced group activity, Google is your haven. It isn't exactly \"forced\" (no guns), but if you don't participate you become labeled as \"ungoogley.\" Once deemed “ungoogley”, you're practically viewed as a rotten apple that threatens to spoil the bunch. If you can endure and appreciate the googley atmosphere, you might also enjoy Google's uncanny ability to clot information within the hierarchy. Very little is shared throughout the company because from the moment you're hired, secrecy is revered. But to be honest, most of those who read this review won't even be able to get a job there. Whether you're right out of college or are putting your kids through college, your academic standing will be asked about, your transcripts required. If you went to Podunk U, your chances are worse than the rumored 1% of applicants. I'm not saying that high standards aren't important, but Google discriminates against creative and diverse applicants by employing such arbitrary standards. Google (generally) hires the elite who have elitist attitudes…probably not the best way to understand what the masses want.",
        "advice": "Stop acting as those you're King Midas…just because you struck it rich with AdWords does not mean whatever you create will be tech gold. For a company that prides itself on innovation, I can't think of any product Google has released since AdWords that has been truly innovative…unless you are calling Google's mergers and acquisitions innovative (just because Google owns YouTube does not mean you can take credit for t… he innovation). You aren't above traditional marketing, and when the AdWords profits stagnate, you'll change your tune. Google has only touched the tip of the iceberg in terms of users, but seems to focus on a very small niche of the internet market (we're not all open-source users and tech-geeks [don't get me wrong, I love a good tech geek]); it's in the company's best interest to drop the elitist niche/attitude and truly become the people's company.",
        "pros": "When people think of working for Google, the food and facilities are generally what come to mind first…and those are the best parts. Google fosters a college or academic feel where you never need to leave the campus in order to find sustenance or a respite from the daily grind. Breakfast, lunch and dinner are offered Monday through Friday, and the food is pretty good (keep in mind I'm comparing it to other free food…… so how can you really complain?). Google-colored Swiss balls (those bouncy orbs you see freakishly fit people doing sit-ups on in infomercials) invade the office cubicles and give the workspace a much more play-pen sort of feel. To bolster the dorm room ambiance, Google also supplies pinball machines; foosball, ping pong & pool tables; and assorted video games. Foam darts are passed out for 'dart wars' during especially hectic times, and silently encourage the employees to roll away from their ergonomically arranged desks to fling projectiles at unsuspecting coworkers. After a grueling week of work, an employee can look forward to a company-funded bender in the form of microbrew beer (both on tap and in bottles!), wine, and the occasional Jell-O shot. If the alcohol upsets your stomach and a retreat to a bathroom is what you crave, fear not! In addition to having showers in almost every building, Google boasts toilets with heated seats, built-in bidets, and dryers for those who prefer to relieve themselves in a more \"green\" fashion.",
        "summary": "Google:An Elitist's Playground",
        "role": "Risk Analyst",
        "date": "May 5, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The downsides of working at Google depend largely on the department that you're dealing with. The sales organization is highly disorganized and has a glut of middle management. Management and structure are obviously necessary in all companies, but the sales org at Google has too many managers, many of whom are ill-qualified to be managing other people. There are also a lot of politics surrounding promotions, etc. bec… ause of this large middle management structure. It also causes a lot of unnecessary bureaucracy which slows down work and can be extremely frustrating for individuals who are still on the lower rungs of the ladder.Additionally, at least within the sales org, there appears to be virtually no real career path or hope for development/promotion. Managers are hired from outside (with MBAs being strongly preferred), which is frustrating and demoralizing for employees who have worked for years without being moved up.",
        "advice": "The senior management at Google needs to do a better job of unifying the company across functional groups. The engineers, PR, marketing, sales, etc. are all kept very separate which often creates a feeling of competition between the groups. It also creates jealousy and bitterness, especially since the engineering groups are seen as being favored by upper management.",
        "pros": "Google has a really strong reputation and is a word leader in internet technology. Working at Google opens a lot of doors for later employment externally and also gives you a lot of insight into what it's like to work for a large company that is still in a growth phase. Google also hires very intelligent, hardworking individuals, so you meet a lot of amazing people and work with them every day. It also provides great…  benefits (health, dental, etc.), and a lot of really nice perks (free food, gym, special guests/events). It's also a good first place to work in Silicon Valley because you learn a lot very quickly about the Valley's culture from an established organization.",
        "summary": "Fun at first, frustrating in the long run.",
        "role": "Account Strategist",
        "date": "May 23, 2008",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The hiring process is completely skewed towards academics so we are limited to the types of people we can hire and too often we end up hiring people with low 'EQ' who just can't function in a coporate environment.",
        "advice": "Hire the most qualifed person for each job based on what they've done the last 5 years in their career, not because of where they went to school.",
        "pros": "There is a tremendous amount of bright, highly-motivated people at Google and you can learn a lot from most of them. They continually challenge you and make you better at what you do.",
        "summary": "Google's hiring bar is off the mark",
        "role": "Recruiting Lead",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "One of the most \"politically\" divisive cultures you will ever work in. If you have ever dreamed of working in a company where you are rarely held accountable for anything, Google is the place to be. The 6 hour days, the inexperienced managers, the joy in reinventing the wheel, the ability to destroy a co-worker by the mere mention of being \"un-Googly\" (In the years I worked at Google I still haven't the slightest ide… a what \"Googly\" means. I never met one single right-arm leg spin bowler while I was there). The bottom line is that Google is NOT the same company it used to be and yet the myth lives on.",
        "advice": "Ditch the \"pedigree\" rubbish, no one is buying it anymore plus you are doing a diservice to a lot of these kids who have this illusion that their grades will still matter when they leave Google. They will sit down in front of their potential employer and scratch their heads trying to explain what they \"did\" while they were at Google. Experience, experience, experience............... Accountability, accountability, ac… countability........",
        "pros": "The food is outstanding. There are good people who have every right to be elitist who are not (not sure how many are left though). If you enjoy building teams and enjoy having the resources to execute on projects then Google is a good place to be. Depending upon how your options are priced Google can lead you to a rich life of spending your time commenting on Google on web sites like this.",
        "summary": "Who's in charge?",
        "role": "Decline to State",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The base salary and lack of promotion opportunities really start to wear down employee morale after the first few years. Unfortunately, there's too many glassy-eyed Google cultists/lifers who are willing to overwork themselves for a 35% (or more) paycut on projects that may not actually go anywhere. Despite claiming to seek openness, management keeps a lot of secrets-- especially around performance reviews (all emplo… yees are graded and rank-ordered, but employees don't get to know how well they fared).In terms of actual productive work, employees are demoralized by having direction constantly changed. I suppose this is known as \"keeping us on our toes.\" Further, it's tiring to hear every team say that they're acting as their own startup within Google, and that team members are going to be hand-picked to be involved in such a prestigious project. It's not uncommon for entire teams to be uprooted or replaced in one fell swoop. Put together, this leads to an uneasy feeling about one's job stability.One final problem: too many Googlers are young, inexperienced, and short-sighted in their understanding of how much power they actually have in developing public-facing products. They don't understand the implications of their actions, and move too quickly to consider them.",
        "advice": "Give employees a reason to stay at Google. Those underwater stock options sure aren't cutting it.",
        "pros": "It's a very convenient place to work-- not only are the on-site perks helpful, but employees have plenty of opportunities to learn. Unlike many companies, where employee productivity is dependent already having a certain set of skills needed to get the job done, Google encourages (if not expected) employees to spend a majority of their time doing things they don't currently know how to do. In effect, you are getting … paid to learn new skills, and due to the \"act now, think later\" Google mindset, it's generally okay to make mistakes as you learn. World-renowned industry experts regularly lecture at Google, giving the campus an even stronger college-like feel. And in terms of the perks, it's surprisingly nice to not have to think about packing a lunch, to be able to borrow a free car to run an errand, and to wash your stinky gym clothes after working out your frustrations in the weight room.",
        "summary": "It's like Jonestown, except without the delicious beverage",
        "role": "User Experience",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The founders often change their minds, causing teams to scramble. They don't seem to care about the damage they cause as a result.",
        "advice": "Eric, you're a truly inspiring leader. Can you help curb L & S more?",
        "pros": "The company has name recognition. Also, in engineering at least, you learn a lot about best practices. Most Googlers are pleasant and competent.",
        "summary": "It was the best of times, it was the worst of times.",
        "role": "Anonymous Employee",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The days when Google was the coolest place in the world to work are gone. Google is deteriorating at the edges. Many managers at Google got their jobs just by having low employee numbers and are otherwise unqualified. Once entrenched they tend to show little concern for their reports, concerning themselves with \"managing up\" to their own manager. Google is supposed to have a project matrix where tech leads are peers,…  not managers, but managers commonly flout this and micromanaging is endemic. Moving between projects is limited by complex procedures and is rarely attempted. In satellite offices the selection of projects to work on is limited and to make matters worse it is discouraged for engineers to work on projects not centered in their own offices. Being friends with your manager is a more effective way to get promoted than showing competence. In fact, showing too much competence or initiative is a good way to earn the ire of your manager. Performance evaluation is supposed to be by peer review but in reality, feedback from peers is ignored and only the manager's rating is taken seriously. Political infighting and character assassination are increasingly the norm at Google. Managers turn a blind eye to it, perhaps because they have found such techniques useful in developing their own careers. Google base compensation is on the low side, and is supposed to be more than made up for by incentive bonuses, but these are largely illusionary because few employees receive the necessary \"exceeds expectations\" performance evaluation. Managers at Google tend to consider themselves special people, better than engineers. Few will bother to greet or otherwise acknowledge the existence of anybody other than another manager if they pass them in the hall. Except for the weekly TGIF cross-company sessions where the founders candidly answer questions from all employees, management at Google is increasingly secretive about procedures and plans.",
        "advice": "Google engineers tend to be first rate but managed by unqualified, self-obsessed managers who were promoted into their positions just by being in the right place at the right time. This cannot possibly be optimal for Google's long term growth. Listen to all the voices trying to tell you this. Stop listening to the voices of managers telling you what a great job they are doing, because their main skill is self promoti… on. They don't care about the welfare of the company or their reports, only about themselves. From their point of view the system is working well because they are free to do as they please. The situation has already deteriorated to the point where many of the best engineers plan to leave as soon as their initial stock awards finish vesting. Google is increasingly becoming a great place to be an intern, and that is about it.",
        "pros": "You interact with great developers, original thinkers and interesting people all the time. Unlimited munchies are great, three free meals a day (or two in satellite offices) is great, medical benefits, partial subsidy of fitness membership, subsidy for ongoing education (though in reality you are unlikely to have time to use it) are all pluses. Being on the winning team feels good, especially when winning an uphill b… attle against an entrenched monopolist.",
        "summary": "Google is deteriorating at the edges",
        "role": "Senior Software Engineer",
        "date": "Jun 16, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The salary, the internal politics, the young, clueless, and arrogant MBA managers leading more experienced people and not listening to them.",
        "advice": "Hire more seasoned managers, give more experienced people the hope of promotion even if they do not have MBAs, be more aware of internal politics, fiefdom-building, backstabbing, and disrespect to non-managers, and compensate experienced people more. There is currently a huge gulf in salaries between people who have been working for a long time in one particular niche and newly minted MBAs with hardly any work experi… ence. It is insulting and demotivating to work under these conditions.",
        "pros": "The food, the smart co-workers, the overall benefits package.",
        "summary": "MBA + no experience = better than no MBA and lots of experience.",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The Test Engineering org. is separate from the core engineering org. making it very difficult for the test engineers to make any real impact. Most of the time the test engineering efforts go unrecognized by the executive management team. The Test Engineering organization is filled with a bunch of very incompetent managers who are very solely focused on advancing their own careers.",
        "advice": "Merge the test engineering organization with core engineering and scrutinize the hiring and promotion of managers and directors within test engineering.",
        "pros": "Some very smart people and good benefits. All the free food and subsidized massages are good.",
        "summary": "Google is not 'googley' anymore.",
        "role": "Test Engineer",
        "date": "Oct 25, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Senior and middle management lack vision on where to steer the group. If engineers are first-class citizens, and sales people are second-class citizens, then the folks in the datacenters are definitely the third class citizens of Google. Very immature and childish personalities. There is pretty much no growth as the career ladders are a joke. While the perks are nice, and the regular benefits are on par with most oth… er large companies, the compensation is again, a joke (almost a slap in the face). Good people leave the group and either move out of operations and into another group within the company, or leave the company altogether as they realize there is no real career to be made there. Hiring smart and talented people and giving them mundane tasks and assignments just makes no sense. There is no real innovation to be created in operations, essentially you are a worker bee to the company.",
        "advice": "Operations at Google is the same as operations anyplace else. Good people will leave for better opportunities, and the rest will likely make a career out of it because there are no alternative options. Stop making Googlers think that this is a \"bottom-up\" company, it is not. You can't change the world in operations.",
        "pros": "Google encompasses the dot com environment. The culture is very laid back. The perks such as free meals and snacks is nice, bringing my dog into the office is also nice. The work outings are good as well. And you get to work with some cutting-edge technology. There are a lot of bright people in the company that you can learn a lot from. It feels like working a summer job all year long.",
        "summary": "Great perks, but that's about it.",
        "role": "Datacenter Technician",
        "date": "Nov 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many people jammed into a cramped, noisy office space.",
        "advice": "Use the vast office space that currently sits empty to give people more space.",
        "pros": "Interesting, challenging work for something I care about.",
        "summary": "Interesting, Challenging, but Cramped",
        "role": "Site Reliability Engineer",
        "date": "Dec 17, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The top levels of management are arrogant and inattentive. They seem to very self interested and only spout pre rehearsed, scripted answers to important questions. Promotions and reviews are based on your managers mood. The management is so flat that some managers have legions of googlers rolling up into them. This makes it very hard to stand out. The perks are there to put stars in your eyes so you won't see that th… ere is very little opportunity for career advancement of nay note.",
        "advice": "Listen to you employees when they say that morale is low. Look at people that are feeling bored and unchallenged a resource, not a menace. they are often your best an brightest.",
        "pros": "They have amazing benefits and perks. The culture in some offices is very positive and fun. They allow honor system style time off for sickness as long as it is not abused. They have a large pool of talent and they look great on a resume.",
        "summary": "The perks are great, but it stops there.",
        "role": "Ad Sense Sales Manager",
        "date": "May 1, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "* Very long hours. At least where I was, people would seriously work 12-14 hours a day (out of which 90% would be \"effective hours\", churning away tons of code).* Peer reviews, while apparently treated seriously, are in fact a half joke. Your manager is your God. You fit with him/her, you're golden; you don't, you're dead meat. Most managers seem at least alright; however, I apparently got very unlucky.* Code…  reviews. I have heard many a old-time Googler complaining about the pedantry. \"Code review Nazis\" are commonplace. From discussions w/ other Googlers, it seems the transition from \"this doesn't break anything and doesn't embezzle funds\" to state-of-the-art torture has happened over the past couple years. This hurts productivity big time, and given that you're still expected to have completed a ton of work, guess what happens.. yeah, you got it: you'll leave past midnight and work from home during the weekends to barely meet expectations.* The \"transfer to any project any time you want\" is an absolute myth nowadays.Caution: from informal discussions, it seems that I really got the short end of the stick, and that in other parts of Google things are much smoother. YMMV.",
        "advice": "The company is generally headed in the right direction. However: listen to Googlers more, adjust to their needs. Google is not that magic place to work for anymore: pay better, think of the work-life balance (I mean, actually think of it, not just pretend you are).",
        "pros": "* Opportunity to work with the smartest people ever. Having collaborated (to varying degrees) with quite a few Googlers, I can certainly say Googlers are \"la creme de la creme\".* Not only they're smart, but they're dedicated 120% to their work. (The 20% is for the weekends...) \"Great is not good enough\" for each and every Googler.* Fantastic development tools (Code Search, the code review tool, the versioning…  tool, and N others);* Opportunity to work on products that will be used (directly or indirectly) by millions of people* Amazing code base, superbly structured, continuously optimized, all at your fingertips.* Free great food :-)",
        "summary": "Could be hell or heaven or anything in between.",
        "role": "Software Engineer II",
        "date": "May 5, 2009",
        "is_current": false
    }
]