[
    {
        "rating": 2,
        "cons": "One of the most \"politically\" divisive cultures you will ever work in. If you have ever dreamed of working in a company where you are rarely held accountable for anything, Google is the place to be. The 6 hour days, the inexperienced managers, the joy in reinventing the wheel, the ability to destroy a co-worker by the mere mention of being \"un-Googly\" (In the years I worked at Google I still haven't the slightest ide… a what \"Googly\" means. I never met one single right-arm leg spin bowler while I was there). The bottom line is that Google is NOT the same company it used to be and yet the myth lives on.",
        "advice": "Ditch the \"pedigree\" rubbish, no one is buying it anymore plus you are doing a diservice to a lot of these kids who have this illusion that their grades will still matter when they leave Google. They will sit down in front of their potential employer and scratch their heads trying to explain what they \"did\" while they were at Google. Experience, experience, experience............... Accountability, accountability, ac… countability........",
        "pros": "The food is outstanding. There are good people who have every right to be elitist who are not (not sure how many are left though). If you enjoy building teams and enjoy having the resources to execute on projects then Google is a good place to be. Depending upon how your options are priced Google can lead you to a rich life of spending your time commenting on Google on web sites like this.",
        "summary": "Who's in charge?",
        "role": "Decline to State",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The base salary and lack of promotion opportunities really start to wear down employee morale after the first few years. Unfortunately, there's too many glassy-eyed Google cultists/lifers who are willing to overwork themselves for a 35% (or more) paycut on projects that may not actually go anywhere. Despite claiming to seek openness, management keeps a lot of secrets-- especially around performance reviews (all emplo… yees are graded and rank-ordered, but employees don't get to know how well they fared).In terms of actual productive work, employees are demoralized by having direction constantly changed. I suppose this is known as \"keeping us on our toes.\" Further, it's tiring to hear every team say that they're acting as their own startup within Google, and that team members are going to be hand-picked to be involved in such a prestigious project. It's not uncommon for entire teams to be uprooted or replaced in one fell swoop. Put together, this leads to an uneasy feeling about one's job stability.One final problem: too many Googlers are young, inexperienced, and short-sighted in their understanding of how much power they actually have in developing public-facing products. They don't understand the implications of their actions, and move too quickly to consider them.",
        "advice": "Give employees a reason to stay at Google. Those underwater stock options sure aren't cutting it.",
        "pros": "It's a very convenient place to work-- not only are the on-site perks helpful, but employees have plenty of opportunities to learn. Unlike many companies, where employee productivity is dependent already having a certain set of skills needed to get the job done, Google encourages (if not expected) employees to spend a majority of their time doing things they don't currently know how to do. In effect, you are getting … paid to learn new skills, and due to the \"act now, think later\" Google mindset, it's generally okay to make mistakes as you learn. World-renowned industry experts regularly lecture at Google, giving the campus an even stronger college-like feel. And in terms of the perks, it's surprisingly nice to not have to think about packing a lunch, to be able to borrow a free car to run an errand, and to wash your stinky gym clothes after working out your frustrations in the weight room.",
        "summary": "It's like Jonestown, except without the delicious beverage",
        "role": "User Experience",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The founders often change their minds, causing teams to scramble. They don't seem to care about the damage they cause as a result.",
        "advice": "Eric, you're a truly inspiring leader. Can you help curb L & S more?",
        "pros": "The company has name recognition. Also, in engineering at least, you learn a lot about best practices. Most Googlers are pleasant and competent.",
        "summary": "It was the best of times, it was the worst of times.",
        "role": "Anonymous Employee",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The days when Google was the coolest place in the world to work are gone. Google is deteriorating at the edges. Many managers at Google got their jobs just by having low employee numbers and are otherwise unqualified. Once entrenched they tend to show little concern for their reports, concerning themselves with \"managing up\" to their own manager. Google is supposed to have a project matrix where tech leads are peers,…  not managers, but managers commonly flout this and micromanaging is endemic. Moving between projects is limited by complex procedures and is rarely attempted. In satellite offices the selection of projects to work on is limited and to make matters worse it is discouraged for engineers to work on projects not centered in their own offices. Being friends with your manager is a more effective way to get promoted than showing competence. In fact, showing too much competence or initiative is a good way to earn the ire of your manager. Performance evaluation is supposed to be by peer review but in reality, feedback from peers is ignored and only the manager's rating is taken seriously. Political infighting and character assassination are increasingly the norm at Google. Managers turn a blind eye to it, perhaps because they have found such techniques useful in developing their own careers. Google base compensation is on the low side, and is supposed to be more than made up for by incentive bonuses, but these are largely illusionary because few employees receive the necessary \"exceeds expectations\" performance evaluation. Managers at Google tend to consider themselves special people, better than engineers. Few will bother to greet or otherwise acknowledge the existence of anybody other than another manager if they pass them in the hall. Except for the weekly TGIF cross-company sessions where the founders candidly answer questions from all employees, management at Google is increasingly secretive about procedures and plans.",
        "advice": "Google engineers tend to be first rate but managed by unqualified, self-obsessed managers who were promoted into their positions just by being in the right place at the right time. This cannot possibly be optimal for Google's long term growth. Listen to all the voices trying to tell you this. Stop listening to the voices of managers telling you what a great job they are doing, because their main skill is self promoti… on. They don't care about the welfare of the company or their reports, only about themselves. From their point of view the system is working well because they are free to do as they please. The situation has already deteriorated to the point where many of the best engineers plan to leave as soon as their initial stock awards finish vesting. Google is increasingly becoming a great place to be an intern, and that is about it.",
        "pros": "You interact with great developers, original thinkers and interesting people all the time. Unlimited munchies are great, three free meals a day (or two in satellite offices) is great, medical benefits, partial subsidy of fitness membership, subsidy for ongoing education (though in reality you are unlikely to have time to use it) are all pluses. Being on the winning team feels good, especially when winning an uphill b… attle against an entrenched monopolist.",
        "summary": "Google is deteriorating at the edges",
        "role": "Senior Software Engineer",
        "date": "Jun 16, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The salary, the internal politics, the young, clueless, and arrogant MBA managers leading more experienced people and not listening to them.",
        "advice": "Hire more seasoned managers, give more experienced people the hope of promotion even if they do not have MBAs, be more aware of internal politics, fiefdom-building, backstabbing, and disrespect to non-managers, and compensate experienced people more. There is currently a huge gulf in salaries between people who have been working for a long time in one particular niche and newly minted MBAs with hardly any work experi… ence. It is insulting and demotivating to work under these conditions.",
        "pros": "The food, the smart co-workers, the overall benefits package.",
        "summary": "MBA + no experience = better than no MBA and lots of experience.",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The Test Engineering org. is separate from the core engineering org. making it very difficult for the test engineers to make any real impact. Most of the time the test engineering efforts go unrecognized by the executive management team. The Test Engineering organization is filled with a bunch of very incompetent managers who are very solely focused on advancing their own careers.",
        "advice": "Merge the test engineering organization with core engineering and scrutinize the hiring and promotion of managers and directors within test engineering.",
        "pros": "Some very smart people and good benefits. All the free food and subsidized massages are good.",
        "summary": "Google is not 'googley' anymore.",
        "role": "Test Engineer",
        "date": "Oct 25, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Senior and middle management lack vision on where to steer the group. If engineers are first-class citizens, and sales people are second-class citizens, then the folks in the datacenters are definitely the third class citizens of Google. Very immature and childish personalities. There is pretty much no growth as the career ladders are a joke. While the perks are nice, and the regular benefits are on par with most oth… er large companies, the compensation is again, a joke (almost a slap in the face). Good people leave the group and either move out of operations and into another group within the company, or leave the company altogether as they realize there is no real career to be made there. Hiring smart and talented people and giving them mundane tasks and assignments just makes no sense. There is no real innovation to be created in operations, essentially you are a worker bee to the company.",
        "advice": "Operations at Google is the same as operations anyplace else. Good people will leave for better opportunities, and the rest will likely make a career out of it because there are no alternative options. Stop making Googlers think that this is a \"bottom-up\" company, it is not. You can't change the world in operations.",
        "pros": "Google encompasses the dot com environment. The culture is very laid back. The perks such as free meals and snacks is nice, bringing my dog into the office is also nice. The work outings are good as well. And you get to work with some cutting-edge technology. There are a lot of bright people in the company that you can learn a lot from. It feels like working a summer job all year long.",
        "summary": "Great perks, but that's about it.",
        "role": "Datacenter Technician",
        "date": "Nov 11, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many people jammed into a cramped, noisy office space.",
        "advice": "Use the vast office space that currently sits empty to give people more space.",
        "pros": "Interesting, challenging work for something I care about.",
        "summary": "Interesting, Challenging, but Cramped",
        "role": "Site Reliability Engineer",
        "date": "Dec 17, 2008",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The top levels of management are arrogant and inattentive. They seem to very self interested and only spout pre rehearsed, scripted answers to important questions. Promotions and reviews are based on your managers mood. The management is so flat that some managers have legions of googlers rolling up into them. This makes it very hard to stand out. The perks are there to put stars in your eyes so you won't see that th… ere is very little opportunity for career advancement of nay note.",
        "advice": "Listen to you employees when they say that morale is low. Look at people that are feeling bored and unchallenged a resource, not a menace. they are often your best an brightest.",
        "pros": "They have amazing benefits and perks. The culture in some offices is very positive and fun. They allow honor system style time off for sickness as long as it is not abused. They have a large pool of talent and they look great on a resume.",
        "summary": "The perks are great, but it stops there.",
        "role": "Ad Sense Sales Manager",
        "date": "May 1, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "* Very long hours. At least where I was, people would seriously work 12-14 hours a day (out of which 90% would be \"effective hours\", churning away tons of code).* Peer reviews, while apparently treated seriously, are in fact a half joke. Your manager is your God. You fit with him/her, you're golden; you don't, you're dead meat. Most managers seem at least alright; however, I apparently got very unlucky.* Code…  reviews. I have heard many a old-time Googler complaining about the pedantry. \"Code review Nazis\" are commonplace. From discussions w/ other Googlers, it seems the transition from \"this doesn't break anything and doesn't embezzle funds\" to state-of-the-art torture has happened over the past couple years. This hurts productivity big time, and given that you're still expected to have completed a ton of work, guess what happens.. yeah, you got it: you'll leave past midnight and work from home during the weekends to barely meet expectations.* The \"transfer to any project any time you want\" is an absolute myth nowadays.Caution: from informal discussions, it seems that I really got the short end of the stick, and that in other parts of Google things are much smoother. YMMV.",
        "advice": "The company is generally headed in the right direction. However: listen to Googlers more, adjust to their needs. Google is not that magic place to work for anymore: pay better, think of the work-life balance (I mean, actually think of it, not just pretend you are).",
        "pros": "* Opportunity to work with the smartest people ever. Having collaborated (to varying degrees) with quite a few Googlers, I can certainly say Googlers are \"la creme de la creme\".* Not only they're smart, but they're dedicated 120% to their work. (The 20% is for the weekends...) \"Great is not good enough\" for each and every Googler.* Fantastic development tools (Code Search, the code review tool, the versioning…  tool, and N others);* Opportunity to work on products that will be used (directly or indirectly) by millions of people* Amazing code base, superbly structured, continuously optimized, all at your fingertips.* Free great food :-)",
        "summary": "Could be hell or heaven or anything in between.",
        "role": "Software Engineer II",
        "date": "May 5, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Although promotions are said to be fair, it is all how you game the system and play the game. Don't expect to be put on amazing projects, those are for the super elite. There is a 3-4 year exit strategy here, and lately it seems its shortened to 1 to 2 years. New employees come in and realize this place isn't all that it's cracked up to be.",
        "advice": "Just because someone is highly technical, doesn't mean they can make a good manager. Those managers are destined to fail.",
        "pros": "Good perks. There's a lot of smart people that work here. If you're a geek like me, then you've found your home.",
        "summary": "Incompetent Management",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Everyone's had the kool-aide! They are having growing pains, too. It is a terrible place to start a career, many would say.",
        "advice": "I would say grow up.",
        "pros": "The swag, food, and pride of working for a profitable company are definitely worth the problems that the company faces.",
        "summary": "Growing Pains",
        "role": "Anonymous Employee",
        "date": "Aug 4, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You will face Software Engineering like interviews. They will test your ability to code and be excellent at algorithms and will be given utterly shitty jobYou will regret joining the company unless you are a fresh graduate student who likes to be pamperedPay is shitty as well except few lucky testers who get placed in \"high profile\" or \"high demand\" projectsYou will feel like a slaveThere is no gettin… g out of it easilyI have a degree from one of the top schools and I am already regretting joining google",
        "advice": "provide more opportunities to test engineers and engineers in testthey have ambitions too",
        "pros": "You will interact with one of the most brilliant computer science workersFree food, free beer, shuttles, opportunity to shake hands with Obama and all the glitz.Sunny state, beautiful campus, I even do my laundry there some days",
        "summary": "Do not ever join Google as Software Engineer in Test",
        "role": "Software Engineer In Test",
        "date": "Oct 23, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Reorgs every 6 months regardless of departmental needs.Getting promoted on merit is near impossible.Zombie projects are the norm.Lots of people trying to steal your ideas and backstab you for advancement opportunities.",
        "advice": "Engineering is out of control. Too many duplicated projects. Quality is not rewarded, only things that ship.",
        "pros": "*Perks*Brand Name on CV*Has long-term potential if it can become a real company and not a startup anymore*Some really smart people can be found",
        "summary": "constant restructuring",
        "role": "Project Manager",
        "date": "Nov 1, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "too many good management places taken by old per-2003 guys, no way to move over them even if you are extraordinary, little personal freedom to work on your own idea (it was the other way around 4 years ago), too much protocol,",
        "advice": "give more freedom to people, listen to engineer, people who are bellow are not stupid, you did too many mistakes because you do not listen to your people",
        "pros": "Many smart people, very challenging problems, good perks, excellent benefits, very good free food, good cash bonuses and engineering ladder promotions for personal achievements",
        "summary": "Too much hype, too little real value",
        "role": "Staff Software Engineer",
        "date": "Jan 14, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-Biggest problem at Google = poor managers who lack leadership skills. My manager never once created an annual or quarterly strategic business plan. He (actually *I*) filled in the template given by management, but he never created a plan we could work toward. As a result, people did what they wanted, which was not always most profitable (in part because short term incentives don't align with long term profitability)… . This created a lot of problems. In 2007, the company created a new layer of middle-manager jobs and hired people internally...without training them to be managers! Disaster. Lots of inefficiency and broken promises. Horrible decision that continues to plague employees. There are some good managers, I just didn't work with any.-No career development. Minimal worthwhile training. You can take a course here and there, but when it comes to moving around the company, watch out. Sales, Engineering, and Enterprise are silos---you can't move between them. *Everyone* complains about this. Smart people have for years been talking about leaving.-They fired most of HR in 2009 (the others have always been contract workers without benefits); what remains of HR is really weak. HR is never helpful anyway.-No one \"owns\" decisions (not even managers or their managers!), but everyone gets a say...so few risks get taken and greatness rarely evolves beyond the idea stage-There's a lot of mediocrity; why improve when improvement might require you or teammates to work a little smarter or harder? Lots of resistance to change that requires more work.-Flat organization is bad for people whose work shows skill beyond job level / area & typical promotion cycles (senior management encouraged national sales team to think of lateral moves as promotions...even though you don't make more money, get better titles--and then must start the promotion journey afresh as if you had never worked there before)-Salary. When Google offered me the job, a well-known, respected web property with a similar job did as well. The latter offered me TWICE as much money as Google. Twice! And all the good benefits.-Salary increases over time. When you're promoted, you don't make all that much more. Bonuses are small (and taxed at 50%). Options are not worth as much as you think. And you don't get as much stock as you think, either. (These are taxed at 50%, too, so you don't really get very much!)All of this relates to the non-engineering side. I always really liked the engineers and when I worked with their projects found great synergies. Unfortunate the sales side made it so hard to move over!",
        "advice": "Teams need better direction. Many managers are very poor leaders who don't make decisions or set clear goals or make teammates accountable to those goals. Just letting everyone do their own thing is a problem...especially when multiple positions have to support multiple people whose own agendas create conflicts of interest (and inefficiencies and tension). You need to give stars more opportunity to grow; they need mo… re than just new projects. You need to actually develop these people. You know that salespeople are not the only stars or potential future leaders. You need to reward and grow more than just the salespeople. Because, let's be honest, many of the salespeople are not the ones growing the revenue. They get the credit, but in the end you lose some of the people most responsible. And they feel resentful and undervalued.",
        "pros": "-Great food-Internal transparency when it comes to what projects are being worked on (not transparent on things like promotions)-Lots of stuff going on-Always changing-Fun people-Great location in NYC-Speakers and authors visit Google--great perk!-Concierge team helps arrange discounts, etc.-In-house massage (I will miss that!)-Good for the resume-Great place to meet future sta… rt-up partners. Cool techie environment. Learn the latest and greatest in the tech world as it develops.",
        "summary": "When No One \"Owns\" Decisions and Managers Fail to Lead, It's Easy for People to Coast",
        "role": "Non-engineer",
        "date": "Feb 5, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The promotion structure is problematic. How you do in your core job is very undervalued in determining promotions. You can be amazing at the main part of your job, but what's prized are all the extra little projects. You'd be better of neglecting your main job to take on 5 little side projects. They also tend to hire way too many people for management positions from outside rather than promoting from within. This mea… ns that it's almost impossible to get ahead.",
        "advice": "Promote from within.",
        "pros": "The benefits are nice, though less extravagant in offices that don't have engineers. The people are for the most part bright, friendly, and really willing to help each other. The work is interesting and rarely boring.",
        "summary": "Decent place to work, could be better",
        "role": "AdWords",
        "date": "Feb 18, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many people full of themselves, extremely flat company structure with little or no promotion opportunities, depending on the department/product you are working on.",
        "advice": "Try to keep the good people",
        "pros": "Perks, benefits, good name to have on your resume, exposure to cool tech.",
        "summary": "Doubleclick Rich Media services - NY",
        "role": "Strategist, Rich Media Technical Services",
        "date": "May 24, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "contractors are treated with disrespect. the company makes it unclear what is needed in order to transition from a contractor to a full time employee. contractors are left in the dark.",
        "advice": "treat contractors with more trust and be more straightforward in regards to what is required to become full time.",
        "pros": "free breakfast lunch, dinner, gym membership, social events, and shuttle to worksmart and interesting co workersgood name recognition",
        "summary": "Contractors are not treated with respect",
        "role": "Anonymous Employee",
        "date": "Jun 4, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- managers detached, not aligned with team goals, focus on networking and their next job- chaotic, siloed organization, lots of inefficiency- sales organization is afterthought, mostly exists to patch up bad adwords user experience - so you're there to fix a problem nobody wants to admits exists. not a great career track!- i had two young MBAs as managers who both left me baffled as to what it is they did… , or knew how to do. both were promoted! one sat me down in a 1:1 and told me to focus on my family and private life more, because caring too much about my job would only lead to problems because most of the issues in our department were not going to be fixed, and that's not really how you advance in your career anyway. it was good advice and all true, but it tells you something that this is what my soon-to-be-promoted boss told me.- lots of activity that has nothing to do with the company's products or business goals: events, parties, dance classes, on-campus organizations, etc. it's a lot like college that way. it's possible to spend A LOT of your time on tangential activities, keep getting good performance reviews (because the diversity festival or whatever is so great for google), and just hang out and make money and never impact the business. To me, this is really weird and not a plus, but a lot of people of course love it.- I left because basically I realized that if what I had achieved in the last year did not get me a promotion (major overhaul of one aspect of the business), nothing ever would. promotions aren't really about business impact at Google, they are about NOT having too much of an impact and rocking the boat. Having a dog helps a lot.",
        "advice": "There's no reason to change anything as long as this much money is being made with the one revenue stream. I expect a big cleanup will take place one that's no longer the case.",
        "pros": "- great benefits and 401K match- great food- half-naked cuties play beach volleyball on campus- really intelligent coworkers- fascinating industry and company profile",
        "summary": "Cushy dead end",
        "role": "Sales",
        "date": "Jun 14, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No career development / ladder / useful feedback. If you're not Eng, you're nothing.FAIR WARNING: When you realize there is more to a career than free food and you start to apply with other companies you will most likely be asked if you know how to behave yourself / act like an adult / perform in a traditional office environment.",
        "advice": "You can't hire top tier college attending, 4.0 earning, type A, OCD personalities then expect them to do menial work. Contract it out, or recognize that there are plenty of people in this world who would be THRILLED to do said menial tasks, and get rid of the ridiculous hiring requirements for those positions.",
        "pros": "All of the things you've already read about: Food, Dogs, 401k.Looks great on a resume: When you're ready to move on in your career, having Google on your resume in any context almost guarantees an initial interview just because folks are curious about Google and why you would ever want to leave.",
        "summary": "Dead end, But the perks disguise that fact nicely...for a few years",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You might get allocated to a position that is below or mismatched with your skills. Since the majority of their software engineers are PhD's, there are many PhD's doing things you don't need a PhD for -- \"flipping burgers\". Less opportunity for career advancement; managers tend to get hired externally rather than promoted internally.",
        "advice": "Consider people's skills, background, and interests, when allocating them. The free food and toys and general awesomeness of work environment eventually don't outweigh dissatisfaction with actual job tasks.",
        "pros": "Great work environment, smart people, unlimited toys and food. Freedom, no nickle-and-dime mentality. Additionally, the word \"Google\" looks REALLY GOOD on a resume.",
        "summary": "Awesome work environment for flipping burgers",
        "role": "Software Engineer",
        "date": "Aug 23, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "the hours were really inflexible and sometimes it was hard to get time off. the working conditions weren't very ideal either.",
        "advice": "google should have better hours instead of three set shifts and they should also offer temps free meals too to compensate for the labor requirements.",
        "pros": "i worked as a temp position for google and the only good thing was that the hours were consistent and the pay was decent.",
        "summary": "not a very good place to work",
        "role": "Anonymous Employee",
        "date": "Aug 31, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Google management is pretty bad. Many cool innovative ideas from engineers were \"killed\" by managers because they were unable to understand their importance. Projects similar to facebook and yelp were made in google long time ago and they did not start and succeed because of management failure. Top management never understood importance of social and local until very recent time.Promotion system is really bad. I … was glad to get my promotions but many people are very unhappy. There is no fair system to evaluate quality and amount of your results. Basically, everything depends on your manager, he likes you, you are doing very well, he dislikes you, you are in hell.Recent privacy scandals were very embarrassing for many employees. I did not expect my company to intercept wi-fi traffic.",
        "advice": "Start respecting your employees and listening to them.Start respecting privacy laws, so your employees will respect you and your policies",
        "pros": "Google is the best place to start for a fresh graduate.You can learn a lot here. I loved working on mapreduce infrastructure, the google implementation is years ahead of any implementation (hadoop etc) and learned a lot.It was incredibly easy to find a job after I left Google, my experience was valued very much by other companies.Until very recent times Google was the best place to work on new innovative … projects in any area from information retrieval and natural language processing to large scale distributed system. The infrastructure of datacenters is very impressive, very few companies can give you similar resources.It's up to employee to decide how much time he spends in his office and how much time he works from home.Food is free and many other benefits are available.",
        "summary": "Good place to start, but do not stay there for a long",
        "role": "Stff Software Engineer",
        "date": "Dec 14, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "unfair/ slow promotions process (if you manager really likes you you get promoted, if they sort of like you you're in purgatorium forever, if they don't you're managed out). boring work. red tape. all big company problems and more. many products competing with each other or duplicating effort. chaos in communication between teams. bureaucracy in order to get simple stuff fone. Disrespect for non-eng functions. declin… ing quality of hires.",
        "advice": "FIx all the above problems!!",
        "pros": "delicious food, massages, TGIF/ other nice events, generally smart people (but also many are total weirdos), many engineers truly passionate about products",
        "summary": "unfair, boring place (at least outside of engineering)",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2011",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Your time at Google is entirely dependent on the capabilities of your manager.I worked in MTV for 4.5 years and I've never been at a place with more inconsistent quality of managers. I reported to 6 managers during my time. A few were great, but others were horrifyingly bad. Had enough with my last manager, who was self serving and not well liked by his group, yet the company did NOTHING to remove him. Decide… d to chart my own course by joining a startup that was more human focused. Have not regretted my decision whatsoever. Much happier now. Too many Google managers are often the victim of their own hubris + lack of real world experience.In 2005, Google was a place where you could change things and make decisions quickly. Now, it is a place to be a cog in a giant profit machine.",
        "advice": "Stop hiring people based on metrics like academic pedigree and grade point average. Focus on human skills and leadership ability. Proactively address cases of poor middle management rather than sticking your head in the sand.",
        "pros": "Perks, food, successful company, some cool products, resume builder",
        "summary": "Inconsistent managers plague Google",
        "role": "Engineering and Sales",
        "date": "Jun 2, 2011",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You never have a career path.You'll need months to figure out how to grad an easy number through the legacy system, needless to mention about the reviews, permissions etc.",
        "advice": "Learn from microsoft, cuz you are the microsoft of 2000 now.",
        "pros": "Good fameGood moneyFree food/shuttle etc",
        "summary": "Waste your life here",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2011",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "no room to really advance. You're just a number.",
        "advice": "Listen to your employees!!! Don't be a Hi.P.P.O",
        "pros": "the perks working here are very enticing",
        "summary": "Overrated!!!",
        "role": "Inside Sales Representative",
        "date": "Oct 12, 2011",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "For more senior people, odds are, you're going to be waiting a long time for any kind of promotion. You will also be way older than most of the people you work with, and your manager may or may not understand family commitments. (Google in general does.)Your manager may or may not care about you. If you get a good manager, great. If you get a lousy one, it may or may not get fixed in any reasonable amount of … time, and it can be hard to transfer out if you're having any difficulty with your manager. I had the worst manager of my 30 year career there, and should have just quit after I figured that out.",
        "advice": "Emulating the secrecy, siloing and hierarchy of Apple will not result in Google being as good at focus and product as Apple.Google needs to encourage lightweight experimentation (in a way that 20% time doesn't really do, since it's often \"120% time\"). Once there are a bunch of organizations who all want to prevent you from launching quickly and easily, innovation suffers.Even line engineers, TLMs, and…  lower level managers are not in fact interchangeable, and the company (or at least the Sales organization) shouldn't re-org every few months.People get promotions based on politics and who sucks up to whom, not based on merit.",
        "pros": "In the right Eng group, young engineers will learn a lot. The food is good. The bicycles are handy.",
        "summary": "It's becoming a place where most people are treated like servers -- interchangeable and replaceable.",
        "role": "Senior Manager",
        "date": "Nov 11, 2011",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "To thrive at Google as a software engineer, at least a Masters degree in computer science or equivalent course of study is needed. A Google employee without a masters degree or Phd will not see the same opportunities for advancement or career development. Some of the technologies used at Google are proprietary, so skills developed in those technologies are not relevant at other tech companies.",
        "advice": null,
        "pros": "Perks are second to none. Google provides every employee with free food freshly prepared on site each day by professional chefs. Google also provides free transportation to / from work from many areas where employees live. Google also has health care facilities on-site so that employees don't have to spend time driving to the doctor. Google employees can also pay to have their hair cut, get their oil changed, get the… ir dry cleaning done, even get their bicycle repaired all on-site.",
        "summary": "I joined Google to innovate and change the world, but found such opportunities to be out of reach.",
        "role": "Software Engineer III",
        "date": "Jan 21, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It became way too political, specially with upper management completely lost its way and lacking a vision.",
        "advice": "Listen to people who are good at their jobs and delivering results rather than random 'group' managers and directors.",
        "pros": "Started and worked on amazing products, which turned out to be highly successful.",
        "summary": "Great Product, Lousy Management",
        "role": "Product Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Google has become just another big software company (like Microsoft or Amazon).The Kirkland office feels like Microsoft or Amazon depending on where your Google Director originally was recruited from.",
        "advice": "Stop pretending that you're going to make the company feel just like a startup.Share more of your outrageous revenue.",
        "pros": "Many interesting office locations, you can be a software engineer in Paris, Sydney, New York City, or elsewhere.Good Benefits.Reasonable compensation.",
        "summary": "Google has become just another big software company.",
        "role": "Software Engineer",
        "date": "Mar 22, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Unless you are a superstar individual and knows how to socialize with other super star, the upside for career advancement is not too promising.",
        "advice": "Replace Larry Page with Bill Gates",
        "pros": "Lots of smart people, and great benefits",
        "summary": "A chaotic place",
        "role": "Software Engineer II",
        "date": "Apr 3, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Finance is a 2nd class function (at best) and in general has very limited power within the organization. This can make it difficult to make a difference or even be heard outside of the org. Often, those who succeed in finance are those that can please their business partners in Engineering/Product which can cause incredible conflicts of interest (sure, that acquisition looks fabulous and it's only $100M! I can make a… n analysis that makes it look great ) - even if not explicit the pressure to please powerful VPs in Eng is intense. This is compounded by the hyper-reliance on 360 feedback and networking which means it can be hard to make a change or stand up if something seems wrong.Finance is primarily full of investment bankers & consultants, with little folks with actual Corp Finance experience. This causes an amazing amount of inefficiency as folks don't understand how to do basic things like create a budget and expect people to stick to it (seriously - within weeks of budget creation no one knows if budget applies anymore or if we're moving to a monthly forecast view instead). At first, I tried very hard to get more Corp Finance folks in the org but now I actually think IBankers do best as folks with actual CF experience tend to be so shocked by the Google processes (or lack thereof) they simply cannot hang.Work/life balance is dreadful - since the employee base is generally young and former bankers, most folks don't seem to be upset by late nights stretching past midnight but for those with families (or even those that just enjoy their lives outside of work) this can be painful. Especially since most of the time is spent on projects that go nowhere.Google elects not to use ERP or other established software in favor of developing their own solutions. Then they don't staff these solutions with adequate Eng resources. Result is an incredible lack of data availability with the expectation that finance be \"scrappy\" to find ways to tease out or completely guess at the data. Upside is that without a data source no one's likely to know if you're completely off base - but this can be unsettling for folks who really want to use reliable info to make business decisions.There are constant reorgs and reprioritizations at Google - particularly if you don't support the Search / Ads business. Forget about focusing on anything that will take more than 1 Q to achieve.This is a social/extroverted environment which means that those who are good at networking have an edge over those who don't, even if the folks who don't are doing a superior job. I've taken advantage of it myself but it's not fair.",
        "advice": null,
        "pros": "Absolutely incredible pay + benefits - I'm making more than I ever imagined - #1 reason I haven't leftFlexible work environment - not tied to a desk all day - can go outside/work at a Google Cafe, etc.Lack of structure means can define own job & execute on what you think is importantResume builder - Google looks great on your resume",
        "summary": "Doing hard time - but paid well for it!",
        "role": "Senior Finance Manager",
        "date": "Aug 29, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Flexibility and openness have taken a nose dive as the company became larger and more compartmentalized.No one wants you to work on \"the world's most interesting problems\" no matter what their employment ads say.20% time has become a myth. No one wants you working on their projects, or on your own.",
        "advice": "Stop dividing the company, hiding behind locked doors, and touting opportunities which no longer exist",
        "pros": "Good Compensation and Benefits. Most peers were a pleasure to work with.",
        "summary": "It's not you're older brother's Google anymore",
        "role": "Software Engineer IV",
        "date": "Oct 2, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Blind allocation: Your initial assignment may have nothing to do with your interests or experience, and policy is that you must stay in that assignment for 18 months before you can transfer (though there are exceptions). Google's success makes it difficult to criticize; \"How can we be doing it wrong if we're making this much money?\"",
        "advice": "Get rid of blind allocation.",
        "pros": "You have awesome, competent coworkers. The challenges are huge and you have unique opportunities that are only available at Google. The compensation and benefits are excellent.",
        "summary": "Frustrating, bureaucratic, impersonal",
        "role": "Software Engineer",
        "date": "Dec 10, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very flat organization, limited opportunities outside engineering and sales. Sales office becoming more and more faceless -- not at all Googley. Long term client relationships sacrifices for short-term quota gains.",
        "advice": null,
        "pros": "Corporate culture is excellent, great benefits and perks",
        "summary": "Too many chiefs, not enough braves",
        "role": "Anonymous Employee",
        "date": "Jan 17, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "everything was fine with work",
        "advice": "nothing",
        "pros": "best job in this place",
        "summary": "questions",
        "role": "Anonymous Employee",
        "date": "Jan 21, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "My team's management is incompetent and strives to build walls between employees and contractors. They suffer from a lack of transparency, a lack of understanding about the specific work that we do, and poor communication skills. The end result is that an entire group of dedicated contractors now harbors a distrust and a dislike for Google.",
        "advice": "Fire my team managers. They're a waste of money.",
        "pros": "Google treats it's contractors fairly well, giving them paid holidays (after 520 hours of work), access to the free food and the gyms, along with other great perks. It also fosters a creative, collaborative atmosphere and strives to give employees ownership over tasks and room to learn and grow in their careers.",
        "summary": "This is a great company to work for, unless you work for my manager.",
        "role": "Contract Attorney",
        "date": "Jan 25, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Inability to significantly grow accounts/make money, micro-management",
        "advice": null,
        "pros": "All of the amenities are great.",
        "summary": "Experienced Salespeople Need Not Apply",
        "role": "LCS AE",
        "date": "Feb 4, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Disclaimer: Google is the most decentralized company I've worked for in the degree to which different groups and projects have their own work intensity, culture, ambitiousness, manager quality, etc. A lot of people I know love working here, feel they are working on interesting/important projects, and are full of respect for their colleagues and leadership.My experience, unfortunately, has been almost entirely…  negative:- problems start with the hiring process because they put up vaguely described job openings, don't tell you almost anything about what you'll be working on during the interview, and then don't make any attempt to match you to projects you might care about or have experience with. The implied message is - you made it to Google, so you're smart enough to learn new technology, languages, and skills as needed, and we give you so much that you should be happy working on anything.After working here for several months, my impression was:- self-satisfaction, detachment/cluelessness/apathy and arrogance are prevalent including at the very top.- too many of the company's core slogans frequently don't reflect reality:    - treating employees with respect - actually condescension disguised as benevolence    - caring about users - actually often dismissing them as a nuisance or too stupid to use the product correctly.    - setting goals that are so ambitious that you fail on some - actually often failing on un-ambitious goals for non-respectable reasons    - openness in communicating with employees - actually, most communications end up being empty hype and ass-kissing.    - maximise efficiency and productivity - actually, even simple web front ends requires constant battle against unrelated problems with unreasonably slow or broken internal APIs, overly slow build/test/deploy tools, lack of documentation for how to use internal systems, etc.     - fast-paced entrepreneurial culture - actually, for too many people, the main objective is to look good and score points with their manager - this is true all the way up to the VPs that report to Larry     - hire the best people - almost everybody here is really smart, but the culture often brings out the worst most unprofessional side of people      - taking risks and changing the world - level of risk I see people taking is changing the location of a UI button on an internal tool without talking to the product manager first",
        "advice": "From what I saw while working on internal tools, it seems for too many managers, their highest aspiration is to keep employees occupied and to avoid looking bad in front of superiors. Other things besides this don't matter as much - not even user complaints (unless/until superiors start caring). Put another way, I was disappointed by the lack of idealism and purpose, by the excessive careerism and politics and by the…  us vs. them mentality between different engineering groups and between engineers and users.",
        "pros": "In my experience, Google is an awesome place to work if:- you get intrinsic enjoyment from writing code - even when asked to spend months coding something for reasons that are unclear or less than inspiring (like lack of planning, inter-group politics, inertia, etc.)- you like reading code, doing code reviews, and having access to the entire source code of most google products.- you plan to work here for … at least several years and like the idea of spending your first 3 to 6 months getting familiar with the large number of google-only systems, tools, libraries and coding practices that must be known even before doing small internal projects - even though this knowledge will be mostly irrelevant outside of google.- if forced to choose, you would prefer a high salary, incredible benefits and job stability more than working on projects you care about.There are relatively few Pros that survived my first 2 months here and that I'll miss when I leave. These are:- you are surrounded by smart, interesting people many of whom are new to the area and looking to make friends.- some really awesome internally-built tools for writing code, doing code reviews, building dashboards, etc.",
        "summary": "Meaningless work, hypocrisy, politics, bureaucracy, great pay and benefits.",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Food didn't taste that great- Long hours- Shuttles crowded- Good luck finding those smart people- Good luck getting 20% time- No freedom to move around to new teams, promotions difficult- Many employees were extremely weird, even for me- Dreary, depressing campus where everyone seemed unhappy and worried about being seen as stupid. Literally, the place was filled with insecur… e people that took every opportunity to make themselves feel smarter than everyone.I was singled out and harassed everyday for reasons unknown to me. I was followed around, and whenever I tried to work my co-workers would comment on the code I was writing as I wrote it (or whatever else would throw me off and prevent me from being able to concentrate). They also took workplace monitoring to a new extreme, because it seemed as though everyone around me could access my computer, see what I was doing, and cause my computer to lock up.I was constantly pushed to interact with my co-workers and to ask questions, but each question asked was met with a non-answer and a dismissive attitude as though they were worried I'd use the answer to show them up.At the end of the day it was just a job as the culture was not as advertised.",
        "advice": "Facebook, though fading recently, has implemented your advertised culture better than you.",
        "pros": "- Free food- Shuttles- Smart people- Flexible hours- 20% time",
        "summary": "Harassed on the job",
        "role": "Software Engineer III",
        "date": "May 24, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The interviews are really bad for the applicant: you learn nothing from what you will be doing and are interviewed only by people from completely different areas of expertise than yours.If you decide to come here, expect to have 5-6 layers of management above you. Unless your are a big shot or manage to get a strong ally, you often get the promise of leading some significant project, only to be exchanged without … notice with more \"experienced\" people.Only a minority of engineers get to do the interesting stuff: Google+, Knowledge Graph, etc. If you are part of the other 99%, things are less exciting and the lower your rank is, the less freedom you have.",
        "advice": null,
        "pros": "Benefits are good.Shuttle transportation can be useful for many people.Occasionally there are interesting talks (but conference rooms are often way too tiny.)",
        "summary": "Very hard to land on projects that benefit your career.",
        "role": "Software Engineer",
        "date": "Jul 24, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Everything else. The offices are placed in the cities. Horrible commute, non-stop parking troubles. The offices themselves are horrible, very densely packed. It's the only place I've seen that has more densely packed offices than the banks. When you sign up, you don't get to know, what group you'll be assigned too. The job itself is incredibly stupid, you're guaranteed to be vastly overqualified for it. The smugness … level is amazing, the smug is so thick you can cut it with a knife. There are worse places to work (i.e. banks) but for the technical companies it's a deeply substandard one. No wonder that the people who stay there for a long time are mostly the new grads, who haven't seen anything better.",
        "advice": "open some offices in the decent suburb locations, and make the offices less horrible",
        "pros": "One word: money. The compensation, including the stock, is very good, and there aren't many other places that pay so well. The benefits are OK too but you need to be careful: for example, they have good insurance policies but by default they push you towards the bad ones.",
        "summary": "Horrible but not quite as bad as financial companies",
        "role": "Anonymous Employee",
        "date": "Aug 5, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Entertainment?? Really? ? There isn't any time to take advantage of all the Entertainment mentioned above unless you sacrifice your lunch break or one of the 15 minute morning & afternoon breaks. Sacrifice resting after doing my job??? NO WAY!! See below-- With the amount of sweat and bodily exertion; when lunch comes around, it's all you can do in your 1 hour lunch to eat, drink, and down 2 more Gatorades … to keep hydrated! I'm in great shape, but the jobs performed by Operations Associates and Engineers such as myself, require extreme physical exertion in order to keep up. My hands are no longer hands, but machines in need of desperate repair. I have callouses so thick that I cannot feel my fingertips. My hands ache terribly each day and are so mangled it feels like I have an extreme case of rheumatoid arthritis or perhaps I do from all the manual labor!- HOT!! The Data Center is kept at a temperature so hot, about 30 minutes into working, I am wanting to take a break to grab some Vitamin Water or any water for that matter. There are no water fountains and there is only one area which is typically far away in which employees are able to store water that must be in a CamelBack thermos. Every work area is extremely hot unless you're lucky enough to have a desk job.- Employees? It's interesting that the majority of actual work is done by workers who are not true Google employees. Temporary workers outnumber permanent Googlers by far. These individuals are interviewed for an entry level position by Google Management, but are actually employed by a Temp Agency. These poor saps are underpaid, overworked, and all are fighting for a permanent position that most will not obtain. They do the same work as many Operations Associates & Engineers. But receive no promise for their hard work and are unappreciated by management. Management is not allowed to give temporary workers any type of feedback as to their performance and are unable to pull them aside to tell them they are doing a good job, nor room for improvement.",
        "advice": "Place water fountains on the DC Floor. Give employees more breaks to prevent bodily injury such as carpel tunnel syndrome. Communicate with your employees more frequently to receive feedback rather than once a month meetings as to our goals. Allow employees to submit anonymous suggestions like this advice text box. Allow temporary employees the same supervisory advice Googlers are given and give them advice on ways t… o improve. Don't be a jerk! And don't be evil! I love Google, but for lower level employees, it is easy to become burned out both physically and mentally. Take this into consideration and take care of your employees as well as the temporary workers who work just as hard.",
        "pros": "- Entertainment! Yes, there is a workout room, pool tables, ping pong tables, Foosball tables, Xbox 360's, Playstation 3s, Wii !!- FOOD!! Ice Cream freezer, cookies, snacks of all sorts, gourmet and normal beverages free for the taking! Breakfast and Lunch are all homemade from Chefs with nothing ever frozen.",
        "summary": "Data Center",
        "role": "Operations Engineer",
        "date": "Aug 10, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Ratio of non-engineering to engineering employees not scalable to growthLack of upper management support for needs of changing employee demographics and work/life balance",
        "advice": "10,000+ employees require a closer and more diverse approach to employee growth, motivation, and happinessProvide more career development, mentoring, and training opportunities for employees, especially management (all levels)",
        "pros": "Ability to interact with very unique and intelligent co-workersNumerous employee perks (free food, fitness centers, events, massage, etc.)",
        "summary": "Worked in support services as employee (non-engineer)",
        "role": "Anonymous Employee",
        "date": "Aug 19, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Good luck taking advantage of the perks. I felt like I was sneaking out anytime I walked over to get a coffee or talk a quick walk around the building for a break. Expected to be at work from 8am to 11pm. Was reprimanded for talking advantage of amenities instead of working (an hour out of a 14 hour day)",
        "advice": "Don't treat people like machines.",
        "pros": "The well known perks are all there. You are given quite a bit of freedom and autonomy within your project or teams scope. The work is challenging and interesting.",
        "summary": "Overworked, lack of respect",
        "role": "Hardware Engineer",
        "date": "Sep 4, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "As a long time Googler (more than 10 years), it pains me to write this, but it has gotten so bad that I feel compelled. Google used to be a place driven by a culture of collaboration, innovation, and, well, Googleyness. Unfortunately, this is no longer the case. The culture has descended into one where employees are pitted against each other by a rating system that forces managers to choose their best team members, n… o matter what. Got a team of all-stars? Too bad, some of them are still going to get bad reviews. Want everyone on your team to work together for a common goal? Sorry, everyone feels like they need to keep their best ideas protected because it’s survival of the fittest. As a result, I have seen great employees forced out, moral destroyed, and careers ruined as the system chews employees up and spits them out. It has taken me a long time to get to this place, as I forced myself for years to see the Google I once loved and not the Google that now exists. It is all very sad.I know many ex-Googlers from the early days who despise what Google has become. It pains me to say that the company I once loved and admired has become what it says it never would be, evil.",
        "advice": "The culture is not what you think it is. Overhaul the employee review system.",
        "pros": "Everyone knows about the great perks and salaries are good.",
        "summary": "There is a Dark Side",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I'm used to startup culture, and I had a serious culture shock coming to Google. Maybe it varies somewhat by team, but from my vantage point, engineering seemed very bloated and bureaucratic. There is an obscenely long and restrictive \"style guide\" of programming rules that must be followed and company-wide banned language features that makes coding much less productive than I'm used to. Code reviews sometimes become…  bickerfests and can drag on for weeks or months. The allocation of engineers to teams is awful - my recruiter basically lied about what I would be working on, when I arrived I was assigned to a team and project that I had no interest in whatsoever, and there was nothing I could do about it except suck it up until I could leave. My coworkers were extremely risk-averse and were far more concerned about breaking something that already worked than about making progress. Also the culture is biased towards \"perfect\" engineering solutions, and just hacking to get something done is highly frowned upon. This isn't always bad, and you can learn good programming practices and discipline, but unfortunately it just isn't always practical in the real world of deadlines and needing to make progress.The worst part of all is that I never felt like my work mattered anyway to the success of the company. I worked on various projects that my manager assigned (there wasn't much discretion in choosing things to work on, and the vaunted 20% time is just hype), and my manager had a lot of \"pet projects\" that he wanted done but didn't really have any great justification for why they should be done at all.Anyway Google is a big company and managers and teams vary in quality. I'm sure there are plenty of people who are much happier than me, but I also think my situation is hardly unique.",
        "advice": "Don't assign engineers to projects before their start date and assume that the employee will be happy with whatever crappy project they are assigned to. Give \"nooglers\" a change to sample several different teams for the first month or so and then give them some leeway to choose a project that matters personally to them. Engaged employees are happier and more productive.",
        "pros": "Most people are smart, lots of vacation days, lots of perks, good food, many interesting distractions like guest speakers, nap pods, good culture. Pay is decent, but not as good as elsewhere.",
        "summary": "Great engineers working on boring code.",
        "role": "Software Engineer",
        "date": "Oct 31, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "1. Long working hours, no work-life balance.2. If you work only for 40hours, you won't get promoted and you will be sacked.",
        "advice": "Care for your employees.",
        "pros": "1. Free food, this is the best part in Google.2. Talented people around you, and you will learn in day to day activities.",
        "summary": "Expect to work like donkey or you will be kicked out",
        "role": "Software Engineer III",
        "date": "Dec 15, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There is very little emphasis on customers.the majority of folks who work here are motivated by two things: better resume, and tech stuff that one ups other techies.As a rather high ranking techie from half way across the world, these folks are not at all what I expected in terms of caliber.Communication, people management, keeping a cool head, these things are not common here, and if you have them, t… hey are not appreciated here.This place is a mecca for folks that can't relate to others very well, but are very technically savvy.Before you come here there are a few things you need to know:1) most folks come here because they want to be happy2) aside from the common knowledge that if you are presently at (be careful of used to work at) Google then you are technically smarter than others3) Once you leave Google, people will think it was because you couldn't cut it, not because you were amazing. the only way to go is to either A) start your own company (not very common as there is not a focus on customers) B) get poached (very common), but after you have been poached everyone will still think you couldn't cut it at the big Goog.4) most folks are happy because of 3 things: A) finding a mate (not very likely at Goog, unless you are hetero female, then game on, except most females here intimidate the guys... lol) B) making money (yep, you can do that here as well, ironically they don't pay that well for the area: IE you can 3x that in IT Finance or startups, or 2X in places like netflix; not to promote netflix, but they are very interesting if you are heavily motivated by the mulah) C) making a difference in the world (not super common here)I know a lot of people who are only happy when talking to other people about their career because they work at Goog, but have pretty much put their life on hold, and their happiness on hold to be here.Honestly, only work here if you live here.Do not travel to work at Google.It doesn't work out, and everyone ends up leaving to find a mate, more money,Do not move away from family to be here.Basically work here if you have no other options.If your people skills or business skills are to weak to affect folks, and you are OK not finding anyone special for a few years, and you are OK with really long hours, work here.It is hella good bragging rights to most folks, but once you get high enough in the tech world, it can be a negative.Actually I should share this as well.the best people at google get poached (startups, other tech companies, etc...)the worst get cannedall the people who can fake it staythe people that stay hire other people just like themThere are a sea of shitty people growing at Google, beware them, and if one of them is your manager, transfer or leave ASAP, lest you find out the #1 factor of job unhappiness. =)All in all, if you live in the area, and are just starting your career, please dont let this scare you.This is a great place if you are local, young (22-28), and not interested in finding a mate.GL out there!",
        "advice": "People are not valuable because they know x amount in technology, people are valuable because they believe what you believe.You are riding out the success of your earlier achievements, and that startup down the street is going to eat your business soon, it is certainly eating your best people.",
        "pros": "Everyone knows the perks.Lots of technical folks everywhere you turn.",
        "summary": "Not what you expect",
        "role": "Tech Lead",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "1. Work/life balance is non-existent2. The recruiting organization is very metrics driven3. Very politicalYou're expected to hire an ungodly amount of people AND work on high profile projects or your quarterly performance review could be in jeopardy. The keyword is \"high profile.\" Unfortunately they don't often tell you if the project you're working on is high profile enough until it's too late. Keep … in mind that sometimes your projects carry more weight than your core job.On the political side, friends of managers were promoted (so were their significant others) ahead of people many thought were far more qualified. One case was so blatant that I wondered why no one said anything.Very senior management did a good job of conveying the overall message but many middle managers were incompetent. One former manager frequently brought coworkers to tears. One new manager told me shuttle time wasn't work time. When I explained I had to work on the shuttle so I could make it on time to pick up my daughter from daycare at 6:30 PM, I was told \"not my problem.\" Keep in mind I was working 9-10 hours a day from the time the shuttle picked me up in the morning to the time it dropped me off at night. Yet I was dinged for not being at my desk for that long because I couldn't be micromanaged.If you live very close to campus or work/life balance isn't something you're terribly concerned with, then you should be just fine.",
        "advice": "Please listen to the team. If a manager is just plain incompetent, let them go! More transparency around goals before the review, not after.",
        "pros": "I worked for Google 3 times as a contractor before converting to full time employment. The perks are amazing and can't be beat. Almost all the cafes are top notch and the microkitches are fully stocked. During my time there, I met some of the most powerful people in the world, was entertained by some of the greatest bands and met some of my favorite authors. The annual holiday party is also exceptional and no cost se… ems to be spared.",
        "summary": "Google is the best place in the world to work - if you're an engineer",
        "role": "Recruiter",
        "date": "Apr 22, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You will get burned out eventually which is why the majority of the employees don't last more than 3 years. You are expected to work day and night, no matter what role you're in, and be available when away on vacations. Management will stress over and over that they wan you to check out for PTO, but when you do, it backfires and I've had 9 different managers and all were the same. I believe it comes from the culture … that you must work 24 hours a day. Majority of the staff is young, and they love to hire right out of college because it keeps fresh ideas but also because they can suck more time out you. The peers you work with are not friendly, competitive to the extreme, and will throw you under the bus during review cycles so their performance review will give them a 1-up during calibrations and promotions. Also, don't expect to get promoted often, if at all. Also, if you don't like company re-orgs then this isn't the place for you. It's expected your job responsibilities will change regularly, as often as they re-org themselves.",
        "advice": "Lead by example and help your peers. If you tell your reports to check out in the evening and not be attached to email, do this yourself and don't send emails at midnight with questions. Also, understand concerns and understand the product which your team is responsible for. How can one grow their career if their manager doesn't even know what is going on or how to work the product? In addition, advocate for your dir… ect reports even if they want to change careers and move to a different department. It's so political now and people are afraid to transfer internally knowing it will damage their performance score.",
        "pros": "Great benefits and perks depending on the office you're located in. Larger offices have more \"Google\" options like gym, robust cafes, massages, and ample training classes. The salary is also competitive when you factor in all of the benefits. However, many other companies are becoming \"Googley\" so beware that it isn't the same it was 5 years ago. All departments are different but the best ones everyone wants to get i… nto are HR, Benefits, Events, and Admin, and Operations. Stay clear of any sales department!",
        "summary": "Cut throat, privileged co-workers, and burn out inevitiable",
        "role": "Account Manager",
        "date": "May 15, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "After all the interviews, they have nothing to offer you other than status for your resume.",
        "advice": "Don`t be evil.Stop canceling projects, too many things going on, can`t get anything right.",
        "pros": "Good co-workers, smart people move on fast.Get that name on your resume.Gives your leverage to get a good job afterwards.",
        "summary": "Only Hype, maybe it was a good company a few years ago. No longer.",
        "role": "Search Engine Researcher",
        "date": "May 28, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No specific order:Smartest people in Junior roles causes complacencyJealousy: Concept/ idea stealing, lack of integrity.The way Temps / Consultants are treated as 2nd class citizensPeople get lazy and tend to meet virtually in the same building. = no human connectionNot friendly people that sit around you don't say hello and if you do, wow the strangest reaction!Abundance of younger (mid 20's)…  fresh out of MBA programs= no real job experience.The Google High lasts about 2 weeks then you realize all the perks are to cover up the companies incompetence.Unless you've been with the org for years it's nearly impossible to set a career trajectoryIf you don't work under a product team you're just background.",
        "advice": "Keep personal affairs outside the work place.Value the contract / temp workers.Stop thinking Google is a startup. It's clearly not.",
        "pros": "Flexible working scheduleEasy job for lots of money: VERY EASY.20% Projects are feasible if you find a way to get your work done in advance.Ex. hiring a freelancer via Odesk (very cheap rates) for the stuff you just don't feel like doing. < smart people in jobs that are too junior get complacent and bored.Manager your managers expectations and they won't have a clue nor do they care as long as you … deliver.Food / SnacksShuttle ServiceBathrooms with heated seats and bidetSmart co-workersMOMA: Googler Visibility with photos (ironically the search engine is awful)Campus vans vs. Riding bicycle in heels.PerksResume Padder: Recruiters call everyday while at work!Choice of laptop, screens, erg setup.Tech Support: Free cords, batteries, adapters, galore!The coolest most legit people are the security staff.",
        "summary": "(NON-TECH Role)",
        "role": "Marketing Manager",
        "date": "Jun 27, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The sales org is a big bureaucratic mess.Most decisions are made by upper management with a very short-term focus - and everyone has to play along - to get that director his/her next bonus.Promotions are 100% driven by politics vs. how you perform in your core role.There are much better parts of the company to be in - but you won't be able to get in to them in the Ann Arbor office. The good roles are all … centralized in Mountain View.HR here is evil. Any move you make, they will look for ways to claw back your merit increases and even make you sign that you will not negotiate salary if you get an offer. Then give you a poor offer.",
        "advice": "Open up more roles to remote offices.Promote for core role competency vs. side projects and politics.Promote more from within vs. external hires (who have 2+ years learning curve).Make HR less evil.",
        "pros": "The benefits and perks of working at Google are outstanding. As a whole, I think the company does care about its employees, at the highest levels.",
        "summary": "Bad Time to be in the Sales Org",
        "role": "Account Executive",
        "date": "Jul 6, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Management- Lack of career pathing- No work life balance",
        "advice": null,
        "pros": "- Free Food- Money and bonus- Perks",
        "summary": "TPM",
        "role": "Anonymous Employee",
        "date": "Aug 20, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Disorganized managementArrogance and complacency are rampant (think Micro$oft in the 90's)You can't trust your co-workersA collection of failed attempts to diversify, kept afloat by one cash cow (depressing to everyone not working on search)Most managers actively sabotage your efforts at working on a 20% project -- very frustrating.",
        "advice": "Concentrate on search, and give the profits to the shareholders. You can't beat the rest of the world to the \"next big thing\" from within the safety of GOOG's balance sheet -- try venture capitalism instead.",
        "pros": "Looks good on your resumeFree mealsYour parents will have heard of the company, even if they still don't understand exactly what you do for a living.",
        "summary": "Desperately trying to stay relevant",
        "role": "Senior Software Engineer",
        "date": "Aug 27, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Big company, Political environment.-Quantity get higher precedence over quality.- Google Recruiting culture is different from the company.",
        "advice": "Integrate Engineering and Recruiting.",
        "pros": "Benefits.401k match.Soaring stock price on a strong ad business.",
        "summary": "Robotic Recruiting where all they care for is a number not quality. Shady practices to get candidates through.",
        "role": "Technical Sourcer",
        "date": "Sep 10, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Amateur management. Beyond the point of being disrespectful at times. I've seen this from the top leadership time and again. Eventually I had to leave because of a conflict with personal values. Funny thing is, those at the top were simply there first/ longest, and they are generally less competent than many of the most junior employees. Heavy bureaucracy. Kinda ridiculous to see how tactical management can get (I me… an,the CMO providing feedback on a product web site), and the sheer lack of a well communicated strategy for the business (ie, I do think Larry sets a good company vision and priorities).",
        "advice": "n/a - too much arrogance there to really listen.",
        "pros": "Smart people, amazing company vision and ambition, perks.",
        "summary": "Too much hype",
        "role": "Product Marketing Manager",
        "date": "Sep 25, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Terrible place for career advancement and developing new skills: promotions are more difficult and much less frequent vs. similar companies and are just as political...95% of folks are top overachievers anyways, so competition is fierce and slots are few.Flawed leveling/stack ranking process inhibits growth, opportunities to transfer, and eventually impacts sense of self-worth and work ethic (burnout is inevitabl… e as mentioned).Little to no impact/meaningful work at less than a Level 6. For context, if you're hired as an L2, it'll take 15+ years to achieve an L6 - and then you can be a middle manager. Woohoo!Sure, you can transfer (not easy though), but you'll be doing the same menial clerical work for a different division unless you level up and you'll have to restart your promo clock all over again.Re-orgs are every 6 months, delaying/killing career traction. Layoffs do happen here, but company keeps it quiet.Culture isn't for everyone: very snobby, often distrusting - company culture outside of walls is face value-only. Peers are collaborative only for promotions sake. Lots of bureaucracy and conformity, very corporate culture. Poor camaraderie outside of office.Terrible internal systems. Proprietary Google CRM is a joke.Transfer packages are terrible; HR always finds ways to negate merit increases when transferring by lowering salary, relocation packages are bare minimum (but most people here come from money, so that's ok I guess).Slowly turning into a conventional company; bloated middle-management doesn't ruffle feathers, protects selves vs. team/good of the company.Benefits are decreasing as company grows and becomes more conventional.",
        "advice": "Don't pay lip service to career development. You're working with some of the best and brightest in the world, don't let them rot on the vine due to corporate politics.Stick with products by marketing them for more than two quarters.Try launching a flawless product for once and/or actually fix it once it GTM.",
        "pros": "Leading companySmart coworkersStrong senior leadershipGreat productsWorld-class benefitsDelicious and free food all day longDecent work/life balance in certain orgsEnvy of friends and family",
        "summary": "Great on paper, miserable in reality",
        "role": "Account Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "1) Org Changes: 'How Google Works,' by Eric Schmidt and Jonathan Rosenberg does not reflect Google reality. Reorgs take 6+ month and no decision gets made. Resulting in people being idle. Not every manager supports 20% projects.2) Poor People Managers: Company is large with a lot of middle management not adding value and just delegating. Groups are created because an employee with double digits wants his/her favo… rite to have a team. Employee feedbacks are not addressed and management pays lip services to fix real issues. HR needs to work for the employee and not leadership team! \"Don't be evil!!!\" HR needs to represent the PEOPLE and remove leaders who have less than 50% YoY approval ratings or significant turnovers in team",
        "advice": "Dear Larry & Omid,Morale is low in some of the business groups because of poor leadership. Please start identifying poor managers and evaluate roles and responsibilities of people in these groups. There are a lot of people who are pretending to work and they spend their day making up work so it sounds like they are working. Please don't waste the precious talent you hired. Morale is low, people are under valu… ed, and some people feel that they are getting dumber!",
        "pros": "1) Food: Great food options. The chicken taste bland 50% of the time but it's free food. Micro Kitchen always well stocked.2) Large Company: Large company with many groups and a lot of opportunities3) Transparency: Appreciate communication from leadership team.",
        "summary": "Act on Employee Feedback - People managers w/ approval ratings ess than 50% YoY should not manage",
        "role": "Business Role",
        "date": "Nov 8, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "work- life balance. career advancement, salary raises, bonuses paid out in vested stock that takes 4 years to actually pay out. golden handcuffsI realized I made a mistake of accepting the job on day 1. I lasted just over 2 years. The stock, benefits and golden stock handcuffs were a large part of why I stayed. Things are done under the illusion of each employee having a voice, and everyone being equitable in…  the growth of the company and in deciding the direction of the company. This is completely untrue. Our entire department tiptoed around the manager, gave her terrible Googlegeist feedback, and yet, as if by magic her salary grew and grew whist we were told that we had \"reached the top of our pay scale tier\"My salary raise was 5 cents per hour in the year that I left. My performance review did not warrant this kind of slap in the face, but my department simply didn't have the funds to pay me more.",
        "advice": "As a children's center employee, having to plan your vacations around other people, is unacceptable. As people stay longer and longer and get more and more time off, there comes a point when you simply cannot afford to give everybody vacation days that they have accrued, and still keep the center staffed.Hire substitute teachers, even floating substitute teachers that are familiar with the centers and how the… y operate.",
        "pros": "benefits, food, perks, discounts.Google has done a great job of marketing themselves as a hip place for smart young things to work. The concerts, parties, and general go go go of the company may appeal to young 20 somethings who have no strings attached and like to spend 75 hours per week at work in a flexible schedule of working out, working, eating, getting massages and hardly ever going outside of the Goog… le bubble.Google culture has its own language so you feel like part of a group. People \"get you\" here because they speak Google-esque just like you. Again, great marketing and appealing to the need for people to belong to a group.",
        "summary": "Your experience depends on your manager",
        "role": "Children's Center Teacher",
        "date": "Jan 5, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "gTech is a highly political org with many more layers of hierarchy than other orgs (Eng, Product, Marketing, etc.). This culture spurs unhealthy competition between co-workers who should be collaborating. It also doesn't make use of individual contributors' skill-sets, resulting in smart people doing low-level things.",
        "advice": null,
        "pros": "Great perks and benefits. Nice facilities.",
        "summary": "Don't join Google's gTech org",
        "role": "Business Operations Manager",
        "date": "Feb 19, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "\"Hire the best people and give them freedom\" is all talk from the head of HR. Make sure that your role is one with enough flexibility so you can enjoy the benefits of Google. Oh the irony that one of the most money-making units of the company is one of the least \"Googley\" in terms of freedom for employees and transparency of the role during interviews.",
        "advice": "Be explicit with what the role is during interviews and also honestly state that it is really difficult to get promoted or move to another department.",
        "pros": "Great people that care, free food",
        "summary": "Misleading Job Descriptions",
        "role": "Associate Account Strategist",
        "date": "Apr 3, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There truly aren't any cons here to report!",
        "advice": null,
        "pros": "Huge career growth potential and just a downright fun place to work.",
        "summary": "“Amazing company that allows you to be act on your creativity and see your ideas in action! ”",
        "role": "Anonymous Employee",
        "date": "Apr 21, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too big a company, too much bureaucracy, lack of shared vision, diversity, trust and respect; hard to make any progress.",
        "advice": "Reduce the compensation gap, that will help get rid of the individuals who there only for money and retain the ones who actually want to bring about change. Fix the talent management practices.",
        "pros": "Through the ups and downs of the economy, Google has been a stable employer. A while ago, it also took on big challenges and with focus, executed them successfully.",
        "summary": "Manager",
        "role": "Anonymous Employee",
        "date": "Apr 23, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Sloooow...doing anything takes two weeks minimum- Promotion process is byzantine and opaque. Years to get into management- Big-company atmosphere - don't be fooled by the \"entrepreneurial culture\". 55,000 employees doesn't allow for that- Stand-offish management",
        "advice": "- Let people get things done",
        "pros": "- Fun, incredibly intelligent co-workers- The perks, of course- Internal mobility to switch within the company",
        "summary": "The perks don't justify the slow-moving bureaucracy, especially in HR",
        "role": "People Programs Specialist",
        "date": "May 11, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Founders stepping back- Influx of consultants- Culture declining",
        "advice": null,
        "pros": "- Smart colleagues- Breadth of opportunities internally- Solid benefits",
        "summary": "Losing uniqueness",
        "role": "Anonymous Employee",
        "date": "May 11, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's google corporate style startup environment doesn't work. Time will tell.the interviews qlarge terrible, but cute. Anybody 20th half a brain can pass them.",
        "advice": "Keep up the hard work. Don't settle. Ever give up. Keep calling hr people operations. Nobody sees through that. And keep up with those ads.",
        "pros": "It's google-smart folks.Flexible schedules allow for optimum work life balance.who runs the world- aapl and goog. Who else?",
        "summary": "MD",
        "role": "Anonymous Employee",
        "date": "May 20, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Engineers lead the company, which is great if they do engineering only. Sadly, they rule all functions and make just plain scary decisions.",
        "advice": "For business initiatives, make sure you have people in charge who know what they are doing, and are qualified (not just an Eng degree)",
        "pros": "Great free food and people.",
        "summary": "Engineers rule, which ultimately ends in marketing disaster",
        "role": "Marketing Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Alot of finished work expected of you in small amounts of time.Bonuses poorly distributed.not great work/life balance, most employees are workaholics.",
        "advice": "Pay more attention to the effort and intelligence when giving rewards like promotions, bonuses, etc. and reduce hours for employees.",
        "pros": "Diverse work environmentSomething new to learn everydayVery casualRewards hard workGood coworkers, very creative people.good compensation.",
        "summary": "Google review",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "little work life balance. stay at the office late.",
        "advice": "less politics",
        "pros": "great, smart people. some interesting work to be done",
        "summary": "overall, ok place to work",
        "role": "Software Engineer",
        "date": "Jul 1, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "PoliticalDishonestBelow Average ManagementTreats employees as disposableLow Work/Life Balace",
        "advice": null,
        "pros": "Nice People / Team MembersPerksComp",
        "summary": "Strategy Manager",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management refused to talk to you since you were a temp. And you HAVE to be a temp for a year, or more - much more sometimes, before you can get hired on.",
        "advice": "Grow a pair!",
        "pros": "It was a fascinating, one of a kind place to work.",
        "summary": "How can you say no?",
        "role": "Operations Engineer",
        "date": "Jul 24, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Disconnected from average consumers, products come second to monetization by ads.",
        "advice": "Improve benefits if you want to keep competing with Facebook, Snapchat, and other companies taking away your employees",
        "pros": "Good pay, good benefits, very little bureaucracy in the way of accessing user data to try and do cool things.",
        "summary": "Not as great as people make it out to be",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Seniority and hard work means nothing to themNo growth opportunityPlays favoritesTotally a labor jobNO Benefits",
        "advice": "Promote people that work hard, not who you like or think you can have an easier time controlling.",
        "pros": "Very Flexible, Good pay, Easy work, Not too strict, different locations to work from",
        "summary": "Don't waste your time...seriously",
        "role": "Store Operator",
        "date": "Aug 12, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "At some point in your tenure with Google, it will become clear that you live in an organization that is engineered to keep you numb, well-fed, and scared of the outside world. (This maybe should be listed under \"Pros\", since you'll gain a sense of empathy for hobbits, cows and children in cults). You will cope with onsite yoga or by spending your bonus on new Teslas. The feeling will endure.The problem with G… oogle is that it thinks it's Pixar (fresh, zany, innovative) when it's actually Disney (bloated, iterative, a little creepy).Do you have a really fat mortgage to pay off from that Mission fixer-upper? No? Then find a job somewhere where you'll actually use your brain and have an impact.",
        "advice": "-Stock Odwalla juice in all buildings. Some didn't have it.-Add actual Kool-Aid to the cafes. Most people will miss the irony.",
        "pros": "-Your mom will be impressed-Easy money, free back rubs-You can leave for hours at a time and no one will know-Work with nice, smart people who also went to Stanford-Improved patience dealing with horrible traffic to Mountain View, slow bureaucracy-Do they add MDMA to the mint spa water in the cafes? You'll only know if you try!",
        "summary": "Your brain will explode from boredom",
        "role": "Business Operations Associate",
        "date": "Aug 16, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Supply and demand applies. Everyone's very talented, so the ability to achieve is worthless, those who excel are those who monopolize and hoard scarcer resources. (approvals, visibility) Office politics is 90% of the job.",
        "advice": "Fix the onboarding, I feel like there's a conspiracy of the old timers against the new. Constant turnover hides this fact",
        "pros": "Great internal toolsPay is greatOther companies will want to pay you lots of money if you worked here because they think it means something",
        "summary": "False affordances",
        "role": "Software Engineer",
        "date": "Aug 17, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Work hours too long, they want you to live at work.",
        "advice": "Stop being arrogant",
        "pros": "The company sucks, everyone is over-employed and frustrated.",
        "summary": "Sucks",
        "role": "Software Engineer",
        "date": "Aug 19, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "no support or feedback. let go without notice",
        "advice": "people should not be treated as dispensable units",
        "pros": "flexible schedule, decent hourly rate",
        "summary": "Ad rater",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If a person is hired on at a junior level, HR expects that person to earn promotions until they attain a senior level. Google management winnows out those who don't earn a senior level within a certain amount of time. That said, Google management does not require anyone starting out at a senior level to earn promotions.",
        "advice": null,
        "pros": "Google offers free healthy food, onsite gyms, personal trainers, limited onsite health care, free buses to and from work. They also help work life balance by providing wifi on the buses so that work can be done while commuting. This means less time spent at the office.",
        "summary": "Benefits second to none but culture needs improvement",
        "role": "Software Engineer III",
        "date": "Sep 18, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Google is now a bloated, political organization. Unless you are a software engineer you will learn more elsewhere, and have greater upside at a Facebook or a start-up. HQs are in MTV, outside of there your career stagnates.",
        "advice": "I worked at gTech for a portion of my time at Google - that organization is a cesspool, full of Machiavellian leaders. Split that department up so the services teams are actually aligned with product and sales.",
        "pros": "Best density of talent at any large company, their office productivity suite (e.g. gmail) is definitely the best, food is quite good, especially the coffee barista",
        "summary": "Google 2015 = Microsoft 2005",
        "role": "Anonymous Employee",
        "date": "Oct 25, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "So many politics, promotions based on popularity not aptitude.",
        "advice": "Promote the right people, value high performers who don't always need the spotlight and value your employees.",
        "pros": "Great perks, smart people, good pay",
        "summary": "Too many internal politics",
        "role": "Recruiter",
        "date": "Oct 31, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Workaholics, intense competition, constant game of thrones! Contractors are sort of a sub-class, make less money, have limited access to meetings, projects and facilities (for the same position).",
        "advice": "Consider contractors as the other employees",
        "pros": "Super smart people, lots of free stuff. Amazing to work at Google, just to realize it's not all that.",
        "summary": "Google Enterprise as a Contractor",
        "role": "Enterprise Sales Associate",
        "date": "Nov 20, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Constant restructuring, always had to \"prove\" self to new management, difficult review cycle (which improved slightly shortly after I left)",
        "advice": null,
        "pros": "Amazing benefits, especially insurance and maternity leave",
        "summary": "Okay, depends on your division and director",
        "role": "Anonymous Employee",
        "date": "Dec 8, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too many middle managers with lack of focus, start projects and then quickly abandon them, open discrimination of women, disabled and minorities.",
        "advice": null,
        "pros": "Free, heathy food offerings, good benefits package",
        "summary": "Lip service about opportunities for women, disabled, minorities",
        "role": "Content Strategist",
        "date": "Dec 11, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "the management was pretty bad, they didn't really listen to engineers and in particular treated engineering as if they were children",
        "advice": "don't treat your engineers like children, other than that it was fine (all perks were good, pay was fine etc)",
        "pros": "cool, smart people, pretty laid back, lots of the perks of being a google employee (e.g. games, lots of free food, etc)",
        "summary": "Good pay; bad managers",
        "role": "Anonymous Employee",
        "date": "Dec 22, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No direction, guidance or training. It was literally sink or swim. The content of what we were working on was not interesting or challenging and when tried to shift to other projects, we were told that we could only do this one thing. Usually a good manager will help their employees find a project where they can build their strengths. I think they didn't really care if we left, but thought, \"hey we can always hire mo… re, we are Google\" - they treated employees as disposable. There was no flexibility for the team we were on, we were micromanaged and they didn't treat us like adults. Our manager was not interested in building our individual careers or supporting us, but just running the business at a strategic level and would constantly cancel meetings for personal reasons.Some people were obsessed about working at Google, almost like it was a sorority or fraternity and it was a little cultish. Even one of my friends said when I worked there, all I did was talk about working there.",
        "advice": "Actually try to promote and develop those who are good managers and encourage them to develop their employees. Treat people like adults and give them a bit more flexibility to get the job done.",
        "pros": "The basics, free food, good benefits (but now most tech companies have the same benefits), a lot of good people.",
        "summary": "Wouldn't call it the best place to work...",
        "role": "Anonymous Employee",
        "date": "Dec 28, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No room to become full time none contract.. Pay is on the low end.",
        "advice": null,
        "pros": "Flex time and once you leave work your day is done.",
        "summary": "VDS 2",
        "role": "Visual Data Specialist",
        "date": "Jan 5, 2016",
        "is_current": true
    }
]