[
    {
        "rating": 3,
        "cons": "Long hours, demeaning management, egos and elitist mentality run rampant. Because the globalization and product development is largely completed, the ability to get in and build something is mostly over. It's becoming sluggish and difficult to maneuver the sea of overachievers all wanting to be recognized.",
        "advice": "Communicate more with your teams, just because you own legacy stock only doesn't make you any smarter. It's all taken so seriously, this need to dominate the world.",
        "pros": "The food and the gym, the perks of valet parking, commuter services, taking your dog to work, oil changes while you work, hair cuts, dental appt., doctor appts, they really do a great job of making sure you are physically taken care of at work",
        "summary": "Google, great food, overrated career opportunity",
        "role": "Product Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "All of the perks are designed to keep you at work longer, without additional pay. Additionally, promotion opportunities are generally available to those who kiss the right feet, not necessarily to those whom do the best work (or work the most efficiently).",
        "advice": "Learn to spend time working WITH your group, not simply looking down on them from above. 90% of the problems in terms of morale and employee satisfaction at this company would be avoided if management took the time to work with the other employees and see what they dealt with day to day.",
        "pros": "It looks good on your resume. Additionally, everybody you speak with will recognize the company you work for, as it certainly has good name recognition. There are a lot of learning opportunities, and very intelligent people to learn from beyond the provided courses. Taking advantage of all of these resources is what makes working for this company worth doing, at least for a period of time.",
        "summary": "Good experience, don't spend more than a year.",
        "role": "Anonymous Employee",
        "date": "Dec 28, 2008",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Flat organization has given way to more hierarchy and middle managers, who are often woefully inept. Company has an inability to deal effectively with low performers. Hard to effect change in a large organization. Lots of people are becoming risk averse and more concerned about personal ass-covering than making good software.\"Don't be evil\" is not a value shared by all at the company, especially newer hires.",
        "advice": "Fire low performers faster, force fewer decisions to require exhaustive processes and signoffs.",
        "pros": "Great benefits, stellar engineers, the ability to work on large, interesting problems. Company has large and usually positive effects on the world.",
        "summary": "Not as fun as it used to be",
        "role": "Product Manager",
        "date": "Dec 29, 2008",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Siloed from many perspectives. Most people were *very* unhelpful. I guess they are all so buried in their work, they don't have time to help you. Some of this seems short-sighted since your getting up to speed will allow you to take some of their burden off, but I did not see that happen.A number of people have pointed out bad management. That is true, but in my opinion the non-existent HR is the bane of Goog… le. I don't mean the HR folks that take care of your 401k's and administrivia; they were good to work with. I mean those who affect your career. About once a year, the director of HR for all of engineering would bring his dog-and-pony show to the googleplex and tell you how the perfs are done. The last couple of times they did these 'info session' with themes like Harry Potter or beach party! Wonderful use of their time! When you need to reach them, you can't because you cannot find a single unblocked slot in their calendar, but they have plenty of time to come up with these useless party schemes!",
        "advice": "Some of the senior management is really out for their own advancement. Some, who were genuinely looking out for their group's interests, were let go to bring in bean-counter types.Additionally, some of the low-numbered employees really need to be let go, much less promoted to still higher positions! Some of them have been the antithesis of 'do no evil', and they have done a great deal of damage to employee mo… rale.",
        "pros": "A very dynamic place. There was always something going on and they really did try to take care of you.",
        "summary": "A different company than probably any you'll work for, but you won't have a life!",
        "role": "Test Engineer",
        "date": "Jan 8, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Gone are the days of a biologist being hired as a senior product manager (Salar). Now Google hires MBAs with 2 years at Proctor and Gamble or 3 years at an investment bank as our typical product hire. People that thrive on bureaucracy and build up the team. When HR is more than a few dozen people and there are both HR and Facilities vice presidents, you know that the company has gotten way too top heavy.",
        "advice": "Pare down significantly. Google is way overstaffed in many areas leading to complacency and plain getting slow and fat. We have far too many HR people and other people working on silly ideas like \"Google Unversity\" where poor quality classes are offered to sales and ops people.Make some major product kills and actually layoff underperforming engineers rather than giving them free reign to travel the world and…  work 2 hours a week on Google's time.Thin the sales staff - searching in moma for \"head of\" pulls up a ridiculous amount of title inflation by average employees worldwide. Google have too many cooks in the kitchen and it's gotten rather political and conniving rather than constructive.",
        "pros": "The quality of coworkers is outstanding, though declining over time as we hire more and more MBAs with plain and boring backgrounds.The perks in terms of facilities are still quite amazing. You can't beat the lunches in Mountain View, the clear weather, and the energy if you're on the main campus (bldg 40-43).If you're on a key team, there's also ample opportunity to jet around the world and work at y… our own pace doing things you love.",
        "summary": "The best \"big company\" to work for, if you're the big company type.",
        "role": "Product Manager",
        "date": "Jan 27, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Hard to get ahead, increasingly bureaucratic",
        "advice": "Make it easier to move between projects, provide more training for engineering managers",
        "pros": "Challenging work, perks, enlightened senior management",
        "summary": "Google is a nice place to have on your resume",
        "role": "Software Engineer III",
        "date": "Mar 12, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Office environment – It could be very noisy and interruptive with 5 to 10 persons sitting in one room. It’s not the best setting for strong and independent engineers to focus and develop solid code. There are such engineers in our office that hardly able to focus and be quiet for more than 30 minutes, always talk loud and flatter each other. I am annoyed and disturbed on an hourly basis.Project management: po… or project management, lack of discipline and launch schedule. It’s very hard to estimate what and by when project will be launched. There is no one to enforce some discipline on code quality and stability. Launch delay quarter after quarter. When accountability finally comes and the project risks of being canceled, I see desperate launch push and poor code quality.Manager role: Managers and directors usually stay far away from daily project management duties. Manager does not know what individual software engineer is doing so don’t slightly expect such otherwise you will be disappointed. Majority managers are not technically strong and write zero or negligible code. Don’t expect much technical inspirations or lead by example from your manager. You will neither see much career mentoring nor other “soft” help from the manager. I had 1:1 with my previous manager maybe 3~4 times during the whole year period. Despite being the “manager” of our project, all his involvement was showing up a few times in our project meeting and later claims making big impact to the project on his self performance evaluation.Career growth: Despite the peer review model, the manager’s feedbacks appear to be what really matter. People that are vocal and suck up to their managers are very more likely to be promoted. If you are hard-working engineer that is able to and like to solve hard problems independently without making superficial noises, and expect Google to recognize your contributions, you will be very disappointed. I know some of such solid and senior engineers; about half of them already let Google. This is very counter-intuitive given the perception people have about Google.Project and team: Google is primarily an advertisement (instead of technology) company. The web search infrastructure is awesome however only need a relatively small number of people work on that. The available projects for most people, especially in satellite offices, are limited and not technically hard-core. If you are a senior and talented engineer, you may not find a local project that allows you to focus and solve hard challenging technical problems. It also becomes harder to find other senior talented engineers that you respect and love to work on, given senior engineers are leaving and junior engineers are joining.Engineering quality: I am disappointed with the code quality of my current team. Despite Google’s code review standard and practices, too many times people hastily touch existing code or add hacky code with no real testing. Such code checked in and deployed to data center. Overall it requires a lot more unnecessary iterations and bug fixes to stabilize the system. I don’t mind working 60 hours per week at all but it is frustrated to see most time wasted dealing with silly buggy integrated system. There is no engineering process to ensure code quality and stability or make a launch date more predictable. I see a general lack of engineering discipline and experience to implement very solid code from software engineers with no or just a few years experience.",
        "advice": "Value more and treat fairly engineers with lots of pre-Google experience. Balance engineer level and management level. Fix the promotion process to be not a popularity or suck up contest.",
        "pros": "Google is leader on web search and has the best web search infrastructure. It is convenient for engineers to work on a single company-wide code base with same coding standard. Company reissues employee stock option to $308 recently. Bigger percentage of annual bonus compare to other companies I know of; $8000 per year 401k match; free meal and other perks. Company has the perception of being an innovative company. Fr… iday TGIF with beer and wine. Engineers’ qualities are general fine. Many satellite offices so people don’t always have to relocate. For the first one or two years, you will be excited to explore the infrastructures, tools, systems and dream about a career path.",
        "summary": "It could be frustrating after two years.",
        "role": "Software Engineer",
        "date": "Mar 22, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "since there is alot of smart people, means that it's hard to stand out. Also, as they are smart, it means that many are also arrogant.it's not that easy to advance your career here. The \"big company\" culture is starting to take hold in this company (e.g. lots of politics and good talent leaving).Many bad managers that became managers because they were early employees.Pay is low compared to oth… er silicon valley companies.",
        "advice": "Train your managers",
        "pros": "alot of smart people. Every person I meet in google is smart. Lots of perks. Basically everything you need to live at google (which can be a bad thing).",
        "summary": "not as great as the hype",
        "role": "Software Engineer",
        "date": "Apr 9, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "My experience was that of an intern so it may not be typical, but I ended up doing work I had absolutely no interest in and didn't envision getting my degree for without much opportunity to do something different. When interns are recruited they don't have much of a say on what type of work they'd like to do, so if you're stuck with something you don't like and want to work on more interesting things, that's what eve… nings and weekends are for.If you have a PhD you can do some fascinating things at Google, but if you just have an undergrad degree you might be better off at a smaller company where you will get more opportunities to do different kinds of work that span several job positions at Google.",
        "advice": "Products like Lively are released while some others with much more potential have been languishing in development for years. Seriously, what are you thinking?",
        "pros": "The perks, food and transportation being the main ones, but there are lots of things that make it a geek's paradise if you're into that sort of thing - games everywhere, free tickets and shuttles for some movies when they open (Transformers was one), etc. Let's face it, it looks good on your resume. The chance to meet some very bright and interesting people. There are so many opportunities to educate yourself about t… he world through your employer - everything from tech talks on a variety of technical topics to visits by politicians and public figures. It's cool to be on the inside and learn about new products everyone else will be talking about soon.",
        "summary": "Depends on where you end up.",
        "role": "Software Engineering Intern",
        "date": "May 6, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Mundane work. If you are not an engineer, you are considered back office. Surprisingly the systems have not been developed enough so you end up being the band-aid holding things together.",
        "advice": "Pick NEW middle management. Hire professional training companies. Get a career path going. Stop giving MBAs a job that involves copying and pasting.",
        "pros": "Benefits of course. Free food, free transportation, gyms. The people are all great people to work with. They are people I would have chosen as friends - I just didn't have to look far for them.",
        "summary": "Great people, Great intentions, sometimes boring work",
        "role": "Associate Financial Analyst",
        "date": "May 11, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "none. the food makes up for everything. the micro kitchen food is going down in quality. many chiefs, not enough indians. our battleship is becoming a bald eagle. we will fly on wings like eagles.",
        "advice": "less hierarchy. better pay. quicker promotions. less time in google spreadsheets. get a real CRM system.",
        "pros": "the food is really amazing. i love this place. PIC and Lunchbox are the best cafes at the crittenden campus. a a a a a a a a a a a a a.",
        "summary": "Honest, blunt, this is what you get.",
        "role": "Account Strategist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Senior management lacking the skills / experience to manage.",
        "advice": "Hire managers and leaders and not just people that receive high marks on standardized tests.",
        "pros": "The food is great and Google offers learning opportunities and personal growth.",
        "summary": "The real Google.",
        "role": "Senior Product Marketing Manager",
        "date": "Jun 11, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Sometimes managment has issue with letting people know to stance of the company. You will find more information if you look yourself",
        "advice": "Let your employees know where the company stands. Better to hear it from you than on the front page. Thank You",
        "pros": "ITs a great place to work and expand your knowledge. You will love the people and location is great. Dont hesitate to apply",
        "summary": "Google Great Place to works",
        "role": "Anonymous Employee",
        "date": "Jun 12, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "very arrogant culture. Old-timers may have a sense of entitlement. Not much growth potential anymore unless you are politically connected with stars. Too many cooks in the kitchen. Too bottoms up, makes cross-team work potentially frustrating. Many remote offices are weak. If you work with a remote team, get ready for a bunch of \"C\" players with poor cultural fit.",
        "advice": "Thin the ranks of management. Have stronger goals across teams (try reading lencioni's silos, politics and turf wars.) Be careful to reward those who work on thankless jobs and not just the Latitudes and other sexy launches. Reward quality over launching crap (several eng dirs are terrible about this.)",
        "pros": "Google has a bunch of smart people. Also, there is a strong culture from old-timers to question the status quo and make this drastically better. It's also great pedigree for a resume. Pay is pretty good compared to other companies, the perks too. The shuttle service is great if you live in SF.",
        "summary": "OK place to work but it's a *big* company now",
        "role": "Product Manager",
        "date": "Jul 4, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Very hard to move up in the org- Too many cooks in the kitchen- Too many teams doing parallel work",
        "advice": "- Growth is slowing. Need to buy smaller companies that can accelerate growth again.- Change incentive structure. Hard to motivate people when there is little chance of over achievement.",
        "pros": "- Good food- Good perk- Smart people- Fun culture- Good reputation. Great to have on a resume",
        "summary": "Good placeo to work. No room for advancement",
        "role": "Anonymous Employee",
        "date": "Jul 19, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Again, being a vendor instead of a Googler, is not quite as bad as being a 2nd class citizen, but it was close. I also found the group I was in to be close to complacent and risk averse.",
        "advice": "The distinction between Googlers and Vendors should be decreased. It could be handled more like the Intern programs in terms of bringing people on board. One could start by chaning the color of the vendor badges from red to blue or green.",
        "pros": "It is much easier to work at Google as a contractor. The interview process was compressed to one phone screen and a 3 one-hour interviews on-site. The team I worked with was very supportive, and gave us a lot of flexibility and discretion in how we completed the tasks.",
        "summary": "Working as a \"Vendor\" (Contractor) at Google",
        "role": "Senior Java Engineer",
        "date": "Aug 15, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No cons to complain about. The job was simple enough. The pay wasn't high enough to justify any sort of con list. I was a peon!",
        "advice": "Had no management. Was all web based with electronic report cards based on how fast you worked and the quality of work performed.",
        "pros": "Was a remote job. All web based. Nice on the resume. Very few requirements other than languages speaking and search knowledge.",
        "summary": "Quality Rater while in school",
        "role": "Quality Rater",
        "date": "Sep 8, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They hire too many young overachievers - people who have only ever \"shown aptitude for having aptitude\", as that one writer said. So it feels like half of everyone is angry about learning what being in the workforce is actually like, and shocked that you don't get promoted for working 12 hours a day and having aptitude and a great GPA.",
        "advice": "Offer a class to the young employees about this topic: reality. Actually, also make the older employees who have only ever worked at Google take the same class. This includes many in senior management.",
        "pros": "Good food, good perks, fun smart people.",
        "summary": "Not so diverse",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Frequent re-organizations which can cause your career to move more laterally than verticallyMany of Google's senior managers are better as individual contributors than team/group leaders",
        "advice": "People management should be a top priority. Some of the leaders that you have hired/promoted are great visionaries, salesmen, individual contributors, but not great leaders. They do not energize the masses to do their best and get behind a common goal. Google needs more great people managers.",
        "pros": "Excellent benefitsExciting company atmosphere. Who doesn't like working for a company that is frequently in media headlinesIntelligent colleagues you can learn from",
        "summary": "Like most companies, Google has both pros and cons",
        "role": "Anonymous Employee",
        "date": "Oct 8, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "no room for growth as contractor and management made many empty promises",
        "advice": "didn't work close enough with management to provide input here",
        "pros": "I worked here as a technical sourcer on a 1 year contract. Overall, the company is great - not much to complain about when you're getting fed 3 free awesome meals a day + unlimited sushi/smoothie/snacks inbetween. i loved how they allowed you to bring pet dogs to work. love the on site massage, oil changes, author talks, volleyball, etc.",
        "summary": "tons of contractors",
        "role": "Sourcer",
        "date": "Oct 14, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "less opportunity since it is a huge companies now.",
        "advice": "good technical leaders, but terrible inter-personal and management skills many times.",
        "pros": "Good name in your resume, but less opportunity since it is a huge companies now. Further, it is up to the team you are working on and the managers. The management structure is kind of mess. But it is full of tenants who you can learn from.",
        "summary": "good for newbie in the industry",
        "role": "Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lack of Communication from ManagementPromotion/Advancement Process (360 Review plan)Lack of Process for a Company it's sizeLack of training for new managers",
        "advice": "TRAIN YOUR NEW MANAGERS - Some of the super smart & talented engineers are thrusted into management positions with no training - They need to be trained!",
        "pros": "Free FoodPerks (Massages, Onsite Laundry, Dry Cleaning Service)Bonus Plan/CompensationAnnual TripsFlexibility to work from homeWorking with some of the smartest people in technology!!",
        "summary": "Google has a long way to go.....",
        "role": "Senior Technical Recruiter",
        "date": "Jan 6, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "sometimes a bit too much protocol...why do i need to respond to every little nuance when the company promotes austerity",
        "advice": "play like you preach...so much good here, but we need to keep it going by allowing more autonomy including the ability to work from home.",
        "pros": "what can you say...i luv it here...the food, the fun, the smarts, it's a great place to work and one that all my friends want to join",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Jan 11, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Atmosphere is rather impersonal- Hard to fit in if you are further along in your career- Teams very silo'ed and x-team coordination almost impossible- Stock option packages minimal for people starting after 2006.. so not much upside there (though base/pay bonus are good).- Many old timers (pre-2004) still have lots of influence, but are no longer at top of game.",
        "advice": "+ Focus. Despite a very large engineering team, there are so many projects/initiatives, that none are properly staffed to achieve breakthrough. Place fewer, bigger bets and cancel many of the smaller initiatives.+ Clear Out Rest/Vesters. Too many old timers, especially at senior levels, who were rock stars in the early days, but are no longer adding value.",
        "pros": "+ Outstanding, A+ engineering talent+ Founders really push teams to \"think big\" and change the world+ Engineers have great freedom to choose what they work on+ Eng SVP's great.. technically and as leaders.. love them all.+ Great place for recent grads",
        "summary": "Google is great in many, many ways, but has become a big company.",
        "role": "Senior Software Engineer",
        "date": "Jan 30, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "difficult to move to another groupheirarchicalneeds more training for young peoplesecretive senior managementcorporate philanthropyworker benefits",
        "advice": "Try to offer more training courses to young people entering the company. Work on having mentors for young people out of college.",
        "pros": "peoplesenior managmentcareer progressionpayhourslearning curvemarket leaderlots of opportunities to take on more responsibilityfun atmosphereyoung",
        "summary": "great place to work",
        "role": "Analyst",
        "date": "Mar 3, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "business decisions are not transparently shared, the 20% is a misnomer, you dont really get that much time, bias towards profit generating products",
        "advice": "dont be shy to let people talk about things openly. the company has maintained a great workforce, but let them be what they can be. be open to the world too.",
        "pros": "Smart people, great infrastructure, cool products, vision clarity. Overal I was satisfied working in the company. People were always helpful and excited about talking on new things.",
        "summary": "Great people",
        "role": "Anonymous Employee",
        "date": "Mar 10, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The working environment is not very friendly, there is an air of arrogance. The recruiting and HR processes are especially slow and tedious.",
        "advice": "Google focuses on hiring the \"right\" (googley) people, but lately this has degenerated into hiring the smartest people who not necessarily pleasant to work with. Steer the focus back on being Googley, possibly by requiring one non-technical/behavioral interview question, such as \"talk about how you handled a conflict with a particularly difficult coworker?\" The interviewer should then drill into the details of the ex… ample to make sure it was a true story.",
        "pros": "The perks are just amazing. Their health plan is especially very generous. The people are incredibly smart and excited about their projects.",
        "summary": "Excellent Benefits and Perks, Incredibly Smart People",
        "role": "Software Engineer",
        "date": "Mar 15, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "promotion limitations and long hours",
        "advice": "listen to your EEs",
        "pros": "great place to work and co-workers friendly",
        "summary": "google",
        "role": "Software Developer",
        "date": "Mar 26, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "become middle age and some office politics",
        "advice": "less office politics, reward the good person",
        "pros": "good company, nice coworkers, good food",
        "summary": "a good company to work",
        "role": "Anonymous Employee",
        "date": "May 1, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's not a small company anymore and it's easy to feel more like a number than a name. Because the change is so often and rapid, you may find yourself working for someone who did not hire you, which can be an issue.",
        "advice": "Utilize employees for their greatest strengths.",
        "pros": "The people are the best reason to work for Google. Everyone is smart and brings their A game. The team culture is great if that's how you like to work, but tough if not. It's a very collaborative environment. It's filled with smart people who have personality (at least in sales).The food is outrageously good.",
        "summary": "Not such a small company anymore...",
        "role": "Senior Account Executive",
        "date": "May 31, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Too much expectations- Difficult to balance work and personal life.- Expectations too high, instant delivery is expected",
        "advice": "Expectations are too high. Standard set is at a very high level for people. Not everyone is same. Need better management.",
        "pros": "-Challenging work everyday.-Great coworkers.-Great benifits.-Good pay.- Nice brand. You get a chance to change the world!- Its google!",
        "summary": "Great Place (especially if you are single)",
        "role": "Senior Staff Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Committee decisionsvery large companyToo much politics",
        "advice": "Take responsibility.",
        "pros": "Great and smart people to work withGood atmosphereGreat perks",
        "summary": "Google NY",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "* Much of the work is not interesting* Mid-level executive leadership is questionable* \"Death march\" schedules and random priority changes becoming more common* No career path from engineer to having substantive influence over what gets worked on* Too many overqualified people forced into work that's beneath their abilities",
        "advice": "Eric seems to be on the ball, but I'm less impressed by many of our VPs. I feel like I'm being assigned to projects as a lowest-common-denominator coder, because it's too complicated to keep track of what people are good at in an organization this size. I also feel that any insight I might have is basically unwanted and my job is to shut up and write code to support other people's visions. It's not an inherently very…  satisfying job, and I think it's going to become harder for Google to continue to attract top people if something doesn't change.",
        "pros": "* World-class, brilliant coworkers* Excellent benefits and physical environment* Above-average total compensation compared to other local companies* Some groups do very cutting-edge work",
        "summary": "Good company and perqs; work itself is often lacking in substance and satisfaction",
        "role": "Senior Software Engineer",
        "date": "Jul 4, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "the managers from my experience did not know how to manage. they seemed like former engineers that were just given the title. No leadership, guidance, or followup throughout my year there. Also when it came time to convert me to full time, management failed and \"forgot\" to submit my application. Contractors overall seemed pretty unhappy even with all the awesome company perks. It just seemed like there was just some … lack of respect for us.",
        "advice": "train your managers better. it's like the blind leading the blind sometimes over there, hence the \"chaos\" everyone is talking about.",
        "pros": "obvious perks like food, gym, celebrity visits/talks, laundry, dogs on campus, etc",
        "summary": "weak management, no respect for contractors",
        "role": "QA Tester",
        "date": "Jul 8, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Career advancement and promotions are vague. Job titles mean nothing -- you can be doing something someone 2 levels higher is doing, but you won't get paid the same.",
        "advice": "Create better policies around advancement and promotions. Keep people interested by giving them work that matches their strengths and values.",
        "pros": "The people are the best reason to work here. I had yet to meet anyone that I would consider incompetent.",
        "summary": "The highs and lows",
        "role": "Compliance Specialist",
        "date": "Aug 3, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The management was too far removed from our group. They really had no idea what we did or how. And they never asked. The would make power plays against each other that would adversely affect the day to day of the people working below them. There was a very strong feeling of working \"for\" them, Not \"With\" them.",
        "advice": "lose the OKR's. People just write what you want them to and it is ineffective.",
        "pros": "The food was great. The place was fun to work. The people are capable and smart.",
        "summary": "Weird Culture",
        "role": "Video Services Specialist",
        "date": "Aug 16, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The downside is that you'll need to take advantage of all that because you'll be so busy with work. My experience was that doing well at Google took over my life completely while I was there, requiring me to work during the shuttle ride, at work and during lunches, on the shuttle ride home, and most evenings and weekends. When I talked to other folks inside the company, many of them agreed that they had the same expe… rience.",
        "advice": "The company seems to be founded on the idea that if you hire smart people, you can run the company with a bottom-up, siloed strategy, and things will go well. But as the company has grown, a more top-down approach, and one that breaks down product silos, is becoming very important in order to take on major initiatives. I haven't seen the company address this growing need adequately yet.",
        "pros": "Google takes care of almost all of your needs, from computer and ergo equipment to a ride to work, a rental car when you need it for an errand, and tons of free food. They do a great job at trying to remove any worries about life so you can focus on your job.",
        "summary": "Overworked",
        "role": "Developer Advocate",
        "date": "Sep 2, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No opportunity whatsoever towards a permanent position.",
        "advice": "Less maths, more humanity.",
        "pros": "Google has a good reputation, so it looks good on a resume.",
        "summary": "Contractor position. I will recommend it for 6 months.",
        "role": "Data Analyst",
        "date": "Sep 9, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too few opportunities. Engineers can be extremely weird here. I would recommend against this job for another tech company. Direction is vague and erratic.",
        "advice": "Learn to do your jobs better Management is poor and almost powerless. No direction at the company. Most gains seem to be from 'luck'",
        "pros": "Easy work, lots of random cool projects to work on. Get to multitask on tons of projects at the same time. Good location.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Oct 16, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too much work and very weird hours!",
        "advice": "have a good work life balance",
        "pros": "Great company to work for",
        "summary": "Nice position",
        "role": "Software Engineer",
        "date": "Oct 24, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The cons of working at Google are that if you are not an engineer, there is not as much flexibility and creativity allowed.",
        "advice": "My advice to senior management at Google is to expand their teams beyond looking at what school someone attended or what their GPA is.",
        "pros": "Google is a wonderful place to work. New York office is fantastic and I love my team. I encourage everyone to apply.",
        "summary": "Love it",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Needs to be run more tightly and with more focus.",
        "advice": "Spend more time and resources getting new employees oriented and productive.",
        "pros": "Excellent compensation and benefits, including very generous match for charitable donations.",
        "summary": "Google's a great company, but hard to understand",
        "role": "Account Executive",
        "date": "Nov 19, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Can't get anything done, so much red tape. As a Recruiter you are really just a paper shuffler and Hiring managers rule the roost so if they are incompetent then your hands are tied and there is no way to be successful. Huge company politics are in play and it is difficult to figure out who to align yourself with. If a process isn't working there is no way to effect any real change.",
        "advice": "Hire Recruiters who know what they are doing and let them manage the hiring managers. Split recruiting into three levels, paper pushers for junior roles, mid to senior level recruiters and executive recruiters. Recruiters who are working on mid to executive level positions should be of a high caliber and be viewed as consultants who's expertise is needed and respected. Set them up to be successful and provide an ats … system that actually works and make it mandatory to keep data in the system and not on a bunch of spreadsheets.",
        "pros": "Like Disneyland, great food, fun environment, fantastic resources and a shuttle! Overall really great environment to be in.",
        "summary": "Not the place for good recruiters.",
        "role": "Leadership Recruiter",
        "date": "Jan 20, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The working hours are long. The pay is not worth all the time spent at work. Management is not great.",
        "advice": "Less micromanagement and a better review process would be great. Also, consider hiring more people. There's enough money to go around...",
        "pros": "The free food is good.",
        "summary": "It is very tiring",
        "role": "Software Engineer",
        "date": "Feb 27, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Inexperienced middle managers who are where they are because they were strong individual contributors, and not necessarily strong people managers.Becoming more and more political.Lack of autonomy in your job. Decisions, even the most inconsequential, seem to be made by a few people in each department.Few career advancement opportunities.No work/life balance.",
        "advice": "Empower your employees and managers to make more decisions on their own. Allow for more risk taking and autonomy.Hire, promote and value leaders who excel at developing and managing people. Make managing employees a full time job, not something to be done only during review time. Managers who remain hands on end up competing with their own direct reports.",
        "pros": "Brilliant coworkers.Culture promotes continuous learning. There's a famous author, artist or industry leader giving a talk or performance at the company every week.Amazing perks. 50% match in 401k.",
        "summary": "Good company, glad to have worked there",
        "role": "Anonymous Employee",
        "date": "Apr 28, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Slow process from idea to launch, too many hoops to run through.Infrastructure not easily transferable outside of Google.",
        "advice": "More efficient ways to go from ideas to launch.",
        "pros": "Great infrastructure, great technology, great food (bad for keeping fit though).",
        "summary": "Excellent, but Stressful.",
        "role": "Intern",
        "date": "May 12, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Company big on branding human resources w/ employees at the top of the hierarchy, and then contractors , and finally temp workers. Badges identify status with the company. Contractors and temps restricted to only work-site building/zone.",
        "advice": "value people because every contributes to the empire",
        "pros": "free food, gym, perks. big name for recognition.",
        "summary": "factory worker",
        "role": "Associate",
        "date": "May 31, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "It grows to 30,000 employees by the end of 2011. and It starts to show similar problems as the previous big companies.",
        "advice": "They should focus on our main business such as search, ads, mobile and make progress faster. Don't create more intermediate layers in hierarchy.",
        "pros": "I like the technology, culture and perks in Google. I like the fact that Google has many offices all over the world.",
        "summary": "It's good.",
        "role": "Senior Software Engineer",
        "date": "Jun 12, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor Career GrowthPromotion review is dysfunctional",
        "advice": "get real!",
        "pros": "Best Work Life Balance ever seen",
        "summary": "It is a pleasure",
        "role": "Anonymous Employee",
        "date": "Jun 13, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Ok foodDisrespect from program managers",
        "advice": null,
        "pros": "Energy atmosphereHigh expectationsBenefitsPackagePerksGood place to try out once. Though you have to fight for good work and to be recognized.",
        "summary": "Not bad experience",
        "role": "Anonymous Employee",
        "date": "Jun 14, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- A lot of concurrent initiatives, but unsure of status/followthrough/reasons for these initiatives- A sense that we are over-hiring- Commitment to \"dogfooding\" is admirable--but sometimes it's OK to use a non-Google application to manage some of our work.- There is a tendency to promote people who need more seasoning. Managing people is not a perk of promotion, and not everyone can be a manager.",
        "advice": "- Clearer focus. Where are we going? How are we getting there?- Clearer feedback regarding expectations of managers.- Stronger management development program is needed.",
        "pros": "- Perks (cafeterias, massage, wellness programs, commuter shuttles, bowling alley (!) etc. etc.) are amazing- Sharp people- Flexible work environment- Strong teamwork culture",
        "summary": "Lot of Activity - What are we Doing?",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "doesnt seem to be a streamlined process for training new hires",
        "advice": null,
        "pros": "good perks, friendly and laid back atmosphere",
        "summary": "Good experience for a recent grad",
        "role": "Anonymous Employee",
        "date": "Jun 22, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Work may be stressful- Promotion opportunities may be limited- You may start to feel strange: highly-qualified, competent... and just one \"number\" among others- Cramped cubicles- Since about a year ago, switching groups became much more difficult.I've been very happy at Google for the first 2-3 years (see \"Pros\"). The work could be demanding, but that was not bad, since demands were coming f… rom other engineers eager to use my stuff and eager to report any problems, cooperate, etc.However, gradually I started to feel as if the company hires the best and brightest only to put them under a nice, but hard-working manager, whose task is to keep them busy at all times no matter what. That's where most of my work stress eventually started to come from - though maybe it was just my personal \"luck\". I had a feeling that despite creating several successful projects, other achievements and expertise in several areas, I am not officially allowed any time to contemplate what to do next and what may be the best thing for me (and the company). Instead, I just have to generate code and other signs of activity every hour. That was exacerbated by the fact that since summer 2010 engineers lost their privilege to freely switch work groups. You could only go where the upper management thought there is opportunity for the company. Again, that felt like less respect to the very people who, being so bright, are supposed to also sniff where the next useful thing really is.Eventually, I left for a job at a research lab. So far I am compensated less well overall, but I am much, much more happy (for now at least :-))",
        "advice": "Respect engineers - you come from the same background! Give them, at least at certain level and above, more chance to decide themselves what to do (or not to do) and which group to work at. Also think how to improve promotion chances for those who work on less \"sexy\" or well-known projects.",
        "pros": "- Average level of engineers is very high. Not everyone is a superstar, but there are practically no \"dummies\".- Lots of interesting technologies to learn. Many things have been almost a revelation for me.- Management is generally competent and caring, but see below.- High transparency, especially of technology - can easily find and look at any code. Projects are usually well documented, removing unnecess… ary obstacles for learning.- Free food, shuttle rides to work, pretty generous vacation time.",
        "summary": "Great company... but not for life",
        "role": "Senior Software Engineer",
        "date": "Jul 17, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Increasing numbers of middle managers who add no value- Focus on \"shiny\" vs. substantive work - you're more rewarded for style than substance, splashy work gets praise",
        "advice": "Don't hire middle managers who add no value. Unfortunately I see us hiring and rewarding people who spend more time on Powerpoint presentations than actually doing work. Growing pains of a large company or something we can avoid?",
        "pros": "- Exciting work- Can see impact of your work fairly quickly- Accomplished colleagues- Great brand recognition",
        "summary": "Stimulating work environment but becoming more bureaucratic",
        "role": "Senior Product Marketing Manager",
        "date": "Jul 21, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Since the environment is one in which everyone must participate, it is difficult to pull back (e.g. girfriend breakup)",
        "advice": "Overall, you are doing well and provide a good working environment",
        "pros": "It is an evenvironment in which everyone participates and contributes; unlike previous environments that have numerous employees that are just putting in time",
        "summary": "Requires dedication",
        "role": "Anonymous Employee",
        "date": "Aug 8, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Little career growth. Bas Middle management",
        "advice": "Focus on core business and stop investing into peripheral areas.",
        "pros": "Nice perk, good compensation. Love the free food.",
        "summary": "I hate my job at Google",
        "role": "Software Engineer",
        "date": "Aug 31, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Can be hard to transfer to a new project, which can lead to the need to excel at something you don't like in order to earn your way out of it.The opportunities for 20% time are real, but you may not have enough time and energy to make use of them.Management is often hands-off and not necessarily helpful/encouraging. Find peers to encourage and support you.",
        "advice": null,
        "pros": "See your company and maybe your work in the headlines.Work with some of the best and brightest co-workers in the world.Work with applications that millions of people use and enjoy.Great food, good benefits and bonuses.Information exchange inside the company is quite open, making it easy to find out about opportunities.",
        "summary": "Depends on your project and manager; hard to transfer.",
        "role": "Software Engineer III",
        "date": "Sep 23, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Having good management seems to be a non-goal, at least below the highest levels. The only requirements for becoming a manager are having good enough technical skills to reach the correct job level, and expressing interest. Because of this, middle management is extremely hit-or-miss. Employees are often expected to figure out how to grow on their own, with little or no guidance, even for those fresh out of school. Ma… ny managers still have technical responsibilities, and let their people-management responsibilities fall by the wayside.It is unclear so far just how Larry Page taking over as CEO will affect the company as a whole, at least in terms of work environment.",
        "advice": "Continue to be transparent about company direction and motives. When you hire the best and brightest, they don't want to feel like they're being lied to.",
        "pros": "Everybody who's paying attention knows how great the perks are. Between on-site gyms, massage, a wide selection of health benefits, 401k and stock grants, competitive salary, and of course the free, gourmet meals, it's one of the cushiest jobs in Silicon Valley.The technical challenges are interesting, and the code base is enormous. Engineers are encouraged to fix any and all problems, on their own teams or c… ompletely separate projects. There is a lot of freedom to do anything that interests you, as long as you have time.",
        "summary": "Smart people enjoying excellent perks, with extremely spotty management.",
        "role": "Software Engineer II",
        "date": "Oct 9, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "getting very political, a lot of nepotism. Very negative vibe from employees regarding manager competency.",
        "advice": null,
        "pros": "They work hard, but are allowed to play hard. 3 free meals/day + unlimited snacks. Great company sponsored outings!",
        "summary": "Up until 3 years ago amazing. Going public made it far too political, causing many issues with management & leadership",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "24/7 jobno guidanceon your own for growth",
        "advice": "more proactive",
        "pros": "plenty of opportunitiescool technologygood perks",
        "summary": "challenging & fast paced, but a lot of good opportunities",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Tough place to advance if you're not an Engineer or in an office where there are non-engineer (i.e. MTV) opportunities.",
        "advice": null,
        "pros": "Benefits package is outstanding, great visibility into future roadmap and plans. Built and operates as an engineering company with a solid future.",
        "summary": "Amazing place to work... if you're an Engineer that is",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "tough seniorstough worklesser growthsalary could be better",
        "advice": "keep it upmotivate employeespay could be more",
        "pros": "good paygood environmentnice projectsvery beautiful buildingsplush gardensprojects are fascinatingmore-and-more people are getting recruited everyday",
        "summary": "good for work",
        "role": "Human Resources Manager",
        "date": "May 13, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High variance in manager competence, including some managers whose only 'skill' appears to have been being lucky enough to join pre-IPO. From my experience - despite massive amounts of 'data', in the form of Googlegeist, employees reaching out to HR to express concerns, and almost universal team dissatisfaction, some really bad managers are simply not dealt with.Really bloated management structure outside of … Eng, which means that many people are doing work that is below their level of skill, simply because there are so many layers of management above them. Think the company would actually benefit from a higher turnover rate.Bias against any sort of standardization, even though at the current size of the company, some standardization is needed.",
        "advice": null,
        "pros": "TGIF - super exciting stuff going on in the company that you have an inside look at every week.Transparency at the level of the executives. (Note - transparency within your own group depends entirely on your manager/director, and may be completely counter to Google's overall level of transparency)CEO - Larry Page back at the helm has been awesome for the companySmart people, some really good at what they … do",
        "summary": "Great company, your mileage will vary",
        "role": "Program Manager",
        "date": "May 26, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Program Managers fresh out of grad school who pretend like they know the product better than you do will shoot down all your ideas or input regardless of your experience. There is no clear direction or priorities set with specific projects.",
        "advice": "When someone asks you what the priorities or goals are - you should know them.",
        "pros": "Great environment to experiment with different roles and find out what type of field of work you would like to do more.",
        "summary": "Begrudgingly praised, hard to advance without an MBA",
        "role": "Anonymous Employee",
        "date": "Jun 27, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Culture of secrecyThe sense that everyone's expendableNo work/life balance or autonomyImmature and/or inexperienced middle managers",
        "advice": "Google's a big company now and it's become more political. Encourage your employees to share candid feedback on their managers, their jobs, policies and processes. Politics are keeping your employees from taking risks and being innovative.You make a lot of money, so keep doing what you're doing and you'll still be rich. But if you value innovation and creativity, promote diversity of thought, make it a safe place…  to share new ideas and do away with your current recruiting/promotion processes that encourage conformity.",
        "pros": "Smart coworkersThe best perks in the valleyCompetitive pay",
        "summary": "Good to have on your resume",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Shifted strategies a couple times. May have been worthwhile to see how certain ones played out before shifting again.",
        "advice": null,
        "pros": "Artificial Intelligence Scientists were super smart and fun to work with.Learned a ton.",
        "summary": "Great people, dynamic start-up culture.",
        "role": "Bus Dev",
        "date": "Aug 16, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not use of one's talent, not much work to do,",
        "advice": "Please it is good if you are installing so many facilities in your company for your employees but please use them also to their extend",
        "pros": "Free food, Massage centre, heavy facilities.Reputed company.Big company,friendly environment",
        "summary": "Good place to work but not much work to do",
        "role": "Programmer",
        "date": "Aug 26, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Sales org has too many internal processes, structure, best practices... meetings about meetings, politics, ever changing sales org, limited autonomy/flexibility.",
        "advice": null,
        "pros": "Great Perks! Very cool company, name recognition. Pride in working for the good guys. Work with the best and brightest.",
        "summary": "Great Experience...",
        "role": "Senior Account Executive",
        "date": "Oct 17, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Pay is pretty low right niow",
        "advice": "Good job with everyone and outside",
        "pros": "Work environment is so amazing",
        "summary": "I love google so much it is the best",
        "role": "Programmer Analyst",
        "date": "Oct 24, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The ratio of full-time employees to contractors is 1:100 for the Bothell office, There is very little chance at promotion for an astonishing amount of work completed beyond what's required",
        "advice": "Take more time to analyze the qualifications and competency of team members, instead of trusting others, before making a decision of who to promote and who to end contract with.",
        "pros": "Free lunch every work day, game rooms with pool / foosball / ping pong / console gaming, kitchenettes with snack and beverages replenished twice per work day",
        "summary": "Repetitive improvement and fixing of Google Maps in all regions of the world",
        "role": "Visual Data Specialist",
        "date": "Nov 18, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "big and slow, too many silosvery distributed, very hard to tell what is going onclosed, NIH environment and technologyinconsistent and political promotion process",
        "advice": "Fire half of your middle management. Ditch the perf system. Focus again on nurturing and developing your employees, not letting them rot and stagnate.",
        "pros": "excellent paysmart peoplegreat benefits and gadget perksgreat on a resumegreat engineering environment",
        "summary": "Too big and slow",
        "role": "Senior Systems Administrator",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Nothing that happens or has ever happened in software engineering is interesting, relevant, or good unless it happened at Google. Prior experience in barbarian companies is considered irrelevant or harmful. Groupthink and NIH syndrome lead to some daft decisions that are considered holy and irrevocable within the company.",
        "advice": "Stop trying to be Facebook.",
        "pros": "Salary and benefits are some of the best around. Most departments respect work/life balance. Internal mobility is good. Overall skill level of peers is very high.",
        "summary": "Good for new grads",
        "role": "Software Engineer",
        "date": "Jan 7, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Low pay- Slow professional growth- Large company with heavy bureaucratic tendencies",
        "advice": "- Understand your reportees' work- Help your reportees with professional growth",
        "pros": "- Exciting work/work environment- Exposed to cutting edge technology- Interaction with world class engineers- Great connections within the industry",
        "summary": "Program Manager I",
        "role": "Program Manager",
        "date": "Jan 31, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Managers are too busy to give feedback (only once a month). They are not on the same page with the lead and it's quite confusing what they're looking for sometimes.- They don't really put you in a team that matches your experience/interest. You can get stuck in a team for at least a year when you start working there- Extremely high workload",
        "advice": null,
        "pros": "free food; smart people; overall interesting projects; flexible work hours (still long hours)The benefits and salary is very good but comparing to how much you end up working is not that lucrative;",
        "summary": "Good & bad",
        "role": "Software Engineer",
        "date": "Jan 31, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "lousy commuteexpensive renthigh cost of livingbad life style choices by peersabrasive managers",
        "advice": "give more bonus and less advice",
        "pros": "young work crowdhappy atmospherelike minded peopleaggressive mentalitychance to make it really big",
        "summary": "pays bills",
        "role": "Anonymous Employee",
        "date": "Feb 26, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too crowded for traffic and work / life around",
        "advice": null,
        "pros": "good at most of time",
        "summary": "good at most of time",
        "role": "Software Engineer",
        "date": "Mar 8, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not much to say about cons",
        "advice": null,
        "pros": "Good intern program. Nice people.",
        "summary": "Good experience",
        "role": "Anonymous Employee",
        "date": "Mar 20, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "I used to love this company and thought we contributed a great deal to help the industry and society, and that we could do no harm. Unfortunately, I don't believe this about the company anymore, and I have recently lost a great deal of confidence in the current leadership team. The company has recently become run much more top down than the bottoms up nature of the years past.",
        "advice": "I think the current leadership is causing significant harm to the company to advance Google+ in a flawed way. I think both Google and Google+ would both do better without the current leadership's undermining of other company priorities and products to increase traffic to G+. Users are being harmed, trust is being broken, and goodwill lost. The CEO and leadership team is also taking the idea of more wood behind fewer … arrows to an unnecessarily unhealthy extreme in my opinion.",
        "pros": "A great company with a great history that still allows you to make contributions that can have significant impact. Awesome work culture.",
        "summary": "Great company, great peers, but disappointed in current leadership and company direction.",
        "role": "Software Engineer",
        "date": "Mar 25, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no training, place you on a team without consulation, not much control of your career, manager driven. if manage is not competent of does not like you things are very bad",
        "advice": null,
        "pros": "salary, benefit, google van, technology",
        "summary": "good job if you have a good manager",
        "role": "Senior Software Engineer",
        "date": "Mar 28, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "I've since left Google; many of my early-day colleagues have moved to more nimble environments where the work has a deeper impact. The company has gotten very \"heavy\" with many layers of experts, all who bring the complexity they developed from other world-class companies they have worked in. A close friend told me \"there are other companies out there who ARE what Google USED TO BE\" which is to say, very lean and int… imate. I love the startup mentality and the opportunity to make huge moves with everything you work on. Google is like a very large ship now; many oars must move in order to effect a turn or feel the ship shift slightly in direction.",
        "advice": "If you are bringing your \"best practices\" from your previous org, and implementing them just to prove your value to the company, STOP NOW. Get on the front line; the company was best when it was \"flat\" which is to say, everyone was a builder and not simply administrative. When I started, I was one person removed from the VP of my group (who is now the \"Global VP\"). When I left there were SEVEN levels of positions bet… ween us. I can say, they were not all necessary.",
        "pros": "I began at Google pre-IPO so my experience is based on the way the company evolved over time from a smallish company of less than 600 employees, to the tens of thousands that work there today. Google is, as expected, an incredible place to work. Your colleagues will be brilliant and the work environment is world-class. The projects are interesting and there is the constant state of wonder you will get when seeing wor… k you completed actually deployed, and used, by people all over the world. On top of that, the company allows for incredible personal development, both professionally and with regards to non-work related interests. Guest speakers and lectures have ranged from celebrity visitors, to heads of state, to famous bloggers with specific domain expertise like \"The Strobist\" whose blog is followed by the photography cognoscenti.",
        "summary": "No longer a startup mentality",
        "role": "Product Marketing",
        "date": "Mar 29, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Little career progression. The company likes to think they are flat but in reality they have deep hierarchical leves (There were 10 people between me and the CEO) but there is no clear way to become manager and each manager manages 12 or more people.- Sales is an afterthought completely. The engineers are rightfully the stars but for the sales people the salaries are half what you can earn in other places.-…  In spite that they say otherwise, pedigree counts a lot. Top salesman globally with no brand name makes half (counting comission, bonuses, stock, etc.) of what another salesman makes as base salary and comes from the \"right\" (Ivy league, big names on resume) background.- If you are not in the right group your day to day work is boring and mundane.- Low engagement of people with their jobs (in the sales org). That makes for very uninteresting meal chats about ski trips and vegas conventions.",
        "advice": "Have pride on your sales force. After all they make the money that allow the great engineers to make the great products that are changing the world.",
        "pros": "- Great, great perks. They really make you feel taken care of as an employee and as a person.- Great pride when you realize how the company is changing the world in a positive way and you are part of it.- Really nice people with not many big egos.",
        "summary": "Great for stability. Bad if you have ambitions.",
        "role": "Inside Sales Representative",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "arbitrary product roadmaps outside the search/ads world",
        "advice": "Don't be so capricious",
        "pros": "awesome perks and decent compensation",
        "summary": "great company, immature management- strong 'one horse pony\"",
        "role": "Anonymous Employee",
        "date": "Apr 5, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's a religion & a cult of youth. If you're not a 20-something, you'll feel out of place. If you've got any grey hair, you're DOA.",
        "advice": null,
        "pros": "Profitable, pays well, great benefits.",
        "summary": "Gotta drink the coolaid and be young",
        "role": "Anonymous Employee",
        "date": "Apr 12, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There are no cons here",
        "advice": null,
        "pros": "Great company to work for",
        "summary": "Google",
        "role": "Anonymous Employee",
        "date": "Apr 20, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "For experienced workers, mostly people are looking for greater challenge, more $$$,$$$ and moving up the ladder. This seldom occurs!",
        "advice": "Please listen to middle level or experienced employees. They are not looking for Pizza or Brownies or Pool Tables.",
        "pros": "Great company to work for fresh Graduates who just passed out or people who are looking for entry level jobs.",
        "summary": "Good for Starters, Not for Main Course",
        "role": "Database Administrator",
        "date": "May 7, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Horrible management. They are pretty much clueless.",
        "advice": null,
        "pros": "Awesome people to work with. Good environment.",
        "summary": "Tech Support - Google Apps",
        "role": "Anonymous Employee",
        "date": "May 27, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Watch out if your company is acquired...Layoffs",
        "advice": "No advice",
        "pros": "Solid management team, good pay, great benefits and perks.",
        "summary": "Great place to work. Watch out if your company is acquired...Layoffs",
        "role": "New Business Development Lead",
        "date": "May 29, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "people. i am an engineer but i like having diversity and not 99% nerds around me 24/7.",
        "advice": null,
        "pros": "free food... free food. free",
        "summary": "no structure, this is the wild west.",
        "role": "Software Developer",
        "date": "May 31, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Needs help with upper management. notice the little fish. big ideas, etc. corporate.",
        "advice": null,
        "pros": "fun experience, it was a blast, golden, a lot of work. work hard, play harder.",
        "summary": "it was good.",
        "role": "Anonymous Employee",
        "date": "Jul 9, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Overworked- Management can be a nightmare to work with",
        "advice": "Listen to employees and offer support to grow.",
        "pros": "- Benefits- Great people- Exposed to awesome ideas",
        "summary": "Engineering",
        "role": "Software Engineer",
        "date": "Jul 16, 2013",
        "is_current": true
    }
]