[
    {
        "rating": 4,
        "cons": "Challenging business environment and low understanding of our services in the marketplace. Distributed workforce can sometimes require focus to ensure accomplishments are communicated and understood by those who need to know. Global roles can require bi-modal days (calls in early morning or later in evening).",
        "advice": "More clear communication to marketplace about the services we offer clients and the people/skills we need to help.",
        "pros": "Challenging roles, smart people and fast pace of change. Opportunity to do almost anything you are able. Very flexible work environment and employees are treated like adults. Just get the work done.",
        "summary": "Great opportunities if you are up to the challenge",
        "role": "Strategy Programs Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Global resourcing is leading to feelings of low job security for US employees.",
        "advice": "The trend toward global resourcing, combined with the lack of pay increases for most IGS employees this year, is beginning to cause valuable US employees to feel that their value to the company is not being recognized and that their jobs may not be secure. Recently, some of the best employees in my area have left IGS for positions that have greater potential for growth and recognition.",
        "pros": "Excellent work-life balance; many employees are able to work from home.",
        "summary": "Excellent work-life balance; low job stability.",
        "role": "Advisory IT Specialist",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hard to advance career (even when you really try hard) and LOTS of red tape to go through to get anything done. I always tell people working at IBM is 90% filling out forms / 10% doing actual technical work. IBM needs to start caring about employees again and we will care about the company. Until then, we will be unproductive.",
        "advice": "Cut the red tape, start caring about employees again and we will care about the company. Until then, we will be unproductive.",
        "pros": "Working at home. Make 95K sitting home, eating chips, and checking your email every 2 hours. Another good reason is that IBM looks good on your resume. Finally, you get really good at dealing with politics and difficult angry people (who are this way because they are stressed from being overworked and forced to achieve unrealistic goals.)",
        "summary": "Make 95K sitting home, eating chips, and checking your email every 2 hours!",
        "role": "Systems Specialist",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It is a HUGE company and it is easy to lose sight of what it is you are trying to accomplish in your projects. IBM jobs in the US are pretty specialized so you often have to talk to many people in order to get something done. This can be very frustrating but I suppose this is the same for most large corporations. Pay increments are very small, compared to what I've heard about our competitors, I think our increments … are pathetic. While the ability to work from home is a plus for me, it is also easy to become isolated. If one is new to the company, that can be very hard.",
        "advice": "Cost cutting through outsourcing is often penny wise but pound foolish...",
        "pros": "First of all I am only talking about the group that I work in. It used to be called the Market Intelligence group but is now renamed to Market Insights to better recognize the fact that we are generating insights about the market and not just information. I feel that the best reason to work for my group in IBM is the flexibility of being able to work from home. My teammates are located all over the US and in fact, al… l over the world. We are measured by what we produce and not by our physical presence. While sometimes there is no substitute for face to face contacts, by and large we are able to accomplish what we need through email, instant msging and phone calls.Another good reason is the many job opportunities in IBM - I can change jobs and not have to change companies. This means I can keep learning new skills without having to renegotiate a new corporate culture.",
        "summary": "Senior Market Analyst at IBM",
        "role": "Senior Segment Analyst",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I did not like the huge bureacracy that came with a large company. Lots of red tape and also lots of politics. The waves of layoffs I experienced (even though I was not affected) was demoralising, but I guess it's the general economic situation at that time. And being large and old, there are a lot of deadwoods around, people that dont do much work but draw a high pay. Paywise, it was alright but not great. Bonuses w… ere neglible.",
        "advice": "Don't forget the things that made IBM great - don't forget the people.",
        "pros": "The pride of working for Big Blue, recognition everywhere. It opens doors for me if I want to move on to something else. Great worklife balance and understanding managers. I am allowed freely take time off when I need to, no questions asked. I also get to work with some really brillant people (and of course, some pretty dim ones too) in the cutting edge of technology. There are also a lot of opportunities to move acr… oss jobs and functions, which is great because you get to try out different jobs without losing seniority. There is also a very good training structure where you can easily take courses you are interested in.",
        "summary": "Great company with some flaws",
        "role": "Advisory Project Manager",
        "date": "Aug 20, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Because of the benefits, the cash compensation tends to lag behind some of its competitors.One of the downsides to the flexibility and the remote teams is that it can take longer to develop the type of comradeship that teams who work face-to-face have.",
        "advice": "More recognition (monetary and or stock) would be nice.",
        "pros": "The benefits. In the US they appear to be fairly complete and seem to exceed those offered elsewhere. There is also a great deal of flexibility in the physical work location that individuals can work from. I have an employee who works for me in Asia Pacific, several in RTP, others in Florida, Massachusetts and Ohio. This is a key benefit.",
        "summary": "Big place but it takes care of its people",
        "role": "Manager, Marketing (Leads Team of People)",
        "date": "Aug 21, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's not really a downside of working at IBM in particular, but corporate America in general. All large corporations tend to micromanage and plan for future contracts poorly, letting the lower rungs of support staff deal with the problems created due to poor planning and incompetent project managers, etc.",
        "advice": "Please don't try to take on more than we can handle.",
        "pros": "Great for someone that wants to get their foot in the door at a young age and possibly embark on a career path. Being one of the largest technologies company in the world means good benefits, ample vacation time, and if you choose to ever leave, IBM looks great on a resume.",
        "summary": "Once you're in, you're in...Unless you really screw things up.",
        "role": "Remote Support Focal",
        "date": "Aug 22, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very Large organization - easy to get lost in the crowd. Sometimes hard to see the big picture.",
        "advice": "IBM has a lot of great opportunities for it's employees, It would be nice if Senior management made it easier to find and take advantage of these. Doing so would likely help the company and the employees both in the long run.",
        "pros": "Experience with large clients and leading technologies",
        "summary": "IBM offers great experience for those who are comfortable in larger organization",
        "role": "Senior IT Specialist",
        "date": "Aug 22, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes there are too many processes which can hinder work from getting done. Not very agile when it comes to development.",
        "advice": "While I do believe they are working on this, senior management could do more about promoting and encouraging innovation, rather than seemingly just trying to \"keep up\" with competitors.",
        "pros": "Excellent work/life balance (ie. working from home flexibility, support for varying schedules, no ridiculous hours)",
        "summary": "Content but not passionate about working at IBM",
        "role": "Staff Software Engineer",
        "date": "Aug 26, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too much beurocracy, slow to move on new ideas especially in the software market, at most times playing catch up with the industry, too rigid with rules and regulations at times",
        "advice": "give more emphasis to career development and understanding the strengths and weaknesses of individuals, find better avenues to bring new ideas to market quickly, increase breath of technical knowledge in the senior management",
        "pros": "Work life balance, respect for different cultures, exposure to cutting edge technology, great benefit and retirement plans",
        "summary": "Great place to learn about the information technology business...",
        "role": "Advisory Software Engineer",
        "date": "Aug 26, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Large, rigid corporation. People don't leave often so opportunities for advancement come much slower than in smaller organizations.",
        "advice": "Quit wasting Billions buying back stock and keep salaries pacing inflation, last year you spend 20x the money buying back stock while employees lagged inflation. Demand more from employees in exchange for keeping up with inflation. In the short term keeping salaries low works but long term your employees start to focus on side jobs to maintain thier quality of life.",
        "pros": "Work/Life balance. A large portion of IBM works from home and flexibility is part of the culture as long as goals are met.",
        "summary": "A great work/life balance",
        "role": "Senior IT Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Currently, IBM has too much management and has reversed the changes made by Sam Palmisano's predecessor. Therefore, there are too many chiefs and not enough indians. The career planning / mentoring at IBM is pure marketing hype and has no true value.",
        "advice": "Reduce the amount of management and invest more $$ in valuable technical resources and R&D.",
        "pros": "IBM is an extremely large company that has a variety of job opportunities. Many positions at IBM enable you to work from home when not at a client/customer.",
        "summary": "IBM is a great place to work.",
        "role": "Consulting IT Specialist",
        "date": "Sep 3, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Salary is not equalized quick enough to match peers salary or band level, can take several years if ever. The diversity push is holding back the careers and exposing to termination thoes in the majority. Performance should be the only deciding factor for career and layoffs.",
        "advice": "Create a better funded program to equalize the salarys and band levels of the employees in the same capacities. Provide same opportunities for career advancement for thoes that are not part of the minority",
        "pros": "Family type of environment, Great benefits, respect for individual, flexible on work/life balance, and sick time off. Diversity is emphasized.",
        "summary": "IBM is a great place to work",
        "role": "Sales Specialist",
        "date": "Sep 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Job stability is an issue, morale is often low. Management maintains a very sharp focus on cost take out, sometimes doing things that don't make long term sense in their eagerness to chase a good quarter or to achieve their targets. Investment in services is very low compared to the revenue, and I don't always get the sense that IBM is really building for the future. Your career won't happen to you at IBM, you've def… initely got to push for it yourself.",
        "advice": "Focus on more than just cost take out",
        "pros": "Global reach, insights from lots of clients, access to new technology, excellent opportunities to learn. Working in IBM you have a lot of freedom - you can build your own career and there are a great many resources you can call on. The support for mentoring is very good, and the educational opportunities are pretty outstanding. There's good opportunity to make more money by filing patents, and really oustanding suppo… rt for developing new technologies even outside the day job.",
        "summary": "Great opportunity in a sometimes tough environment",
        "role": "IT Architect",
        "date": "Sep 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Middle management cannot and does not take risks. Managers do not position their employees for success. The finance organization and business controls prohibits many operational desires.",
        "advice": "Look at how your middle managers - partners, VP's and directors operate. Get on some of their calls/meetings without them knowing and on a regular basis and listen to what they and how they act. Listen to the marketplace as articulated by your sales teams. Press on delivery to step up while taking risks.",
        "pros": "Many places to work within IBM. Building a strong network helps getting promoted and understanding IBM capabilities.",
        "summary": "10 year IBM vet, tells you how it really is within IBM.",
        "role": "Business Development Executive",
        "date": "Sep 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "huge company, too slow, old-style management",
        "advice": "Transformation of the HR culture, need to pay attention to the workforce, rewards, more career advance opportunities",
        "pros": "Name recognition, travel, networking, ability to make decisions within my own area of expertise",
        "summary": "Constant leadership",
        "role": "Communications Manager",
        "date": "Sep 5, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too bighard to advanceYou can also expect to read a new feature each day, written by several and staff members who will be on",
        "advice": "keep it up",
        "pros": "Nationally recognizedadvancementjob securityI feel that the most important contributions I would like to see are related to building both the product and the company through direct contributions to vision, strategy, and design. As it grow, the role of our CEO will increasingly be to hire and grow the right team - to lead and help the company scale - to thousands of people and tens of millions of users of.…",
        "summary": "IBM employee review",
        "role": "Test Engineer",
        "date": "Sep 5, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Utilization and sales are key drivers and focus can be on those instead of on the individuals. The work life balance can be very challenging at times.",
        "advice": "Stress levels can get to be too high. We understand working hard is important, but one individual can only give so much.",
        "pros": "There is flexibility in the job and can work from at least some of the time on most projects.",
        "summary": "Overall - smart and solid performers at this company.",
        "role": "Anonymous Employee",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lower salaries compared to other companies",
        "advice": "Get along with other divisions within IBM; treat your employees as you would want to be treated and dont worry so much what Wall St thinks of IBM",
        "pros": "Flexible work conditions--time-off, ability to work from home if necessary, other jobs available within the company",
        "summary": "IBM is great for flexible work conditions but you sacrifice on the salary side",
        "role": "Financial Analyst",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The same as for any large corporation... bureaucracy, lack of individual identity. It can be frustrating, as it can be for our clients, to navigate through the maze to connect with the appropriate person.",
        "advice": "Continue to work towards real performance based pay.",
        "pros": "The great breadth of the corporation allows for great flexibility in choosing from a wide variety jobs and locations to work.I think that as far as large companies go, I think that IBM tries to be a good corporate citizen. There is so much creativity and innovation occurring in research and development and I feel that permeates in some way thoughout the corporation. It is definitely not your father's IBM.",
        "summary": "Solid company with lots of opportunities",
        "role": "Systems Support Representative",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Consulting offerings are somewhat ill-defined, paths to advancement also not well defined. I work in the Intelligence Community and our presence here is limited. We cannot compete with companies like Booz Allen for the bigger projects. We often have to work as subs to other consulting firms.",
        "advice": "Better define consulting offerings, increase presence in the Intelligence Community, hire more people with security clearances",
        "pros": "Great work life balance (I have 2 young children at home, and I have all the flexibility I need to deal with the typical toddler/infant issues), varied experiences, great management team, IBM legacy of innovation, the pay is pretty solid, most of the people are great to work with, great reach back to some of the best technical minds in the industry",
        "summary": "Good work/life balance, not always the most exciting work",
        "role": "Managing Consultant",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of organization and communication. Number of jobs outsourced overseas. Perpetual bureaucratic and budgetary restrictions. The \"family\" appeal of the \"old\" IBM if virtually non-existent any longer.",
        "advice": "Need improvements related to communication with staff and exhibit a more proactive leadership style.",
        "pros": "Work at home & schedule flexibility, breadth of opportunities if willing to work remote or relocate.",
        "summary": "Great place to work for many people, but probably not for others...",
        "role": "Advisory Software Engineer",
        "date": "Sep 8, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As might be expected for a company the size of IBM (390,000 employees at last count), there is a large amount of bureaucracy and bureaucratic thinking. Often the bureaucracy can create barriers to innovation, which leads to stagnant product releases. Upper management is very focused on hitting short to medium term financial goals, which although positive in many ways (challenging employees to think creatively) also l… eads to making some business decisions that are good in the short term but not in the long term. Basically, IBM's sheer size is both its greatest asset and the greatest challenge faced by prospective employees.",
        "advice": "Take more risks, shake things up to ensure that employees do not simply take the path of least resistance, challenge R&D to create breakthrough technologies, then push development hard to adopt them (or create their own).",
        "pros": "IBM poses challenging problems to its employees and you get to work with smart colleagues to solve the problems. The pay and benefits are good. The company seems serious about balancing work and family time, although like any high tech company, there are times when the job can become all-consuming. The sheer size and aggregate capabilities of IBM's employee base is staggering... when they are applied effectively. Few…  companies can attack problems of the scale that IBM can. Several times in its history, IBM has re-invented itself to adapt to changing business and technical circumstances. Overall, it seems like a good place to work.",
        "summary": "Challenging problems and smart colleagues",
        "role": "Research Staff Member",
        "date": "Sep 8, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Senior management is detached from employee feedback. Job satisfaction largely depends on the quality of your first-line manager. My direct manager is particularly good at recognizing employee contributions, but I rarely see that extend beyond his level.",
        "advice": "Listen to lower-level employee requests and do more to improve morale.",
        "pros": "Industry-leading technology. Good benefits and stable work environment (mainly because it's a large company). Very flexible about work schedules as long as work is completed. Good balance of work and personal life. Solid multi-site communication.",
        "summary": "Good solid company to work for, but suffers from characteristic large corporation management.",
        "role": "Physical Design Engineer",
        "date": "Sep 9, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The transparency and fluidity of communication is sometimes lacking. The organizational structure is matrixed which leaves room for ambiguity on who is in charge and what needs to be done as far as who is responsible for tasks. Alot of times people pass the buck to others when trying to get to the bottom of a solution which leads to inefficiencies and somtimes leads to going in circles when trying to get to the botto… m of a problem. Another disadvantage of this organizational structure is that sometimes when working with other IBMers it is difficult to work with them because they are only looking out for their own self interests. A competetive atmosphere is also a catylist to anti teaming.",
        "advice": "I would suggest that team building needs to be worked on. The fact is that some of the people that you need to deal with on a day to day basis do not care about anything but themselves which makes it difficult to work together. There is often a combative ambiance when it comes to communicating with other employees. If IBM could stress that IBM employees are on one team and need to work together to get to a common goa… l it would serve to improve the culture in leaps and bounds.",
        "pros": "The best reasons to work at IBM is the fact that they are very flexible when it comes to work/life balance. There is a culture that allows for employee recognition. There are company events that IBM pays for like BBQs and company outings to sporting events. Also they have a new hire network that helps those who are in their first 2 years with the company. That program offers outings to movies with discounted prices f… or tickets and popcorn and also there are other outings to local resaurants that offer appitizers and drinks on IBMs tab. There are opportunities to engage in improvements and change is usually openly accepted.",
        "summary": "Work Life Balance in a Matrixed Organization",
        "role": "Financial Analyst",
        "date": "Sep 11, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company, easy to get lost in shuffle.. too many people who are riding their careers out and have lost real skills.",
        "advice": "I think Sr management should really look at the role of sales and distribution. There seem to be so many resources, and few have strong content and value. The brand specifics resources seems to be the gold in the company.",
        "pros": "IBM has a trememdous Brand, Global presence, and can provide great opportunities around the world. I do think the senior executive team is quite strong (despite wat many might say)",
        "summary": "It's all about you make of it..",
        "role": "Project Manager",
        "date": "Sep 14, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There are some incompetents at IBM, who are very hard to get rid of, and very frustrating to work with. It's hit or miss when management addresses performance issues with these types of employees. Formal training is lacking in my job category. You are expected to find time to complete the computer-based training while you are more than 100% utilized on your project(s). Promotion criteria is nebulous, and not communic… ated well. There are so many \"corporate procedures\" to follow that you get lost with what's truly important while you are trying to do your day-to-day work.",
        "advice": "More individual focus on employees. People in the field seem to be forgotten if they're not working in the local area (which is the majority of the time).",
        "pros": "Wide range of experience in different industries. Opportunity to work with some very talented and diverse people. My experience has been that there is some slow time at the end of projects that you can take advantage of after a grueling project (but not always).",
        "summary": "Diverse Project Opportunities / Training and Promotion Lacking",
        "role": "Advisory Project Manager",
        "date": "Sep 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Global exposure can often mean regular 12 hour days. Complexity of business environment (matrixed organization) can mean lack of clear direction and focus, leading to a consistent sense of being overwhelmed. Despite all the focus on communication from top leadership, due to the complex nature of the business one will find often competing goals and objectives within the organization, so an understanding of the ambiguo… us operating environment can either frustrate or foment, depending on the individual response. The long days can become overwhelming, so the employee needs to know when they should turn off the Blackberry/ThinkPad -- IBM will take all that you can give them.",
        "advice": "Establish more crisp, clear objectives and account for support of those through the line. Also, more constructive feedback and recognition to those leading performers.",
        "pros": "Environment of constant change and complexity, particularly due to IBM's global focus. Good management with opportunities for advancement. Also, increasing flexibility in work location (telecommuting, etc.) Work projects are often very challenging, so being bored is never an option. On the other hand, getting major initiatives supported and off the ground can take a seeming act of God, so patience and persistence is … not only a virtue, it's absolutely required. Leadership often provides good communication from the top down, particularly as IBM embraces the social media to get the messages out to an increasingly distributed troops. But individual initiative is still key for personal growth.",
        "summary": "IBM: Lots of Opportunity, Lots of Exposure to the Flat Earth, Lots of Hours",
        "role": "Marketing Manager",
        "date": "Sep 28, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The compensation and benefits were somewhat unbalanced compared to my job scope, work load and responsibilities. I had to often clock overtime due to the high workload but the compensation and benefits did not seem to make up for it. My manager explained this due to a temporary shortage of staff, but there really was not anyone employed to come here to help me out with the workload. While the pay was somewhat decent,…  I just felt I could have gotten the same pay in a similar role in a competitor's company, with a more humane workload and a more balanced lifestyle.",
        "advice": "To higher more staff when needed and not just think of back-end staff as a cost centre. Although we do not bring in any sales, we do generate the output that is needed to sustain the company.",
        "pros": "They had good career opportunities and good careers advancements. There were career opportunities and career tracks and my manager allowed me the chance to make internal switches to other departments as and when opportunities arose. They also had clear distinct reporting structures so it was easy to directly speak with whoever I needed to, and was unencumbered by complicated layers of organisation. It was a very flat…  organisation structure, so to speak. Co-workers also similarly were co-operative and easy to get along as everyone understood that we were there to get the job done. It was easy working with them.",
        "summary": "Work-heavy experience",
        "role": "Systems Administration",
        "date": "Sep 29, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The company is so enormous that getting noticed is extremely difficult. Furthermore, even if you are a top performer, you are overlooked, underpaid, and underutilized.",
        "advice": "Don't be complacent letting your employees go through the motions without rewarding them or showing them that you care whether or not they work for you. Reward the top performers and show them that they are valued so they will want to prolong a career at IBM.",
        "pros": "Having experience at a big name company such as IBM, is a great resume builder. For college hires, it is a fantastic place to \"learn the ropes\" within the consulting world.",
        "summary": "Great place to gain experience, but top performers will not be \"lifers.\"",
        "role": "Senior Consultant",
        "date": "Sep 30, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The company is so enormous that getting noticed is extremely difficult. Furthermore, even if you are a top performer, you are overlooked, underpaid, and underutilized.",
        "advice": "Don't be complacent letting your employees go through the motions without rewarding them or showing them that you care whether or not they work for you. Reward the top performers and show them that they are valued so they will want to prolong a career at IBM.",
        "pros": "Having experience at a big name company such as IBM, is a great resume builder. For college hires, it is a fantastic place to \"learn the ropes\" within the consulting world.",
        "summary": "Great place to gain experience, but top performers will not be \"lifers.\"",
        "role": "Senior Consultant",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Poor bonus and salary increasesIncompetent middle management and employeesSales, not technology driven culture",
        "advice": "IBM is a place where people go to work before retirement.",
        "pros": "Can't get a job elsewhereFlexible work form home optionsMinority advancement opportunities",
        "summary": "IBM isn't a great place to work",
        "role": "Advisory Software Engineer",
        "date": "Sep 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "At IBM, as in hardware companies in general, we are being asked to make more and more complex products with less and less resources/people (due to computers (vs. cars, milk, and most other products) becoming cheaper with each passing year). Technical leaders are not promoted as often or as high as managers, in most areas.",
        "advice": "Value your technical people, not just the ones presenting the results to you.",
        "pros": "There are smart, technical, helpful, and hard-working engineers working on cool, challenging assignments. An open environment to try out new ideas and methods all in the name of getting the latest products out on time. Good team atmosphere. Good pcs and technology. Flexible with working from home.",
        "summary": "Big Blue",
        "role": "Hardware Engineer",
        "date": "Oct 2, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "very large, too bureaucratic, managers with poor people skills. There are a good number of managers who are out to benefit themselves and no one else. They get bonuses based on their staff utilization and meeting numbers. Many IBM employees are just numbers to the staff. Its all about who your manager is at IBM. Bad manager = bad experience. Good manager = good experience.",
        "advice": "Large amount of technical staff without people management skills",
        "pros": "resume builder, experience, ability to learn from others. The benefits are very good, hands down. The 401k match is the best in the consulting industry. You will be able to learn a great deal in a very short time frame",
        "summary": "Great for resume building",
        "role": "Consultant",
        "date": "Oct 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The only downside is that if IBM does offer me a position it will not be outside my co-op area. I wish I would apply for other positions else where in the company internally. The only downside so far.",
        "advice": "My manager and my managers manager are both very supportive and very helpful. They really know their subjects well and they allow me to concentrate on my course work as well.",
        "pros": "I am currently at IBM STG co-op. IBM has given me the opportunities to explore the possibilities available to me at IBM. I work with very knowledge people and the work environment is very dynamic and supportive. I am comfortable, and I learn a lot about subjects that one cannot learn in school--which is the most valuable type of experience needed. I am given responsibilities that affect the company going forward, and…  IBM empowers me to do my best by giving me all the tools I need to succeed.",
        "summary": "IBM is a good place to work as a co-op.",
        "role": "IBM STG Co-Op",
        "date": "Oct 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Huge technology services firm, and so you are rated with EVERYONE at your level. Plus, the pay slowly matriculates upward. The bonuses are fair, but I'd like to have more pay and not worry about looking elsewhere.",
        "advice": "Share the wealth. I'd like to see it become another Google--where employees are lining up at the door trying to get in.",
        "pros": "Brand recognition, and instant credibility on engagements. Also, the company has a world-wide presence. Thus, you could be tapped to go on an international engagement; or, you could lead a data recovery team in the Gulf states. The place has a lot of opportunties.",
        "summary": "A great place for consultancy with an abundance of resources at your disposal.",
        "role": "Senior Consultant",
        "date": "Oct 5, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Software is not important. Hardware always takes priority.Very bureaucratic and slow paced company",
        "advice": "Don't give us the runaround. No need to talk in all the fancy but empty marketing terms",
        "pros": "If you want to work on hardware",
        "summary": "Make sure you know what your goals are . Don't just take the job 'cause it's IBM",
        "role": "Staff Software Engineer",
        "date": "Oct 9, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No one looks out for you if you spend too much time at work, so it's easy to get into an 11 hr/day routine.",
        "advice": "Spend more time developing processes for customers and employees to follow, rather than devoting key technical people to favored accounts.",
        "pros": "There are many opportunities to determine your job scope and direction. The management culture is all about fairness almost to a fault. The same is true about respect for employees; emotional outbursts, when they occur, are frowned upon, and the people are counciled in private.",
        "summary": "IBM is still a great place to work.",
        "role": "Senior Engineer",
        "date": "Oct 11, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Compensation is below industry although it is said that we are competitive.",
        "advice": "Review compensation policies and make sure to reward your top performers accordingly. We lose very talented people because of frustration regarding salaries and bonuses.",
        "pros": "People - One of the most enjoyable aspects of working at IBM is the people. Very talented, smart, motivated, and friendly people.Challenging Environment - With clients all over the Fortune 500, you can rest assured tat you will be engaged solving business problems and devising solutions on every engagement.Knowledge Sharing Tools - IBM has made a huge effort in implementing internal knowledge sharing tools th… at are top-notch and allow you to find the information you need and learn from what other have done in the organization. The latest web 2.0 emphasis is remarkable!Available informationBenefits",
        "summary": "IBM Global Business Services -- Great place to work - need better comp plan",
        "role": "Senior Managing Consultant",
        "date": "Oct 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As a Sales person, quota-setting and the often changing sales compensation programs are severe demotivators.",
        "advice": "Establish realistic revenue targets and simplify the sales compensation matrix. You shouldn't need a PhD in Operations Research to know how much make for making your quota.",
        "pros": "You work with very competent people. Ocassionally, you find someone who thinks \"outside of the box\".",
        "summary": "Best Products, Excellent R&D, Strong Customer Base, Great Work-Life Balance, Company-induced Sales Mediocrity",
        "role": "Client Executive",
        "date": "Oct 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Overly complex processes, too many internal meetings and micro-management. Business units do not work well together. Hard to do business with. Salary growth is limited.",
        "advice": "Pay for top talent. Re-invest in Field Sales and Field Engineers.",
        "pros": "Work life balance. Significant R&D investment. Career growth is encouraged.",
        "summary": "IBM Sales",
        "role": "Sales Representative",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "IBM is not known for high salaries. It rarely gives raises to employees. It is very difficult to move up or change departments or get bonuses. they also have many review processes that do no directly relate to the raises or bonuses",
        "advice": "i have not encountered senior management during my work",
        "pros": "IBM has been around for many years, and it is one of the most realiable and stable companies to work for. it offers great benefits and is almost impossible to get fired",
        "summary": "IBM",
        "role": "Consultant",
        "date": "Oct 14, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Compensation horrible, annual increases were practically non-existent. Sometimes managers would not let you move to a different job because of office politics.",
        "advice": "I think senior management should pay employees market prevailing wages and don't make it so hard to get a decent bonus.",
        "pros": "There are quite a few reasons to work for IBM, for example their telecommuting policies are the best I've seen. You start off with 3 weeks vacation time and they offer full tuition reimbursement. Also because it is such a large company you can move around quite often and get lots of great work experience in different areas.",
        "summary": "IBM looks great on your resume, then leave ASAP",
        "role": "Accountant",
        "date": "Oct 14, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Can by, like most jobs, a difficult balancing act. As many employees are shifted to home offices, hours go up, vacation is put off and the clock is 24/7.",
        "advice": "Become more specialized and less generalist. With the bureaucracy that goes on in a big company, too many manage inward and not outward to the market. Would be nice to see more public leadership skills than corporate.",
        "pros": "Provides for an unbelievable depth of resources, customer exposure and challenges",
        "summary": "Always changing, with an eye to the past",
        "role": "Sales Manager",
        "date": "Oct 16, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of bureaucracy and somewhat rigid job structure (thus the need to fight to not be pigeonholed in any given job role).",
        "advice": "Continue with good strategy.",
        "pros": "Opportunities for new assignments abound if one's willing to seek them out (in other words fight for them).",
        "summary": "Great assignments, job roles are fought for -- they're not an entitlement",
        "role": "Advisory IT Specialist",
        "date": "Oct 16, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Below average pay compared to competition, far too many layers of management, too many people paid on the same deal, old fashioned command and control style of management, complex sales plans that are virtually impossible to understand, success punished with massive quota increases. But all of this is probably the same as at most other similar companies.",
        "advice": "Reduce the number of management layers, minimize the increasing emphasis on transactions, and give people in front of customers more decision making capability.",
        "pros": "Best of breed products and services, pride of association both with the company, pride of association with peers, very flexible working options, from both time and location perspectives, virtually unlimited career opportunities, opportunities for international assignments, strong company culture, very good benefits compared to similar companies, can get in the door at virtually any sales prospect.",
        "summary": "Great place to work, especially in bad economic times",
        "role": "Senior Sales Representative",
        "date": "Oct 16, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can get lost within the corporate structure. Sometime very hard to get change through without red tape.",
        "advice": "Start hiring from the outside more. Start looking at your managers more and hold them accountable.",
        "pros": "It's so large there are many areas to move into if you want to grow your career. I'm working at another company now due to being a small layoff last year and I personally miss the structure. IBM had many of the processes down on how to work that many companies could learn from.",
        "summary": "Good company to work for if you look at what you could be working for.",
        "role": "Advisory Software Engineer",
        "date": "Oct 20, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "In such a large company it is easy to get lost or overwhelmed with information.",
        "advice": "Be more transparent -- Allow developers to participate in sales and marketing and vice versa.",
        "pros": "There is a good corporate culture that promotes leadership and continuing education.",
        "summary": "IBM is a great place to work for those that thrive in large businesses.",
        "role": "Software Engineer",
        "date": "Oct 21, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Many times you will find yourself spending unnecessary time working through \"red tape\" in order to get things done, which can mean many late nights in the office or working multiple weekends.",
        "advice": "IBM does a good job of defining challenging career paths and mentoring top talent employees, but they need to spend more time on compensation and rewards.",
        "pros": "Well diversified company with many opportunities for advancement and leadership. Management does a good job articulating your place in the company and how you can personally help achieve the organization's goals.IBM also has a flexible work/life balance and work from home program, but be careful as with some managers, \"out of sight; out of mind\".",
        "summary": "IBM is a great place to contribute, and gain leadership experience",
        "role": "Senior Financial Analyst",
        "date": "Oct 21, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very big company - not all parts of the company are equally well run. Some parts don't seem to be as good as others (in terms of being a good place to work).",
        "advice": "Try to not let short term market realities drive how the company is run. Don't become yet another big company that makes decisions that are good for short term gains, at the expense of long term strength and growth. Look at the hiring and staffing strategies of companies like google. Be very selective and hire the best people, and treat them very well.",
        "pros": "Very interesting work, particularly in the more technical areas. Lots of smart people to work with. Lots of opportunity to move, and if you are lucky you can gradually move into a job that is a good fit for you. This might be harder is a smaller company.",
        "summary": "IBM is not perfect, but I like my job here.",
        "role": "Senior Engineer",
        "date": "Oct 24, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Anytime there is a large number of people, communications become harder. Project managers or engineers might think about the number of communication channels, which is n(n-1)/2 where n = number of stakeholders (Ref: PMBOK, 3rd ed.). For 330,000 employees, that means IBM has 54.4 billion communication channels. Obviously that is difficult to manage and work within. Recognizing that there is an inherent challenge in th… e liquidity of knowledge and information can help employees find ways to solve those problems, such as developing wikis for small teams. The other downside to having that many employees means that every time the company spends $3 on each employee, you just spent $1 million. Many employees don't understand this problem, and instead complain about only receiving free ice cream in the cafeteria after project milestone is reached when their cousin at the unprofitable, but well funded, start-up is getting free coffee and soda every day.",
        "advice": "Every IBMer operates to varying degrees baed on your position in one of three roles--doing, leading, and managing. For instance, a staff engineer will spend the majority of their time doing, and a small percentage leading or managing. Whereas, senior managers will spend almost all of their time leading, some managing, and almost none of their time doing (as it should be since they are the strategic leaders of the com… pany). First-line managers have the toughest jobs in the company, however, since they are stretched the farthest in all three roles. Therefore, I would recommend that senior management look for ways to offload the \"doing\" role from first-line managers so that they can focus on leading and managing their teams. By doing so, first-line managers can spend more time developing employees, looking for ways to get the best out of each employee (do not read \"most time out of each employee\", instead read \"best\"), or recognizing when an employee would be a better fit in a different team, organization, or even company.Also, I would recommend that first-line and second-line managers cultivate a culture of allowing employees to try new ideas and new ways of working. I'm not saying that this isn't already happening or isn't being encouraged to some degree because it is, I just believe that managers need to do a better job at this. For instance, if employees have an idea to work better but it requires a website or computing power, as a manager don't say \"that's not allowed by our IT department for security purposes\" or \"a new version of the w3 intranet wiki is being rolled out shortly\" or my personal favorite (read: the one I rely despise) is \"we've always done it this way.\" Instead look for ways to enable your employees to succeed. Remember, everyone at IBM was hired for a reason--someone saw that they had the knowledge and drive to be an IBMer, so take a chance and let the employees implement their best ideas, even the ones you as a manager think will fail (but use a little commonsense here). Oh and for all those IBMers who say \"we've always done it this way\", I would encourage you to go join the team designing the computing, tabulating, and recording equipment. Oh wait, what's that? You say that group doesn't exist anymore. My point exactly.",
        "pros": "For a large company with over 330,000 employees, IBM does many things right as an employer. They pay competitively and have a solid benefits package. They have a great internal training program for things like management and project management. They delegate much of the human resources (HR) responsibilities to the first-line managers, so that key HR decisions are being made by those with the most knowledge about the … employee instead of by HR representatives who couldn't pick the employee out of a line-up. They have a strong mentoring program (people who say they don't have a strong mentoring program probably weren't willing to put in the effort and time necessary to make those mentoring relationships fruitful). IBM is large enough that employees can have multiple careers without ever changing companies or having to rollover their 401k.",
        "summary": "One former IBMer's view on being an IBMer",
        "role": "Former IBMer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's a corporation, so you are at the mercy of \"Corporate Wisdom\": layoffs, management's preference of \"leadership\" over real skills, ugly politics, back-stabbing and the overpromotion of the underqualified.Another issue to be aware of, especially to those on the Field, is that Engineering seems to lag Marketing in some areas. As a result, you may be asked to represent a \"solution\" that doesn't really address…  customers' needs, or is so buggy that it gets the entire account team banned from some clients.",
        "advice": "Downsize youselves first. Lead by example.",
        "pros": "A steady paycheck and the ease of doing business with established clients that trust the IBM brand. Technology that (mostly) works.",
        "summary": "A good solid corporation",
        "role": "IT Specialist",
        "date": "Oct 29, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Big company rules & regulations. Possible to get lost in the 300k employees. If you like the freedom of a small company where sometimes you are running around like a chicken with your head cut off but doing a lot of different things, then IBM probably isn't for you.",
        "advice": "Less management more doers.",
        "pros": "wide variety of opportunities with out having to change companies. You are limited by your desire to pursue more. Compensation is fair when factoring all fringe benefits.",
        "summary": "Good place to work if you like balance.",
        "role": "Senior Manager",
        "date": "Oct 29, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Getting to the right source for an answer. It is so large that at times it is impossible to get an answer! It is important to get to know people that can help your career along within IBM. Since it is such a large company you could get lost in the masses.",
        "advice": "Give more recognition to the employees for working hard to make money for the company and cutting cost. If it wasn't for the employees, then the company wouldn't be there! Find a way to get in front of the employees. At this point the only time it seems that Senior Management is seen or heard from is via a prerecorded Webcast.",
        "pros": "Work Life Balance, Career Opportunities, Flexible Hours",
        "summary": "Good company to work for with lots of opportunities",
        "role": "Manager",
        "date": "Oct 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Senior managment refuses to let true decision making power occur at lower levels of management.",
        "advice": "Screen lower level management well and then empower them to make decisions.",
        "pros": "Pretty good job security; good compensation; excellent benefits.",
        "summary": "IBM: A pretty good place to work.",
        "role": "Manager",
        "date": "Oct 30, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "In many parts of IBM, one has to constantly be worried about their job being off shored. Many jobs in IBM require onsitepresence and/or weekly travel to customer sites. Many of the jobs are tied to customer contracts, so when contract endsor isn't renewed you have to find another job.",
        "advice": "Stop being such a bean counter and reward loyal employees for their service. Seems like a waste to keep buying your own stock back just to pump up the share price so senior management gets their bonuses.",
        "pros": "IBM is a really large company and there are many opportunities to do some interesting jobs. There are many chancesfor training ... as long as it's free and it's on your own time. IBM has some really good benefits, although they recentlyfroze their pension plan, they do have a good 401K plan. If you don't have to be on a customer site, then IBM is a bigbeliever in work@home.",
        "summary": "Many opportunities and diverse jobs available",
        "role": "Consulting IT Specialist",
        "date": "Nov 2, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Salary increases and bonus plans for non sales people are poor. They will hire you at a competitive rate but if you are not in a critical area, expect a \"national inflation\" rate salary increase. Doesn't do much if you live in area where the cost of living is above the national average. In the Accounting and Finance positions, expect to work long and hard, especially if you are in entry level positions. The costs don… 't out weigh the benefits.",
        "advice": "Invest more in paying and rewarding people.",
        "pros": "Breadth of opportunities and the people who work at the company. IBM is a place you can grow and have a career. For the most part, you can work any where you want. There are some jobs that are \"premier\" position\" that you may have to work you way in (i.e business development). Also, the company offers a plethora of opportunities enhance your skills and knowledge. The offer tuition reimbursement for advanced education…  and offer numerous internal educational courses. The majority of staff, middle management, and executives are really good people with hard working values who care about people.",
        "summary": "A stable company with a stable job for high performers/",
        "role": "Business Analyst",
        "date": "Nov 2, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Being a large company also has its downside . It is difficult to grow the company of this size at a significant rate . Much of the growth therefore is done through acquisitions . This low rate of organic growth results in a few opportunities for a career growth as new management positions are not being created . This also gets exacerbated by many senior folks staying at the company for a long time resulting in a low … turnover . Although , career growth might not be a high priority issue for the next few years as we are going through a tough economic stretch .",
        "advice": "Scan the industry horizon for new opportunities and go after them before competition (vs. the usual getting bogged down in day-to-day revenue target and budget management issues).",
        "pros": "IBM is a large and stable company , generally being smart about running its business . In the current macro economic environment , it is a big advantage . As industry growth is reversing itself , small companies are at risk of not making it to the other end of the tunnel . Management quality varies by division / department , but , in general , it is not bad . Work place flexibility is truly exceptional : many employe… es work from home ( if it suits them ) or go to the regular office only a couple days a week . It could be an enormous plus for some folks.",
        "summary": "Cautious optimism",
        "role": "Business Analyst",
        "date": "Nov 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The bureaucracy gets painful at times.",
        "advice": "Give worker bees the same opportunity to try to positions as management is given to move around.",
        "pros": "Flexible work schedule. I am able to adjust my schedule based on my own workload and activities at home.",
        "summary": "Opportunities abound at IBM but no one will find them for you.",
        "role": "Staff Software Engineer",
        "date": "Nov 17, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Travel away from family is hard.",
        "advice": "Stop worring so much about utilization in management so they can be more involved.",
        "pros": "Training, and meeting new people. In addition it is great to meet new clients, and solve interesting problems.",
        "summary": "IBM is fine, no big problems.",
        "role": "IT Specialist",
        "date": "Nov 18, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "the BIG in Big Blue. Sometimes feel kind of distant. Most of HR is taken care in a central place, e.g Raleigh, NC. Also most people are very good at what they do making promotions kind of hard to attain.",
        "advice": "Meet with us more! Between me and the CEO was 7 management levels. From my 3rd line manager had a VP title.VP, VP, SVP, GM, EVP....",
        "pros": "The opportunity to work for such a global company. IBM sets the pace in many technology sectors. Skills learned here are in high demand outside of IBM. As a software engineer got to work on latest and greatest web technologies and got a job really quickly after leaving IBM. I was able to rotate around to different software brands building a good portfolio of knowledge of software offerings. From development to applic… ation software.",
        "summary": "Great Experience out of College!",
        "role": "Staff Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too large and complex with hundreds of procedures, many layers of management and politics. The culture and size of the organization can also make one feel isolated. Often times because you are on your own in terms of how you work, you may not actually see your manager for months at a time. The business controls and procedures can sometimes bog you down with the time it takes to develop the necessary documentation to … meet compliance. It can also be frustrating when you discover there is duplication and some managers operate with blinders on and just direct you to comply if if there is duplication.",
        "advice": "Listen to regular employees.",
        "pros": "Many of the people. Basically good people. Lots of resources in terms of jobs, benefits, opportunities, etc. Working at a large company like IBM for twenty four years was like working for several companies. The jobs ranged in responsibilities and most of the time as a professional hire you were pretty much on your own in terms of managing your time. Assignments were given and it was up to you to decide how to approac… h and or deliver results.The people at IBM for the most part are great people and one can develop great friendships. IBM's reputation carries a lot of weight in the industry, depending on the type of job you're seeking.",
        "summary": "Ex-IBM Employee's hindsight.",
        "role": "Alliance Manager",
        "date": "Nov 20, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you work for IBM for a long time and try to move to another industry, you're in for a little culture shock, most places aren't that laid back compared to IBM. I know several people who left IBM to work for one of the big finance companies and they went back to IBM to beg for their job back because they couldn't handle the workload and amount of off-hour commitments. Try to keep yourself up to date on technologies … and hardware that's going on outside of IBM to avoid becoming a dinosaur.",
        "advice": "I was only a co-op, so I don't know what life is as a full timer. I always thought IBM's problem was that it wasn't sure what it wanted to be...a consulting shop, manufacturer of big iron, or a chip designer.",
        "pros": "IBM had a very relaxed environment. Although I was a co-oping for them while finishing my masters degree, the atmosphere was very laid back.",
        "summary": "Great working environment in Research division.",
        "role": "Research Graduate Co-Op",
        "date": "Nov 24, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very so many layers of Managements",
        "advice": "Let the higher management know about the employer skills and abilities working under first line managers. Specially those contractors whose skill set are unique and very hard to match",
        "pros": "Job growth is pretty good, you good to work on the industry leading projects",
        "summary": "Committed employees are the bread and butter of any ongoing project",
        "role": "Circuit Design Engineer",
        "date": "Nov 24, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "* Compensation. IBM brand is one of the best in the world. As a result, do not expect to be compensated heavily.* Huge organization. Consequently, things move at a slower pace than you would normally anticipate. But, don't give up so easily. People are committed to doing the right thing and have a bias for the right action.* Global integration is both a boon and a bain. Bain because, a lot of times you never … get to see who you are working with on the other side of the table. You will recognize them by their voice and know a lot about them, but you would have never met them in your life.",
        "advice": "1. Keep doing the great things and continue expanding globally.2. Increase the compensation to industry standards to retain good talent.",
        "pros": "* Brand name. IBM is #2 globally recognized brands. When you have IBM on your resume, you get very few questions. It opens several doors* Opportunities. IBM is a huge company that has limitless opportunities. There are several people and life timers at IBM, who are yet to scratch the surface.* Work life balance. IBM is a globally integrated organization. It encourages WFH (after the 1st year of stay at IBM). … You will be surprised at how addicted one gets to using Sametime for chatting as well as for scheduling meetings.* Culture. IBM is a very open company. It is a no non-sense company where Senior leadership is very committed to doing the right thing. IBMers have a bias for the right action.",
        "summary": "IBM is a legendary company. You will be proud to be an IBMer for the rest of your life.",
        "role": "Segment Analyst, Market Intelligence",
        "date": "Nov 25, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "As a consultant working at the client site it you can feel isolated from the company because contact with other IBMers can be sparse.",
        "advice": "Improve communication to employees at client sites.",
        "pros": "Plenty of room for professional growth if you are a driven person who will seek out the many opportunities within the company. Flexible management that allows you to chart your career path. Great benefits package. Pretty good work life balance such as \"unlimited sick days\" (Granted you work from home for some of those days to maintain your utilization goals).",
        "summary": "IBM is a good place to work if you are driven to chart your own career path.",
        "role": "Consultant",
        "date": "Nov 25, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "• Project Managed NC Department of Transportation initial installation of SAP GRC• Implemented Security Roles for IBM’s initial deployment of SAP NA Integrated Supply Chain - developed initial Segregation of Duties• 10 years with IBM’s Financial Systems group• Diverse background working assignments in SAP IT Security, Financial Systems, Order Fulfillment and Business Transformation• PMI Certified Proj… ect Management Professional (PMP), with a Masters Certificate in Project Management from George Washington University.At IBM I was Implementation Project Manager for IBM’s SAP General Ledger – NA Deployment, as well SAP Security Analyst on IBM’s initial security structure for its NA Integrated Supply Chain. In addition, I have worked on several large, complex, enterprise wide projects in over 15 years of IT assignment. Some highlights are as follows:",
        "advice": "be more strategic - too focused on cost cutting need more growth",
        "pros": "At IBM I was Implementation Project Manager for IBM’s SAP General Ledger – NA Deployment, as well SAP Security Analyst on IBM’s initial security structure for its NA Integrated Supply Chain. In addition, I have worked on several large, complex, enterprise wide projects in over 15 years of IT assignment. Some highlights are as follows:• Project Managed NC Department of Transportation initial installation of SA… P GRC• Implemented Security Roles for IBM’s initial deployment of SAP NA Integrated Supply Chain - developed initial Segregation of Duties• 10 years with IBM’s Financial Systems group• Diverse background working assignments in SAP IT Security, Financial Systems, Order Fulfillment and Business Transformation• PMI Certified Project Management Professional (PMP), with a Masters Certificate in Project Management from George Washington University.",
        "summary": "Stay put",
        "role": "Project Manager",
        "date": "Dec 1, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Internal matrix organization and beauracratic tendencies",
        "advice": "More accountability for hard results at all levels",
        "pros": "Part of global organization and great international assignments",
        "summary": "Strategy has positioned IBM well to emerge as a strong leader during the current global recession",
        "role": "Supply Chain Manager",
        "date": "Dec 2, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A very secretive place regarding job actions. People simply vanish and when someone does vanish the people who work nearby seldom ask questions.",
        "advice": "Remember that it is talented people in research and development that create value. IBM can only fade away if you try to sell the reputation year after year while cutting back on the kinds of investment that built that reputation.",
        "pros": "IBM has long ago lost the concept of commitment being bi-directional. It expects more commitment from workers than it gives in return. That said, I think it is better than most companies. IBM does not shy away from dumping valuable employees but it probably does not pick that course as fast as many companies.I can only speak for one small part of the software side but I think IBM does try to encourage people … to try new things and give them some time to come up to speed.",
        "summary": "Fear of job loss is everywhere - why would we expect to be exempt?",
        "role": "Senior Software Engineer",
        "date": "Dec 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "This is an enormous company with many, many layers and internal navigation is difficult.",
        "advice": "Senior managers tend to \"help\" by requiring vast amounts of reporting and checkpoints. Getting out of the way would be even more helpful - seriously.",
        "pros": "I am surrounded by smart people who are competent and focused.",
        "summary": "Smart people work here",
        "role": "Client Manager",
        "date": "Dec 6, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Huge, bueauracratic, and very political at times.",
        "advice": "Don't be afraid to cut some of the \"lifetimers\", even if they are execs, who are just dead weight, and give more opportunity to those who really have value to offer.",
        "pros": "A solid, established company, a leader in its industry. Large enough company to offer many different career options.",
        "summary": "An IBMer view - SWG",
        "role": "Program Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Huge size makes it difficult to keep on top of what is going on.Top ranks are extremely difficult to attain, and heavily populated by a population close to retirement.",
        "advice": "Involve the perspectives of younger thought leaders. IBM is seen publicly as a company of old, closed minded, traditionalists very often because of the lack of younger stars in positions of significance. You have smart people, but they aren't very visible externally.",
        "pros": "Well developed training and skills development helps career development.",
        "summary": "Extensive opportunities but top ranks are very closed (and close to retirement).",
        "role": "Senior Software Engineer",
        "date": "Dec 21, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "IBM is a highly matrixed environment, at times, it is confusing who has the lead. It is a large organization and there is competition within product lines and services groups. Without strong leadership looing t the bigger picture, it can get very disheartening to work at IBM. In addition, because it is so large, it frequently takes time to find the right person or right organization to address a question/problem.",
        "advice": "Take more risk, Aggressively go after opportunities",
        "pros": "The choice to work from home or the office offers a great amount of flexibility especially for women and men. Respect for work life balance issues is prevalent in most organizations. IBM is such a large organization that there is a tremendous amount of job opportunities to branch out. Throughout my 20 years at IBM, I have held positions in Manufacturing, Development Engineering, Marketing and Sales, with the ability … to parlay job history and skills aquired into the next job. The colleagues I work with are competent and the management team I work for is respectful and appreciative of the effort that I put in for IBM.",
        "summary": "IBM offers opportunities to those who want it",
        "role": "Business Development Executive",
        "date": "Dec 22, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "At this point in my career I can't think of too many downsides. We have a strong portfolio of software products and alot of demand in the marketplace. Sure quota's are crazy but I'm sure they would be that way at any other place. Folks who don't make it at Big Blue should reflect on themselves on what they could have done better. My approach is to always understand the clients issues and identify IBM solutions that c… an address those issues. There has to be a fit otherwise we come across as Snake Oil Salesman. Not good if you want to have a good relationship with your clients.",
        "advice": "Give your folks a chance to succeed and reward effort appropriately",
        "pros": "Complexity of work that is rewarding from both a knowledge and money perspective. I also enjoy working for a company where I can help my clients adopt technology and innovation to solve their most pressing needs. The diversity of IBM's people and products allow this too happen.",
        "summary": "Proud to work for IBM. Work is interesting, Software brands are strong, pay is pretty good.",
        "role": "Software IT Architect",
        "date": "Dec 24, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A number of researchers are working on pure development projects, which is supposed to be completed in the software development department. The company is large and bureaucratic which slows down the decision process. No free perks around.",
        "advice": "Spend more time on helping employee instead of seeking for funding",
        "pros": "IBM is a big and diverse company with great work-life balance. IBM research, as a industrial research lab, still offer sufficient opportunities for publication. The managers and evaluation systems appreciate external recognition from research communities. The employee is also able to collaborate with colleagues from different areas such as business department, software development and others. I also like the internal…  courses for your own career development.",
        "summary": "Big Blue with good research environment",
        "role": "Research Staff Member",
        "date": "Dec 30, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There is to much bureaucracy. It is very hard, if not impossible, to change jobs. You basically have to quit and come back. This also holds true for a significant pay change (>10%). The executives seem to be the 'untouchables', providing no perceived value to the working class. The direction of the company is never made clear.",
        "advice": "Please retire and make the company less top heavy.",
        "pros": "It's great for your resume. The company is very large and diversified. As a consultant, you are exposed to many different opportunities and client situations. The experience is invaluable. The networking opportunities are endless.",
        "summary": "Not a bad place to work.",
        "role": "Senior Consultant",
        "date": "Dec 31, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "heavy bureaucracy and politics, Limited diection from senior management on direction other than just 90 days",
        "advice": "Be open and communicate challenges with the entire team/organization. Changes can't be made if things aren't openly addressed.",
        "pros": "A global company with the ability to work with cultures and people around the world",
        "summary": "Heavy bureaucracy and politics",
        "role": "Sales Account Manager",
        "date": "Dec 31, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company so implementing new ideas can be a tedious process. Work life balance is not great if you really want to get ahead. If you are not looking for speedy advancement, then good work life balance is possible. Some employees have been around for a many years and believe they are entitled to things because of their seniority. This can create problems for younger employees like myself.",
        "advice": "Schedule more time for employee evaluations and feedback sessions",
        "pros": "Cutting edge innovative company that values its employees. Be ready to work very hard but be paid fairly for the work that you do. Great learning opportunities are available for all employees. Company values its position in the market and is constantly innovating in order to meet customer needs.",
        "summary": "Great place to develop technical expertise",
        "role": "IT Analyst",
        "date": "Jan 4, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "lots of work, long hours",
        "advice": "keep up the good work",
        "pros": "Compared to other tech companies ibm is relatively stable and the chances of getting laid of are smaller.ibm is fairly flexible about work hours and working from home, however this depends a lot on your manager. Benefits are ok. In general if you work hard, you will be rewarded. smart engineers. stock is still doing good considering the tough econmic times",
        "summary": "not a bad company to work for",
        "role": "Software Engineer",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Difficulty in effectively leveraging all the capabilities available due to vastness, sometimes conflicting performance metrics. Occasionally seems too bureaucratic / requiring too many approvals on deals. The flip side of being a remote / mobile worker is very little sense of Team.",
        "advice": "Continue focus on helping us all be more effective at better leveraging IBMs end to end capability, which is second to none.",
        "pros": "Ability to offer end to end capabilities to clients, huge amount of resources to work with, ability to change roles / build broad experience, being part of a mobile workforce. Opportunity to work closely with a global workforce. Compensation and benefits are very good, the business is strong, business is diversified enough to weather downturns in specific sectors or segments. In the services business, the ability to … work remotely, live just about anywhere is a huge plus.",
        "summary": "It would be hard to find a better company to work for.",
        "role": "Business Development Executive",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can be very beaurocratic. Siloed business units challenge company's ability to work in unilateral direction. Many legacy employees overly reliant on conventional ways of doing business can retard real growth and internal innovation. Size of the company is an advantage from a personal benefits standpoint also interfere with capacity to employ new thinking.",
        "advice": "Better integration of business units. Additional talent from outside.",
        "pros": "Good learning, excellent options for advancement. There are a multitude of online and in-person training opportunities that build skill sbeyond immediate job requirements. IBM also has general philosophy of growth through experience, encouraging employees to advance through taking roles in other business units over the course of their career.",
        "summary": "Good place to get strong training",
        "role": "Consultant",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Little personal attention given to skills development. Preoccupation with Billable utilization over other important commitments. Getting answers to client questions could be difficult at times, with the client sometimes getting 2 different directions from 2 separate Service areas within GS.",
        "advice": "Improve retention of top talent and promote effective leaders.",
        "pros": "Exposure to large projects and early exposure to new products and technologies. The pay is industry average, and the entire experience can be heavily influenced on your immediate management; this is good and bad. Having experience at IBM may be viewed as desireable by future employers. There are lots of opportunities for professional and personal networking.",
        "summary": "A good stepping stone",
        "role": "Senior I/T Specialist",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "big company bureaucracy, some politics as expected in such large company, careful - don't get caught in the wake of that wave coming your way...you can make more but only when you leave the company, so don't plan on getting comfortable there",
        "advice": "treat your retirees and pensioners with more respect!",
        "pros": "big name, lots of opportunities,they make the best PCs on the planet, the Operating Systems have never been outperformed, they will always produce exceptional hardware, a retirement program that is the envy of the world, the company country club is superb, the mainframe business is still going strong, DB2 rocks!, Lotus Notes continues to destroy the poseur Exchange system for kids,",
        "summary": "Better than a lot of other places to work for",
        "role": "Senior Engineering Manager",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "They pay you as much as they need to keep you there. You pick up slack for older less computer savvy workers. Utilization is king, if you are a business resource on the bench, don't be surprised if they ask you to learn SQl, SAP or take a testing role.",
        "advice": "Focus on high performing resources, they end up completing or leading a large portion of work. Compare their training, opportunities, salaries and bonuses to high performing resources in other companies, not to the mean of IBM.",
        "pros": "You are treated fairly and most managers acknowledge your contribution. IBM has inroads with hardware, software or consulting; you will see more large scale end-to-end projects with IBM than anyone else. International travel is a easy to come by with a year or two of experience.",
        "summary": "Great experience, Fair treatment, still a technology company.",
        "role": "Senior Consultant",
        "date": "Jan 6, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Off shoring, downsizing, forced moves, too much work per technical worker, bureaucracy abounds, fat upper management.Respect for the individual has declined, but all companies now days treat employees as an asset instead of a person, until you are not longer considered an asset , thus terminated.",
        "advice": "Please trim senior management since the technical workers in the trenches have been heavily trimmed over the past 20 years.",
        "pros": "Great opportunity to move around during your career. Excellent education opportunities. Great innovation with large dollars spent on R&D (#1 in patents for 15 years). Decent benefits. Very flexible work hours. Working from home with budget for home office.",
        "summary": "Great innovation, decent benefits, fat upper management",
        "role": "Technical Sales",
        "date": "Jan 6, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "So large that the goals of different parts of the company often conflict. Benefits, vacation, pension, stock purchase plan, medical, etc. have all been squeezed in recent years so the fringe benefits of working for IBM are not so great. They're also working hard to transfer jobs out of the USA to China and India, this makes one's future with the company in the USA less stable. The level of expertise of the technical … talent can vary widely, many parts of the company are not attractive to really talented people who can get jobs elsewhere.",
        "advice": "Get technical people into decision making positions rather than the marketing/finance goof balls I meet.",
        "pros": "Frequently a leader in technology development, though one's exposure and participation in that effort depends upon which part of the company you work for. Most of the management is \"sane\", the real wackos are filtered out (usually). The company has been around so long that they've seen everything and don't often panic when situations (of all kinds) occur.",
        "summary": "Great place to be from.",
        "role": "Research Staff Member",
        "date": "Jan 7, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "1. Not easy to be promoted.2. Very little bonus3. Not so good job security.",
        "advice": "1. Need better business strategy",
        "pros": "1. Flexbility: work from home, lateral transfer2. Not too bad work-life balance",
        "summary": "Big and strong company you can learn the technology, but not so much job security",
        "role": "Advisory Engineer",
        "date": "Jan 12, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "red tape... but don´t let it slow you down. just keep pushing when you´re doing the right thing for a customer and your team",
        "advice": "stop chasing numbers and truly keep the focus on customer success. reward people when the numbers aren´t good but customer satisfaction is high... the numbers will follow...",
        "pros": "Great opportunities here for those with skills and motivation. Don´t expect things to be handed to you... you gotta work for it...",
        "summary": "Stop trying to measure every element of the company and let people work...",
        "role": "Sales Manager",
        "date": "Jan 13, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you don't negotiate a high salary when you get hired you will struggle for the rest of your carreer. There are constant budget constraints that limit salary increases and bonuses even when you get a high performance rating.",
        "advice": "The low salary is a big driver for attrition at IBM.",
        "pros": "Work life balance is respected at IBM! There are unlimited opportunities for gaining valuable work experience. IBM is such a big company that you can change your career and still work at IBM! IBM supports teamwork and collaboration across within and across business units. Overall it is a gret place to work!",
        "summary": "Overall IBM is a great place to work.",
        "role": "Senior Business Controls Advisor",
        "date": "Jan 14, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "IBM is very large, but the downside to that is how long takes to do anything. The red tape is legendary. It takes a long time for an oceanliner to turn around. Promotions can be slow. Progress of any kind takes time and people like to stick to the way things have always been done. If you have a new idea, or process, you have to move heaven and earth to get it implemented. Management can also promote on who you know, … not what you know. But this is typical corporate america. It goes without saying that the level of political intrigue is dense at IBM. Kissing bottom is taken to an art form and there are more angles on everything you say and do than a billiards game.",
        "advice": "Recognize talent and do everything you can to reward and keep it.",
        "pros": "At IBM you work with some of the smartest people in the world. It still makes me proud to have been associated with an organization that has the reputation for excellence that IBM has. Smart people, great name, and in addition, IBM is so large that their are a glut of resources at your fingertips. So much so, that sometimes you get so used to having so many resources that you become a little spoiled. There is a depar… tment or a person for every possible business, sales, or service function. The benefits are also world class. I can remember when I started paying about $34.00 per paycheck to cover my entire family and didn't realize how inexpensive that was.",
        "summary": "IBM is what you make it.",
        "role": "Sales Manager",
        "date": "Jan 16, 2009",
        "is_current": false
    }
]