[
    {
        "rating": 1,
        "cons": "IBM offshores most jobs to developing countries. Monetary compensation is well below industry averages. Managers routinely engage in doublespeak. IBM also has a mandatory overtime policy. When this policy was found to be illegal, they cut salaries by 15%, telling people that they can still make the same amount of money as long as they continue to work 15% overtime. Meanwhile, the CEO will retire with a $70k per WEEK … pension.",
        "advice": "Burn in hell, you certainly deserve to.",
        "pros": "There are no good reasons to work at IBM, other than paying the bills.",
        "summary": "IBM is an awful place to work at.",
        "role": "Associate Project Manager",
        "date": "Apr 23, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Everything is a downside unless you are a genious .. Else you need to be \"ingenious\" to make it",
        "advice": "RESIGN!",
        "pros": "None! Things were good in late 90s when everything was rosy. Now the environment has made pathetic by management with blatant bias.",
        "summary": "IBM STG SUCKS -- BIG TIME",
        "role": "Really Does Not Matter",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management is just plain incompetent at all levels. You'll never get a decent raise. They expect you to work 80 hour weeks in most cases. You'll get no respect from any level of management and in many cases clients are so fed up with IBM that they are just waiting for their SLAs to expire and then they go with someone else. I've seen it happen over 8 times in the last 5 years. It is absolutely appalling.",
        "advice": "Is there any competent senior management at IBM? Hire more H1-Bs, yeah, that'll improve your image. I mean it can't get any worse can it?",
        "pros": "A great place if you want to telecommute, their virtual services are second to none.",
        "summary": "Working at IBM REALLY Sucks!",
        "role": "SAP Technical Consultant",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Upper management has become extremely short sighted, focusing on the needs of tomorrow and not the long term future. Last year LEAN was implemented except that the only focus in LEAN was to remove staffing. If you read LEAN techniques it is about reducing staff but doing so in a way that removes excess work that doesn't add value. The staffing reduced is supposed to go into a short term position of handling documenta… tion and process improvements, instead people were cut without all the detail work.",
        "advice": "Remove Sam Palmisano as CEO. Then undo the disaster that was Project LEAN.",
        "pros": "Access to some of the most advanced equipment and techniques. It is very common to work from home.",
        "summary": "IBM on downward spiral.",
        "role": "Team Leader",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM really does stand for Idiots Become Managers. I did time with IBM as a contractor - the kind of employee they hire through another agency so they don't have to give them perks like decent pay, benefits, raises, vacation/personal/sick time, job security, or respect. Maybe if I worked harder on my golf swing I could've had a shot. The contractors were treated like dirt, and I think that's the whole reason we were h… ired like that - cheap labor to be abused like slaves. We worked just as hard, dare I say much harder than our supposed full fledged IBM employee coworkers but for much less money and no way to move up in the world! But shouldn't we be making so much money, you know, doing overtime? NO - overtime was frowned upon. Our time wasn't valuable enough to justify paying us more for. They could just hire another schlub at some low rate to take over for us when we were done. Sure they might be a complete idiot who might cause irreparable harm to client relations but they're cheap! As for raises, instead of raises we got annual pay CUTS - cuts that we were made to feel guilty about - our letters said we should be grateful that we got to keep our jobs, and that everyone had to sacrifice. Everyone meaning the contractors. Full employees were comfy and cozy with their nice checks and health insurance. Our schedules would change at a moment's notice. Can you work this weekend? Ok, well great, and by the way, because you said yes you're working every weekend from now on. Graveyard shift? Same deal. When IBM lost clients as they have a talent for, the contractors were cut loose without notice or severance. Some time before the Melville office closed a local newspaper ran an article about the fact that the offices were closing. IBM was quick to react, assuming doing absolutely nothing could be considered a reaction. Eventually a statement was issued that there were no plans to close the offices, and a meeting was held to that effect as well. Several days later a formal announcement was made that the offices were closing. And that was that.",
        "advice": "It may be good to work for ibm if your are fresh out of college,Respect: at least everyone knows the company name.Benefits: average for a large company. You get PPO and travel perks, but they quickly lose their \"perk\" status.Work/life balance: it doesn't exist. The travelling owns you. And if you work locally, they'll still work you to death because they don't care what the turnover rate is. Most loca… l DC projects for the gov't are dull. 44 hours is required every week. Nope, you don't get paid the extra 4 hours. It was never stated in the offer, but yep - they added it in when you join up.Career Growth: This is a complete joke if you start out on the bottom. I've worked my ass off and got NO WHERE. The people determining your advancement are never on the projects you're on, they never monitor what you do, and the only thing they have to go on is one or two project assessments, and a PBC where you explain how well you think you've met your own goals that you set every year. It's a joke. All the money and extra hours worked goes to the top.Location: or rather, lack of location. If you're consulting, wherever there is work is your location. Now, this might be cool if you're just starting out - but eventually you become extremely stressed out and lose all contact with your friends.Co-worker competence: again, horrible. Underqualified people work here and stay under the radar.",
        "pros": "It may be good to work for ibm if your are fresh out of college,Respect: at least everyone knows the company name.Benefits: average for a large company. You get PPO and travel perks, but they quickly lose their \"perk\" status.Work/life balance: it doesn't exist. The travelling owns you. And if you work locally, they'll still work you to death because they don't care what the turnover rate is. Most loca… l DC projects for the gov't are dull. 44 hours is required every week. Nope, you don't get paid the extra 4 hours. It was never stated in the offer, but yep - they added it in when you join up.Career Growth: This is a complete joke if you start out on the bottom. I've worked my ass off and got NO WHERE. The people determining your advancement are never on the projects you're on, they never monitor what you do, and the only thing they have to go on is one or two project assessments, and a PBC where you explain how well you think you've met your own goals that you set every year. It's a joke. All the money and extra hours worked goes to the top.Location: or rather, lack of location. If you're consulting, wherever there is work is your location. Now, this might be cool if you're just starting out - but eventually you become extremely stressed out and lose all contact with your friends.Co-worker competence: again, horrible. Underqualified people work here and stay under the radar.",
        "summary": "sucks",
        "role": "Software Engineer",
        "date": "Jun 11, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "IBM as a whole is outsourcing and downsizing its US workforce. Each Day I see more and more of my colleagues lose their jobs. Its disgusting, most of the people posting good reviews on this board are kidding themselves. IBM is not the great company these folks say it is.",
        "advice": "None, its pretty much worthless, we have stated our concerns only for them to turn their backs on us, The US workforce.",
        "pros": "Well if you are in Global Services, and in the US. their is no good reason, all you are doing is dodging the big blue bullet if you still have your job. If you are outside of the US things are great for those people.",
        "summary": "I think his name is Samonella, Spreading disease throughout the company",
        "role": "Technical Services Professional",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Raises, most often below the rate of inflation, are few and far between. Benefits, like most everywhere else, are dwindiling. The company can no longer afford a decent benefit package because of the poor management decisions made in the past.Starting out as a person that very much enjoyed technical activities, I now create superflouous paperwork and engage in meaningless tasks that appear to be adding value i… n the eyes of my customer. CYA is the name of the game. If IBM looks good, then all is well, right?",
        "advice": "Morale within IBM Global Service (IGS) is lower than low. Given that nothing is being done to improve it, I can only surmise that managements actions are deliberate and willful in the continuing of this atmosphere.",
        "pros": "When you first join IGS, usually through an 'outsourcing deal', expectations of career advancement run very high. However, as time goes on, these hopes are slowly and methodically squashed. One day you wake up and realize you work for \"little blue\" and thus considered an unwanted stepchild of the real \"Big Blue\" IBM, which I hear is a nice place to work.",
        "summary": "IBM Global Services is the worst part of IBM to work for.",
        "role": "IT Specialist",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "It is \"top heavy\" and has a lot of bureaucracy. It's very hard to get promoted unless you're buddy buddy with your manager. It's not very fair sometimes because the managers don't really know their people well.",
        "advice": "Get to know the people doing the work and not just listen to their selling points.",
        "pros": "IBM is a very comfortable place to work. It has good benefits and it has fitness programs for its employees.",
        "summary": "Too much bureaucracy",
        "role": "Staff Hardware Engineer",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM employees have slowly dwindled in the US. With the increased outsourcing of Sr./Jr. technical positions overseas, the accounts are very short staffed, and lack the technical expertise to properly support the associated accounts. This has lead to the thought process of \"Quantity not Quality\". The US will continue to suffer, as large companies like IBM, continue to take advantage of their employee base, and continu… e to reward their management base through cost savings. This philosophy continues to erode the company’s ability to function efficiently and fosters anamosity towards upper management. If you are seeking a career with “Big Blue”, and you are a top performer, look elsewhere. If you are the individual who like to: push all responsibilities to others, do not want any accountability, willing to work only 30 hours/week (from home), have no technical knowledge or skill, willing to agree to anything that comes across your desk (even if that product isn’t concieved), and exhibit that outstanding concept of, “It’s a large company, I can hide anywhere.” IBM has Senior Management position waiting for you. Good Luck!",
        "advice": "Seriously, what are you thinking?",
        "pros": "IBM has very few good reasons to work there. However, a different view might see things more positive. For instance, if you are a senior manager IBM has a ratio of about 30:1 (Management:Employee). This equates to very minimal work load, as well as no accountability. Pay increases for this level are phenominal, and work life balance is outstanding.",
        "summary": "IBM Loves their Management!",
        "role": "Consulting IT Specialist",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The world's largest computer company is run like a small country with its share of unnecessary administrative rules and regulations.",
        "advice": "Management for management's sake is no way to run a company.",
        "pros": "Name recognition of the world's largest computer company.",
        "summary": "Why waste your life at IBM when other companies offer so much more opportunity without the red tape.",
        "role": "IT Architect",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Working over 48+ week, have to make up time if you take education or vacation.",
        "advice": "Give us good news instead of not telling the truth.",
        "pros": "It is a paying job to pay the bills.",
        "summary": "Is IBM a place to work for?",
        "role": "IT Specialist",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Too many to list but here are my top 101. Way too much red tape and unecessary daily report building. It is like living in a Dilbert cartoon everyday.2. Leadership and innovation is punished NOT rewarded.3. Absolutely no fairness in raises or promotions. Advancement by pure kiss-ass.4. Very little substance at the executive leadership level.5. No respect for senior experience level employees and w… ay too much focus on babies right out of MBA School.6. Did I say poor executive management?7. Layoffs of lower level people first and zero executives get fired.8. Almost every senior executive that leaves IBM fails miserably in the real world. Do you see a trend here?Exception being John W. Thompson at Symantec. Maybe John should be running IBM right now!9. Across IBM there is NO respect for the average employee and very little recognition.10. Nepotism is rampant. Many executives get their families jobs and their buddies make sure that they get \"choice\" positions and promotions. Over-promotion and hiring of legacy employees is killing IBM. We are NOT a family owned business nor should we be.",
        "advice": "Set standards for promotions and flatten the organizations. Make it mandatory for VPs to have at least 100 people working for them and Directors should have a min. 50. Lower level managers would be less stressed. Stop firing the workers and get rid of the executive slackers.Do not let sons and daughters of executives get preferential treatment in IBM advancement.",
        "pros": "Work at home. Flexible workplace and average pay. We used to have the best training but no more.",
        "summary": "Only stay cause I work from home. Anyone else offers that and I am gone like a flash!",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM discriminates against white males, and in particular, those over 40 years old. It is clearly a supporter of reverse discrimination. All diversity groups are protected and nurtured except white males over 40. It's a disgrace and causes many roles to be filled with people of lesser skills in order to minimize the role of white males in the workplace.",
        "advice": "Stop breaking the law and treat ALL employees fairly based on their skills. Executives should not be compensated for any activity that reduces income / benefits to employees - it's a disgrace.",
        "pros": "It is a good place for young people to start a career and get good training as long as there is a plan to leave the business within 5 or 6 years. Employees in the sales and marketing professions can gain significant good contacts to move into other businesses as they grow their skills.",
        "summary": "A horrendous place for white males over 40 to work.",
        "role": "Middle Manager",
        "date": "Jun 17, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM has no clue about developing software... it just assimilates smaller companies, and tries to shoehorn them into IBM's way of doing things, which results in low-quality products. It also treats its engineering staff like interchangable cogs, laying off highly paid, experienced engineers for inexpensive college hires, assuming they can do the same job",
        "advice": "Let people who know what they're doing do what they do best.",
        "pros": "None. Unless you like working for a huge company.",
        "summary": "Don't go there.",
        "role": "Advisory Software Engineer",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Growth is very limited in the Managed Services",
        "advice": "Recognition for work and promote right people in the right role with abilities/skillset to do the job",
        "pros": "Great place to learn and work on challenging projects",
        "summary": "Good place to learn but very limited growth for people",
        "role": "Service Delivery Manager",
        "date": "Jun 18, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "get less pay and drive you to die",
        "advice": "Be reasonable and not create inner-circle.. i hate this. They like to someone like a dog to only listen.",
        "pros": "close to my home which can save my transportation cost.",
        "summary": "Good",
        "role": "Sales",
        "date": "Jun 21, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM fires people who become disabled. They can terminate with no warning, and they can circumvent the peer review process if they wish. HR stands behind all managers' decisions, right or wrong.They make no accommodations for disabled individuals, and they scoff at the ADA.",
        "advice": "Try to understand you are managing human beings. Give employees some feedback, positive or negative, before simply terminating them after two decades of loyal service.",
        "pros": "Good salaries, flexible work life. Excellent benefits package.",
        "summary": "IBM shows no loyalty to long-time employees, and can get away with wrongful termination.",
        "role": "Senior Executive",
        "date": "Jun 22, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Today employment at IBM has nothing but negatives. The bureaucracy is far worse than ever. In order to accomplish anything at all, one must fill out an endless stream of web forms, request databases, spreadsheets, management approvals, etc. A simple change can take weeks to get all the \"ducks\" aligned. The chance for career advancement is almost nonexistent. The internal jobs website has been revamped to make it almo… st unusable. When applying for a job, the hiring manager doesn't even give the applicant the courtesy of a response. This has happened to me on many occasions. Most of the folks that I've talked to have said the same thing. Apparently it's now considered an acceptable practice to not even acknowledge receipt of an application. I guess that should be expected given the fact that employees are now referred to as \"resources\" and not people. If I had a dime for every time I heard a manager refer to employees as \"resources\" I could retire today.Employees are continuously bombarded with 'take aways' and benefit reductions. Pension freezes, pay cuts, band reductions, forced overtime for exempt employees, offshoring, employee layoffs and a blatant sense of dishonesty coming from upper management. These are all part of everyday life at IBM now.",
        "advice": "Look at the history of the company. This company was built on \"Respect for the Individual\". Senior management needs to stop focusing on lining their own pockets and focus on returning the company to the values that it was founded on. Stop using trickery, fraud and deceit as tools to advance the bottom line. Also remember that company success and growth are not achieved on cost reduction and cuts alone. Return the com… pany to greatness that it once was.",
        "pros": "Best reasons to work for IBM? Wow, that's tough! When I started with IBM 10 years ago there were many good reasons to work for IBM. It was a company with a great history of respect for its employees and their customers. It was a company that paid well, treated people fairly and honestly, was respected by the industry, it's customers and it's employees. It offered people fair pay, good benefits, rewarding work environ… ment and opportunities for career advancement. Today,all of those things are no longer true. In reality, in 2008, there is no good reason to work for IBM.",
        "summary": "It's not your fathers IBM anymore....it sucks!!",
        "role": "IT Specialist",
        "date": "Jul 10, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Mandatory voluntary overtime. Basically, you have to work 10% overtime to get a good review. You need an excellent review to be considered for a raise. Promotions are given only after a lengthy process of 'proving your worthy' through a ton of paper work and multiple levels of management approvals.",
        "advice": "I only know my direct manager. He refuses to allow people to work the flexible schedule that is constantly talked about when you are talking to the IBM recruiters, and in orientation. He on the other hand seems to have an excuse to work whenever and where ever he wants. He plays games with his own vacation time, by logging on when 'on vacation' and then reclaiming that time, even though he is not in the office. No ot… her employee is allowed to do this. Finally, he is constantly reminding us that we could go somewhere else to work when discussions about work conditions or the pressure to work overtime comes up. During a salary review, in which I was told that no one was getting a raise even though IBM has record profits this year, the manager told me that I was welcome to go somewhere else and that if I wanted to be considered for a raise next year (if they offer it) I had to get my utilization score up (work overtime). He then stated 'Your job should be first, before family, and anything else'.Needless to say, I am taking his advice and finding a new job.",
        "pros": "I really can't think of any. Maybe the IBM name and reputation but even that is questionable these days.",
        "summary": "Avoid IBM if possible.",
        "role": "IT Specialist",
        "date": "Jul 16, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Where to start... pay, stress, quality of management",
        "advice": "You already know the betrayal you are doing to the American based employees",
        "pros": "It still looks good on your resume. Its a good short term starting place, but opportunities for AREAL world experience are lacking. Management is forcing older workers out the door. Quality team mmebers are fleeing the company due to lack of respect and wage issues. You are no longer valued as a contributor, you are a deficit to the company. Contracts are NOT based on customer sat.. they are judged by who gets sued f… or breech of sla's. If you have a good customer sat, you are way over staffed. Use the time at ibm to gain resume experience. Do not plan on a lifetime career.. they dont exist anymore",
        "summary": "Dont stay too long",
        "role": "PM",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I was working hard, making a lot of progress and getting praise from mymanager and co-workers. One day I read an article on the Internet saying thatcompetition in the microelectronics industry had intensified and companies should look atvarious options to remain successful. I showed the article to my manager and asked for hisopinion. His response was “not to worry and keep up the good work”. Of course…  I expected morefrom my manager, but I noticed that him and other first line managers at IBM were so muchinvolved with just managing their direct reports and waiting for a directive from above on whatto do, so they rarely if ever took initiative to propose any anticipatory changes or tuning.In March 2002 Sam Palmisano became the CEO of the company. He joined IBM in 1973 as asalesman in Baltimore and later moved up the ranks as senior managing director of operationsfor IBM Japan, senior vice president for the personal systems group, the enterprise systemsgroup and IBM global services, and president and chief operating officer. Shortly thereafter,when IBM Microelectronics announced its financial results for the first quarter of 2002, multi-million losses were revealed. Unfortunately, the senior management didn’t or couldn’t do muchto anticipate this, so now everyone was waiting what the new CEO would do in this difficultbusiness situation. At that point of time only reactive changes could be made. Instead ofadaptation, which in my opinion required a lot more skills from Palmisano, he chose re-creation.What was his solution? Massive job cuts. In June of 2002 approximately 1,500 out of 7,000employees were laid off in Burlington and I was one of them. Workers piled their belongings incardboard boxes and left the office for good, collecting pay for the next 60 days. Among 1,500employees who were laid off there was a substantial number of new hires who joined thecompany just a little bit more than a year ago. All of the sudden, from the greatest asset peoplebecame something that can be easily dispose of in order to cut costs.",
        "advice": "I was really outraged when I found out that for such a “great” job in 2002 Palmisano wasawarded a bonus of $4.5 million in addition to his salary of $1.43 million. In my opinion, indifficult times good leadership calls for a leader to share in the pain, for example taking a paycut. One may doubt if any CEO would do that. Well, I have an example. Steve Appleton, theCEO of Micron, the Bo… ise, ID semiconductor company did just that under similar circumstances.In 2001 Micron was hit hard by a downturn in the microelectronics business and similar to IBMMicroelectronics needed to make layoffs. Appleton announced that his annual salary of $800,000would be dropping to zero! He went for more than two years without a salary and even sold hisvacation home and several small personal planes to raise cash. Only when Micron becameprofitable again in 2004, did Appleton resumed his salary.",
        "pros": "What attracted me the most toIBM Microelectronics was their vision: “we are committed to creating the most advancedtechnologies, products, services and solutions for our customers around the world and weemploy the most creative and innovative minds to help us achieve that.” In addition, the phrase“our people are our greatest asset” was pronounced by the company’s recruiters on numerousoccasions.",
        "summary": "awful place",
        "role": "Physical Design Engineer",
        "date": "Jul 26, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lipservice. Don't believe it, especially from senior management who think they're doing the right thing, but all they're doing is propping themselves up so they feel good as they look to retire.",
        "advice": "Get real. Get vision and be true leaders. Believe in your vision. Stop hiring consultants and listen to your inner voice. Listen to your employees. They're unhappy. I gave my blood for the company, and because of 1 really bad sr vp who you raised to his/her level of incompetency, I'm out. Stop letting Palmisano bleed the company.",
        "pros": "It's a job. If you don't have expectations beyond that, and are flexible to know that you might be out tomorrow.",
        "summary": "IBM needs to get back to being a leader with vision",
        "role": "Advisory Software Engineer",
        "date": "Aug 20, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Grueling hours if you let them boss you around; little to no pay raises; low wages; they will outsource you overseas in a heartbeat; little communication from upper management; billions in net income yet very little to boost pay; poor quality of work provided to clients due to understaffing of accounts.",
        "advice": "Actually listen to and fight for your employees. Pay people what they're worth & give pay raises above the rate of inflation;",
        "pros": "A variety of benefits; 3 weeks vacation to start; great name to put on your resume when you get laid off",
        "summary": "IBM - the Big Blue cesspool",
        "role": "Accountant",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM preaches work from home and work life balance, but they don't practice what they preach. Management have a much easier time moving to other positions within IBM, than non-management staff. Very political place to work...IBM has been in a constant state of change over the last four plus years and very little of it has benefited the employee, from no longer offering a pension to revoking work from home privileges t… o all employees within the our division to not granting pay increases for even some of their top performers for two years running now. Overall a huge surprise to someone who grew up in the Big Blue family.",
        "advice": "Stop the continuous change with what you expect and require from your employees. Nobody likes a moving target. Reward the people who put on the high revenue map. Practice what you preach. Don't promote or sell the idea of mobility to your customers when you don't practice that yourself.",
        "pros": "IBM is a recognized name in the IT industry",
        "summary": "IBM...Not what you would think.",
        "role": "Advisory Software Engineer",
        "date": "Aug 21, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Travel is extensive. \"Work-life balance\" is totally lip service. The only thing that matters to this company is sales and as a result, the only real bonuses go to sales people. Oh yes, and they use forced rankings, which means someone has to fail. I was fortunate enough to always have a high PBC rating (of course not high enough to get any decent bonus though). Raises are a pittance if non-existent. Their approach is…  flawed. They oversell commitments, even those that we have zero experience with. Their theory is to just throw bodies at any problem, and as such, you will just become a resource. Another number. Another worker. Additionally, you never know when/if you might be layed off. You will have to travel a lot, get little to no salary increase, little to no bonus money, little to no work-life balance.....well at least you get some job security right. Not exactly.",
        "advice": "Stop hiring people because you need bodies and start hiring people who are passionate about technology, have critical thinking skills, and most of all can present well in front of the customer. Hire fewer people and pay them better and treat them better. Commit to projects you are qualified, and say no to those that you aren't. When you take on a customer project that we have no experience with, it shows in a very ba… d way. Keep management overhead on projects to a minimum so as not to eat up all hours/dollars that those actually delivering need to use. Create a true work-life balance. For what your employees are sacrificing, they are not getting much in return. They are giving up their lives for you. Think about that. No time with family or friends. 2 or 3 days on the weekends to complete all 7 days of errands and work at home.",
        "pros": "There are a few good reasons to work at IBM. The first is to establish a higher base salary for yourself which you can advertise to your next employer. Get in and get out. The second good reason to work at IBM, at least as a consultant, is you do learn a lot in a consulting role. This theory applies at any consulting firm though, so not particularly strong seller for IBM in particular. If you are lucky as I have been… , you will make some great friends as well on the road.",
        "summary": "Start looking for a new job the day you you start with IBM.",
        "role": "IT Architect",
        "date": "Sep 4, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Long hours, little personal time off, NO overtime pay. Employees are required to replace hours for vacation and holiday time-off with additional hours worked to receive any bonus or salary increases. Management receive excessive compensation as compared to the employees they manage. 60 to 80 hour work week are not uncommon with no compensation in pay or time off. Company removes employees who even mention the word UN… ION.",
        "advice": "Management should not receive a higher percentage of salary or bonus greater than the highest ranking employee. Stop the sweat shop environment where management benefits most from the work of the employee. Most employers don't need an organized union of employees if the employee is treated fairly. IBM needs a union.",
        "pros": "Average benefits and the ability to work in a good location that provides small town atmosphere with big city benefits of restruants, entertainment, and recreation. The climate is moderate with an average high temp of 71 degrees, an average sunshire days of 62%, rain fall of 40 inches and only a annual 9 inch trace of snow. The traffic is moderate and the commute is short. Housing is reasonable in comparison to large… r cities.",
        "summary": "IBM employees want union representation for fair treatment",
        "role": "IT Specialist",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The performance rating system is seriously broken. When I did well, I was told that \"Your work was good this year\" -- nothing more. Details were forthcoming only when management thought that my performance was inadequate. I was forced to resign after being given a negative performance review and being given 6 months to improve my performance. This trial period was a joke, as I worked myself to the bone to meet the go… als that were given to me, and I did meet the goals, but was told that I had not met the goals. I believe that the motive for these actions on the part of management was age discrimination.",
        "advice": "I would discontinue the practive of age discrimination. I would fix the PBC (Personal Business Commitments) system. It appears that first-line management is rated primarily on the individual work they do (e.g. writing papers and going to conference) than on the way they manage. Also, every department is run differently. Senior management needs to adopt and enforce software development best practices. I had difficulty…  getting my manager to support using source code control!",
        "pros": "Salaries are good. Work-life balance is very good -- I was able to work at home regularly. Basically, I was able to take off all the time I needed, but performance expectations were not adjusted accordingly. There are many smart people at IBM Research, and it's possible to learn a lot. Seminars on various topics are offered constantly. I found that the variety of work was very good until the last year or two that I w… as there. I was able to transition from desktop programming to Web programming. Everyone who works at Research in Hawthorne has their own office, which is another plus.",
        "summary": "Age Discrimination at IBM Research",
        "role": "Software Engineer",
        "date": "Sep 22, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Do not expect much in the way of ongoing compensation. The management philosophy appears to include: moving as much work as possible offshore, drive the people into the ground - they can be replaced, don't compensate well as the workers should be grateful to have a job, and at all costs maximize executive compensation. Layoffs are regular (or as they like to call them \"Resource Actions\") even when the company is anno… uncing great accomplishments to shareholders.It is very difficult to get time or approval for ongoing professional training since the company is almost always in some sort of \"cost freeze\". It is not unusual to go years without being able to take a course. Expect any education to be on your own cost and on your own time.It can also be years without getting any raises. Their stated goal is pay a little above average for the industry. The management focus seems to be on how to cut benefits, rework the salary plans to the detriment of the workforce and in some cases implement salary cuts which are not offset by the supposed improved way of handling things. If you are not early in your career, do not expect much.",
        "advice": "Take care of the people actually doing the work and driving the business. If you want dedication and loyalty from the workforce, live up to your end of the bargain. Stop focusing entirely on short term goals and invest in your people.",
        "pros": "There are many different areas in such a big organization. The people actually doing the work (versus management and Executives) are mostly very competent and cooperative. Workers are knowledgeable, driven and cooperate to get things accomplished often with mandated \"free\" overtime for the sake of productivity improvements. The productivity is not measured based on hours worked - only the cost of the salary, etc are … accounted for.There is training and reasonable room for advancement at first. An okay place to start your career or work a short time before you are taken for granted.",
        "summary": "Living off its past reputation",
        "role": "Project Manager",
        "date": "Sep 28, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Incompetent upper management. Executives are more interested in driving the stock price up in the next quarter to line their pockets, than to plan for the company's long-term prospects. Most senior management is completely clueless on the technical front and rely on underpaid and overworked folks in the trenches to do all of the hard work.Powerpoint presentations are ubiquitous and long (100+ slides in a presenta… tion are not unusual), and people spend months and months between pre-pre-reviews and pre-reviews before the final review.",
        "advice": "Resign!!! Think about what the Watsons would say, if the could see you now.",
        "pros": "Name recognition on a resume. If you do join, don't stay long; a couple of years max, then move on to some other company with better prospects.",
        "summary": "Read this before you join IBM",
        "role": "Senior Software Engineer",
        "date": "Sep 29, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is no appreciation or respect for employees, management is incompetent and decisions/promotions/raises are completely political in nature. It is not what you know or what you do, its who you know. Upper management is too greedy with the distribution of wealth, leaving employees with only crumbs.",
        "advice": "Get more competent and become more ethical. IBM has good potential, it is just severly miss-managed. There are a lot of inefficiencies in the company that waste a great deal of money. Cutting out the unneccessary layers of management and focusing on morale will take things a long way. Not only do lower level managers fail to enhance employee morale and productivity, they often impede progress with nonsensical behavio… r.",
        "pros": "There are not many, if any good reasons to work for STG. The only good reason I can think of to work for STG is a steady pay check for the short term.",
        "summary": "Poorly managed company... will not survive too long with all the inefficiencies and poor employee morale",
        "role": "Hardware Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No raises, No education, Too much travel, high utilization targets. For example, while IBM is making record profits, a blanket decision was made not to give I/T Specialists raises. Doesn't matter what you did, no raise, no chance. 110% utilization makes you average, (rated a 2) which means no raise, no bonus) Plan to work 50 hours minimum to keep your job, 80 hours to excel, and that is only if the contract allows fo… r it. (FYI, travel time doesn't count).",
        "advice": "Remember what made IBM great...its people.",
        "pros": "If you're young and need a year or two of experience, this is a great place. They'll hire almost anyone, chew you up, burn you out, and lay you off. IBM notoriously pays lower than others, so you'll have an opportunity to boost your salary as soon as you leave. The benefits used to offset the low salary, but they have been whittled down to average, at best.",
        "summary": "Great place to get a years experience, but don't plan to stay",
        "role": "Senior IT Specialist",
        "date": "Sep 30, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lack of management support, technical savvy, nepotism, and discrimination. Bathroom floors are painted a disgusting color, faucets don't match, and soap dispensers constantly drip a glowing, stinky, pink soap.Managers are often unaware of what the teams are doing. Hence, technically ignorant. Nepotism and favoritism is rampant, making management issues even worse. Discrimination against any employee is a career h… azard to the point where employees are fearful of revealing a disability, especially by accident. Microwaves are wired to a single minute timer because a secretary burned popcorn which triggered the smoke alarms and caused the building to be evacuated. Twice. Imagine being treated as a neglected child. It's worse than that at IBM.",
        "advice": "Actually take into account the suggestions given by rank-and-file employees. Don't just say \"email me any time with questions\" but then reply with a belittling email, cc-ing every manager down the ladder to the employee. Stop the 'rule by fear' environment! Everyone fears they will be pushed into early retirement or train their replacement who has a heavy Asian accent. This keeps information sharing from happening. T… hose who wish to learn more and be promoted aren't because they are pushed down from above. Constantly.",
        "pros": "Compared to what else is available in this area, the pay is okay. The cafeteria food is varied but the area itself is crowded because the work site is huge with 1700 IBMers alone at the site. Raytheon also shares the same eatery along with a small high school. Parking is plentiful. Being able to work with technology is great, provided that it works as described. Commaderie is great IF one can break into the establish… ed network. One can jump start a career at IBM but don't stay too long to avoid being pigeon holed into a specialty which does not translate well into the outside world.",
        "summary": "IBM Is Not Fair",
        "role": "Staff Software Engineer",
        "date": "Sep 30, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Non-existent bonuses. 1-2% pay raises (at most). Incompetent management. IBM is offshoring much work to India, Brazil and Argentina. Management is fully committed to reducing the US workforce to a bare minimum.",
        "advice": "Gosh, where to begin? Quit now before there is a royal uprising. Give back the 15% pay cut you gave to 7600 employees back in Feb 2008. Classify them back to Exempt status, as opposed to the current hourly worker (slave wages) non-exempt.",
        "pros": "By far, the best reason to work for IBM is the flexibility to work from home. And perhaps it will look good on your resume.",
        "summary": "Will the last US IBM employee standing please turn off the lights and water the plants.",
        "role": "Senior IT Specialist",
        "date": "Oct 3, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Work and life balance is just some old wives' tales, and the pay absolutely sucks.",
        "advice": "Listen to the younger people, don't be so arrogant, think outside the box.",
        "pros": "To get the name on your resume, nothing else. Or if you like telecommuting, then this might be the place for you. The 3 weeks of vacation is good for new-hires, but taking them can be hard. Use it or lose it, your manager might not approve it when you need it the most.",
        "summary": "My experience at IBM = Dark Ages of my life",
        "role": "Internal Auditor",
        "date": "Oct 8, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Consultants have NO work/life balance; just utilization targets. Period. Anyone who tells you otherwise isn't a full time consultant at IBM. Negotiate your salary VERY carefully before you sign off. Virtually NO raises once you get in, and you'll quickly find that new hires (many MUCH less experienced), make MUCH more than you do because they knew how to research and negotiate better. Also, bonuses are a joke so focu… s on your BASE pay.",
        "advice": "Managers, read and learn more about career development. Sr Mgrs, ensure that your lower level managers, particularly first line, know how to help employees grow. All: Consider promotions based on merit not nepotism.",
        "pros": "PERCEIVED IBM brand. Great opportunities for different types of consulting assignments, though not so much anymore due to the infighting for bill rates between organizations. Good job security but poor opportunities to grow, so if security's your only criteria in measuring a 'GREAT' company, then it's an OK place. 90% of your IBM colleagues are truly GREAT and you will learn far more from each other than the company.…",
        "summary": "IBM GBS Consulting: 100% utilization + poorly scoped/managed projects = NO work/life balance and LOW morale.",
        "role": "Managing Consultant",
        "date": "Oct 9, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "You are an expendable robot. Company has unrealistic performance objectives. You are just a number to them. Management is clueless.",
        "advice": "Don't be so greedy. Take time to listen to your employees instead of watching your stock ticker.",
        "pros": "You get a paycheck every few weeks.",
        "summary": "IBM. I've Been Misled.",
        "role": "Technical Support Analyst",
        "date": "Oct 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you want to get overworked, unpaid and under appreciated, this is the place you want to be. I have never seen management try to cut corners to save a buck than I have in the Systems and Technology Group. And not to mention the sheer incompetence of team leads not making an effort in order to distribute accurate and correct test plans in order to complete necessary projects on time. Once the project does reach it's…  completion date, there is no appreciation expressed for the hard work or overtime spent in order to meet project deadlines by management. It's off to the races to try and complete the next disaster of a project that you're assigned.",
        "advice": "How about you listen to the needs of your employees in order to get the job done properly instead of trying to keep the stockholder happy by keeping the share price up?",
        "pros": "Learning new technologies that are in development or are ready to hit the market.",
        "summary": "More layoffs imminent",
        "role": "Hardware Engineer",
        "date": "Oct 28, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I thought I would get ahead at IBM. I thought I would be judged on the work I did. But eing a white man made it nearly impossible to get anywhere. I would see women and minorities do terrible things like not show up for work, work half days when they were getting paid as full time, waste time, lie about status, etc. But when it came time for promotions, appraisals, and rewards, those same people got rewarded very nic… ely whereas I would work a lot of overtime and had excellent results to show the quality of work I did but never was rewarded by managers.I would hear \"you are doing a great job\" at appraisal time from my several managers through the years, yet this was never reflected in actual performance ratings or raises.Benefits kept deteriorating every year I was there. IBM used to be the top company for benefits; now it seems like it is in the lower half of companies out there. We used to get free health insurance with very low copays if at all; now there are very high premiums, copays, and deductibles. Since I have a wife and kids, I had to pay a lot more in premiums the last few years I was there.They talk about \"work life balance\" but then make you work nights and weekends as their projects always slip schedule.I worked my butt off until I finally realized that the politics inside IBM would never allow me to advance. So I quit. I do not regret that decision at all. IBM is a very messed up company internally.",
        "advice": "Quit and let someone who cares about employees run the company. Give back pension plans and restore health benefits. Stop allowing managers to reward minorities for their gender, sexual orientation, or color of their skin. Only allow people to be rewarded based on the work they do. Make executive and management compensation more in line with how employees are compensated. Don't allow executives to make huge bonuses a… nd then tell the employees that they won't get variable pay because we did bad in the market.",
        "pros": "The technology and products are way cool. They used to suck in the mid-90's, but now they are cutting edge.Even though most people have to share an office, at least I never had to work in a cubicle. Other people in some of the newer buildings are starting to have to work in cubicles, though. It just depends on where you work within the company.",
        "summary": "Minorities at IBM can get ahead without doing any work. Nearly everyone else is stuck at the bottom.",
        "role": "Software Engineer",
        "date": "Nov 10, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The pay is very low compared to similar positions at competing companies. There's constant \"freezes\" on bonuses, raises, promotions though only for working folk of course not for executives. No recognition for a job well done, lack of opportunities to grow one's career. Long hours, lots of responsibility but low pay.",
        "advice": "Share some of the prosperity of the company with the people that make it succeed. Compensate employees justly instead of using outsourcing and resource actions as a fear inducing technique to refuse raises or bonuses with the excuse of \"you get to keep your job\"",
        "pros": "There's plenty of opportunities to telecommute",
        "summary": "Avoid IBM if you can get a job elsewhere!",
        "role": "Software Engineer",
        "date": "Nov 14, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Overall a cut-throat, finger-pointing environment. Managers have no problem yelling at individuals in front of their peers. When work load is heavy, management expects employees to work round the clock to meet THEIR ridiculous schedules. Too many releases leaving exhausted employees with no time to regroup.",
        "advice": "Change the culture in IBM to make \"treating employees with respect\" the norm. Schedules need to be shared and worked out with entire team to deliver quality product, on-time, and within cost. It ain't rocket science... Treat people with respect, include them in decision making and employees will respond positively resulting in quality products. I expect when the job market improves, there will be a mass exodus of emp… loyees leaving IBM.",
        "pros": "The IBM name is impressive on a resume. Some of the folks working there are very talented. Some of the managers are very good and understanding of the pressures in the work place.",
        "summary": "IBM is old style management - manage by fear. Employees are plug and play!",
        "role": "IT Specialist",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very limited opportunity for career growth; too much favoritism in promotions and assignments. Low pay compared to others in the industry doing similar work. Increase opportunity for career growth; remove favoritism in promotions and assignments -- base it on skills. Pay comparably to competitors for consultants in the industry doing similar work.",
        "advice": "Increase opportunity for career growth; remove favoritism in promotions and assignments -- base it on skills. Pay comparably to competitors for consultants in the industry doing similar work.",
        "pros": "Benefits, job stability, good for your resume. There are thousands of fantastic people (colleagues) at the company; the problem comes with some who tend to abuse authority because they know that there are few checks and balances at the company when employees complain or dispute working conditions and/or evaluations.",
        "summary": "Good company - depending on the area you're in.",
        "role": "Managing Consultant",
        "date": "Nov 28, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Focus is given to those who only exist to contribute to IBM, without regards for any personal life. In other words while IBM touts \"work/life balance\" as being important, it actually encourages an \"all work / no personal llfe\" atmosphere. The moment a person realizes that they need to slow down and re-claim their personal life, IBM loses interest in that person and labels them as \"making too much money...\", hoping th… at the person will eventually get frustrated from a lack of forward financial progress, and simply quit. Alternatively, if the person doesn't quit, they get laid off.",
        "advice": "If you're going to not have a more even handed approach to dealing with all your employees, not just those dedicated to the \"all work / no life\" ethic, don't get upset when some of those \"all-workers\" look around, notice what is happening to their friends and colleagues, and decide they-themselves decide to quit while they still have their high energy levels…",
        "pros": "Great place to learn from others",
        "summary": "IBM: Great place to learn, bad place to work.",
        "role": "Staff Hardware Engineer",
        "date": "Dec 30, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Upper management is only running the company to maximize their own personal compensation. Maximum greed. Quarterly fudging of \"whatever it takes\" to make quarterly numbers is so management can maximize their own stock options to further maximize their compensation. Upper management does not otherwise care about the shareholders. By the time long term shareholders end up getting bitten by all this, upper management wi… ll be long gone with fat bank accounts. As for the employees, several years ago the executives decided they are all overhead costs which need to be minimized by any and all means possible. The recent Business Week article about IBM employees being reduced to nothing more than numbers shows exactly what IBM is all about. Young fresh talent out of college is cheap as are foreign emerging nations talent. At present rate, won't be long when all employees except for the executives will be at overseas facilities and/or the company will have already passed on into history. Treatment of US employees a few years or more in the business reminds one of the working conditions akin to slave labor.",
        "advice": "None. They do not care.",
        "pros": "Largest Computer Company in the World.",
        "summary": "IBM executives run IBM strictly for their own personal gain.",
        "role": "First Line Manager",
        "date": "Jan 2, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "outscouring,taking pay cuts, and losing health benifits.",
        "advice": "stop the outscourcing, stop the forced overtime, give a cola to the retires. stop cutting into employee benifits such as health and stop taking 10 to 15 % of our saleries every year.",
        "pros": "the 401k program and the penion program",
        "summary": "out with the new ibm",
        "role": "Anonymous Employee",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you are unwilling to travel at the whim of the project, you are submitting your resignation",
        "advice": "Please try to be more supportive of our efforts and appreciate our value both to the bottom line and as human beings.",
        "pros": "If you live in Bangalore, Pune, or Mumbai",
        "summary": "IBM is less than ideal",
        "role": "Product Manager",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "long hours, bad conditions, more work for less attitude from management",
        "advice": "look to rebalance the company and push back on customers who are a pain.",
        "pros": "none that I can think of. IBM has an attitude of wanting more for less. The ONLY people who matter are the shareholders, employees are treated badly and expected to give their total commitment to a company that will suck you dry and then throw you aweay when you cannot keep up with the pressures of the work. The ONLY good thing abuot the company is that the insurance package is good compared to some other companies, … but even that is being whilttled away year by year. Equipment for actually doing the job is limited and of incinsistent quality, I even had to buy my own monitor as the company refused to allow one as thehy did not feel it was required for me to actually do productive work!!!",
        "summary": "IBM is not the place to be.",
        "role": "Advisory Software Engineer",
        "date": "Jan 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM will work you to death. They will pigeonhole you in the same job, limit your ability to learn and grow so that you can have a lifelong career. They will treat you like a piece of meat, and dump you in a heartbeat. You can do a great job, and get great results, and you can work 80 hours a week. It doesn't matter. All that matters is that they reach their profit targets, so the upper executives can get their big fa… t bonuses. You will be subjected to unending stress and never know from one minute to the next if you still have a job. You will usually not get an honest review of your work as management will rank you against other employees. Even if management has a very talented and high performing team, some people will be ranked lower and get lowball performance assessments. There is no fairness or honesty in the performance assessment system.",
        "advice": "What advice can you give people who have sold their souls to the devil and worship at the altar of extreme greed? IBM senior executives have no special talent, yet they think the company owes them millions of dollars a year in compensation while they destroy the US economy by sending jobs to other countries. They are making communist countries like China stronger, the US weaker, and the IBM executives are the only be… neficiaries. They should join al Qaeda directly. Osama bin Laden loves them because they are already doing a fantastic job of destroying the USA for him.",
        "pros": "IBM is a good place to pick up SOME professional & technical training and learn how large corporations work. It is also helpful in work life balance by allowing employees to work from home.",
        "summary": "IBM is an employer to avoid.",
        "role": "Project Manager",
        "date": "Jan 7, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Years of no raises, cost of benefits for a family of 4 at over $9000 per yr for employees, no respect for the people that are making the money for the company then giving huge raises and bonuses to upper level managenment and CEO. Layoff thousands of US employees while they continue to outsourse work to other countries and IBM as a company posted billions of dollars in profits.",
        "advice": "Treat your employees equal. Treat them like you treat yourselfs. We all deserve raises and bonuses when the company does well. Anyone that is aware of the pay and overall compensation and lack of benefits that takes a job at IBM is plain crazy !",
        "pros": "None since the late 80's",
        "summary": "Wake Up !",
        "role": "First Line Manager",
        "date": "Jan 29, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM has no concern for the US of A. Slimy management. Continual lay-offs (resource actions). IBM management has decided to move away from the American worker in favor of the Indian and Chinese worker even at the expense of the American economy and national security. Overall, it is not possible to feel good about supporting such an anti-American company. Their lies and deceit to American workers have shattered many dr… eams. IBM puts Americans in the unemployment line by the thousands and unethically tries to hide what they are doing.",
        "advice": "I don't senior management for taking jobs away from the United States to India. It is how you are doing it that is abhorrent. Stop ltrying to make employees feel like they have any real prospects of a long-term job. Come clean on the numbers and plans. Just admit that the current international economic situation dictates moving most of the jobs to India. Tell us just what your goal is in terms of number of employees … per country and job site. When you decided that 80% of the American jobs were going to be heading overseas you should have told us and laid out the time-lines. It is very dirty how you are trying to secretly do this. We all see what is going on and it is a slap in the face that you won't just give us the hard facts.",
        "pros": "Relaxed dress code. Flexible work hours.",
        "summary": "IBM is an International, not US, corporation.",
        "role": "Staff Software Engineer",
        "date": "Jan 29, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM does not value its employees. Treats people like commodities. Senior management view themselves at the chosen ones, and the rest of us as \"resources\". In my view, they have no morals, no character and no soul. They are not creators of wealth and jobs, rather they are exploiters. In the past, I have seen some great leaders at IBM. No more.I think the future of IBM as a company is not good. The present cult… ure is not sustainable. They are throwing away too many good people.I remain thankful for the years I have had at IBM and hope to remain employed there for a few more years. I could not in good conscience recommend it to anyone else.",
        "advice": "End the culture of greed at the top. Try being a true leader, and a steward of this once great company.",
        "pros": "Salary, company resources, business reputation.",
        "summary": "IBM's current leaders only care for themselves.",
        "role": "Architect",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Bloated bureaucracy and overbearing processes. Much lip-service paid to Open Source, but legal approval processes to be able to use it make it agonizing and slow to actually get permission to use it. Patronizing and often downright mean management. Management which often explicitly stifles and punishes any hints of dissent; aka, \"honest opinions\". Much arrogance about being \"cutting edge\", whereas the reality is that…  IBM is too slow to adopt new technologies. Co-option of terms like \"agile\", applying them to whatever IBM currently does rather than actually changing and \"walking the walk\". Constant fear of being on the \"wrong\" project or working for the \"wrong\" manager, which may lead you vulnerable to the next round of layoffs. A performance review process which often bears little relationship to reality, with only managers and a few \"architects\" giving any input into your review, as opposed to your actual peers with whom you work. Lack of money to buy equipment, resulting in obsolete computers on desktops, and a constant struggle to find adequate hardware to test on.",
        "advice": "Don't patronize. Tell us the truth. Reduce the layers of management. Do away with processes that hinder productivity and add nothing to quality.",
        "pros": "The pay's good for senior talent. The benefits are decent.",
        "summary": "Good employees laboring under difficult circumstances.",
        "role": "Senior Software Engineer",
        "date": "Feb 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management is not so bright. Most managers I've met seem to be afraid to have opinions of their own or to stand up for their workers. The PBC evaluation system is the best evidence of this. Most first-line managers will sell their employees down the river at evaluation time if that's what their manager tells them to do.Nobody really knows what anyone else does (this happens in all large companies---it's not p… articular to IBM), so it's the smooth-talking self-promoters who get ahead at IBM. This is really a shame, because there are a lot of quite bright and talented developers who are overlooked while the self-styled 'architects' flourish.",
        "advice": "Value your software developers.",
        "pros": "They do 401(k) matching. Is active in raising money for the local United Way.",
        "summary": "Arrogant, bumbling company.",
        "role": "Software Engineer",
        "date": "Feb 9, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM internal performance review rules promote meritocracy. You can work very hard, accomplish a great deal and still be given a bad or average performance rating just because you were not visible enough to the right people or simply because it was your time to take one for the team. Most employees I know of have given up on trying to improve anything in the products. People are in \"survivor\" mode - minimum effort for…  maximum benefit and don't stick your neck out. A lot of truly talented technical people have either left on their own or were layed off. People that seems to be staying behind are poor souls that are stuck at IBM for some reason, or those who play internal politics well.",
        "advice": "What the hell are you doing? You are destroying this company's future potential for innovation and, in many cases, simply for ability to release and maintain products. You are treating employees just as resources without regard for their skills and abilities. Talented people that made this company what it is today retire, resign or are layed off. Your new hires, contractors and global resources have no skills to matc… h people that are leaving. And they will never have those skills because there is nobody left who can teach them. Those kind of skills can't be obtained in 30 or 60 days either. They take years to develop.",
        "pros": "If you are not ambitious and not passionate about your work, if you don't expect much in terms of professional respect, opportunities, fair compensation and fine with being layed off at any time, this might be a company worth considering.",
        "summary": "Set your expectations low, really low and plan to move to a different company in a few years",
        "role": "Advisory Software Engineer",
        "date": "Feb 9, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Senior management is only interested in keeping stock price high. IBM is always offshoring jobs. 2/3 of IBM employees are outside the US now. Vacation blackout dates for a total of 2 months each year. Management has not mentioned a word to it's US employees, and over 5,000 have lost their jobs in the last two weeks. They rule by fear and intimidation. When you manage good business results, you don't get a raise, and … instead are fed the line \"at least you have a job\" all while IBM records record revenue.",
        "advice": "Offshore some executives for a change. The Chinese keyboard factory where they make 41 cents an hour might have some openings. It's time to stop manipulating the company for the executive benefit. Executives should work for the employee, not the other way around.",
        "pros": "work from home mobility is nice. IBM has nice logo items.",
        "summary": "IBM - I've Been Mislead, mistreated, miserable",
        "role": "Customer Fulfillment Professional",
        "date": "Feb 10, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Unless you reside in the ivory tower in Armonk, you are just a serial # to this company. Management is a joke. They are not respected, because generally speaking, most of them are incompetent. They rely on their team to make them look good, so when it comes time for recognition, they have no problem accepting it for themselves, rather than passing it on to those who \"truly\" deserve it. The PBC rating system (yearly r… eview) is a joke, it is a luck of the draw exercise. I have found that in 10 years with the company, it seems we spend more time trying to justify our employment by making sure our powerpoint presentations look pretty and also that the data presented to executives is as \"accurate as possible\". Employee morale is horrible. It has become a depressing company to work for.",
        "advice": "Get your heads out of the sand and start showing your employees the \"respect for the individual\" you claim to have. Show them you actually appreciate their efforts and that you care about them as human beings, not just a serial #. Be open and honest with them, especially when layoffs will be approaching. Help them prepare for the worst.",
        "pros": "The benefits and perceived respect for IBM in the marketplace.",
        "summary": "Time to expose Big Blue as a Big Fraud.",
        "role": "Business Analyst",
        "date": "Feb 10, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Sadly, IBM has made alienating its workforce into an art form. People work under continual threat of being laid off, and those who remain watch their benefits erode every year. Every action from upper management reflects their attitude that \"human capital\" is to be used and then discarded. You are free to dismiss this post as a rant from a disgruntled ex-employee, but mark my words - join IBM and 1) you'll be sorry, … and 2) you'll be back here to leave a post identical to this one. Run, don't walk, from this sorry excuse for a company.",
        "advice": "The loss of IBM's senior management and their brazen \"let them eat cake\" attitude would be a classic case of addition by subtraction. The only reason Palmisano gets a \"1\" rating is because no lower numbers are available.",
        "pros": "Very good people throughout the company - far better than IBM deserves.",
        "summary": "IBM does for employee relations what the Titanic did for the cruise industry.",
        "role": "Financial Analyst",
        "date": "Feb 10, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Incompetent middle and upper management. Executives that put their personal gain ahead of all else, including the United States of America. Poor quality products, caused by said executives incompetence.",
        "advice": "Resign, and give back you salaries and bonuses. You haven't come close to earning them, and it might help make up for the 27 billion you flushed down the toilet with the stock buy back program.",
        "pros": "The company almost pays the industry standard wage for software engineers.",
        "summary": "Don't buy IBM products, and don't work for IBM",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Poor management that provides little direction. The \"matrix\" environment creates several bosses you have to report to and each boss is in a different organization with different goals. It's truly a case of the left and right hands not talking to each other and putting staff in the middle to make both sides happy. Career development is not a focus and certifications are not encouraged. I've tried to transfer to other … positions and management would never provide me a release date; even though HR policies says there's a 90 day maximum hold period.",
        "advice": "Get rid of the middle management fat and talk to your staff members. The \"big wigs\" have no idea what happens in the field. Management decisions need to be explained. There's a lot of intelligent staff members who would put forth more effort if business decisions were explained and the big picture was shared and not a secret.",
        "pros": "Vacation time if you've been there a while. I used to be able to work from home but IBM is canceling all work at home policies, so there's not much reason to stick around.",
        "summary": "If you don't work for IBM, don't come, if you already work here, leave",
        "role": "IT Specialist",
        "date": "Feb 11, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management cannot be trusted to tell employees the truth about strategy. Agreements are regularly broken. Overall corporate culture is based on fear and intimidation. Very little support or teaming. Constant threats from upper management despite reality of individual's contributions or performance.",
        "advice": "Stop competing solely on price and bring back an emphasis on quality and customer satisfaction. IBM's reputation is in the toilet due to strong-arm tactics, poor delivery and lack of accountability",
        "pros": "The benefits package is decent - health insurance plan is top-rate.",
        "summary": "IBM is looking to cut US job rates to match offshore salaries.",
        "role": "Senior IT Architect",
        "date": "Feb 11, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Complete lack of respect for the individualYou're treated as a component rather than a living, human being.You simply can NOT trust anyone at the executive level",
        "advice": "Revisit your corporate roots. Your people have suffered enough, it is time to take a long, hard look in the mirror and decide if you actually like what is staring back at you.",
        "pros": "If you enjoy working within the realm of complete chaos, this job's for you.If you look forward to working 60+ hours a week, with little to NO guarantee that you'll reap ANY reward, this job's for you.The single, shining positive is the wonderful people that have managed to survive the wrath of Sammie.",
        "summary": "IBM, the meteoric fall of a once, great corporate \"family\"",
        "role": "Advisory Technical Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM mgt lies and uses both the workers and clients. IBM management is very unethicalas they only care about their own pockets.",
        "advice": "You need to take care of the IBM workers and many of us have quite of bit of time invested in the organization. Senior mgt should also stop firing staff that exceeds their objectives. It makes no sense to release all the people that IBM US has moved on and the management of the failing organization remain IBM employees.",
        "pros": "Old pension plan is the only reason to stay.",
        "summary": "IBM is not ( and has not) been a very good place to work for the last 8 years. I'm By Myself. ( IBM)",
        "role": "Business Development Manager",
        "date": "Feb 17, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Obscene greed on the part of senior managers, and incompetence at the lower levels of management. Not knowing if your position is going to be downsized, or right sized, or whatever term is the term of the day for IBM.",
        "advice": "Do the right thing--RESIGN.",
        "pros": "There are few. One would be rather than collecting unemployment, but for the most part I would expect that anyone desperate enough to accept a position at IBM should count on a negative experience. To some that may be the trade off to gaining experience and later finding meaningful employment with an ethical and morally run company.",
        "summary": "Fear and Loathing in the halls; What happens when there is Only Greed and Incompetence in the Board Room",
        "role": "Advisory Engineer",
        "date": "Feb 17, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bad ManagementManagement has too much power and if they dont like you they will treat you badly no matter how well you perform.",
        "advice": "Dont share band information or salary information with service managers and managers who have to manage employees as this causes alot of strife amongst people and eventually jealousy could get to such a level that someone really good leaves. Also management usually do not have enough technical knowledge and lead by gut instinct instead of experience,",
        "pros": "Initially when you start off at the company management paints a rosy picture.",
        "summary": "IBM needs to have real leaders in management to be able lead the leaders of tomorrow.",
        "role": "IT Architect",
        "date": "Feb 17, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No Job Security. Tremendous effort to offshore all jobs to lower cost countries. Pension reduced and frozen from active employees. Medical benefits taken away for retirees. Employee performance ratings decreased for no apparent reason.",
        "advice": "Be upfront and transparent about plans to move jobs overseas. Also, publicly announce layoffs including numbers and locations.",
        "pros": "IBM allows a somewhat flexible work schedule for some jobs.",
        "summary": "IBM is just a shell of what a great company it used to be.",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM in the US is shrinking, and as an employee you will compete with your coworkers for survival. Many people have been at IBM for 30+ years. They have survived many layoffs. If you want to keep your job, you need to be better then they are in the eyes of your manager. Being talented and hard working is not enough. You need to sell your ideas to managers. Most managers were talented engineers at one point, but manage… rs are shuffled often, so most manage groups whose work they have a limited understanding of. If you can't explain to your non-technical relative why you are valuable to IBM, you will struggle to keep your job, no matter how valuable you really are.There is a constant flow of people who join IBM right out of college and are gone within four years. About half find better jobs because they have IBM on their resume. The other half change fields entirely, or go back to school.A manager being laid off is unheard of. Non-managers generally distrust what managers say about layoffs, because managers are invulnerable and so have no empathy. The managers I had took every opportunity to say that yearly ratings were based on your performance and not compared to your pears. In other words, everyone under a manager could get a high rating. This was to fight a persistent rumor that managers can not give high rating to everyone. I believe the rumors are mostly true: A manager could give everyone a great rating, but other managers would question that manager's judgment, so in practice no manager does it.One trap to watch out for is moving to a town like Poughkeepsie NY, where IBM is a large chunk of the local economy, when IBM is at a hiring peak. The housing market moves with IBM's hiring or layoffs. If you buy a house when IBM is hiring, and are forced to sell it a few years later when IBM fires many people, the loss you will take on the house could easily be greater then a year's salary. Ouch.IBM tends to use technologies that are internal or not the industry standard. Often the IBM way was invented before the industry standard way, and often the IBM way is (or was) better by a small margin. Keep in mind that IBM may not be the last place you work before you retire, and make sure that you learn some skills that will allow you to get a job elsewhere. If you spend ten years at IBM and become an expert in the IBM method of making chips, you may find that you can not pass an interview to get a job making chips somewhere else.",
        "advice": "Customers pay a premium for IBM products because those products used to have above average quality. If you invest in the engineering work that keeps quality high, you will be able to keep earning that premium. Management is failing to do this.Managers need to be experts in the work done by the people they manage. No exceptions to this rule should be allowed below the VP level.",
        "pros": "If you want to live in the Hudson valley and work as a computer engineer, IBM is basically your only option. If you are very talented as an engineer and a salesman of your ideas and you have a bit of luck, you will get to work on very interesting technical problems.",
        "summary": "IBM: Okay if you are a superstar, but have an exit plan just in case.",
        "role": "Senior Software Engineer",
        "date": "Feb 25, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Big company with established interests, very slow moving. Sales-oriented, rather than technology-oriented.",
        "advice": "Keep pace with technological advances -- or outsource technology to other companies (Amazon, Google, Microsoft, etc).",
        "pros": "Big company with strong network of clients.",
        "summary": "None",
        "role": "Anonymous Employee",
        "date": "Mar 2, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The current IBM US culture is a culture of open competition beneath a veneer of civility. The 'nice guys' get laid off, leaving the schemers and back-stabbers and team leaders who understand that whomever reports the status of a project controls who stays and who goes. Lies are commonplace as no one ever tells bad news. Low level management is swamped, impotent, and powerless. Yearly appraisals are a farce - the ten … percent 'fast-trackers' are openly praised and rewarded and everyone else is left alone or fired. There is no 'meritocracy' at IBM. A true meritocracy would know that it is possible for everyone to be meritorious, especially if you have hired the best people there are.At IBM the appraisal system is more of a lottery where one out of ten is treated as a champion and everyone else, the other 90 percent, are considered not good enough. The 90 percent, the serfs, are expected to fight amongst themselves and compete for the prized top spots. Since the contest for top dog is rigged and secret with no clear metrics, the serfs pretty much ignore the ratings and do what they can. Why work hard when you aren't rewarded? Why work hard when It is easier to play games and surf the web and grab open source stuff and pass problems around. If your job is a game of musical chairs for a year and a mad scramble at the end to pick the loser then why bust your butt? If the stock slumps no matter what you do then why bust your butt? If the company doesn't care about you then why care about the company?Layoffs are kept as secret as possible and happen quarterly. Actually the IBM management style is mostly secretive. Metrics change. What was good last year is bad this year. You never know where you stand. You may get a bonus 'variable pay' or get laid off. Management, even first line managers, are always 'somewhere else' talking about 'something else' and are hidden as much as possible. As a result fear is commonplace. It is every man for himself and nobody really knows what 'doing a good job' means anymore. Some of the best and brightest are layed off so what exactly does 'doing a great job' mean?",
        "advice": "I don't know if it is a blessing or it is a curse to have the knowledge of how great IBM used to be and how far IBM has fallen.You should be ashamed of yourselves, every one of you. Shame on you. You have taken a great company and turned it into nothing but a 'business case' for enriching yourselves at the expense of the workers, the customers, and the stockholders. You have lost touch with your humanity and … you are cowardly hiding behind your layers of PR and huge layers of bureaucracy.During the Great Depression TJ chose to have himself and IBM be a leader. Now, at a time of similar need, you are showing your true nature and vision and it is sadly, sadly lacking. You think Africa is the growth market for IBM? You ignore the big, big changes that are already starting regarding the end of cheap energy and the need for carbon caps and smart grids?!IBM is getting none of the recent stimulus money from the US government?!Sadly, the answer is that IBM is nothing anymore, IBM is just another poorly run company with no vision and no leader trying to optimize an outdated and failed business model. It is like IBM is being run by Republicans who think the answers to the future lie in the past, and that is very sad. It is very sad to see such a great company fall so very far.",
        "pros": "If you can start as an executive (VP in IBM speak) you can do no wrong. Mistakes are rewarded, and successes are greatly rewarded. If you are not a VP you will work with some of the smartest, nicest (for the moment) and least appreciated people you can imagine. But that is changing. The IBM US corporate culture used to be a culture of cooperation and working together for the benefit of all, and some of the old-timers…  still have that attitude lingering around. Try to work with them if you can find them, but their numbers are dwindling because . . .",
        "summary": "Like Chinese water torture - drip drip drip",
        "role": "Advisory Software Engineer",
        "date": "Mar 7, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "IBM bought the company I worked for, so my last 5 years there allowed me to observe the many ways in which IBM demoralizes talented people and drives them away.IBM talks a great deal about being accountable, and it devises (and then revises) systems for setting goals for projects and for professional development and for reporting progress toward them. It is fair to say that you spend about 50% of your time co… llecting the data for and providing it to these systems. Thus, it is not possible to achieve the goals because you are spending most of your time measuring, but not making, progress.What matters most is to appear to make progress and appear to take responsibility. Over time, your colleagues become disembodied voices in faraway lands, and you spend a great deal of time in conference calls with them. What you quickly learn is that you can declare progress has been made, and no one is likely to know or care whether it was. I inherited, from IBMers who understood how the game is played, projects that recent college graduates would have done a better job of. I was appalled by the \"work\" of senior people. Thus, IBM is not a place to learn any skill other than that of self promotion.The cumulative impact is devastating. You don't see as much of the colleagues who are still around because you are always on the phone or trying (in vain) to get something done. The isolation gets to you. You become surprised that someone you worked with for years has a) left without saying anything or b) is still around because you haven't seen them in months. Most people work at home as much as possible.Before IBM came into your life, you knew what a good job was and you knew how to do it. If you stay too long, you begin to doubt that you know anything and are worth anything to another company and even to yourself. Toward the end of my tenure, more than one person expressed thoughts of suicide. The only folks who seemed to understand the true nature of what was happening were raised in eastern Europe and the Soviet Union.I left IBM. I was not laid off. I did not have another job lined up. Things are very tough right now, but I have never regretted leaving. It was a radical act of self respect. My confidence has returned.",
        "advice": "Stop lying. The false cheer in the messages from Sam or whoever is running the division is insulting to the intelligence of your employees, who you claim to value. Honesty about your true intentions, namely, to rid yourself of most of your US workforce (especially anyone over 50) would not make anyone happy but would at least earn their respect.IBM's true investment is not in innovative technology, superior c… ustomer service, or professional growth of employees. It is in the insidious mechanisms that disseminate and reinforce a culture in which the price of success is one's humanity.",
        "pros": "The only reason to work for IBM are the money and benefits. And if you are just beginning a career, IBM might be OK for a couple of years just to make the transition from the life lived at college and the life of full-time employment with no summer off. IBM is not a long-term proposition for anyone except the most senior management.",
        "summary": "If IBM buys your company, get out. You have about a year before life is unbearable.",
        "role": "Advisory Information Developer",
        "date": "Mar 23, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Too much work time, no training, bad management, constant threats of 'resource action' (layoff). Always dumping more work on you from your laid off coworkers (with no training, no time to learn, no support).Constant threat your job will be offshored. The latest morale boost is that your job will be moved to one of three cities in the USA and no moving expenses paid and your salary will be adjusted to the local pr… evailing rate. Could be worse, job could be going to India, Brazil, etc without you.",
        "advice": "Hope you can manage the offshore workers better than you manage USA workers. Hope they offshore the IBM management to India! Would make more sense.",
        "pros": "To get experience - not training (no training given) to go to your next job. Hope that it looks good on the resume. Still do not see why other employers think that working for IBM is a good thing.",
        "summary": "If you have no other job to go to, look here.",
        "role": "Systems Engineer",
        "date": "Mar 24, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Operates on a \"need to know\" basis. May work for the CIA but it doesn't work in an ever-changing business environment. When the company was purchased by IBM, the change was like being crushed by an army tank. The bureaucracy has reached unbelievable levels.60 hour work weeks have become the norm. Meeting are being scheduled on Saturdays and Sundays. Engineers work all night long; submitting code at 3am is conside… red normal.",
        "advice": "None. They listen politely, might even agree with what you say, but they won't do anything that might jeopardize their position.",
        "pros": "Telecommuting was very much supported but this support is being withdrawn, pushing employees to resume commuting to physical offices.",
        "summary": "Run if you can",
        "role": "Staff Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No advancement potential, very top heavy in management, too much supervision when it is not necessary. Management roulette practiced by the company, you have a different manager every 6-9 months and rarely get to know their hot buttons. The company is a bureaucracy out of control and rarely changes its ineffiecent procedures.",
        "advice": "Listen to and respect your employees. Streamlone you operations.",
        "pros": "Experience and exposure to all types of businesses and situations.Training that used to be second to none.It still looks good on your resume to have a stint with IBM. Benefits are a little better than smaller companies but have been shrinking.You might get lucky and wind up in a situation where promotion or growth is possible.",
        "summary": "You can do better elsewhere.",
        "role": "Systems Services Representative",
        "date": "Mar 30, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Layoffs. Pay cuts. Lack benefits/cost. Lack of tuition reimbursement (they have a program, but you won't be eligible. Their enrollment form even says most people won't get it and to not talk about it to others because most won't get it). POOR management (lack on knowledge, lack interfacing, lack of career growth). These aren't just my opinions, these are facts that have happened to me personally.",
        "advice": "Treat your employees like people, not assets. Treat them like they matter and contribute to the success of the company. Pay competitively. You get what you pay for.",
        "pros": "If you don't mind moving around the world, there are opportunities for advancement.",
        "summary": "Stay away. This is will be a job, not a career.",
        "role": "IT Specialist",
        "date": "Apr 2, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM Microelectronics is a microcosm of most large companies. It is very politically connected and without the right connections your career will quickly stagnate.As with most large companies, managers are there to get jobs done and it isn't until you get relatively high in management that most employees are trained for advancement.I can't emphasize enough, this is NOT the company to work for if you ta… ke your eye off your personal career development. If you treat your employment as a job and not a part of a carefully managed career trajectory management here will push you into jobs that are likely not in your best interest. As a large company there are many small tasks that tend to be very specialized to IBM, and getting stuck there will seriously stunt your career growth and prospects.As far as business is concerned, IBM overall has been consistently shipping jobs overseas and the morale in the company is terrible. Their US employee count has been diminishing, so if you treat your employment here as a \"job\" you are at serious risk of trouble when a Resource Action comes.You cannot count on IBM to support employees with retraining or reeducation now like they did when I first joined, and in general the more experienced you are the bigger the target you are if you're not in management.",
        "advice": "Senior management treats IBM Microelectronics rather poorly. They need to either treat it as a full business and make the push into full foundry services with competitive prices or they need to spin off the foundry and go as a fabless design house. The mix they have now guarantees that they will fail at both design and fabrication.",
        "pros": "If you can manage yourself and your networking, IBM can be a very rewarding place to begin a career. With good political skills, a good background, and an active, forceful personality you can gain access to very advanced technology and some of the best systems level insights in the Microelectronics industry.In general the tools provided are good, many even beyond the leading edge of the industry, as are the i… nteractions with most employees. Be warned, however, that many tools are unique to IBM and their applicability and value to the rest of the industry is at best limited.This is not a workplace that will suit most folks. It requires a very career focused individual who can recognize when the work will stop contributing to a career and who is willing and able to quit this job and move on to other opportunities.",
        "summary": "IBM is a good short-term first job, but no place to make a career anymore.",
        "role": "Senior Engineer",
        "date": "Apr 2, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "IBM tends to augment staff excessively and just place employees in projects without providing a defined role. You will end up doing random meaningless tasks, in which will amount to nothing and will barely assist you in growth. It really hurts you if you decide to leave apply for another position; you have nothing to really add. In addition, you will find youself in undefined roles, feeling like a lost fish in a pond… .",
        "advice": "Senior Management should focus more on training their subordinates on how to lead and manage others. There seems to be a lack of quality leaders (team leads and managers) within consulting.",
        "pros": "IBM has vast number of areas that one can work and develop skills. It is somewhat strong in the mist of the economic turmoil. It has a recognizable and good reputation amongst society as a whole.",
        "summary": "Great Name Put To Shame",
        "role": "Senior Consultant",
        "date": "Apr 5, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is absolutely no respect for the individual. Sr. management could not care less about the employees. They are on a mission to move work offshore to India and China, and get rid of as many U.S. employees as they can. They are even forcing the U.S. employees to train their replacements. Then, employees with 20+ years and excellent reviews are thrown out like yesterday's trash. These are not low level employees --…  we are talking about senior professionals in IT, finance, etc., who are highly educated and high performing employees.",
        "advice": "Understand that we are all in this together. You might save some dollars in the short term but you are selling your country short. You may think as long as your own pocket is lined that your actions towards your employees and fellow countrymen don't matter, but when there is massive unemployment and people have nothing to lose, violence and social unrest become everyone's problem.",
        "pros": "The best part of working for IBM is some employees have the option to work at home.",
        "summary": "A once great company that treats its employees with very little respect and appreciation",
        "role": "Senior Program Manager",
        "date": "Apr 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is no loyalty from IBM to its employees. You are treated strictly as a number. Management does not manage to the job, it manages to the dollar. IBM has gone from being one of the best, most sought after companies to work for, to being a pariah.",
        "advice": "Pay attention to your employees. They are who made you who you are. Random \"layoffs\" and offshoring of jobs is not the way to do business.",
        "pros": "The pay is competitive. IBM is well known name (and used to be respected).",
        "summary": "IBM has no loyalty to its employees. If you work in the US for IBM----kiss you job goodbye.",
        "role": "Managing Consultant",
        "date": "Apr 8, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I had absolutely no job security, very few raises, and you were expected to work enough hours and overtime time make up for any vacation, sick leave, or other time off - plus an additional percentage. Funding for education seems to have been frozen for the past 4 years, so forget about any classes unless they are free and downloadable... and taken in whatever spare time you can find. Any compliments about a job well … done were followed with expectations of more, no matter how impossible. All in all, the last five years my quality of life dropped substantially, and my morale was at an all time low, a sentiment shared with many co-workers. 2009 brought the ax down on many of these wonderful hardworking people - and these people will go to competitors.",
        "advice": "IBM's biggest asset is it's people - and how much they are willing to give. The RAs that are going on are throwing away IBM's best asset to other companies. This may help stock prices short term, but it's going to ruin IBM's reputation in the long run.",
        "pros": "10 years ago, IBM had a great reputation, was offering a highly competitive salary, and great benefits. I was able to take classes to expand my skills, go to conferences, and \"flex out\" for excessive overtime. The best thing about IBM was definitely the people I worked with - these were the most hardworking, intelligent, creative thinking people I have ever met. These employees were truly cream of the crop. Unfortuna… tely, times have changed, and most of the benefits I initially saw with IBM are long gone, and I don't believe it will get any better.",
        "summary": "I would not recommend this company.",
        "role": "IT Specialist",
        "date": "May 5, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They have so many layoffs that you end up with more work, then more layoffs. So, you have to work 55+ hours a week just to keep up.",
        "advice": "Quit sending all the U.S. jobs offshore",
        "pros": "Access to lots of software products even though you have to teach yourself because they quit budgeting for employee training several years ago. You get to work with some great people, but that's changing too.",
        "summary": "IBM will soon be an OFFSHORE company",
        "role": "Data Analyst",
        "date": "May 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lots of overtime for no pay. On call all the time. No work life balance. Paged in the middle of the night. On call and have to work holidays = time away from your family that you can never get back. No compensation for any of it.",
        "advice": "Senior Management needs to stop treating the hard working people like crap and lieing to us all the time.",
        "pros": "There is no good reason to work for IBM. Years ago it was a good company to work for. Today if you work there you are only a number, and sooner or later, your number will be up.",
        "summary": "Don't even waste your time thinking about working for this company!",
        "role": "IT Specialist",
        "date": "May 12, 2009",
        "is_current": false
    }
]