[
    {
        "rating": 4,
        "cons": "Giant sea of cubicles, and renovations are LOWERING the cube walls. Management policies under Brian Krzanich are more cutthroat. Long therm accumulated experience gets thrown out in favor of 'what have you done for e lately\".",
        "advice": "Put people in jobs they actually want to be doing, but be sure to reward the people who \"take one for the team\" on one project to fill in when nobody else was available by ensuring that they get their pick of assignments on the next project. Don't lpunish them by keeping them on such tasks. Stop treating talent as a commodity.",
        "pros": "Friendly office environment. Talented people. Good benefits. Free coffee, soft drinks, and fruit. Health and fitness centers on campus.",
        "summary": "Good, but slipping",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too big.. politics in cross-geography locations",
        "advice": "Please provide stable direction... re-orgs and re-alignemnt of strategy every couple of quarters doesn't help",
        "pros": "Surrounded by smart people all around. Go-getter culture. Opportunities to learn and grow. Unique place to observe industry and influence it.",
        "summary": "Excellent company to work for",
        "role": "Principal Engineer",
        "date": "Aug 27, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Production has gone overseas and development was left over.",
        "advice": "None",
        "pros": "Benefits consists of medical and dental plans with retirement benefits.",
        "summary": "Grea place to work",
        "role": "Engineer Technician",
        "date": "Aug 27, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you land in a project with a bad manager or with no direction, you can end up spinning your wheels furiously and getting nowhere.",
        "advice": "Ask the right questions of mid level managers to make sure projects are truly on track and viable.",
        "pros": "Smart people, disciplined processes, good compensation and excellent benefits.",
        "summary": "Great, unless you are unlucky enough to land in a bad project",
        "role": "Anonymous Employee",
        "date": "Aug 27, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "My area had 12+ hour days. 3 in a row and 4 in a row.. can wear you down.. Many wanted to just wanted to do there jobs and go home.. Some very lazy people. Classic squeaky wheel syndrome",
        "advice": "A \"Thank you\" go a long way... A \" Good Job\" goes a long way..",
        "pros": "Quarterly meal with team, Bonus, Yearly Reviews, Free Fruit and beverages, managers that listen and work to resolve issues.. Good work life balance. Great pay and benefits. Awesome Culture!",
        "summary": "Fab Tech, Maintenance Tech, Fab Support Group (FSG)",
        "role": "Anonymous Employee",
        "date": "Aug 28, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Need to be more agile in execution.",
        "advice": null,
        "pros": "Cutting edge technology, Great opportunities to move within the company",
        "summary": "Senior Staff Software engineer",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Easy to get lost in the weeds of such a mammoth organization, and disillusionment can set in, as upward mobility is slow to non-existent",
        "advice": "Pay closer attention to star employees (well, to all employees, but especially the best ones).",
        "pros": "Working with some of the smartest people in the industry, and the freedom to bring your ideas to life",
        "summary": "Good Place to work",
        "role": "Process TD Engineer",
        "date": "Aug 30, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Work load, Big expectation, Slow growth",
        "advice": null,
        "pros": "Good salary, Good location, Good benefits",
        "summary": "Company review",
        "role": "Anonymous Employee",
        "date": "Aug 31, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The lack of assigned desk space for many employees is frustrating. It's an open work environment, which is great for traveling employees. Not so great for employees that come in every day and have to wonder if they will be able to find a clean desk with a working dual monitor display. Ergonomically, the office is set up to allow for individual adjustments, but it takes time to adjust and readjust daily , if you sit i… n a mobile space and have to change desks every day.You really have to own your career and manage your time to take advantage of the benefits well, but I imagine it's probably the same at just about any employer that offers such comprehensive benefits.",
        "advice": "Let people have cubes if they are in the office most days. Reserve the mobile work spaces for contractors and employees that are truly mobile. Make your employees feel like they have their own space to work and they will feel more invested.",
        "pros": "Great employer with good employee values and benefits globally. Maybe not the most competitive in the bay area, pay wise, but Intel really does allow for more of a \"work/life balance.\" Sabbatical is a great benefit that many other places can't compete with and Intel recently announced 2 months paid bonding leave for all new parents, which is a great way to attract female talent.Intel is also famous for their … DOT (development opportunity tool) where employees can sign up and interview for assignments to develop professionally and shape their own career! This is a great tool.",
        "summary": "Competitive",
        "role": "Anonymous Employee",
        "date": "Sep 1, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The benefits were good but the pay raises were slow in coming. They kept the pay as low as possible.",
        "advice": "You need to work to help your employees more. If they say that they can't do something and they explain their limitations then you should really look into helping them or they will seek employment opportunities elsewhere!",
        "pros": "Great medical benefits. The noght shift differential is pretty good. I believe they raised it as I was leaving from 12% to 16%. There was also the 11% differential for compressed work week.",
        "summary": "Manufacturing Technician",
        "role": "Manufacturing Technician",
        "date": "Sep 1, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too many levels of management , and too much planning rather than practical execution",
        "advice": null,
        "pros": "very competitive salary/benefits and excellent work place environment/settings",
        "summary": "review 1",
        "role": "Component Design Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Slow Turnaround from Upper Management",
        "advice": null,
        "pros": "Excellent Pay, Excellent Benefits, Many Incentives",
        "summary": "Good Experience",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "not good salary, need proper grading system",
        "advice": null,
        "pros": "good work balance, good work culture",
        "summary": "Process Engineer",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The corporate ladder is really hard to climb, constant arguments with Architects on the implementation details, most products have a very complex architecture that could be simplified if there was some interest in doing so",
        "advice": "I would like to see management actually taking the feedback from the implementation and validation engineers and pushing priorities with the Architects",
        "pros": "Stable company with lots of perks, not so much innovation though and it is hard to push your own ideas",
        "summary": "Good for some time but not for always",
        "role": "INTEL SOFTWARE VALIDATION ENGINEER",
        "date": "Sep 3, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big corporate culture. Sometimes challenging to move through barriers and you get lost in the number of people.",
        "advice": null,
        "pros": "Great people. Fantastic rotation program and opportunities for finance. Gives a wide breathe of jobs and development for their employees. Tons of flexibility.",
        "summary": "Finance controller",
        "role": "Finance Controller",
        "date": "Sep 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too many meetings. Lower level management is useless.",
        "advice": "Don't rely on stock assignment given by managers as performance metric",
        "pros": "Good compensation. Benefits are nice.",
        "summary": "Unfair layoffs in July 2015",
        "role": "Anonymous Employee",
        "date": "Sep 4, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not Applicable, Not Applicable,, Not Applicable,",
        "advice": "Not Applicable,Not Applicable,Not Applicable",
        "pros": "Career Growth, Life Work Balance and Benefits",
        "summary": "Review",
        "role": "Software Engineer",
        "date": "Sep 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Time to go when manager does not share the information and have regular staff meetings",
        "advice": null,
        "pros": "Lots of internal opportunities and training to growExcellent benefitsExcellent collaboration among oversea teams as a global company",
        "summary": "Good company",
        "role": "Test Engineer",
        "date": "Sep 4, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Poor Management. People never leave this organization so it's the good old boys/girls club. Be prepared to be kicked out if you don't fit the model.",
        "advice": null,
        "pros": "Decent pay and perks. Intel tries to be a great place to work.",
        "summary": "ASMO Business Operations",
        "role": "Business Analyst",
        "date": "Sep 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Like any large company, there is plenty of bureaucracy and getting things done/finding needed information can be very frustrating. As mentioned above, management is working to improve this, but it's a slow process.",
        "advice": null,
        "pros": "Strong upper-level management direction towards improving efficiency and decreasing TTMLots of opportunities for career mentorship and growthFreedom to innovate and explore new ideas",
        "summary": "System Validation Engineer",
        "role": "Systems Validation Engineer",
        "date": "Sep 6, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you don't like your project you are SOL. They don't pay for intern housing only a stipend which doesn't cover any apartment!",
        "advice": "Pay more attention to your interns. Make sure you stay in touch with them after the summer is over.",
        "pros": "Great environment if you know how to work it. Super open and can email anyone and usually expect a response (even the CEO)",
        "summary": "Intern",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Working hour is too long.",
        "advice": "Need to improve the mentoring system",
        "pros": "The salary is really good.",
        "summary": "PTD Mod & Integr Yield Eng",
        "role": "Anonymous Employee",
        "date": "Sep 7, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "What you learn depends on you.",
        "advice": "manage projects better",
        "pros": "you will learn something being fresh out of college.",
        "summary": "interns",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "long working hours ....... ........ ........",
        "advice": null,
        "pros": "good benefits ...... ...... .......",
        "summary": ".......",
        "role": "Process Engineering",
        "date": "Sep 9, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Long hours, hard to get noticed on night shift.",
        "advice": null,
        "pros": "Lots of time off, great benefits and good pay.",
        "summary": "Great to their employees",
        "role": "Anonymous Employee",
        "date": "Sep 9, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Turning into more of a cut-throat environment that seems to not be geared towards more seasoned employees. They tend to overinvest in some trending markets (e.g. phones) when it is clear, the ROI is not there and for other markets they pull-out before the full business plan can be implemented.",
        "advice": "Real status gets filtered up the management chain such that I am not sure the higher you are in the organization, the harder to get the true picture. Bunch for lunch or other ways to get real, honest feedback from the lower levels in the org are a great example of how to stay connected.",
        "pros": "Really smart people work there -- lots to learn from them. Leading edge technology company that can influence trends around the world.",
        "summary": "Strategic Planning",
        "role": "Strategic Planner",
        "date": "Sep 9, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "what? why? its is great. none",
        "advice": "What?",
        "pros": "Nice company. Love the company.",
        "summary": "GPTW",
        "role": "Senior Process Engineer",
        "date": "Sep 11, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "high demand in meetings, involve management skills, work/life balance",
        "advice": null,
        "pros": "challenging, people skills, collaborate, innovation, team work",
        "summary": "senior technical lead engineer",
        "role": "Senior Technical Lead",
        "date": "Sep 11, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "A little too tight on travel and entertainment budget. Tending to lean a little too much towards the politically correct recently.",
        "advice": null,
        "pros": "Short on politics and long on data. Great overall compensation compared to the local market. Very little micro-manangement and plenty of authority and accountability to make decisions. Plenty of opportunities to expand your scope into other areas if you are willing to take a risk.",
        "summary": "Good Work if you can get it",
        "role": "Program Manager",
        "date": "Sep 11, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The leadership has many levels and decisions take a very long time to make.",
        "advice": "Flatten out the leadership hierarchy.",
        "pros": "The health benefits are pretty good and there are on-site facilities for care. The pay is pretty good, and the people are pretty smart as well.",
        "summary": "Good Pay, Good Benefits",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's a big company. Like really big. You can get lost in the sauce a lot and not get a lot of traction waiting on people",
        "advice": "Work life balance is key to keeping employees around. Not every AR has 100% importance on it.",
        "pros": "Working with really smart people on things that matter. Some of the great place to work events are actually really fun like movie day!",
        "summary": "Great place for a start!",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "conservative, compare with internet industry it is very slow.",
        "advice": null,
        "pros": "free, a lot of space to let intern do whatever they want.",
        "summary": "Software Engineer Intern",
        "role": "Anonymous Employee",
        "date": "Sep 13, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "New CEO is more worried about pleasing the shareholders than supporting the enployees. You may have to play politics to advance depending on your group. Some managers will activity block you from moving to other groups.",
        "advice": "Your technicians ( non engineers) are the foundation of your company. Listen to them and be able to lay out a path of advancement",
        "pros": "Good company of you love technologies. Salaries are industry average. Perks and comps are great.",
        "summary": "Good company with some drawbacks",
        "role": "Engineering Technician",
        "date": "Sep 13, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "very tedious and boring, management very bad",
        "advice": null,
        "pros": "good benefit and taking care of employees",
        "summary": "research scientist",
        "role": "Research Scientist",
        "date": "Sep 13, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There were not a lot of intern perks and engagement event compared to what other companies have to offer which made it slightly boring.",
        "advice": null,
        "pros": "There are a lot of smart people and the company offers good work life balance. The work was interesting. Everyone at the company is approachable and the company has a very open culture.",
        "summary": "Internship at Intel",
        "role": "Intern",
        "date": "Sep 14, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Need to be more progressive and leading edge in creating technologies to tackle the next generation of cybersecurity issues",
        "advice": "Create a less siloed organization",
        "pros": "Both inbound and outbound product management responsibilitiesGod culture and work environment",
        "summary": "Product Management @ Intel Security",
        "role": "Senior Product Manager",
        "date": "Sep 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Many company/group level re-organizations every 1-2 years. Strong Work at Work policy with no regular flexibility for telecommuting. Employee collaboration technologies do not support effective telecommuting or other flexible work arrangements.",
        "advice": "Management needs to continue their recent focus on employee health, engagement and integration of new employees/acquisitions. Evaluate the other work options availability at similar technology companies and provide additional work/life solutions to help bring in the best talent. The workforce is not one size fits all.",
        "pros": "Competitive salaries, strong healthcare and employee benefit programs, access to leading edge technology projects, Global, excellent employee/career development resources & programs",
        "summary": "Great Benefits, Significant Organizational Change",
        "role": "Operations Manager",
        "date": "Sep 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hardware focussed culture. Hard to change that.",
        "advice": null,
        "pros": "Ability to make a difference",
        "summary": "Architect",
        "role": "Anonymous Employee",
        "date": "Sep 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Slow moving with decisions making at times",
        "advice": null,
        "pros": "Excellent Company. Good benefits, Positive Enviroment",
        "summary": "Supply Chain Manager",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Years of repeated layoffs has caused morale to be low. Org is very flat so opportunity to advance into the senior ranks is tough.",
        "advice": "Create a healthier pipeline of CG's coming into the company and clear the glut at the top to provide opportunity for those below.",
        "pros": "Lots of opportunity to move around the company if you have the drive. Managers and leaders very approachable and everyone I've encountered is always trying to do what is best for the greater Intel.",
        "summary": "12 years and counting",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too many lay-offs. Does lay-offs once every 3-4 years.",
        "advice": "Infrequent lay-offs.",
        "pros": "The company really takes care of you.",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lower level management is useless. Intel fires who they consider \"old\" people, then 2 days later hires boatloads of recent graduates who, some don't even know what a CPU is. Lost a lot of good talent in 2014/2015. New CEO not fun. Intel is cheap. Pay for our own \"teambuliders\" Really? No commission for those who do the grunge work so field gets fat commissions. And if you don't fit the hipster nerd profile, prepare t… o get walking papers. Lastly, way too many meetings.",
        "advice": null,
        "pros": "Nice people, fun things to do because they want you never leaving campus. Good benefits. We're better until new CEO arrived.",
        "summary": "Business Analyst America's Operations Org",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company, you can get lost in the numbers.",
        "advice": "Fight for your team",
        "pros": "Great benefits and gray people to work with.",
        "summary": "Good Company",
        "role": "Sustaining Technician",
        "date": "Sep 21, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Challenging times with a struggling PC market and gaining solid footing in the mobile spaceOver-emphasis on diversity",
        "advice": null,
        "pros": "Fast pacedIncredibly smart peopleLots of opportunities for personal growthHighly competitive compensation and benefits",
        "summary": "Great Company, Challenging Times",
        "role": "Anonymous Employee",
        "date": "Sep 21, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Still very much a male network, work/life balance.",
        "advice": "Break the male networks, more integration with women.",
        "pros": "Innovation, solutions orientation and open to suggestions.",
        "summary": "Innovative",
        "role": "Anonymous Employee",
        "date": "Sep 21, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Different business units work very differently. A mix of new employees (at all levels) combined with the old guard leads to cultural clashes from time to time. Budgets are tight. Acquisitions have not been successful in the past.",
        "advice": "Focus headcount and budgets toward product/initiatives that monetize even if that means scraping other projects or headcount in other areas",
        "pros": "Big company that has a diverse range of job and career options (technical and non technical). Take advantage of this when opportunities present themselves. If you don't, you could paint yourself into a corner. Opportunities are there though. Pay and benefits are relatively good.",
        "summary": "Take advantage of opportunities",
        "role": "Director of Product Management",
        "date": "Sep 22, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not enough training opportunity",
        "advice": null,
        "pros": "Good culture to work with lots of smart people",
        "summary": "Program manager",
        "role": "Anonymous Employee",
        "date": "Sep 22, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too big, too complex and slow to make decisions",
        "advice": null,
        "pros": "flex hours, fiversity in career growth",
        "summary": "Good company",
        "role": "Anonymous Employee",
        "date": "Sep 23, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It must offer better salaries compared to the market",
        "advice": "Should evaluate benefits and salary compensation so it can be according to other vendors offerings in the same jobs",
        "pros": "World leader security company ideal to work",
        "summary": "xxxxxx",
        "role": "Inside Sales Account Manager",
        "date": "Sep 28, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Work expectations include nights and weekends. There is no such thing as a 40 hour work week.",
        "advice": null,
        "pros": "Good benefits, maybe some of the best in tech.",
        "summary": "Intel - Keeping it Real",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "probably not as great for younger people. things can move very slowly because it is a large company, lots of hoops and loops to jump through. a thousand meetings",
        "advice": null,
        "pros": "large company. many opportunities/ groups to work in. many locations. trying to improve on diversity. get the feeling they genuinely care about employees. very stable. good for people who are older/ have families",
        "summary": "a review of intel",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Bureaucracy makes decision making process painfulDepending on business group, growth can be hard",
        "advice": null,
        "pros": "Plenty of work to doTime offLeadership opportunities",
        "summary": "Complex challenges keep things interesting",
        "role": "Environmental Engineer",
        "date": "Sep 29, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Stuck in the cube farm.",
        "advice": null,
        "pros": "Surrounded with incredibly great talent from around the world.",
        "summary": "Senior Financial Analyst",
        "role": "Senior Financial Analyst",
        "date": "Sep 30, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Salary/Bonus is not very good.",
        "advice": null,
        "pros": "Great place to work. Not too much stress and provides great career opportunities,",
        "summary": "Graphics Software Engineer",
        "role": "Anonymous Employee",
        "date": "Sep 30, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very long hours, too many meetings",
        "advice": null,
        "pros": "Cutting edge tech, excellent resources, opportunity for promotion",
        "summary": "PROGRAM MGR",
        "role": "PROGRAM MANAGER/PACKAGING MANAGER",
        "date": "Oct 1, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "job security, varied roles, nothing much",
        "advice": null,
        "pros": "good management, hard working collegues",
        "summary": "overall good company",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some groups are not as forth-coming with recognition for employee success from what I've observed",
        "advice": null,
        "pros": "Employees treated more like people than numbers or cattleCompany supplies food perks such as healthy fruits and beverages - encourages better morale and supports good healthExcellent employee benefits and services available for employeesStrong feeling of community",
        "summary": "Intel supports diversity and compensates fairly",
        "role": "Anonymous Employee",
        "date": "Oct 2, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "no downside. Everyone was nice and helping.",
        "advice": null,
        "pros": "Fun place to work as an intern",
        "summary": "Graduate Technical Intern",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "in short-term, there are some challenges in mobile section for the company",
        "advice": null,
        "pros": "Great place to work. good work and life balance",
        "summary": "Great place to work",
        "role": "Regional Supply Analyst",
        "date": "Oct 6, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The higher the pay grade the more difficult it will be to keep getting accolades, I think this is natural. However, The company has a dogmatic approach to thinning the working herd.It seems like it backhandedly penalizes senior persons that dont continnuously actively manage their career.",
        "advice": "Management should recognize high level re-orgs should take more consideration for specific talent that is in place in the lower portions of the org. and should work to take advantage of the existing talent better.",
        "pros": "You have Opportunity to work on industry leading products and technology.The company enables cross-site teams and collaboration.Compensation is good. (Nobody in high-tech can really complain about compensation)",
        "summary": "Sr Component Design Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Less challenging opportunities. Same old work everyday.",
        "advice": null,
        "pros": "Decent perks and benefits, Diverse culture. lot of learning. overall a great place to work.",
        "summary": "Great company to start career",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very fast paced and sometimes safety can be an issue. Due to changes and staffing cuts some departments were cut to bare minimum. In my opinion, for some jobs it was not a safe move. Be careful out there. If something happens to you even at no fault of your own and you can't go back to work you are very much ON YOUR OWN. It took a long time to get to a decent pay grade. I was quiet and I worked HARD and didn't toot m… y own horn for MANY years. Finally, I got a supervisor that saw what I was doing and had been doing for many, many years and brought me up to where I should have been. Working at Intel can be VERY STRESSFUL as it is a cutting edge technology company. However, there a lots of AWESOME programs in place for current employees.",
        "advice": "Know your employees, know what they do and how they do it and treat them right, compensate them appropriately and truly help make it a GREAT PLACE to WORK.",
        "pros": "Intel has great benefits and take care of current employees as long as nothing bad happens to you. It is a very modern and fast paced environment. Intel is very involved in their local communities with many volunteer events for employees to take part. All in all my 29.5 years at Intel were mostly good. Full of opportunities to learn new things. I had some GREAT supervisors and some not so great supervisors during my … time there. The good ones were AWESOME and the not so good ones just made life difficult. I am proud to say I retired from Intel.",
        "summary": "Great Place to work",
        "role": "Hazardous Waste Technician",
        "date": "Oct 9, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lower management can be a mixed bag.",
        "advice": null,
        "pros": "Innovative, willing to take risks, lots of room for advancement",
        "summary": "Support Engineer",
        "role": "IT Business Process Analyst",
        "date": "Oct 9, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Maybe not as fast-paced as other companies - felt like I could be challenged more.",
        "advice": null,
        "pros": "Great work-life balance. Plenty of team meetings/lunches - good bonding.",
        "summary": "Software Intern",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very engineering focused so if you are not part of building chipsets it can sometimes feel like you are not with the program.",
        "advice": null,
        "pros": "Excellent benefits package. Well recognized company",
        "summary": "Great company to work for",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes it feels like 'old school' type of company, not feeling competition just yet",
        "advice": "Promote faster decision making, seems they already got it",
        "pros": "Benefits are ok, especially health and pension, working hours and flexibility",
        "summary": "Good company to work for",
        "role": "Software Engineering Manager",
        "date": "Oct 10, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No career path growth for product professionals.Old fashioned blue corporation.",
        "advice": "Hire younger people.",
        "pros": "Great work-life balance atmosphere. You get to work with very experienced people.",
        "summary": "Program Manager",
        "role": "Program Manager",
        "date": "Oct 12, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Job can be very narrow in scope",
        "advice": null,
        "pros": "Great learning opportunities, solid culture",
        "summary": "Great Place to Learn",
        "role": "Anonymous Employee",
        "date": "Oct 13, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Opportunities for advancement are limited",
        "advice": null,
        "pros": "Good management, we'll run company",
        "summary": "Good employer, limited opportunities",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "constant turnover for individuals approaching 50",
        "advice": "Value your older employees",
        "pros": "Good coffee, smart people, pay ok",
        "summary": "Developer",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hard to move up for Technician position",
        "advice": null,
        "pros": "Great 401k, SPP medical and dental",
        "summary": "Manufacturing Technician",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can be very demandingLack of accountability at timesManufacturing environment can be very unforgiving and irritatingLayoffs are getting too frequently",
        "advice": "If you want to be an Engineer or work in IT, don't become a Manufacturing Technician",
        "pros": "Sabbatical after 4 yearsFree Stuff!!!Time off and personal time is greatA lot of great perksMany opportunitiesAbility to work on personal projects and get recognition for itAbility to move up quickly if in the right starting position",
        "summary": "Great Perks but...",
        "role": "Automation Engineer",
        "date": "Oct 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "good in some areas for software but bad in some areas",
        "advice": null,
        "pros": "Very good company for hardware engineers",
        "summary": "QA Lead",
        "role": "Team Lead/QA Manager",
        "date": "Oct 14, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "learning process for new employees can be improved by a lot.",
        "advice": "keep it up. i like it here.",
        "pros": "Good work/life balance. No pressure.",
        "summary": "pretty good overall",
        "role": "Anonymous Employee",
        "date": "Oct 15, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I had trouble maintaining work/life balance. Intel gives work/life balance lip service, but to advance, you must sacrifice your life outside Intel's walls.",
        "advice": null,
        "pros": "Lots of technically challenging and exciting work. The pay and benefits were good.",
        "summary": "Worked hard, rewarded well",
        "role": "Senior Software Developer and Team Lead",
        "date": "Oct 17, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Falling behind in benefits compared to other companies, a little bit outdated in terms of perks.",
        "advice": null,
        "pros": "Talented people, specially in HW.",
        "summary": "Good company overall.",
        "role": "Software Engineer",
        "date": "Oct 18, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of nepotism. Doing process for the sake of saying your doing it, even if it wastes time.",
        "advice": null,
        "pros": "Great work life balance for the most part.",
        "summary": "Was okay",
        "role": "Senior Program Manager",
        "date": "Oct 18, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "With so many people and groups, some roles can be very narrow in scopeCan be difficult to change roles and get into new groupsYour management may be remote which can be a challenging environment",
        "advice": null,
        "pros": "Some of the smartest people I've ever worked withExciting technology",
        "summary": "Good, not great, place to work",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Rarely get to move on from one project to the next.",
        "advice": null,
        "pros": "Great variety of work options",
        "summary": "Great Opportunity",
        "role": "Solutions Analyst",
        "date": "Oct 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not too many. It can be a bit top heavy. For the most part it is a great company to work for.",
        "advice": null,
        "pros": "Good work life balance and great benefits. Compensation is good. Lots of great people to work with. Some interesting projects.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Rigid culture, very engineering driven",
        "advice": "Embrace change",
        "pros": "Great place to work. Solid pay and benefits",
        "summary": "Working at Intel",
        "role": "Market Segment Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not anything so far. Everything is going good",
        "advice": null,
        "pros": "Great atmosphere and management, package and benefits",
        "summary": "Research Scientist",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Typical big company politics you have to maneuver around.",
        "advice": null,
        "pros": "Lots of opportunities. Decent benefits.",
        "summary": "Some good,some not so good",
        "role": "Anonymous Employee",
        "date": "Oct 20, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "need complex problem solving skills. Employees need to balance work/life.",
        "advice": "improve work/life balance for Management and Employees. Why can some Intel employees work from home whereas other employees (not Fab/Mfg) must work in office M-F long days? Do I need a doctor note for a flexible schedule to avoid rush hour traffic? If I drive at rush hour my commute is 50-70 minutes each way vs. 20 minutes each way with no traffic.",
        "pros": "I love the challenging job. It is impressive how projects are critical for leading edge design, tight schedule, lowest DPPM, and challenging to provide the best customer experience. Employees are extremely intelligent and from the best universities. Intel is developing custom silicon that is changing the world.",
        "summary": "Commodity Manager",
        "role": "Commodity Manager",
        "date": "Oct 22, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Intel is big. Very big, and the groups just dont communicate with each other. This causes a lot of political positioning and works against progress. This is the most frustrating factor at times and can be quite distracting. It always seems to take too much time to make decisions and I often feel we miss opportunity because senior management has a hard time making the hard choices.",
        "advice": "Start making the hard choices much quicker. Sticking with something that isn't working, which is obvious all the way down to the front line, is very frustrating and demotivating. Listen more to the people doing the work instead of thinking you know where we should go.",
        "pros": "Intel has a lot of different opportunities to try new things. You can move between hardware, software, firmware or any of the business management jobs quite easily. Not to mention working on cutting edge technology and a wealth of very talented and fun people to work and learn from. Intel is the most diverse company I have ever worked with, and this is one of the main factors I like about the company.",
        "summary": "A Place to Move Around",
        "role": "Engineering Manager",
        "date": "Oct 22, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of both management skills and expertise on the job discourage talented individual contributors. So many talented individual contributors leaves company or their departments due to conflict with managements.",
        "advice": "Please respect employees and treat them with integrity and respect. Show your role model first before management asks something to employee.",
        "pros": "Flexible time and lots of talented individual contributors. Good work and life balance. Optional four and seven years sabbatical vacation helps a lot.",
        "summary": "Management",
        "role": "Senior Research Scientist",
        "date": "Oct 23, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Tribal knowledge vs. established process",
        "advice": null,
        "pros": "Dynamic and fun colleaguesSolid and highly experienced / educated managers",
        "summary": "Intel Security",
        "role": "Group Manager, Product Marketing",
        "date": "Oct 25, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "1. SSG (Intel's Software and Service Group) thinks of itself as a software company, but doesn't have the same attitude. This is abundantly clear when you visit real software companies.2. Review system (called \"Focal\") is a pain. In addition, performance isn't always directly rewarded during end of year reviews (you could have a really super couple of years and still not get adequate recognition).3. Pay isn't … competitive with software companies.4. Benefits -- no 401K matching for instance.",
        "advice": "Improve focal system and make reviews more transparent (e.g. \"why were you not promoted even though you have clearly performed above and beyond\" etc.)",
        "pros": "1. Chance to work on cutting-edge hardware and influence hardware decisions.2. More laid back (but that is changing now)",
        "summary": "Intel software engineer",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Alot of re-orgs. Also heard many employees were fired for no good reason.Job insecurity increases when you go up the ladder, and this applies to both management and technical path",
        "advice": "instead of layingoff and firing experienced employees, maybe do budget cut and pay reductions.",
        "pros": "Great place to work IF you get a good manager. Alot of smart and friendly employees, loved my team. First year was tough ramping up, in a few years its easy to learn and manage work-life balance.Alot of diversity, you get to enjoy different cultures. I left for family, will definitely return if my situation changed.",
        "summary": "Senior Product Developement Engineer",
        "role": "Senior Electricsl Engineer",
        "date": "Oct 26, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "On some occasions there were changes in department organizations that did not make any sense and general rules that are one size fits all.",
        "advice": "Management should be careful with establishing bureaucratic rules that get in the way of employee productivity and prevent them from working on what they are best at.",
        "pros": "Many opportunities to work on interesting projects and collaborate with other groups and make contacts. Most people are competent and good to work with.",
        "summary": "Intel",
        "role": "Anonymous Employee",
        "date": "Oct 27, 2015",
        "is_current": false
    }
]