[
    {
        "rating": 3,
        "cons": "Too many initiatives, management's communication with other employees doesn't build confidence.Promotional marketing to keep employee morale up is bogus. (A coworker's picture was placed under a title 'Talented Program Manager' and that person wasn't even doing Program Management)The focal / ranking and rating systems prevent successfully performing candidates from getting recognition besides the standard rai… se and stock",
        "advice": "Listening to the employees that actually do the work should be paramount.Providing lip service doesn't instill confidence in employees.Need less management, more technical people. Need to focus on the customer.",
        "pros": "There are a lot of opportunities to move around within the company.Generally you're working with smart people on cutting edge technologyDecent work-life balance",
        "summary": "I learned a lot from this company and I'm happy I'm not there anymore",
        "role": "Systems Validation Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Unrealistic goals. Lack of respect for people exists, which is different at different locations. Rank and rating process is an unfair process and needs to be revised. Really take a look at how many people are working 60-80 hours in a week and sacrificing their family life, just to stay afloat at work due to unrealistic workloads.",
        "advice": "Hire the right people when it comes time to diversify the company, building new product lines. Sometimes Intel believes they can produce new products using current business experience from the inside. Where has that produced great results? Maybe some were wins, most were failures to compete with other more established manufacturing companies. In some locations, such as R & D, start over from the beginning, so peo… ple are treated with respect and not forced to work inhumane hours which goes totally against the company's value of \"Work Life Balance\".",
        "pros": "Good to above average pay. Great benefits. Sabbaticals every 4 years (1 month) and 7 years (2 months). Great people who are experts in the semiconductor field, some of the best in the industry.",
        "summary": "Equipment Module Team Technician",
        "role": "Equipment Module Technician/Engineer",
        "date": "Jun 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "All things listed in Pros depends on the team you are in. Ni consistent policies.Varies from team to team",
        "advice": "Remove red tape, address real problem, need for innovation",
        "pros": "Flexible timing, employee friendly, good recruitment process, you get hired only if you are seriously good",
        "summary": "Intel Security (Formerly McAfee) Company review",
        "role": "Senior Software Development Engineer",
        "date": "Jun 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Inconsistent managementEmployee morale is almost always bad, just waiting for the next reorg/round of cuts",
        "advice": "Pick a direction and commit to it",
        "pros": "Good co-workersFree fruit and coffee/tea/soda",
        "summary": "Not what it once was",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Plan on working long hours, and nights and weekends are a given depending on the organization. Large corporate atmosphere, high ambiguity, and poor or underdeveloped management in many areas.",
        "advice": null,
        "pros": "Great pay and great benefits package. Corporate perks and additional free events are nice. Great volunteer program.",
        "summary": "Great benefits",
        "role": "Project Manager",
        "date": "Jun 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Definitely feels like a large company, a lot of process and overhead- Room for advancement can be slow after initial promotions- Way too many \"new\" programs introduced that function similar to if not the same as existing programs. Limit these because you put a lot of time and effort into stuff that is hot for a short period of time and fades away. Less is more sometimes.",
        "advice": "I know it takes a lot to manage a company of this size but I feel Intel is chasing markets and pulling out once they find out how difficult it is to gain market share. Try an focus your efforts.",
        "pros": "- Benefits, especially SPP and bonus opportunities are nice.- Gain some culture, the chance to work with people from all over the world- Depending on the group your work can be challenging.",
        "summary": "Good benefits, decent work",
        "role": "Anonymous Employee",
        "date": "Jun 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "At intel, there does not appear to much of career advancement opportunity or exposure to different job functions for exploring transitions. Engineers tend to get stuck at what they do and have to stay in the area of expertise unless taking substantial risk of pay-cut or starting all-over.",
        "advice": "Recent re-organization activities involving massive work force reduction across the company is a vivid example of poor business acumen and judgement of management.",
        "pros": "Intel values technical contributions based on data and sound analysis. Also, not so much of politics are in play during performance review.",
        "summary": "TD engineer",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bureaucratic, too big, politics easily hampers career prospects",
        "advice": "Learn how to grow people and not stifle talent.",
        "pros": "Great benefits, place to work, friendly people, team building, etc list is long",
        "summary": "Sr Software Engineer",
        "role": "Lead Business Intelligence Developer",
        "date": "Jul 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not the same company I joined more than 10 years ago. The recent PC market decline has left the company struggling to find a new direction. There is a constant cloud of layoffs looming in the horizon. The main reason employees want to do well in the focal review process, is to not get fired. This makes the environment competetive in a way thats toxic",
        "advice": "CEO needs to instill trust in his employees. Morale is low and the constant winds of change make any kind of stability impossible",
        "pros": "Good benefits, bonus and RSUsYou ca have the chance to work with very smart people and the work-environment (depending on the group) is dynamic",
        "summary": "Not the same company I used to work for...",
        "role": "Anonymous Employee",
        "date": "Jul 6, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Intel has been treading water for a long time, trying to get into break into new markets and then achieve similar margins to those it has in the client and server CPU space. To date, success has been very limited. In my observations from a long career there, I just don't think that the current management has the know-how to drive substantial increases in revenue. I do, however, believe that the company is somewhat vu… lnerable to a downturn in the market or a competitive threat who is seeking to get a share of the lucrative server market. Intel just laid off 11% of the workforce or 12000 people during a time when revenue is largely flat. If they experience a decrease in revenue, I expect things will get much worse regarding layoffs.",
        "advice": null,
        "pros": "Intel has a great foundation in its core businesses that bring in substantial revenue at great margins. It also has a very deep talent pool of people who are passionate about and dedicated to the work that they do. The compensation is very good as well.",
        "summary": "Treading water",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Low general pay unless you start experienced, not quality focused in the assembly areas, the fabs and assembly areas are too disconnected with the way they are run making synergy impossible.Company is too involved in Political correctness marketing and needs to refocus on the business it is in.Headcount is rarely at a sustainable level...expect to do multiple other peoples' jobs, if you plan to get anything d… one.",
        "advice": "Develop a focus on quality, that will help resolve most of the issues within the company, especially in the assembly ares. Focus on BUSINESS, not the current PC trends.",
        "pros": "Relatively good, market matching benefits, can obtain good work life balance with the correct manager choices...though that could change with the restructuring recently occurring. MANY opportunities within the company and you can utilize company resources to develop yourself professionally with the right manager and position.",
        "summary": "High Volume mindset in a TD environment",
        "role": "Technology Development Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "slow progress, redundancy, focus, less work",
        "advice": null,
        "pros": "technology, growth, work, position, work life balance",
        "summary": "senior staff",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Compensation is low when compared other companies.",
        "advice": "Please do market adjustment",
        "pros": "Kind of work is good",
        "summary": "Sr.Graphics Design Engineer",
        "role": "Senior Graphics Hardware Engineer",
        "date": "Jul 8, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Stressful, work odd hours, require lot of presentation in front of groups",
        "advice": "Implement better work life balamce",
        "pros": "High visibility to upper management, exposure to entire process",
        "summary": "Yield Engineer",
        "role": "Anonymous Employee",
        "date": "Jul 8, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Actually achieving work/life balance can be impossible, depending on your peers and if you have family. Plan on specializing in a tiny area of your vast education.",
        "advice": "No one likes the somewhat random downsizing to make up for poor management decisions in the recent past. Concerned about the lack of any significant wins towards revenue growth in any area that will pay off soon.",
        "pros": "Work with some the best and brightest talent in the industry. Excellent benefits and corporate entitlements.",
        "summary": "A lucrative waste of time",
        "role": "LC Physical Design Engineer",
        "date": "Jul 9, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "If you want to get promotion then you have to understand diplomacy and wait for a long time. Lay off is said based on performance but actually not.",
        "advice": "Value your people. Manage and plan well ahead so that you don't need to lay off people. Try to adopt a company vision \" how to run a big corporation\" without laying off people.",
        "pros": "lots of hands on learning. Good for an RCG job.",
        "summary": "Intel Process engineer job",
        "role": "Process Technical Director Engineer",
        "date": "Jul 9, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lack of commitment from employees, a lot of bureocracy",
        "advice": "More discipline needed for employees.",
        "pros": "get to work with a huge diversity of employeesvoluntary activities",
        "summary": "Engineering Manager",
        "role": "Anonymous Employee",
        "date": "Jul 11, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "similar to any corporate company",
        "advice": "no point",
        "pros": "smart people to work with",
        "summary": "Project Analyst",
        "role": "Project Coordinator",
        "date": "Jul 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Every two years or so, it seems like they are doing some sort of re-org and priorities change, so it is hard to keep continuity with what one is doing. Some groups seem to value what you are doing for them; others, not so much. You never know what you are going to get.This time around, however, management made extremely bad decisions and 11% of the workforce is paying for it (regardless of what upper manageme… nt wants you to think). So, the culture at present is rather toxic, I've heard.There tends to be a lot of political double-speak, phrasing things in palatable sounding business terms where you have to read between the lines to guess what people really think or in a particular situation what might have really happened.",
        "advice": "I think you need to worry less about creating a perfect politically correct \"inclusive\" culture and more on hiring people with the skills needed to get the job done.",
        "pros": "Pays well, in general. If you are with the right group, the even-keeled engineering culture can be inviting. Work-life balance was good.If you are young and are offered a good job, it might be a good place to get some experience, but keep your options open and keep scanning the marketplace, because you most likely won't get the opportunity to retire there.",
        "summary": "Web Applications Developer",
        "role": "Anonymous Employee",
        "date": "Jul 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Failure to translate vision into action. Very impatient with new business opportunities due in part to unrealistic expectations. Executive management is pandered to by senior management: the latter has a hard time delivering bad news and/or setting realistic expectations. Needs to undergo further downsizing to clear out mid/senior exec level.",
        "advice": "Accelerate focus on new markets. Clearly state where company intends to compete then stick with it. Be more confident and therefore more patient with long term strategy.",
        "pros": "Good people for the most part. Very smart technical and world class research. Big idea / big vision place that will recognize thinkers. Very progressive supporting under represented classes. Fairly transparent executive team - better than most companies as big as Intel.",
        "summary": "Trying to evolve beyond incredible legacy",
        "role": "Anonymous Employee",
        "date": "Jul 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work/Life balance does not exist and the culture is very poor - there is a lot of 'back stabbing'. A majority of employees work 12+ hour days and/or on weekends consistently.",
        "advice": "Engineers are made managers prior to having any formal training. This really needs to be prevented. Directors need to be more heavily evaluated before being offered a position.",
        "pros": "If you are able to relocate to Hillsboro OR then Intel is an expansive and great place to work. The campuses are well kept and the people are very friendly. There are a lot of job opportunities if you are growing out of your current position and want to move up, take a side step or temporary assignment or change managers.",
        "summary": "Good Salary, Poor Culture",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Traffic is getting worse, but management is making every effort to improve parking conditions.",
        "advice": null,
        "pros": "Intel Corporation boasts its streamlined efficiency in manufacturing execution and I was glad to be part of it in the last decade. It taught me valuable transferrable skills that I can apply in my personal life and in my next career endeavor.",
        "summary": "Intel",
        "role": "Anonymous Employee",
        "date": "Jul 13, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No road map and no visibility",
        "advice": null,
        "pros": "Good Technology and Brand image",
        "summary": "Sr QA",
        "role": "Anonymous Employee",
        "date": "Jul 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management seems clueless. They seem more interested in promoting their own personal brands then letting the best products win",
        "advice": "Don't punish employees for trying risky products to benefit the company. Bad management direction is not their fault.",
        "pros": "Great technology. Leading place to do cutting edge work on VLSI and computation engines.",
        "summary": "Electrical Engineer",
        "role": "Anonymous Employee",
        "date": "Jul 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management heavy who lack listening skills. Often they do not follow up with agreements and stated promises. Worse then average opportunity system. Poor work/life balance chiefly due to the management communications, bad leadership, and indecisiveness. Atrocious annual performance review system and the way it is managed.",
        "advice": "Need to establish much higher degree of trust with employees. Improve the performance-based system and treat employees fairly. Become better decision makers by understanding the data analysis, formulate valid conclusions, and recommend decisions based on facts.",
        "pros": "In general, good teaming experience and people. Peers are willing to listen to ideas and opinions. Challenging projects. Average opportunity to present your work and efforts to higher level management. Better than average salary and benefits package.",
        "summary": "Senior Process Engineer",
        "role": "Senior Process Engineer",
        "date": "Jul 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Best to have as high as a degree as possible before working here, not easy to be promoted after joining, lack of opportunities for advancement unless you're an engineer, work with people who have egos and many who don't have good social skills, work with a lot of foreigners who can't speak clear English, too much emphasis on diversity, managers don't have time to be managers most of the time, too many meetings, atmos… phere of fear from layoffs, bad manager can ruin your career",
        "advice": "Fix all the cons above, focus on upwards mobility, hire less H1B visas, de-emphasize diversity/RCGs, keep older people and don't force them to retire early, promote from within, focus on training",
        "pros": "Work with latest technology, work in safe environment, work with smart people",
        "summary": "Engineering Technician",
        "role": "Engineering Technician",
        "date": "Jul 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Breakneck pace, lack of manpower, churn rate less than 2 years (Average most senior engineer in most groups has been at the job for 2 years, besides managers), overloads PhD's with low level operational tasks. Resistance to hiring automation/programmer specialists in some groups. Precious time wasted in constant meetings. Bad work-life balance",
        "advice": "Better division of labor, better career advancement prospects, do not burn thorough your employees!",
        "pros": "Good salary for the area, reasonable PTO, good health insurance coverage",
        "summary": "Portland technology development group",
        "role": "Process Technology Development Engineer",
        "date": "Jul 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "long hours and difficult to have life balance",
        "advice": "avoid catch up on future trends and make more agile transitions",
        "pros": "advanced products, new technology process and new cad tools.",
        "summary": "company review",
        "role": "Silicon Architecture Engineer",
        "date": "Jul 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Tendency to wait to add things into projects at the last minute, crushing delivery times.",
        "advice": "With this big diversity push, shouldn't that also include mature, knowledgeable individuals?",
        "pros": "Diverse departments and groups to gain knowledge from.",
        "summary": "Software Engineer",
        "role": "Senior Software Engineer",
        "date": "Jul 18, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too political in the work place.",
        "advice": null,
        "pros": "Great benefits and salary. Company cares about your health and safety.",
        "summary": "Engineer",
        "role": "Test Engineer",
        "date": "Jul 19, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Some of the management has not kept up with time, it seems like they people are trying to protect themselves and their cohorts.",
        "advice": "Do not be afraid to stand-up and say why you think a certain line shouldn't be taken .Make sure that new generation is taught the right things, do not be afraid to say where we failed and why...",
        "pros": "There are lots of opportunities, for talented individuals who are ready to go that extra mile and also have a strong manager and a good team.",
        "summary": "I learn't a lot duirng",
        "role": "QA Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not enough focus on improving inter departmental communications. This would greatly improve meeting the project deadlines and success of Intel in general.",
        "advice": "Please pay more attention on how different groups and departments communicate between each other. I have worked on a software team that have missed deadlines due to poor communications with other teams.",
        "pros": "Intel is a great place to work at if you like to be challenged and awarded for your accomplishments. Management is understanding and flexible.",
        "summary": "Great place to work at",
        "role": "Anonymous Employee",
        "date": "Jul 19, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lot of politics around yearly review processYou might have to shout from mountain top about your achievements in order to get visibiltyNot cometitive salary and raise",
        "advice": "Pay your employees well in order to keep the motivationPlease introduce a fair review process",
        "pros": "Some of the best people to work withGood benefits, insurance etcFlexibilty to move within teams",
        "summary": "Graphics Hardware Engineer",
        "role": "Anonymous Employee",
        "date": "Jul 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "With the recent workforce reduction in 2016, it's uncertain what the impact will be on career opportunities. Not sure if employees will hunker down and stay in place, or if there is an upside where there will be opportunities if there is the hoped for growth.",
        "advice": "It's hard being a tech company with high growth expectations, and new products, services and developments which continually disrupt the market. For a good discussion, see the book The Innovator's Dilemma by Clayton Christensen.",
        "pros": "They hire really intelligent people. They have a world class manufacturing process. Finance has a good rotation program so that you can get different experience. It's a good place to get work experience. Generally, the pay is good and it's above average for Oregon.",
        "summary": "Finance",
        "role": "Financial Analyst",
        "date": "Jul 21, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "contractor always not allowed to the meeting",
        "advice": "good",
        "pros": "i really like environment and the team",
        "summary": "technical analyst",
        "role": "Anonymous Employee",
        "date": "Jul 21, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "From a software engineering specific position: there is no coherent career path for people who want software to be their main focus. Advancing down the technical career path at Intel, strictly speaking from a software perspective, usually means losing a huge amount of relevancy in the outside world - no companies outside of Intel need an expert in the politics and methods required to get things done within Intel. For…  this reason, I saw many of the most talented software folks leave after several years from fear of resume rot.Another point to be aware of for just about everyone at Intel, assuming you are ok at your job, your quality of life will depend almost entirely on who your direct manager is - and if you don't have a good one, your life will be miserable. Even if you are exceptional at your job, your career will go nowhere without a decent manager backing you. Spend too long under a not-so-great manager, and your career will be irreparably damaged - this is not a statement of hyperbole or jest. The way the employee ratings and ranking system is arranged requires that your manager play a serious political game, and if they are unable or unwilling, you will end up stalled. \"Stall\" too long - even being a key contributor to a business critical project- and you will get flushed by HR - also not a joke.",
        "advice": "If Intel needs talented software people (as I hear my friends in HR say), they need to be a place software people want to go. They probably need to define a career path for people in the software field, and they drastically need to fix their employee ratings and ranking system (changes have been \"in the works\" for the near 10 years I have worked for them).",
        "pros": "In any position at Intel, you will work with some pretty amazing people, make life-long friends, and have the opportunity to learn quite a lot. Health benefits are pretty much top-notch, and it seems they are making an effort to keep it that way. The ability to take a sabbatical (eight week paid leave) is a life-changing opportunity, and the new child bonding leave should set an example for all employers to follow.",
        "summary": "Software Engineer",
        "role": "Senior Software Engineer",
        "date": "Jul 22, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The management is highly incapable of understanding the employee's work.",
        "advice": "Learn and do more, talk less",
        "pros": "General good place, deal with latest technologies",
        "summary": "Packaging Engineer",
        "role": "Packaging Engineer",
        "date": "Jul 24, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Hyper competitive environment; lots of churn recently",
        "advice": null,
        "pros": "Leader in computing solution for various segments; driving industry transformation and changes; reinvented from memory company to PC company and now to cloud company.",
        "summary": "General Manager",
        "role": "Anonymous Employee",
        "date": "Jul 24, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Job Security, upper management one track thinking",
        "advice": "New managers need to take management class to improve leadership",
        "pros": "Benefits, work life balance, career opportunities",
        "summary": "Systems Analyst",
        "role": "Systems Analyst",
        "date": "Jul 25, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Poor work life balance, old school senior management 'carrot and stick' mindset from manufacturing environment, not fully aware of software ecosphere. - decisions made on short term profit and loss with little risk taking.",
        "advice": null,
        "pros": "Good pay, interesting customer base with excellent networking opportunities.",
        "summary": "Intel Software and Solutions Group",
        "role": "Technical Support Manager",
        "date": "Jul 25, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bad Management, No growth for technical guys, average salary,",
        "advice": "Change Old guys and being new talents",
        "pros": "Flexible time, Good learning place",
        "summary": "Technical Architect",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor work/life balance. Salaries aren't very competitive.",
        "advice": "Listen to your employees when there are valid complaints against management. Good moral is essential for the team.",
        "pros": "401K, stock, health benefits are all competitive. Encourages and has lot of opportunities for growth. Good networking opportunities.",
        "summary": "Great Benefits/Poor work/life balance",
        "role": "Product Analyst",
        "date": "Jul 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too big company unable to react to market changes",
        "advice": "Remove unnecessary executives and lower yearly cost.",
        "pros": "New challenges everyday and learning opportunities.",
        "summary": "CPU Debug & Reliability Engineer",
        "role": "Senior Fault Isolation & Silicon Debug Engineer",
        "date": "Jul 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Pay and benefits are not in first tier. Old guards try to guard their loots.",
        "advice": "Trim more fats. Cut to the bone. Scrutinize travel budget.",
        "pros": "Work-life balance is good. Company is going through a transformation period; expect change and uncertainty in the next year or more.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Jul 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Intel has started down the normal corporate path, reducing head count by letting employees go using VSP, loyalty seems to have been replaced with greed",
        "advice": "Take care of your employees",
        "pros": "Strong company to work for, dedicated employees",
        "summary": "Former Austin employee",
        "role": "Anonymous Employee",
        "date": "Jul 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Little to no personal life",
        "advice": "FIRE BK, the idiot CEO",
        "pros": "If you work 12+ hours daily you'll likely get decent pay",
        "summary": "Employment State",
        "role": "Operations & Engineering Manager",
        "date": "Jul 30, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Very stressful environment. Can be very negative at times. Lots of hours, no limit. On-call. No development plans or progression. Like a free for all. Some politics as wel .",
        "advice": "More positive culture focused on motivation and good behavior. Also focus on continual development of engineers and allow learning across areas.",
        "pros": "Good pay and benefits. Flexible schedule and some great people in manufacturing",
        "summary": "Fast paced environment",
        "role": "Senior Process Engineer",
        "date": "Jul 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The company is currently in transition. Not all decisions on changes to the work force are not being made at the local level. To be successful at Intel one must always be looking to get to the next level.",
        "advice": "Allow direct supervisor to give input on skill sets that are needed rather than looking primarily at time in grade to force out older workers.",
        "pros": "Intel provides a fast-paced,competitive work environment with excellent benefits. Everyone I worked with was intelligent and hard working. Safety is a very important part of the culture.",
        "summary": "Company in transtition",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Some positions ill defined and not well justified. When company reorganizes you are prime for release.",
        "advice": "If position is important enough to have then provide the candidate with clear role definition, scope, and career path. Otherwise upper management doesn't see the value of the role.",
        "pros": "Challenging work. Always expected to increase skill set and promote teamwork. And",
        "summary": "Yield engineering technician",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too many layers of management which creates a highly political atmosphere. Advancement is not based off of skill, but off of who you know.",
        "advice": "Cut out the middle layer of management. It isn't necessary and stops the company from being agile.",
        "pros": "Wonderful talented people to work with on a daily basis. Also the opportunity to move anywhere in the corporation which helps you to continuously grow your skill sets.",
        "summary": "Highly Political",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Work unlimited hoursRespond e-mails at 10pm at night is a norm",
        "advice": "Focus less on process and more on creativity",
        "pros": "Large potential for growth in the future.Excellent BenefitsVery accepting of minoritiesVery good pay",
        "summary": "Business Development Manager",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It is a big company, you would have few chance to promote.",
        "advice": "Good management,",
        "pros": "Woke life balance, usually you should not work overtime. And you will work with smart person.",
        "summary": "Good place",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no direction and we seem to move from one project to the next before finishing.",
        "advice": null,
        "pros": "Coworkers were always the best.",
        "summary": "Soft Eng.",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No Job securityNeed to keep projecting (boasting) about your work and keep arguing with your manager for growth.Quiet working employees become victims during lay-offs.First Level Managers project the work done by Engineers and get all the credit.Since most of the work is very specific to Intel, getting offers outside becomes difficult.",
        "advice": "Too many people managers and there is no technical freedom. Do not victimize the Engineers for Management's mistakes.",
        "pros": "Good Pay and work life balance.Employee Friendly.Cutting Edge technology.",
        "summary": "Becoming a Management Company",
        "role": "Anonymous Employee",
        "date": "Aug 3, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "In the department I work in there is no stability.High stress, very competitive environment right now.",
        "advice": "Stop taking yourselves so seriously. Look for opportunities to bring up talent from within the ranks even if they lack a degree. Too much of our talent leaves because they feel overqualified and underappreciated.",
        "pros": "Benefits are much better than any other company I have worked for.Flexible hours, if not abused.",
        "summary": "Not terrible yet not great.",
        "role": "Maintenance Planner/Scheduler",
        "date": "Aug 4, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "People are treated as cogs in a large machine. Seems to be going downhill fast.",
        "advice": null,
        "pros": "If you want a stable source of money, Intel is the place for you.",
        "summary": "Intel...",
        "role": "Manufacturing Technician",
        "date": "Aug 4, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Long hours, high stress. Review process makes genuine teamwork impossible. Most of the \"old\" employees (with more than 10 yrs at Intel) are gone now because of layoffs & restructuring. Good luck figuring out the best way to do things anymore!",
        "advice": "People are more motivated by praise & encouragement. Whipping employees to work harder all the time and giving constant criticism only leads to much resentment and poor performance. Show some respect & concern to them... they'll work harder and help turn the company back around.",
        "pros": "Great pay and greatgreat benefits,",
        "summary": "No teamwork anymore",
        "role": "Engineer",
        "date": "Aug 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Current bad management will run it to the ground. Bad/No strategy is killing the company fast.Every group has its own hiring policy, so many bad engineers tend to get hired due to sloppy interviews (bad hires hire other bad hires). Due to good benefits, bad people dont leave, while good get frustrated and leave. Messed up diversity hiring, messed up layoffs, messed up closing of sites, projects, messed up reorgs … etc.",
        "advice": "The reason Intel is not competitive in mobile and other products is due to bad management strategies. Products get delayed due to frequent reorgs that take 6 months to settle. Delayed products are not competitive and so they get cancelled and then management again does roadmap changes and reorgs which ironically delays the next generation of products by 6 months to a year. Have a stable management structure so that t… eams get 3-5 years stability to gradually meet and beat the competition. Stop expecting to compete against well entrenched players by entering the markets and expecting to beat them in 2 years. Have a real strategy (not some fancy virtuous cycle) instead of charging customers more just because you have a monopoly. That differential will disappear soon and then the company profit will collapse.",
        "pros": "Still pockets of technical excellence and brilliance. Still has lot of money making products. Teams working on every stack from virtual reality and machine learning to physics and manufacturing. A mini industry in itself. Benefits are pretty good.",
        "summary": "Best days behind it",
        "role": "Engineer Manager",
        "date": "Aug 6, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management expects too much. It is a very numbers based job / company and management asks for more and more each new process. Some jobs are extremely time extensive and management doesn't recognize the difference and asks for unreasonable outputs.",
        "advice": "Management needs to rethink their bull strategy. When you hire some of the best STEM workers around the globe then reduce them to a numbers game you will lose them. Also not knowing how what you are requesting works is never a good thing.",
        "pros": "Great benefits and pay. Being at the forefront of new technology allows the use of top of the line equipment for EVERYTHING. Never having to deal with tools or machines breaking due to age is a great way to deal with the stress of the job.",
        "summary": "Intel Lab job review",
        "role": "Yield Engineer",
        "date": "Aug 9, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Work life balance can take a hit sometimes. Your mileage of good work, environment can vary depending on what group you end up in. Can get lost as it is a big company. Sometimes bureaucratic and",
        "advice": "Need to set direction. Increase accountability for wrong decisions at higher levels. The old values and culture of meritocracy seems to be on decline; favoritism on the rise. Too much upheaval lately with almost all top mgmt. being replaced",
        "pros": "Overall good company to work for. Highly competitive and number of engineering opportunities. Lot to learn and good benefits overall",
        "summary": "Tech company review",
        "role": "Anonymous Employee",
        "date": "Aug 10, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Overworked, tough schedules, yearly layoffs and people churn, too much distributed development",
        "advice": "Quit burning out employees - value experience.",
        "pros": "Good benefits, great people, challenging work",
        "summary": "Good place to work....if you survive",
        "role": "Design Automation Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Office politicsit's everywhere and it controls everything. but it is a common issue among all medium\\huge corporations.- Very slow career progressionafter grade 6, it takes ~5 years to move to next level, averagely.- Some senior staff are rude and arrogantif they dislike you, or think you'll threaten their position, you will find you are out of the game next day. a few senior engineers t… hink they are on top of the world, with their outdated knowledge\\skillset.- Stupid stack-ranking review systemMicrosoft has discarded it already.. Intel still has it.- losing its mind in recent yearsIntel has been stubborn and insists that \"PC market is not decreasing and it is still strong!\" and in 2016 senior management has finally realized they were wrong. but it is late enough.- Horrible layoff in 2016the layoff in 2016 is terribly managed. it is endless and there's no way to predict when next round is coming. A lot, i mean a lot of bright engineers have left Intel and joining competitors.",
        "advice": "accept the reality and move fast.",
        "pros": "- open and direct communicationi love this the most. as long you are not offensive, people do listen.- managers are all supportiveof course it is not the case for everyone.. but my manager, manager's manager are all supportive on your thoughts\\ideas\\concerns.- perfect work-life balancei seldom work over-time.. employees with kids love here.- smart coworkersyou'll find the best … hardware engineers here",
        "summary": "A big bureaucratic machine",
        "role": "Senior Software Engineer",
        "date": "Aug 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Up front, I'm not a disgruntled employee fired during the latest round -- I left to take a job somewhere else because I could see the writing on the wall.Intel is clearing house. They are getting rid of thousands of seasoned employees. Imagine what that does to morale? Imagine what happens to a project you're working on when all the tribal knowledge that keeps everything running smoothly is shown the door.… >Is that where you want to work?",
        "advice": "Have a coherent plan for the future. Stop flailing every 6 months. Treat your employees better. Figure out how to encourage low level innovation. Top down management of every aspect is not the way to do business in 2016.",
        "pros": "Salary, benefits, medical package, work on interesting things, work with great people, good work life balance if you can figure out how to make it work.",
        "summary": "A company in turmoil",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Ultra competitive. Being successful in your job is not enough to keep your job.",
        "advice": null,
        "pros": "Good benefits good people there",
        "summary": "Systems analyst",
        "role": "Senior Systems Analyst",
        "date": "Aug 12, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Work night shift, compressed work week",
        "advice": "Integrate technicians and engineering a little more. Give technicians oppurtunity to have input on plans for maintenance.",
        "pros": "Safety is highly valued and is always priority.",
        "summary": "Manufacturing Technician",
        "role": "Manufacturing Technician",
        "date": "Aug 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Golden handcuffs... For a technician in the development factory there is very little to keep the job interesting.",
        "advice": null,
        "pros": "How much they pay and how much time off you get. Working a compressed work week with holidays, vacation and personal absence time, you work about 120 days a year and every 7 years you get 2 paid months off.",
        "summary": "Not a great place to work",
        "role": "Manufacturing Technician",
        "date": "Aug 14, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "too much politics and policies",
        "advice": "stop wasting money on marketing.",
        "pros": "work life balance is good.",
        "summary": "senior software engineer",
        "role": "Senior Software Engineer",
        "date": "Aug 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "top level management blindly follow mid level management, business direction not clear. Laid off frustating",
        "advice": "Need clean up middle management and SPE and Fellow PE not the employee",
        "pros": "Well structured company, well known in semiconductor business",
        "summary": "Project Review",
        "role": "Anonymous Employee",
        "date": "Aug 14, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The company is in transition and opportunities in manufacturing appear to be less stable.",
        "advice": "In the 2016 employee reduction, many employees were happy to take the early retirement because the working climate had changed. Employee moral has dropped quite a bit over the last 10 years.",
        "pros": "Many opportunities to grow and expand knowledge within the simiconductor industry.",
        "summary": "Line Coordinator",
        "role": "Anonymous Employee",
        "date": "Aug 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "upper management is not transparent in their plans or decisions; does not feel as if older employees are valued regardless of outstanding performance; lots of bureaucracy in decision-making at pretty much every level (not lean); risk taking is not really supported - Intel does not walk the talk - and the fear of failure is part of that.",
        "advice": "be open/honest with employees; truly encourage individuals and teams to take risks and go out on a limb once in awhile without fear of killing their careers if they fail; allow employees/teams to make decisions - reduce all the bureaucracy.",
        "pros": "Lots of opportunities to change positions/careers; competitive salaries; great employee benefits; lots of training/learning opportunities; diverse workforce",
        "summary": "Not the company it used to be",
        "role": "IT Business Analyst",
        "date": "Aug 16, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Short-sighted management. Lost vision and strategy recently.",
        "advice": "Do your homework.",
        "pros": "A wide range of technologies to work on.",
        "summary": "No Vision",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Ranking and rating (including the back stabbing and lies)",
        "advice": "Do not preach teamwork for 50 weeks out of the year, then turn the team against each other when it comes to raises.",
        "pros": "Wages and benefits, feeling appreciated at times",
        "summary": "Intel: Be Careful",
        "role": "Anonymous Employee",
        "date": "Aug 16, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "not the best place for most",
        "advice": null,
        "pros": "good employee base all over",
        "summary": "Intel",
        "role": "Anonymous Employee",
        "date": "Aug 17, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "represses positions. slow to get promoted",
        "advice": null,
        "pros": "Good work life balance. great benefits",
        "summary": "Senior Strategic Planner",
        "role": "Anonymous Employee",
        "date": "Aug 19, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too much politics and butt kissing.The focal (performance evaluation) process is a scam.If you are not part of any clan, you go nowhere.You got to like their koolaid and drink a lot of it.",
        "advice": null,
        "pros": "Good exposure to technology and plenty of career options",
        "summary": "Good for a few years.",
        "role": "Process Engineer",
        "date": "Aug 21, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Because it is a collection of fiefdoms, your experience in various places might be mixed. If you work in software or a product team, it can be very stressful. Also things change rapidly, you'll be working on something and then off after 8 months. Everything indicates that this will continue.With the recent actions, there is an incredible amount of stress as people adjust to the new operating parameters. Right…  now it is unknown what is a good employee and there are some who have decided to leave than to deal with an unknown system. It would be wise to wait till things have settled down and things are more clear on how compensation is going to work.Intel is still a good place to work, but work conditions are very tough right now and it could be alleviated by hiring more people, but that can't happen till clear expectations on compensation and what it means to be successful is more clear.",
        "advice": "Good luck. :) Right now, until people figure out the focal process, it will be hard to retain good people. The best thing to do is to keep people on task and hire many new people in hopes that the relative newness of these people will spare them from the chopping block.",
        "pros": "Think of Intel of a collection of fiefdoms battling for fun and profit. If you get into the right fiefdom, then you have a rewarding experience and a great chance to learn new things that you never would have before. In my 20 years at Intel, I have been grateful for the opportunity to do many interesting things. Especially my last four years, has been an amazing experience with a great team - Open Source Technology C… enter.",
        "summary": "Great company but challenging times ahead.",
        "role": "Engineering Manager/Marketing",
        "date": "Aug 22, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Stuck in old processess. Slow to change. Annual review process is terrible, simply it does not work. Not a company to stay for life.",
        "advice": "Managers need to be leaders!",
        "pros": "Great people, challenge, and good interaction. People is always trying to help each other. Knowledge is shared. Good company to start your career.",
        "summary": "Good compensations and benefits",
        "role": "Hardware Engineer",
        "date": "Aug 22, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "poor work-life balancegeneral sense of insecurity in job stability",
        "advice": null,
        "pros": "Good pay and benefits. Lots of interaction with other engineers.",
        "summary": "TD Process Engineer",
        "role": "Anonymous Employee",
        "date": "Aug 23, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Even though I personally did not suffer too much from performance management related issues, I was always discouraged by the way performance management was done at Intel. Towards the latter end of my career, I myself was forced to follow some of the direction even though I always felt disgusted. Meritocracy it seems was not really rewarded and it always seemed that the laggards somehow were better at surviving. While…  I have utmost respect for technically competent people, men or women, in the name of diversity, I saw some of the women being given leadership opportunities even though they did not deserve it - in some cases, their feedback was sub par but since they were connected to upper management, they kept getting promoted. In the last 5-7 years especially, decision making had significantly deteriorated across some BU but some of these keep surviving",
        "advice": "Listen to the feedback that is being given to you some multiple technical and senior management people who care for the company and people. Bring someone new who in turn brings their own set of pet people will not change things. New person needs to first understand how this ship runs before he/she can think of steering.",
        "pros": "Intel is like many companies in one. During my time, I was able to gain experience across EDA, Logic Design, Verification, Physical Design, Software Optimization at Compiler Lever among other things. For the most part, I was fortunate to have worked with some of the sharpest people in the Industry. Moving from one business unit to another was not difficult and one could pursue opportunities based on interest.",
        "summary": "Overall Feedback",
        "role": "Senior Engineering Manager",
        "date": "Aug 24, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "company currently doesn't have clear direction on where its headed",
        "advice": "Handle Layoffs better. Lot of really good hardworking employees lost jobs",
        "pros": "Great benefits and work perks",
        "summary": "Overall Review",
        "role": "Anonymous Employee",
        "date": "Aug 24, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Big company is big overhead! The old guards are hard to replace to bring new ways of thinking. Decisions are made slow. And one may be lost in the crowd!",
        "advice": "Bring people with new visions. Shake-up the whole org and put people in charge who want to perform rather than play politics and position themselves ahead of the company.",
        "pros": "Financially stable. Leading edge CPUs & SOCs",
        "summary": "Pre-Si Verification",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "General fear of industry standard tools. This isn't the whole company, and they were using a few when I left. But in general they create their own, which ends up being meaningless on your resume to any company outside of intel. Also, the reason they create there own is that the people who do so get more credit for that than using an industry standard tool. This creates a cycle of creating new internal tools that repl… ace old ones constantly to get that credit. As a result the tools are never very refined.",
        "advice": "Look more at industry standard practices. Don't be afraid to ask your employees to learn new languages like (gasp) python instead of perl... Encourage people to work with their strengths, and reward them.",
        "pros": "Large company means you can move around to different positions without taking a pay cut. It also means there is a lot bureaucracy, which you can be a part of, make good money, and do little real work. A lot of people are very happy doing that.",
        "summary": "Mixed Bag",
        "role": "Component Design Engineer",
        "date": "Aug 26, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Some parts of Intel are very political and not results oriented",
        "advice": null,
        "pros": "Intel keeps changing, which offers opportunities to grow your career",
        "summary": "Senior Program Manager",
        "role": "Senior Project/Program Manager",
        "date": "Aug 27, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Intel has been around a while and that has meant changing directions and getting into new businesses. The cost is cyclical hiring and layoffs. Rather than punishing the leaders that made wrong choices its the work force that suffers more.Mixed quality of management. Manufacturing and technology development generally has a rough culture, the culture is promoted by the higher management and valued as a way to gener… ate new ideas but realistically just causes passive aggressive behavior.Some VPs are busier with internal empire building than actual business strategy to benefit Intel.",
        "advice": "Directors and VPs let the people managers manager their teams. You are not all knowing and all wise. Focus on larger goals, process and organizational memory rather than micromanaging and incessant input.",
        "pros": "Generally good culture, benefits above average, best transistor technology, many smart colleagues, free drinks, fruits and fun events. Quite agile for a 100K+ employee company but at a cost (see below), willing to get into new businesses, learn and compete.",
        "summary": "Mixed bag",
        "role": "Failure Analysis R&D Engineer",
        "date": "Aug 27, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Sometimes as a software professional in a hardware company, you are valued less than you should be. There isn't always a clear a path for career advancement for software professionals, at least not as much as for hardware pros.",
        "advice": "Lay yourself off. Find leadership that champions new ideas and products that lead to growth, rather than spending so much time making sure you have the right politically correct mixture of diversity on a sinking deck.",
        "pros": "Used to be a good company",
        "summary": "She ain't what she used to be!",
        "role": "Software Applications Developer",
        "date": "Aug 27, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High pressure. Schedule is top priority.Less opportunity to innovate due to resource and design constraints.",
        "advice": "Create and nurture an environment where engineering is as exciting as it should be. Emphasize innovation over procedural tedium.",
        "pros": "Make an impact. Your designs go into high volume production.Work with highly skilled contributors.",
        "summary": "Component Design Engineer",
        "role": "Component Design Engineer",
        "date": "Aug 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too much nose browning, politics involved to climb ladder. Yearly performance review (Focal) process is completely broken and fosters internal competition instead of collaboration",
        "advice": "Reward people for their accomplishments not for how loud they can talk!",
        "pros": "Relative job stability, good/competitive compensation, internal opportunities, technical knowledge, access to state of the art technology, blah, blah, blah, etc... blah, blah, blah, etc... blah, blah, blah, etc...",
        "summary": "Org fatigue",
        "role": "Senior Graphics Software Architect",
        "date": "Aug 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too many managers. and too much politics. over managed and supervised most of the time.",
        "advice": "lay off the employees let them do their jobs without constantly being judged and over supervised.",
        "pros": "challenging and rewarding. good benefits, and decent pay.",
        "summary": "mixed bag",
        "role": "Technician",
        "date": "Aug 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Sales org confusing and not aligned with customers. Risk culture has shifted to one of it's okay to take a risk as long as you get it right. Manufacturing exec leading the company without clear vision and may under mind the ultimate long-term success of the company.",
        "advice": "get back in touch with customers and understand the value of the sales to customer relationship",
        "pros": "great overall benefit package including sabbatical and 401k contribution",
        "summary": "Field Sales Engineer",
        "role": "Anonymous Employee",
        "date": "Aug 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "workspace is politically driven by who likes who.",
        "advice": "a heads up on when you will be let go from the company. Hiding it until the minute an employee gets a unexpected sit down with HR and your OM",
        "pros": "COMPRESSED WORK WEEK AND OREGON",
        "summary": "MEH.",
        "role": "Manufacturing Technician",
        "date": "Sep 2, 2016",
        "is_current": false
    }
]