[
    {
        "rating": 2,
        "cons": "No career growth or promotions even with great performance and awards. Moving within the company can also be hard, especially because of mediocre upper management.",
        "advice": null,
        "pros": "Great work-life balance. Job rotation to try out different teams.",
        "summary": "Look elsewhere if you want career growth",
        "role": "Graphics Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Managers/Leaders more worried about their careers than producing innovative products. There is a general fear of being innovative and failing. There are lots of groups who compete against each other for projects. This creates tension between teams and as a result they don't help each others. Very odd way of managing business. Annual review process is more of a popularity contest than rewarding people for strong resul… ts. Their pay is typically less than most hi-tech companies. Sadly, best days are behind them.",
        "advice": "Too many people in the company for amount of work. As a result people are fearful of keeping their jobs and not looking for innovative products. Remove managers who can't manage or produce strong results.",
        "pros": "Steady income and good work life balance. If you want a job it's a great place as they have lots of reserve cash.",
        "summary": "Not for those who are innovative and like learning",
        "role": "Engineer Manager",
        "date": "Jun 3, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "observing a lot of poor managers caring about their self interest only regardless of negative impact to the company and they are hiding the truth.",
        "advice": null,
        "pros": "high tech and fair compensation",
        "summary": "Senior engineer",
        "role": "Senior Engineer",
        "date": "Jun 13, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management is lack of vision. Reluctant to move forward and compete wih other high tech companies.",
        "advice": null,
        "pros": "Steady environment. Will survive for a long time.",
        "summary": "Lack of innovation",
        "role": "Anonymous Employee",
        "date": "Jun 19, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Challenges include finding the right fit for skills, lack of direction, unable to retain top talent, corp politics play a big role in how and what is worked on. many mid level managers make intel a slow moving ship. There is a lack of creativity, risk taking, innovation. Engineers in Fabs over worked and have no life .. ability to move into new position is near impossible/",
        "advice": "if you want to know why there is high churn and why the recent college grad engineers prefer to go work for companies like google, then dial in and listen to these RCG's. They likely hold the key to the companies success.",
        "pros": "If you do find yourself in the right job then all the benefits and compensation is pretty good",
        "summary": "We make logic, but certainly don't use it!",
        "role": "Senior Process Engineer",
        "date": "Jun 23, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Work/life balance here means don't ever let your life get in the way of work from 7am to 4pm. After those hours, a compelling reason for absence is okay, as long is it happens infrequently and nothing bad happens when you're away.In 4.5 years, I never saw anybody get a raise better than the real inflation rate. For the people managers love (which seems to have little to do with performance), they get 3%. Mana… gers there love people that will not speak up when given impossible tasks or when told blatant lies. Managers all manage up, meaning they want you to say you are on top of everything so they can go back to their meetings. When something falls through the cracks, they want to be able to say you didn't ask for help. They do not want you to actually ask for help, and if you do they will burn your time up justifying what you've been doing every minute, but they never take anything off your task list.The few Managers I saw that actually spent time trying to help their team get their jobs done were laid off or demoted. Everything new that is rolled out is presented with the punishments for not complying. I never saw a new initiative or process rolled out with rewards or positive encouragement. Every failure, even mechanical breakdowns like welds breaking, are viewed as personal discipline issues because a good engineer knows the condition of all their systems. If you asked to upgrade the system and got turned down, the failure is your fault because you didn't specify when and how it was going to fail, and you didn't re-submit your request with better justification.I had an alarm that went unattended for 2 hours and caused a problem. One root cause was that they just laid off 2 of the 3 job positions that were supposed to respond to the alarm and hadn't figured out a backfill plan yet (normally 3 job positions are all supposed to make sure the alarms are handled). Two of the three were laid off, the ops tech was busy repairing other broken equipment, and the managers at the incident review rejected those root causes. The only root cause accepted was the ops tech thought the alarm was not critical and took two hours to respond. The solution adopted was to change the alarm message to sound more critical.I've worked for many companies, and I've never seen a place where deception by omission is the only way to keep your job.",
        "advice": "Start accepting feedback from your lower managers. You have built a culture of yes men that will not tell you when you're steering into a wall. Start dividing up work so that people are doing what they're best at. The current mindset is everybody should be great at everything, and if not, that's what we'll make you do until you get great at it. The result is inefficient teams where most people are spending hours doin… g something that would take the right person minutes, and pointing out examples of that is considered insubordination and poor attitude.",
        "pros": "They pay competitively at the time of hire. The bonuses are real and they are substantial.",
        "summary": "The pay is good.",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Talented employees identify others as 'competent' or 'incompetent' on a hair trigger - judgement is rampant. More idiots who can play the game than people with real passion or ideas.",
        "advice": "Empower your employees to do what they care about - quit 'no more free candy - but here's 250k to blow on a totally unnecessary part because the Engineer said so.'THE SKILLED MTs ARE THE ENGINEERS HERE",
        "pros": "High concentration of talented people, very intelligent and deliberate values,",
        "summary": "Not What It Once Was",
        "role": "Manufacturing Technician",
        "date": "Jul 2, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Swearing, yelling, blaming, pointing the finger, and just plain unprofessionalism. It depends on what lab you work in. Some managers have too much time and others not enough. Some managers spend a great deal of time \"spying\" on employees. I guess it's the same in any company, but I thought Intel had higher standards.",
        "advice": "Blue badge employees, supervisors, managers, and team leads are placing too much responsibility on Green Badge employees and or the contingent workforce.",
        "pros": "Fantastic Learning Opportunities. The most advanced microprocessors in the world. Intel owns the facilities and spends copious amounts on Research and Development.",
        "summary": "Contractors Beware. Be Prepared to do the work of a regular full-time employee without the \"Great Place to Work Value\"",
        "role": "Software Testing",
        "date": "Jul 3, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Sub-par compensationLess and less focus on work-life balanceInefficient planning / work flow (you get to enjoy doing the same changes multiple times, and/or completing a task and THEN having it pulled from a project)Hard to get promoted past mid-level, at least in engineeringYour hard work may very well go unrecognized",
        "advice": null,
        "pros": "Great job stabilityWork on products that impact a lot of peopleManagement usually listens to complaints of workers",
        "summary": "Stable, limited upward mobility",
        "role": "Graphics Hardware Engineer",
        "date": "Jul 14, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Horrible annual review process that encourages backstabbing, \"clique\" promotions--too bad if you don't know anybody..",
        "advice": "No point..the company has been the same for years.",
        "pros": "reputation, coworkers, quality of work",
        "summary": "Lacking in Culture",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is no real opportunity for career advancement, there are relatively few transferable job skills, work-life balance is terrible (24/7 on-call support), the pay isn't great compared to the number of hours worked or the possibilities at your skill level, and you don't feel like you contribute meaningfully most of the time because you are such a small cog in such a big machine. Oh, and because much of what you do i… s IP-protected, it can be hard to tell anyone what you've done on, say, a resume for another employer.",
        "advice": "Listen to what the people on the floor are telling you. Treat your current employees better so that you don't have to keep hiring new ones. Don't pay new hires more than people who've been at the company for several years. Stop setting contradictory and expanding expectations without consultation of the people it will affect. Don't tell us we're doing great and then pay us small bonuses.",
        "pros": "Working as an engineer in PTD has amazing job security with a decent salary. You are also helping to develop the next generation of computer chip, which is pretty neat in an abstract sense.",
        "summary": "Good company, but working in the PTD fabs is rough",
        "role": "Process Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Consideration of new ideasAdaptation to change",
        "advice": null,
        "pros": "Smart peopleGood Processes / Manufacturing",
        "summary": "Strong finance organization, but resistant to change.",
        "role": "Anonymous Employee",
        "date": "Aug 26, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Sell your soul and compete against co-workers for recognition, pay and advancement...",
        "advice": "Focus more on managing down rather than up. Less PowerPoint presentation meetings, more skunk teams who are given time and resources to develop new innovative products. Focus on actually developing people rather than boxing them in to focal categories.",
        "pros": "Relatively good pay and excellent benefits",
        "summary": "Political big corporate environment...some great people though...",
        "role": "Professional Support Role",
        "date": "Sep 7, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Pockets of terribly mismanaged groups... all depends on who you are working for (which is surprising for the company of this size); incompetent / immature management is quite common",
        "advice": null,
        "pros": "Working form home is wide-spread across the company",
        "summary": "Finance Org",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No work-life balance. Politics get in the way of getting anything done. If you aren't in management, your opinion is not valued and they will find any way possible to make your time there difficult if they deem you not \"Intel quality\". Like someone once told me, \"Intel is where engineers go to die\". I also found as a female working there, the environment was even more closed-minded to you. Don't be mislead by all the… ir advertising of \"women in engineering\" or claiming they want to hire more females. I endured plenty of discrimination in my time there.",
        "advice": "You really are not as smart and almighty as you think you are. You missed the train years ago for the mobile market and no matter how fast you move it's going to be impossible to keep up. Stop draining the life out of your employees and hire more people so work can be more evenly and appropriately dispersed. Also, you may want to monitor your managers more closely because there's a lot more harassment going on than m… eets the eye.",
        "pros": "In general, people are good. Great benefits and pay.",
        "summary": "Pick your team wisely",
        "role": "Test Engineer",
        "date": "Sep 9, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Use of performance anxiety driven overwork labeled as \"healthy tension\" can make the place \"difficult\". See also \"high tech lawsuit\" for further info on HR policies.",
        "advice": "Dump focal, get back to the core values that have gradually become ignored or only given lip service. The solution is printed on the back of your work week calendar.",
        "pros": "You can define the technological solution space of the next generation compute engines",
        "summary": "Constant change keeps you a little off balance",
        "role": "Engineer",
        "date": "Sep 11, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Mind-numbing work (which is why they hire PhDs from any major. What does a Mat. Sci. Phd have in common with a biochem PhD??)Terrible work-life balance (weekend on-call and about 6 months every year is in a 7 day start up phase).Heirarchical management (not welcoming of dissenting dialogue on a problem, even if presented with data)",
        "advice": "Be open to discussions with your hires, rather than giving ARs.",
        "pros": "Good pay compared to industry average.Process engineer at Intel is an extremely secure job.",
        "summary": "Above average industry pay but dull routine work, especially in the high-volume fabs.",
        "role": "Process TD Engineer",
        "date": "Sep 16, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I worked at Intel for 8 1/2 years. The last couple of years were my most passionate and my greatest frustration. While none of my managers were malicious, their net effect was categorically abusive. I simultaneously had a skillset that was too critical to my server project to allow me to take an offered SoC \"Hot Job\" (jobs identified as critical for the company's future), but not worthy enough to address the career g… rowth reasons for my dissatisfaction with the project that led me to want to leave, but they still offered me nearly half a years pay to voluntarily separate from the company to make space to hire more engineers for SoC. Let that sink in - I had been offered an SoC-related engineering job and my group blocked my transfer then offered me a large buyout to leave the company because they needed to make room to hire SoC engineers. Again, nobody was being malicious here, but I was in the middle of three different ridiculous circumstances caused by decision of three different levels of management all acting in what, at some level, was the most rational thing for them to do. At no point did anybody stand up to say \"the company is paying a good engineer we could use in SoC to leave the company. That doesn't seem right.\"Intel will tell you largely and loudly about how much they value the people working there, but they have erected systemic barriers that allow pathological levels of cruelty towards these same people. Intel will shout until they are Intel-blue-in-the-face that they have these wonderful systems for recognizing and rewarding accomplishments, but they're very inconsistent in their use. I worked on my own time for two years creating an architectural firmware debugging GUI tool. After it was announced that I was leaving, architects and engineers from different teams and different projects popped up to make sure that the source code would be available once I was gone. Over 400 hours of my own time creating it, other engineers apparently thinking that preservation of the source for it was of paramount importance, yet it was never deemed enough of an accomplishment for either recognition or reward. I can think of few more stinging ways to wound a departing engineer. When the buyout offer was extended to everyone, 5 acceptees were asked to delay their departure because their skills were needed badly. I was one of those 5 and to this day one of my greatest regrets of my 8 years at Intel was agreeing to it.I offer this example for illustrative purposes to demonstrate the dysfunctional connection between Intel's intentions, and Intel's actions. That last tool was not the first time I had identified a need, spent my own time providing a solution, had the tool picked up by many other engineers but received no notice from management until I moved on -- it was the third. The problem is systemic with deep roots. It also isn't why I left. I left because my career growth was dependent on the cooperation of a junior engineer who was getting rewarded with annual review bullet points for non-cooperation.",
        "advice": "Think about the Intel values and think about how you are using them. They're good values, but worthless if they're little more than filler on the back of your badge calendar. My manager sat in a cube 600 miles away held 30 minute 1:1's with me on average once every 3 weeks. When I complained up the management chain, nobody thought this was something that deserved attention. My manager assured me that he understood my…  concerns and had a good sense of what was going on. When the auto-generated emails from Taleo started arriving, his first question to me was: \"what can we do to keep you here?\" Apparently he didn't actually know my concerns. He pleaded with me to wait just a little longer before accepting anything, which I did. When the server group GM enabled management to block transfers for 6 months, all such pleading stopped. Are you listening to your direct reports? Do you know what they're working on? Do you recognize when they go the extra mile for the project? Do you confront conflict between engineers constructively or do you ignore it and tell them to \"deal with it\"? Is the best tool in your belt the ability to delay dealing with a report's concerns until you can argue that addressing something that far in the past would do more harm than good? In 1:1's do any of your reports have to spend most of their time telling you what they've been working on because you can't remember?",
        "pros": "Your colleagues can easily become your best friends. Work/life balance was very good. Health care benefits were fairly good and they have patient advocates who will take up your cause with the insurance provider if necessary which really blew me away the one time I needed them. Opportunities to work from home were superb.",
        "summary": "The best of times, the worst of times...",
        "role": "Silicon Architecture Engineer",
        "date": "Sep 17, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Work-life balance is nearly nonexistentThere is slow job advancementThere is a bureaucratic feelThe company culture varies dramatically between groups, and is more of a group culture than company culture",
        "advice": "Provide more opportunities for advancementStop promoting great work-life balance at recruiting events, it is extremely misleadingStop consolidating multiple jobs into one, as it makes it difficult to specialize and requires workers to have a very, very broad and shallow set of skills, which isn't conducive to specializing in one area as you move up",
        "pros": "Flexible schedulesGreat benefits (vacation, holidays, payment, bonuses, stock purchase plan etc)Cool events like NW FIT events and quarterliesAwesome networking opportunities with all levels of management",
        "summary": "Not as great, or as bad, as it could be",
        "role": "FP&A Analyst",
        "date": "Sep 29, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No one actually cares about your needs, they only care about the company.",
        "advice": "Change management.",
        "pros": "Great company benefits and starting salary",
        "summary": "Wish I could forget it",
        "role": "Process Engineer",
        "date": "Sep 30, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Over two years working in one of Intel's product strategy units [not engineering and I think that's important to discern], I met some awesome people but overall, I found little challenge, inspiration, or vision in the company and its culture. I often felt like the company as a whole was on auto-drive, sticking to management styles, roadmaps, lifestyles that were familiar and comfortable to them, rather than taking ri… sks and seeking true, sustainable positive changes. I witnessed an idea rejected because it wasn't on a years-old roadmap and thus deemed impossible to execute; Apple came out with devices that implemented the idea 6 months later. I sat in many meetings where the audience typed furiously on their laptops or snored loudly over the conference call during the presentation, giving 0 cares, or they pigeon-holed on a completely unrelated topic that delayed crucial decision-making. Everything at Intel felt like it moved slowly, bogged down by tradition and its resulting band-aid fixes/decisions.I also encountered serious issue with the company's management selection scheme. Managers seemed to be chosen based on how long they've been at Intel or what's on their outdated resume, rather than their demonstrated merits and character. When respected colleagues approached my manager requesting to change projects due to consistent sexist and demeaning comments made by the project manager, they were immediately told to quit whining or start looking for new jobs. When I approached my manager with concern that I felt unchallenged, was not experiencing growth, and reaching my potential, he told me that I shouldn't worry since learning the organization chart and how the different business units interacted with each other was still a major achievement.... UH, NO.... not after I've been there for about 2 years and I regularly expressed to him my goal to build my technical expertise.In summary, based on my experience, Intel has some great people but if you're looking for serious growth and inspiration as a non-engineering designer, this is not the place you will find it.",
        "advice": "Do a better job of selecting management.Target some women empowerment initiatives at educating men that compose the majority of your work force.Provide benefits oriented towards younger, single (no kids) workers.Commit and really spell out a single vision and it's practical implications on your workers.",
        "pros": "BenefitsFree peaches during the fallWork-life balanceGlobal community",
        "summary": "A quicksand of tradition and stability...",
        "role": "Designer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Overall, adversarial relationship with operations, not much of respect from business owners and finance. Highly disfunctional environment in the department, blooming favoritism. Quality training opportunities are poor to none. Constant pressure to pay less and reduce headcount.",
        "advice": null,
        "pros": "Work-life balance is good. Legacy of great internal audit process and methodology",
        "summary": "Internal Audit",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Let's start with blue badge cons: sabbaticals are great when you are on them, and extremely stressful when important co-workers are on them. More than a few people quit or transferred because of other people's poorly-planned sabbaticals. On the other hand, some people at Intel are so useless, you don't even notice that they're gone until their cube is decorated for their return. It is very much a secret society; if y… ou are liked by everyone, you will work there forever. If you are disliked, you will find yourself in redeployment regardless of how much of a rock star you are. The technology at Intel (and the IT department in general) is ironically bland, old, and limited. You will not be working with cutting edge technology at Intel unless you're directly involved with creating it. There is shockingly little innovation at the company because whenever a new problem arises or a new business idea is funded, they put the same old grey ghosts in charge of it. If your previous job was at a tech startup, Intel will feel like Soviet Russia to you -- big, cold, slow, mundane, hostile toward change, dominated by senseless rules and old traditions, secretly pleased with the failure of new initiatives, and governed by oligarchs. Most people are decent, but some people are untouchable and they know it: many 10k and 100k managers, architects, and everyone above them. They are free to do and say whatever they want, they can and will flagrantly disobey rules and disregard standards, and they can eliminate your budget, cancel your project, or even force you into redeployment or resignation if you really stand in the way. If you want to make a difference, do not go to Intel. Do not expect to be employed long-term unless you are working on a product that is actively making a ton of money for the company. Green badge contractors are often fired for no reason with no warning and no severance. If you are a green badge at Intel, expect not to have a job tomorrow, be glad if you still do, and always be looking for your next job.",
        "advice": "Stop with the re-orgs and bipolar decision-making. Eliminate the perks that attract long-term bloodsuckers and focus harder on benefits that attract risk-takers... figure out how to be competitive with startups instead of trying to be competitive with the US Postal Service. Look up Jane Elliott's \"Blue Eyes Brown Eyes Exercise\" so that you can learn a famous and well-documented lesson about discrimination based on co… lor (even if it's the color of the plastic around your neck, the same results apply). Maybe the Stanford Prison Experiment as well. Use more short-term contractors to fill in for sabbatical coverage so your high-achievers don't get burned out. Modernize everything in the same ways that ARM and nVidia have. The only part of Intel that isn't old and rusty is the manufacturing group.",
        "pros": "This depends on the color of your badge. Blue badge employees or ICE contractors have a lot of perks -- free tickets to major sports games and shows, on-site events, little freebies like coffee and fruit. You are entitled to a one-month sabbatical every 4 years, or a two-month sabbatical every 7 years. There aren't layoffs in the traditional sense; instead, Intel will offer voluntary separation agreements (big severa… nce check) or redeployment (you can still get paid while you desperately apply for other positions within Intel, and are given priority hiring status). Most people at the company are pleasant and professional (some are NOT; see the cons section for details). If you play your cards right, you can coast here for 30+ years and get a marvelous retirement at the end. The people who are happiest at Intel are those who don't really care about the outcome of anything. They just show up, log their time, complete their work to spec and on deadline, follow the rules, don't make waves, and go home at 5. If that sounds like you, then you will love Intel. That really isn't any different from any other huge corporation, but Intel will give you better long-term benefits. Now on to green badges: the one and only pro is that you will get paid for the time you enter into your timecard.",
        "summary": "Know exactly what you are getting into and don't dare to hope",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "They want to take over your life and make sure you drink the corporate koolaid.",
        "advice": "Learn to be more flexible and adopt more of a start up mentality, obsession with meetings for the sake of having meetings means you often miss deadlines. People are too busy going to meetings to get any real work done.",
        "pros": "Seems to be a lot of activities to keep your interest, and the pay is about middle of the road.",
        "summary": "Beware Dinosaurs",
        "role": "Senior Engineering Technician",
        "date": "Dec 16, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Horrible Management. Needs a lot of work.",
        "advice": "work-life balance.",
        "pros": "Worked On The Latest Technology",
        "summary": "Validation Engineer",
        "role": "Validation Engineer",
        "date": "Dec 23, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "1. filled with politics2. false promises are made till work has to be done3. hikes,promotions everythg is biased",
        "advice": "grow -up and be accountable for your actions! live upto the reputation tht intel brand has achieved...",
        "pros": "1. the facilities are good2. if you are focused one can learn alot",
        "summary": "never join this company!",
        "role": "Graphics Hardware Engineer",
        "date": "Dec 26, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "no good project, no very technical, no ambition.",
        "advice": null,
        "pros": "relax, time permissive, free drinks",
        "summary": "Intel Argentina",
        "role": "Anonymous Employee",
        "date": "Dec 30, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Poor job growth opportunityLots of politics",
        "advice": "Work towards getting younger talent the right opportunity",
        "pros": "Relatively good life and work balance",
        "summary": "Very poor growth opportunity",
        "role": "Senior Packaging Engineer",
        "date": "Jan 8, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lack of career advancement unless you are buddies with someonePoor management stylesExtremely conservative company - comes from someone who worked here for 10+ yearsPeople get stuck in the same grade for several years for no fault of theirs",
        "advice": "Start trusting your employees and invest in themDont BS at review time",
        "pros": "Good benefits, good vacation policy",
        "summary": "Poor management, poor career growth, stingy company",
        "role": "Software Engineer",
        "date": "Jan 12, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "negative people, old boy's club, men's locker room environment.",
        "advice": "getting to know what your people are dealing with on the factory floor would be advantageous, instead of taking management's word for it.",
        "pros": "one of the highest paying employers in the industry, fast paced environment, room to grow if you have a Phd.",
        "summary": "Frustrating environment, overworked for the amount they pay, always looking for people to work overtime.",
        "role": "Maintenance Technician",
        "date": "Jan 15, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "PC market is shrinkingconfrontational culture",
        "advice": "take a look at all the failures to diversity in the past, and try to do things differently",
        "pros": "still monopoly in PC semiconductor industry. AMD is far behind and has too many problems to effectively compete",
        "summary": "still looking for break through",
        "role": "Financial Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Pay is ok if you're outside of the Bay area but not as competitive as other tech companies in the valley. Not many perks either. Your success all depends on who you know and work for. Very political. Lots of ok talent. Intel doesn't attract the best in Silicon Valley but if this is your 1st company out of college, go for it. Very very difficult to move up. Flat organization. Too many meetings that are very unproducti… ve.",
        "advice": "Reduce # of meetings, hire more talent that have specific discipline expertise, hold teams accountable to deliver on ROI.",
        "pros": "Lots of flexibility to work remotely, Ability to move around the company and learn a new job/ discipline but mostly lateral moves, interesting technology and very competitive in the chip space. Benefits are good and on par with other companies. Their sabbatical is attractive if you plan on staying with a company for a long time.",
        "summary": "Big company, lots of politics. Success all depends on your team and manager.",
        "role": "Marketing Manager",
        "date": "Jan 18, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It is a bottom-line high volume manufacturing company",
        "advice": "Just focus on the basics with no frills",
        "pros": "Cutting edge technology. Chip manufacturing is a science within itself.",
        "summary": "Life at Intel",
        "role": "Anonymous Employee",
        "date": "Jan 26, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Overall business in a downcurve and loosing control of technology leadership yet turning into a huge marketing-ad company. Diversity program to focus on hiring/promoting mix (or number) of certain people/groups by not evaluating the capabilities. As like any other big size companies, bureaucracy spreaded widely amongst the company.",
        "advice": "Really need to tranfuse capable resources from outside and stop promoting and/or shifting internal \"Intelians\" who'd been with the company for ever.",
        "pros": "Huge marketing company with great bonus plans and other benefit packages. Depends on the group/team you work for yet very high chance of an envious work-life balance. Many chances to learn tons of different jobs/roles given company to be size of a mammoth or even greater.",
        "summary": "Marketing company with good benefits",
        "role": "Product Marketing Manager",
        "date": "Mar 18, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "very bad mid level managemnet. Most managers are morons and just beat people. Hardly 1% managers have a vnc and are technically involved. they dont care about employee development. Nepotism seems to be rampant. Most teams have core group of people and they are the ones promoted.",
        "advice": null,
        "pros": "sabbatical/profit sharing decent health insurance even though now comapny is moving most of teh burden to employees",
        "summary": "Poor mid level management. Works like a government org with lots of red tape to get simple stuff moving.",
        "role": "Anonymous Employee",
        "date": "Mar 24, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "work life balance is often a challenge as work demands push into personal life weeknights & weekends. Stress level often climbs above reasonable range. Hardly any time to innovate, create, learn new methods. Employee competition is high.",
        "advice": "create a better environment to improve worker morale for a happier work force.",
        "pros": "good benefits, nice campus, smart people",
        "summary": "they really get what they can out of you",
        "role": "Anonymous Employee",
        "date": "Apr 7, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Everything else. So pathetic that they cannot even manage sending out W-2s & that is just a tip of ice-burg!",
        "advice": "Cannot say much when a company's President used to be the personal secretary of previous 2 CEOsPlease consider retiring & bringing external people",
        "pros": "The best with what they know**they know just one thing & there is no competition in that space",
        "summary": "Component Design Engineer",
        "role": "Component Design Engineer",
        "date": "Apr 21, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The corporate culture, and management constantly nagging for schedules and timetables. Having to be on-call every evening and many weekends. Average employee stays only 3-4 years, many quit sooner",
        "advice": "Give work-life balance more than lip-service",
        "pros": "Interesting work and generally competent/motivated engineers; decent pay and benefits",
        "summary": "in TMG (D1C,D1D,PTD), hours are long and many weekends on-site",
        "role": "Process Engineer",
        "date": "Apr 22, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Everything that you can think of, poor work life balance, poor benefits lot of bureaucracy",
        "advice": null,
        "pros": "Nothing worthwhile to mention, everything is crappy with no growth opportunities",
        "summary": "Crap, not employee friendly, too much politics and bureaucracy, no growth and poor salary and benefits",
        "role": "R&D Test Engineer",
        "date": "Apr 26, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "On call, 24 hour support wears a person down. Even though this large company has many different roles, it is very difficult to change jobs within the company.",
        "advice": "Create a culture where internal positions can be filled with capable candidates.",
        "pros": "Good salary, good people, interesting and complex work. Because the work is so complex, there is a good training structure for nearly every role.",
        "summary": "Process Engineer",
        "role": "Process Engineer",
        "date": "May 4, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "not at all a competitive pay",
        "advice": null,
        "pros": "less work at this place",
        "summary": "component design engineer",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many managers, growth prospects aren't very good.",
        "advice": "Get rid of middle managers and concentrate on a few products.",
        "pros": "Work life balance, good pay, sabbatical",
        "summary": "Component design engineer",
        "role": "Anonymous Employee",
        "date": "May 13, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Hard to move up, upper peers don't move on or up.",
        "advice": "You build trust by not firing peers every year and replace with young college graduates that we have to train to replace our jobs so you fire us next year.",
        "pros": "Get a paycheck. Building has effective air conditioning.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "May 18, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "management makes it difficult for engineers to get promotedyearly raises are very low, and don't match inflation rates",
        "advice": "help employees get promoted through coachinghelp employees develop their careers",
        "pros": "opportunity to work on leading edge projectsopportunity to work with diverse groups across the company",
        "summary": "Engineer",
        "role": "Component Design Engineer",
        "date": "May 26, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The experience you have will vary significantly with the area where you work. If you work in the technology area, TMG, you are likely to have a position which is geared to recent college graduates, where your work is highly specified and very controlled. After a few years, this will get old and you won't like it. The Copy Exactly model for process transfer is stunning in its success - however, it crushes any creativi… ty and teaches you to do as you are told.",
        "advice": "Intel's management is currently suffering from an entire generation who has no work experience with other companies, and thus has a very narrow perspective on leadership. There is a LOT of management and not a lot of leadership.",
        "pros": "Intel is the technology leader in the semiconductor industry. As a recent graduate, you will get a ton of training and be well prepared on how to solve key industry issues.",
        "summary": "Mixed bag",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Go see the movie Office Space, it's like that",
        "advice": null,
        "pros": "Health benefits, flexible hours, low expectations",
        "summary": "Real life Office Space",
        "role": "Anonymous Employee",
        "date": "Jun 3, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Salary: slow vertical climb.Performance management deliberately used to foster high-performance dog-eat-dog competitive survival environment and ethic.Management follows an unspoken template to foster paranoia and competition, and eventual distrust between peers.Workers are used at the expense of health and life, and then disposed when their usefulness has run its course.Workers are constantly subtly … faced with the threat of job loss.The ability to politically maneuver the navigation of one's career is key.Meritocracy is secondary to conniving astuteness.Clear delineation between management and workers.The promotion of work-life balance is a facade.The employment of integrity boils down to money. Integrity has no place in the human context.Any plan to work for Intel only for one's whole life span will eventually limit their career and notion of ethics.Working for Intel is worth the experience to understand life.",
        "advice": null,
        "pros": "Benefits, opportunity to work on technology.",
        "summary": "Dog-Eat-Dog",
        "role": "Engineer",
        "date": "Jun 4, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Every group is a political silo. Many teams are working on similar products with competing technologies. Project management is non-existent and there is very little ownership over decisions.",
        "advice": "Provide leadership, vision, and accountability. Create a culture of collaboration. Everyone should be held accountable.",
        "pros": "Intel had great benefits and is a very stable environment. Despite the semi-annual reorgs, layoffs are few and far between. You get a free piece of fruit everyday.",
        "summary": "Political Silos",
        "role": "Anonymous Employee",
        "date": "Jun 9, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management reduces head count, but cannot decide what work can be eliminated and you get no new tools to do the work. They do not value people who have worked at the company for a long time or are getting older.",
        "advice": "Really learn to change your paradigm, embrace new tools that are available to become more effective. Don't rely on spreadsheets for everything.",
        "pros": "Met many great people from all over the world. Most people are nice and easy to work with. On-site recreational facilities.",
        "summary": "Technical Project / Program Manager",
        "role": "Project Manager",
        "date": "Jun 13, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Management does not have a clue how to manage people. Most managers were promoted for doing a great technical job, but are not people persons.",
        "advice": "Get managers than know how to manage people. Most managers were promoted for doing a great technical job, but are not people persons.",
        "pros": "Free fruit and drinks for employees. The company is very safety orientated, with a very safe environment. The company also overs goo pay and benefits.",
        "summary": "Process engineer",
        "role": "Process Engineer",
        "date": "Jun 22, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Many - no career growth for women, minority representation at higher levels.Faulty focal performance review processRisk taking is not honored positively and constructively",
        "advice": "1. Value employees and their contributions than stockholders and top management/MCM.2. Stop paying over half a million per year for white elephant Principal engineers/Senior principal engineers:There are some exceptionally talented PEs/Sr PEs in the company but they are unfortunately very handful who do meaningful work, are down to earth, have high integrity and provide path breaking guidance to Company/indus… try (by technical contributions) and to technical career aspirants within the company. Most are or have become arrogant and full of attitude and earning big cash and RSUs for only ranting and treating rest of the fellow employees as second class citizen.",
        "pros": "Good benefitsGood work life balance depending upon team/manager and job function",
        "summary": "Intel Review",
        "role": "Design Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Terrible management and little room for growth",
        "advice": "Hire fewer PhDs and more tehnicians",
        "pros": "Good Salary and benefitsThat's about it",
        "summary": "Process Engineer",
        "role": "Anonymous Employee",
        "date": "Jul 6, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "often overworked yet underutilized. You may be smarter than your managing hierarchy. a lot of politics make it difficult to get work done",
        "advice": "start listening and caring to the RCG's... they are the future of the company. why is there not one executive under the age of 30?",
        "pros": "There are many great reasons including benefits, smart people, and salary.. that is if you end up in a group and job that is mundane.",
        "summary": "Research",
        "role": "Research Scientist",
        "date": "Jul 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "BK initiated a blacklist for 1000+ employees in June of 2015.Surprised, shocked, disheartened. For a company earning billions in Net Profits even despite the constant cry-wolf of \"we need to tighten our belts, we're in trouble, we need to deliver more 'value' to 'shareholders' (who I feel are just an artificial and convenient proxy for \"I want to do something tough but I don't want to accept responsibility fo… r it, so I'll blame a crowd of nameless, impossible-to-identify people who probably aren't even rattling the cage any harder than any other company\").It made me sick of the corporate doublespeak and feeling of being treated like cattle who (as long as you don't speak the truth in front of them) will never actually understand what's going on around them until the bolt crosses their skull directly.Hearing all the individual stories from colleagues (of people hit by this death-by-spreadsheet action) makes me glad I'm no longer part of Intel - decided to move after years of ignoring my own gut sense that Intel has terminal cancer and will never shake off its 40 years of fossilized \"culture\" (which is just a polite way of saying \"habit\" and \"bullying\" in one palatable syllable) and may never turn into an organization that values risk-taking, actions-over-ass-covering and investing in the long-term of its people resources.",
        "advice": "Admit you're focusing the company on silicon to the exclusion of all else, or get out of the factory mindset and spend more time learning how to run the non-silicon parts of the business.",
        "pros": "Still surrounded by a shrinking proportion of smart people making new stuff (sometimes enduring, sometimes doomed).",
        "summary": "CEO shows true colors, manages employees like factory machines",
        "role": "Product",
        "date": "Jul 9, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Bad groups, someone does nothing but gets promotion. They creates sub-group like \"mafia\" ti cover to each other",
        "advice": "Carefully consider the quality and quantity of group members, try to avoid \"mafia\" sub-groups",
        "pros": "It's a great place to work, good salary, benefits, bonus and compensation",
        "summary": "Engineer",
        "role": "Senior Product Development Engineer",
        "date": "Jul 21, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too much bureaucracy and no concern for software quality; constantly having to fight others to get the right things done.",
        "advice": "First-level management needs to understand how to write software better so they can better manage and reward their engineers properly (and remove the low performers, not accepting poor quality work).",
        "pros": "Salary and bonuses are decent; the four-week sabbatical benefit after 4 years is also nice. There's a lot of flexibility given to the engineers (at least in some groups).",
        "summary": "Too Bureaucratic",
        "role": "Graphics Software Engineer",
        "date": "Jul 24, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Intel uses temps to avoid permanent hires",
        "advice": "Hire people! Having to train a new temp every 18 months is a ridiculous waste of time and resources",
        "pros": "Great pay and benefits but no chance for advancement unless you are an attorney",
        "summary": "Legal assistant",
        "role": "Legal Assistant",
        "date": "Jul 27, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "There is a widespread practice of favoritism and the company is in the process of laying off older workers and hiring more RCGs ( recent collage grads).HR mostly is on the side of management.It has become more of a social environment than a proper business place.",
        "advice": "Need to hire proper managers who know how to manage people and not force tech leads into becoming managers who have many personal issues.",
        "pros": "used to have great benefits, but are dwindling now due to revenue issues.",
        "summary": "Intel, not what it used to be",
        "role": "Anonymous Employee",
        "date": "Jul 27, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I formed a very low opinion of higher / senior level management. Within the company, they essentially encourage what a good friend of mine called a \"clan war\". I happen to work in MCG (mobile communication group) that throughout my time (3.5 year) was reorganized 6 times(!). Many times the multi-month work of whole department (not only my team) was thrashed, because some new boss would come and \"not favor\" your team … and whatever result was done to that date.Global cross-team coordination effort was very low to non-existent. Teams would \"fight\" for resources, and have a quite unhealthy competition. Decision would be made with some irrelevant considerations, and forced down to my team.As result, the culture actually experienced would not be really engaging.The performance review process is essentially botched. Some much higher management essentially issues a quota on number of good performance ratings to your team. Then, you end up in a situation when no matter how much you tried, you'd be stuck at your performance grade, because no good rating can be made available to you (again despite the acknowledgement of high level of contribution and such). Example: our team received only one EE (exceeds expectations) rating, and my manager decided to use it to promote one particular employee (citing his family situation (he had a new child, etc), and his current lower grade). Others were given S (satisfactory) rating",
        "advice": "fire most of senior management as incapable",
        "pros": "Pay is generally very good, 2 extra bonus programs, especially if you're in higher grade.You may get to travel to different GEOs - our team had collaborating divisions all over the world (Finland, Israel, Netherlands, S.Korea, Taiwan). Good opportunity to see places. I traveled 2-3 times a year being in an engineering role.Some good positive aspects of the culture - Intel has a \"work-week\" (WW) based schedule…  (simpler to learn and more efficient), it at least declares a lot of good intentions (but in practice you may find a different picture), all kind of training is available to employees (a lot of mandatory programs).Intel has plenty of relationships in the industry. My team ended up facing customers in \"deep technical dive\" support programs, I got to work with all big industry names: Samsung, Asus, HP, Dell, Sharp, Sony, to name a few.",
        "summary": "Your experience will vary depending on factors you don't control",
        "role": "Software Engineer",
        "date": "Jul 28, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "if you are in TD group, you will not get any of them",
        "advice": null,
        "pros": "a big company with many benefits",
        "summary": "ok",
        "role": "Anonymous Employee",
        "date": "Jul 28, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too much of red tapism",
        "advice": "Keep key technology focus, success will follow.",
        "pros": "Several new technologies you get to play with.",
        "summary": "Platform Architect",
        "role": "Platform Architect",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Horrible management. No communication. No loyalty to long time employees. Horrible hiring practices. Care more about making money than making their employees happy, at least on the manufacturing side.",
        "advice": "Intel used to feel like a family. New management practices have killed that feeling. Now it's all clinical, which is understandable from a business standpoint, but the people are what made the company what it is. The new practices will definitely generate more dollars right now, but innovation will die out when people aren't happy to come to work anymore. I know that at least half of the manufacturing staff, that I w… as a part of, no longer wants to be a part of Intel, but only stays because of the paycheck. Five years ago, that wasn't the case. I was let go because of one bad review at the wrong time, after all these years, but I'm not bitter. I was relieved to be done with it. I was one of the people only staying for the paycheck. Part of my Intel family is still there, and I hope that things can get back to, or at least close to, the way things were, for their sake.",
        "pros": "Good pay, compressed work week, great benefits, excellent clean room and manufacturing facilities, and job security, for the most part.",
        "summary": "Disowned",
        "role": "Manufacturing Technician",
        "date": "Jul 31, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not leading edge technology anymore, Very bureaucratic.",
        "advice": null,
        "pros": "Work-life balance is set well for every employee.",
        "summary": "Senior Software Engineer/ Team Lead",
        "role": "Senior Software Engineer/Team Lead",
        "date": "Jul 31, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Little work life balanceNot rewarded enough for performance",
        "advice": null,
        "pros": "OK salary and benefitsGood network of people",
        "summary": "Not rewarding",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "micro management, 3 meeting a week, reporting your work 3 times a week to your manager",
        "advice": null,
        "pros": "big company, average pay, some guys work easy there.",
        "summary": "software engineer",
        "role": "Graphics Software Engineer",
        "date": "Aug 3, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Periodic layoffs. Many project cancellations, seems very wasteful.Even with \"Successful\" annual reviews, you can be dismissed and be not eligible for re-hire (based upon stock grant allocation).",
        "advice": "Make Intel a truly Great Place to Work, do not punish successful employees.Place a higher value on quality, rather than time-to-market. Both are important, but do not sacrifice quality to meet deadlines.",
        "pros": "Working with smart people and learning new technologies, good compensation and benefits.Location is great for me, company encourages volunteerism in community.",
        "summary": "Good Bad and Ugly",
        "role": "Anonymous Employee",
        "date": "Aug 3, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "New leadership team has made a number of changes that has shaken employee trust. Working environment remains tenuous.",
        "advice": "Without a strong, committed workforce Intel will struggle to meet its strategic, product and manufacturing commitments. Get back to visibly valuing your people.",
        "pros": "Benefits and pay are very competitive. Sabbatical leave after 4 years.",
        "summary": "Operations Manager",
        "role": "Anonymous Employee",
        "date": "Aug 10, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "outsourced project, need to look out for projects.",
        "advice": "need to offer better incentives",
        "pros": "Intel as a corporation is very good,",
        "summary": "ISV Enabling Manager",
        "role": "ISV Enabling Manager",
        "date": "Aug 11, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Outlook is dim and management is not that adept.",
        "advice": null,
        "pros": "Pays well, good benefits Lots of RCG opportunities",
        "summary": "Platform Applications Engineer",
        "role": "Anonymous Employee",
        "date": "Aug 11, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lots of turn over. Marketing department in chaos. Contact and full time employees roles are blurring and full time staff are devalued. Middle managers suddenly having two assistants who don't do anything, and spending tons of money on contractors that don't have the required skillset.",
        "advice": "stick to your values as a company. They appear to be thrown out the window. Look at the new Marking organization with a fine tooth comb.",
        "pros": "People were great when I arrived. They were all let go and replaced with people that were not great.Work can be rewarding",
        "summary": "People are great, Marketing department is in flux",
        "role": "Anonymous Employee",
        "date": "Aug 11, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Multi-site, multi time zone teams - no work/life balance. Too bureaucratic. Too much emphasis on process and methods vs getting the job done.",
        "advice": "Make teams local. Focus on engineering work, not process / methods / indicators. Way too elaborate infrastructure is waste of headcount, drain on Schedule, Quality and Cost.",
        "pros": "World renowned. Good overall compensation.",
        "summary": "Rating Intel",
        "role": "Process Engineering Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Many long hours are not worth the slightly above average compensation. Working in manufacturing is like being a military family. Moving from place to place so that Intel can minimize expenses and maximize profit. Hours and expectations would be impossible without a stay-at-home spouse.",
        "advice": "Pay factory engineers what they are worth. Why are we paid 10-20% lower than people with the same degree, but no on-call, seed assignment expectations, or frequent 'redeployments'? I should take my Ph.D. somewhere that I don't have to be on call 24x7. As I have MD like expectation, I will expect MD like compensation.",
        "pros": "Many resources available. Average compensation. Work can be challenging and interesting.We perform some state-of-the-art work. Facilities are well kept. Ability to change careers without changing position may be a draw for some.",
        "summary": "Did I make a mistake?",
        "role": "Process Engineer",
        "date": "Aug 12, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Intel is actually losing competitions due to her \"big company disease\". Management are disengaging people with office politics, spending money on silly things, slowing down innovations. The company has been lost in market focus and slow in response.",
        "advice": null,
        "pros": "Yes. Intel has hard-working and intelligent staffs, who are working on cutting-the-edge technologies. Technically, intel is a giant and has a master role in sever and PC market. Intel has huge legacy in the two major market and good reputation.",
        "summary": "Tech giant with big company disease",
        "role": "Hardware Engineer",
        "date": "Aug 13, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Work culture moderate to bad",
        "advice": null,
        "pros": "some opportunities to learn but not much expertise required for the job",
        "summary": "Salary package is low compared to competition",
        "role": "Architect",
        "date": "Aug 13, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Work long hours (~12-14 hrs per day)",
        "advice": null,
        "pros": "Challenging work environment, health benefits, perks",
        "summary": "R&D Engineer",
        "role": "Anonymous Employee",
        "date": "Aug 18, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The company is going through a period of shifting priorities and focus always looking to get into a business that someone else as pioneered.",
        "advice": "Decision making at the high level needs to incorporate planning the foundation on how to achieve the goals in the longer and short term",
        "pros": "Traditionally this has been a stable company. The company has projects working a variety of technical areas so you can change jobs without having to leave the company",
        "summary": "Intel",
        "role": "Systems Administrator",
        "date": "Aug 19, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "While compensation is very good, the reward system works counter to collaboration and instills an up or out culture. A culture where everyone wants to be seen as the decision maker, but no one wants to make the decision for fear if an idea is unsuccessful. Career opportunities are limited to a select few - 5% - and only if you have the right connections or come from the right school.",
        "advice": "Find leadership who can bring back the belief and culture of changing the way the world works.",
        "pros": "Total compensation is very high.",
        "summary": "Intel - lost in politics and the past",
        "role": "Anonymous Employee",
        "date": "Aug 19, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You pay a high personal price for success.",
        "advice": "Not worth the keystrokes. Ones with a soul leave or get let go. But that is the nature of tech now.",
        "pros": "Good benefits. Work with talented people",
        "summary": "ME",
        "role": "Mechanical Engineer",
        "date": "Aug 24, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "there is a tight circle of management that has been there for 30+ years. This encompasses nearly everyone in the top echelon. This style leaves little opportunity to advance or grow at Intel. If you are looking for a \"job\" to pay the bills and that is all then this is the place.",
        "advice": "Break out of your box and get creative. You are not attracting hires with fresh new ideas only people willing to check your boxes and move on.",
        "pros": "Good pay, benefits and freedom to work from home or office.",
        "summary": "Sales",
        "role": "Global Account Manager",
        "date": "Aug 25, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Mid management not capable of identifying and aligning resources to high values projectsGood managers are hard to come by -- some first level managers chosen for diversity not meritNot nimble - too slow, lack of transparency",
        "advice": "Focus on aligning people to high value items.Flatten the organization - too many layers",
        "pros": "Plenty of opportunities to work in various business units to acquire broad spectrum of functional domain knowledgeGreat people to work with depending on the group",
        "summary": "Business Systems Analyst",
        "role": "Anonymous Employee",
        "date": "Sep 5, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lots of busy work if you're a fast worker. Do ever get a bad yearly review, it takes only 1 of those to get fired.",
        "advice": null,
        "pros": "Plenty of areas to work in. Lots of places to work at in the company. Easy work for the amount of pay.",
        "summary": "Great pay for the work load.",
        "role": "Manufacturing Technician",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "New president laid off thousands of older 15-25 year veteran employees within a few years of retirement who were the backbone of Intel's success for many years. Then turns around and opens 3.3K new jobs (according to GlassDoor's count) for new college grads.",
        "advice": "Sr. management is all 20+ year veterans of Intel. That same experience and loyalty still applies to experienced employees at all levels, so don't undermine that loyalty by throwing those people out on the street.",
        "pros": "Was a good company for a long time that took good care of their employees. Good benefits, healthcare, 2 month paid sabbatical every 7 years, etc. Stock options were given as an extra incentive over a 5 year period to convince employees to stay long term, plus extra for promotions.",
        "summary": "Unfair layoffs in July, 3.3K new jobs in Sept?",
        "role": "Senior Engineer",
        "date": "Sep 6, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You don't really get to decide where they put you. If you are unlucky you will get stuck with a group or project that is at a major disadvantage compared to other groups and will consequently be a major burden until the next technology node is reached. There is no work-life balance. Intel owns you 24/7. Vacations are permitted but not without a penalty before or after you leave. Management style is very archaic. Feed… back from any employee in manufacturing is disregarded because the \"if it isn't broken, don't fix it\" philosophy prevails among those in upper management. They pay you 20% more than average but expect 100% more of your time than other companies (80-120 hrs/week is common).",
        "advice": "Fear is only a temporary motivator. It works initially to get people to do what you want but eventually people adapt to the discomfort and will usually end up doing only the minimum of what is required to get you off their back. If you are really interested in increasing productivity you need a better strategy than just working new employees to ruin and then casting them off and/or replacing them when they can't take…  it anymore. So much time gets wasted by you constantly having to replace/train your engineers. This system results three types of engineers: those who are new and don't know anything but are willing to work hard, those who are experienced enough to know how not to work hard and get away with it, and those in the middle who are always on the verge of giving (either quitting or losing their self respect and becoming like every other senior engineer who does only a minimal job).",
        "pros": "There are great engineers to work with, the pay is above average and benefits good. There is also a certain amount of notoriety in the industry for someone working in the technology development part of Intel.",
        "summary": "Luck of the draw",
        "role": "Technology Development Engineer",
        "date": "Sep 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Job security lacking. Taking away resources while expecting higher performance.",
        "advice": "Learn how to value your employees again.",
        "pros": "Good pay and benefits, but these have been reduced over the years",
        "summary": "Very Challenging Place to Work",
        "role": "Technician",
        "date": "Sep 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "If you are new you are nothing. Your previous experience does not mean anything. Huge, impersonal environment.",
        "advice": null,
        "pros": "You get to use new hardware that is in development. Decent food in the cafeteria.",
        "summary": "Cog in the machine",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Intel's long time CEO (Paul Otellini) \"jumped ship\" and the new CEO (Brian Krzanich) has not performed to expectations. Many top managers have left the company and now BK's right hand (Renee James) is also \"jumping ship\". One of Brian's strategy is to let go of experienced middle aged employees (35+) and replaced them with low paid interns and recent college graduates in order to cut costs (He recently fired ~4k empl… oyees who had been with the company for years and said more layoffs will continue). In one of his speeches to Intel Employees, he said that employees are disposable, all that matters is the survival of the corporation, continuity of Moore's Law and the name of the corporation. He has taken away many of employee perks: Work from home day, work life balance, team builder off-site's, etc... The moral of Intel employees is down and there is no job security - Therefore, employees are not performing at their best. Management group is very \"clicky\" - they hire their friends and help them get into Mgmt by giving them top job reviews - but no one dares say anything because even though the feedback says \"confidential\" they are not - and once you get on the bad side of one manager, you are sunk. If you do a job really well and then want to move to a different position, your direct manager has complete control of your carrier development and may keep you on one role for as long as they want. Focal (yearly job reviews) are a joke... they have to be written by the employee in third person because managers are to lazy to write them and no matter how long you spend or how good you have sold yourself, the manager will still give top reviews to their preferred employees. Standard pay raises are between 0 and 3% per year - as of recent, pay raises average about 1%, since the corporation is going through financial stress - a 1% pay raise does not even cover the increase of cost of living.Is it a good place to work? Yes it is - but do not stay on one job for more than a year and be ready to leave after 3 to 5 years. The benefit of working for Intel is mainly to get the experience on your resume - it opens bigger opportunities - better pay - elsewhere.",
        "advice": "Management does not take accountability nor responsibility - The role of a manager is also to look after the best interest of its employees: Opportunities, development, learning experience, career development, etc... - the success of an employee reflects directly on the manager - as well as the failures. Intel Management lacks all that - so do not expect much from your manager, unless you got the job using them and y… ou are in their group of personal friends.",
        "pros": "Large corporation where experience and skills may be attained. Some co-workers are very smart and some of them willing to mentor less skilled co-workers. Access to work across multiple divisions and gain a world of knowledge and experience. If working is your passion - this is the place for you.",
        "summary": "Heading down hill - Lack of leadership and Mgmt",
        "role": "Customer Business Analyst",
        "date": "Sep 8, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lagging strategy and product developmentStruggling to increase shareholder valueSlow moving culture and poor decision making processesNot many opportunities for advancement due to a very \"aged\" work-forcePoor managementPoor resources management",
        "advice": "Re-focus on market driven product development and change decision making processes. Establish hard-core metrics for EVERY team to drive shareholder value. Hire young and talented people and give them the right motivation and element of freedom for creativity.",
        "pros": "Fair payFlexible work-scheduleLarge organizationA lot of different groups and teams if you want to move jobs",
        "summary": "Fair pay and benefits with poor culture and no good opportunities",
        "role": "Business Analyst",
        "date": "Sep 9, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "with this unfair lay-off where the company care more of the stock holder than a loyal employee , with this lay-off they destroy peace and happiness of a arizona family, now unemployee, with kids and mortgage to pay..thanks Intel",
        "advice": null,
        "pros": "Good benefits, stock options",
        "summary": "another unfair lay off july 2015",
        "role": "Process Engineer Tech",
        "date": "Sep 10, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "High stress work environment. Intel used to be a fun place to work. Lots of teamwork and collaboration. Not anymore. Everyone out for themselves.",
        "advice": null,
        "pros": "Good pay and benefits. Ability to work from home.",
        "summary": "Moving on",
        "role": "Anonymous Employee",
        "date": "Sep 15, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The base salary offered is very less from Visual and Parallel Computing group.",
        "advice": null,
        "pros": "Get quarterly profit bonus around $800 per quarter",
        "summary": "Less Salary and Total Compensation",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2015",
        "is_current": true
    }
]