[
    {
        "rating": 1,
        "cons": "They don't actually use the data to make decisions. They make decisions and then manipulate the data to match the decision. There is a lot of unethical data manipulation and way too much politics to make engineering decisions. Managers are not trained very well, and to increase the \"technical\" aspects of employees, people who are poor managers but did well as engineers are promoted. People with PHD's are hired for po… sitions that are also done by college graduates, leading to a question as to why this makes any sense. The reasons for doing things such as these seem more political and to get certain statistics up rather than actually doing the right thing for the factories or its employees. Intel likes to hire people straight out of college so they don't know that the workplace could be better elsewhere and Intel can work them to the bone.",
        "advice": "Clean up the real ethics of the company. People should not have to pull teeth to get real information from so-called partners (eg. HVM vs. Development factories).",
        "pros": "It was nearly impossible to get fired, so very good job security. The benefits are pretty good, and include everything you would expect such as health, dental, vision, including a link to the Mayo clinic for more information. Intel really tried to get employees to be healthy with initiatives to get you to exercise, drink more water, etc. Every campus has an exercise facility, which is nice. There are some managers wh… o are pretty good and actually care about their employees. Intel hires a lot of smart people, so you can feel intellectually stimulated most times. They also reimburse education costs, as long as the degree is towards a job within the company.",
        "summary": "Intel has ethics on the outside, but not when it comes to actual engineering work.",
        "role": "Process Engineer",
        "date": "May 22, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "lower pay and benifit than other competitor",
        "advice": "value the work of the employee",
        "pros": "The location is close to my family",
        "summary": "You have to learn to play politics for career development at Intel",
        "role": "Senior Software Engineer",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Corporate culture in Oregon. Lack or respect shown to employees. Lack of utilization of employees to the level they are capable. Lack of ability to make improvements and change things. Bad management. It's not the high end research place that many are led to believe when starting.",
        "advice": "Learn to treat your employees with respect. Recognize high turnover for the problem that it is. Managers need training on how to be a leader not just technically capable. Managers who cannot treat people with a basic level of descency should be held accountable.",
        "pros": "Benefits and pay, clean work environment, located in good areas to live.",
        "summary": "Be Aware before you start at Intel",
        "role": "Senior Process Engineer",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Insane pressure to meet ridiculous schedules set by incompetent managers. The bathrooms in C7 are too small and smell pretty bad. The new cube configuration is a mess, the walls are so low there is no privacy. Low moral due to long hours and poor T-Comp. Most employees would leave if given a similar job at another company. The stock options are worthless. Sub par employees are made managers because of the people then…  know or of the pictures they have.",
        "advice": "Listen to feedback from employees in the trenches. Follow your own practices, I had the ‘Effective meetings’ class over 8 times and not one meeting followed the class guidelines. I would routinely ask for an agenda for a meeting placed on my calendar but was rarely provided with one.",
        "pros": "Better than being unemployed. Free drinks in the cafe. The people are generally nice. The managment could be more clueless but not by much since they are approching absolute zero.",
        "summary": "Not worth investing your time, build seniority with another company.",
        "role": "Senior Software Engineer",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Most of the interesting engineering work is being done outside the US - China, India, Israel, etc... Continuous pressure to move engineering work outside the US - either Israel expansion or low-cost geo. Polarization between marketing and engineering.",
        "advice": "Intel has decided that it's allegance is to the stockholder at the expense of the US job market and US engineer. The rationalization is that it's selling mostly outside the US, it can't get the engineers it needs in the states, etc. I say this is BS, there are good engineers, but a lot know Intel's policies about the US and they aren't interested. Also, Intel is stuck on improving diversity and URM (under represented…  minorities). So am I - but it's like finding a needle in a haystack. Hiring other than an URM requres high-level management approval with detailed justification. Intel is consistently looking to \"low cost geos\" in order to get 5+ engineers for the price of one (Israel is the exception as it's not considered a low cost geo). At the end of the day the US headcount is decreasing, Israel, China and other places are increasing. My job in the US exists today, but what about tomorrow...",
        "pros": "If you live in Oregon and are an electrical engineer then there are not a lot of options - Intel is the best from a very small selection.",
        "summary": "Uncertain future for US engineers @ Intel",
        "role": "Design Engineering Manager",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "managers whose motto is \"what have you done for me lately\", a management team that thrives on fear & intimidation. I was in a group where both my direct manager and the director were arrogant and headstrong, and it made for some very unpleasant times. My manager expected inordinate amounts of time from me, and not that I'm unwilling to give it for a position I love, but for someone who constantly terrorizes and b… erates you, is it really worth it? I complained to HR about his behavior, and was told my complaints were unfounded. I did some investigating on my own and found that he had been demoted and moved out of a group after mistreating a number of employees.. and then 3 years later, he's up to his same tricks in a different department. If you are thinking of working here, be VERY CAREFUL and ask to talk to former group members to see if you can get the real scoop on your potential new boss.",
        "advice": "let people have a life. Do not expect them to answer email at 3am, do not dismiss ideas because they do not match your own. DO NOT allow bad managers to continue abusing employees after many many many complaints.",
        "pros": "Competitive pay in the local area, LOTS of smart people. There are good places w/in the company, but it totally depends on whom you get as a manager as to whether or not you will be successful.",
        "summary": "Wish I could have the year I spent at Intel back!",
        "role": "Ecosystem Marketing Manager",
        "date": "Jun 12, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1. We are essentially a one product company and we seem to be incapable of succeeding at anything else.2. Our marketing has been hideous since the late 1990's and we have no idea how to fix it.3. Executives are rotated into jobs they have no experience in or ability to succeed at and the company suffers for it.4. The morale is hideous and there are many people like me who pretend to be happy working for t… he company, when we really could care less anymore.5. The SET was a complete disaster. Intel let go of a lot of talented people and kept a lot of sycophants and suckups. Even worse, the good people who remain are still angry at the company.6. There is a marked lack of executive talent in the upper ranks and it's hard to see where our company is headed.7. No recent college graduate in their right mind would pick Intel over places like Google and Yahoo.",
        "advice": "Do a clean sweep of the executive management ranks and bring in fresh talent from the outside with some new ideas and ways of doing things.",
        "pros": "1. We are essentially a monopoly in the processor business.2. If you kiss the right butt at Intel, you can survive anything.",
        "summary": "You probably don't want to work here.",
        "role": "TMG",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Chance for moving up thru the pay grade is very limited. In the group i was in, senior management had no idea what to do with Software Engineers, including my direct manager. We felt like they never understood what we needed to do our job. The chance to move between groups and move up the chain is very limited and hard to do. If you decide to work for Intel, take some time to investigate the group you are going to wo… rk for and what the options are to move up the chain.",
        "advice": "make sure you understand the jobs of your employees and what they need to do those jobs.",
        "pros": "The medical Benefits are decent. The culture tries to push work/life balance, but it is a changing culture.",
        "summary": "Be carefull what group you work for at Intel",
        "role": "Database Administrator",
        "date": "Jun 16, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "sink or swim mentality requires a certain personality. a big company so there are a lot of faces to get to know.",
        "advice": "Cut some of the extraneous work, be more streamlined in processes, decisiveness will help us to not recreate work",
        "pros": "I like my coworkers and the people I work for. Interesting stuff (combined with the mundane tasks that all job has), there is a sense of empowerment and you can take the initiative to make your job what you want to",
        "summary": "Big companies, big challenges, big opportunities",
        "role": "Portfolio Manager",
        "date": "Jun 23, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "uptight meritocracy and culture, long hours, non competitive compensation, flat stock. Performance appraisal process subjective,",
        "advice": "Please start to reward employees with cash upfront in salary vs. backend loaded compensation and flat options",
        "pros": "Great Brand and market leader, fast paced environment, ability to learn new skills",
        "summary": "Upright Meritocracy",
        "role": "Business Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bureaucratic mess... decision-making and matrix-type management often entangled by political agendas and vendettas. Not a place to advance a career. Doesn't match up to the careers available to new college grads or MBA's from top schools say at Google or Wall Street. Often, grads from top schools leave because they realize most of the senior people at Intel are from much lesser backgrounds and don't share the fast-tr… acking mindset and career interest.",
        "advice": "Shape up. You've been a tech giant for 40 years, and yet every venture outside the microprocessor arena has yielded a net operating loss. Do something different. Chips are a commodity now. Nobody (including Wall Street) gives a f*ck. If you need a hint, look at Apple's company history -- oh wait, you probably are still bitter about the fact that Apple was your customer and yet they took you for a spin and left you hi… gh and dry. ha ha ha.",
        "pros": "Hmmm... large company, resume name-recognition, free coffee?",
        "summary": "Intel Corporation -- stay for a resume-padding job, then leave for a real career elsewhere",
        "role": "Senior Process Engineer",
        "date": "Jul 12, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "People are simply meat puppets. \"You own your own employability\" is the excuse for having no management investment in employee development. It's a cold, competitive culture.Only the paranoid survive is taken by many employees to be paranoid about their fellow employees rather than the competition. It's so very big there are pockets of excellence and pockets of crap. It's difficult to know which is which befor… e you sign up.",
        "advice": "Treat the people like they are an asset, not a liability to be minimized.",
        "pros": "If you want to design microprocessors or semiconductor technology, this is the place. The technology is as good as it gets, though it can be difficult to pursue new ideas within the existing bureaucracy. There are advantages to working for a market leader in terms of resources, technology, marketing, etc.",
        "summary": "Not for those who like working with human beings.",
        "role": "Industrial Engineer",
        "date": "Jul 14, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Looooong hours and management doesn't seem to care about employee burnout anymore.",
        "advice": "Worry more about your people and stop promoting women just to satisfy quotas",
        "pros": "Big company so you can hide in the system easy",
        "summary": "Intel, No longer a great place to work.",
        "role": "Engineering Technician",
        "date": "Aug 1, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "HIghly political, highly clanish atmosphere. Engineering competence is necessary to advance; but is not sufficient to advance. You have to know the right people in places. The politics is subtle. If you do the right project, you get the exposure and rewards. But you don't get the right projects. They do politics where your projects are allocated.",
        "advice": "The idea of \"managers should not be technical\" is boomeraging on you and is going to be disastrous in the longer run. You need to pour money back into the employees - to their salary increases, their perks etc. And, need to pay attention to stem the wrot caused by extreme politics in the work place.",
        "pros": "Since they are a monopoly, more likely to be in business and hence your job is less likely to disappear in economically hard times.",
        "summary": "Highly political, fast degrading workplace",
        "role": "Senior Staff Software Engineer",
        "date": "Oct 5, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No accountability for managers. Employee's feedback is almost always ignored. Low paid jobs. Performance review are not fair. People think Intel engineers earn a lot, but that is not the case. Managers deliberately do not hire anyone who could be a threat to their positions in future. Managers find loop-holes in the system. A single manager is suppossed to take care of 10-15 egineers, but they unofficially appoint te… am leads to make their own jobs easy, so they can slack off.",
        "advice": "Stop breeding slackers and stop slacking.",
        "pros": "Top-notch in technology. One Generation Ahead of competition. World famous brand name.",
        "summary": "Good place for fresh graduates, experienced engineers should move out",
        "role": "Senior Component Design Engineer",
        "date": "Oct 7, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They are a machine, they do not value people.",
        "advice": "Understand that your greatest asset is the human capital you have before it is too late.",
        "pros": "In the semiconductor business, it is stable.",
        "summary": "Wake Up before the ship sinks.",
        "role": "Engineering Manager",
        "date": "Oct 15, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "the workload is too heavy",
        "advice": "please give us more money",
        "pros": "the microprocessor project is interesting",
        "summary": "not a good place to work",
        "role": "Senior Software Engineer",
        "date": "Oct 21, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "It's very difficult to plan things ahead [unless when on vacation] for some positions within the company that require having on-call pager at all times. Quite disappointingly, some managers reward their employees not solely based on their performances. Career advancement for the employees is not always be the main focus for some managers. There has been effort recently to improve things in many ways to increase emplo… yee satisfaction rate but it will be quite long ways to go. The stock has been performing poorly in the past few years.",
        "advice": "Please ensure that middle managers understand and listen to their subordinates for constructive critics and fairly reward their employees strictly based on their performance not just based on \"what appears on the surface\".",
        "pros": "It's considered as one of the largest firms in the world with well-known products. The company provides a series of benefits inside and outside work for the employees.",
        "summary": "OK but not the best the firm to work for",
        "role": "Senior Engineer",
        "date": "Jan 7, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "In spite of their stated corporate values, “to be a great place to work’, and other “work life balance” statements, the Intel work culture is very high pressure and demanding. Yes its nice to get a seven week (paid) sabbatical after seven years employment, but most people I knew had developed health problems as a result of the constant pressure, long work days (ave. 50 – 55 hrs/wk) and stress to perform at very high … levels.",
        "advice": "Intel Management needs to take an AR address the many employee surveys collected over the years.",
        "pros": "Intel provides a great opportunity for an individual to travel and see the world in support of their international operations. Also when the chip business is good the bonuses and stock options can be financially rewarding.",
        "summary": "Intel, sucks, the life out of its employees.",
        "role": "IT Security Consultant",
        "date": "Jan 10, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Its a large company and you get lost in the cracks. They make billions in profit every quarter and have cut more programs for the employees than I can count. There pay is not competitive to others in the same industry. The pay is not even competitve between employees. I have the same qualifications and do the exact same job as some of my peers and I am paid 7$ a hour less than my nearest peer. And it has nothing to d… o with my work ethic. I have never recieved anything less than a exceeds expectations on a performance review.",
        "advice": "Find your employees, if you even know who they are.",
        "pros": "I cant think of one reason to want to work for Intel. It used to be a great place to work. The company has changed so much from being worried about its employees to more of how they can make a buck. Moral has never been lower.",
        "summary": "Stay away from Intel",
        "role": "Maintenance Tech",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "REDEPLOYMENT is a living hell. Raises/Salaries get behind market pay because \"can't get good ratings multiple years in a row.\" Cut throat rating system against other employers makes for a hyper competitive environment. Intel IT the victim of constant unreasonable cost cutting. Rating system is unfair -- management knows this but does it anyways. Quotas for reviews are pre-determined managers have to argue for top rat… ings in big meetings against other managers. Ranking (seems to have stopped) but they would numerically order people. Top dogs would get lots of $$, everybody else nothing. NO 401k match. NEVER sign anything if they try to lay you off/fire you -- talk to a lawyer before you waive your right to sue. NEVER sign a bad review.",
        "advice": "Cut another 1000 managers! The Middle/Upper Management cut was the best thing ever done! Redeployment is a living hell just lay people off and get it over with.",
        "pros": "resume builder, looks good after you leave. Stock Purchase plan provides about 12% gain. Profit Sharing plan is actually nice. Big campuses often have gyms, outdoor areas, restaurants.",
        "summary": "Why wait to die Hell on Earth at the local Intel Office or fab is here.",
        "role": "Systems Programmer",
        "date": "Mar 25, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They make promises which are not followed thru. They say your pay and promotions are based on performance but are not. Intel claims they want employes to speak up but when you do you get into trouble with management. They claim to have open door policy but when used you face retribution from management. Worst of all they use age discrimination when it comes to training, pay, and promotions. Go to HR and you are told … keep mouth shut or HR will make sure you get no promotion. They use older people for cheaper labor. Intel seems to know how hard it is for older people to find employment and uses this to it's advantage.",
        "advice": "Make Intel values corporate wide. Make all campuses follow same rules and regulations",
        "pros": "Great benefits. The pay is ok but does not keep up with cost of living. The try to keep employees working.",
        "summary": "Intel's use of older employes rivels Wal-Mart's",
        "role": "Manufacturing Technician",
        "date": "Apr 16, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Managers have no clues what they are doing. No technical and leadership guidance and suggestions. Managers say YES to everything his/her manager says and no judgement at all.",
        "advice": "Time to take the book off the shelf and read it before coming to meetings and give ARs in every possible directions.",
        "pros": "You don't have to explain what your company does in the party. You get to first hand experience newest technology.",
        "summary": "Too many managers...too little knowledge and leadership",
        "role": "Component Design Engineer",
        "date": "Aug 11, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Intel today is not even close to the Intel that I started working for in 1992. Ranking and Rating is a joke especially if your not the managers fave!..and while on the subject of managers, during my last 7 years there I had at least that many managers, however, there wasnt one of them that really knew how to manage, unless being one of the Good Ol Boys qualifes someone to be a manager.But what is most phenomi… nal of all is after someone has worked there for the better part of their life, at some point you become a target and once that happens, its over. I use to wonder why people that had worked there for years, one day, they werent there anymore. No explanation, nothing, just gone...........My advice for folks wanting to work for Intel.............have a plan B.",
        "advice": "Take some lessons from Andy Grove because he actually cared and looked out for the employees and made it a company that I was proud to work for!",
        "pros": "Benefits, Sabbatical/vacation, access to latest technololgy, the people.",
        "summary": "No longer the Intel that I was proud to work for",
        "role": "Anonymous Employee",
        "date": "Jan 27, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Too much politics and silos within a department. Decisions are not made quickly enough causing frustrations within the rank and file employees.",
        "advice": "get rid of all the dinosaurs and bring in younger and more talented employees",
        "pros": "flexible working hours, decent health benefits",
        "summary": "Too much politics, and not enough challenging work",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "extremely high level of org. politics. people care more about who you are connected with than what you do. almost no chance of career advancement. working for intel is like career suicide.",
        "advice": "for heaven's sake, you are on board of google. Take a lesson or two from them and apple. when was the last time your company ever came up with a cool product? You focus too much on cost control, stifling innovation.",
        "pros": "more or less a retirement community. steady job, decent pay, no pressure, no challenges. good for some one not career oriented. Totally non-innovative bureaucratic environment.",
        "summary": "Intel is a career death trap.",
        "role": "Hhh",
        "date": "Feb 25, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "layers of management, fatcats who feel entitled and do not act but just react",
        "advice": "fire the top 10% highly compensated employees and make room for the middle management to amke more current decisions.",
        "pros": "Learning the ropes for an entry level position",
        "summary": "Poor strategy, bad execution",
        "role": "Anonymous Employee",
        "date": "Mar 2, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "A typical manager is competent talking to a power point, with very little understanding of or appreciation for the content. He is a good salesman and a sycophant. He gives little thought to the growth of his direct reports (who usually haven't left the team or the company because they are on Employment Visas or the employment market is bad).If you are looking to gain technical experience/knowledge you will work a… tleast twice as long as the industry on a project, spend twice as much time in irrelevant meetings.If you are looking to grow your career vertically, there is little hiring and most managers have decades to o before retirement, translation: very few management positions in the foreseeable future.If you are looking to broaden your skills (grow horizontally), the hiring managers will not consider your application without \"prior relevant experience\", translation: most groups operate as silos.If you are looking to grow your income, follow the stock price INTC (a good portion of the compensation) the last decade (Jan 3rd 2000 to Jan 4th 2010) the stock has fallen more than 50%. The average annual raise in salary in the US has ranged from 0% to 6% during the same period.",
        "advice": "If Intel wants to remain an attractive employer to the Gen Zs, the status quo has to change. To retain employees when the income grows less than inflation and vertical growth is uncommon, the management has to put in place practices that enable horizontal movement of the workforce.",
        "pros": "Intel's competitive advantage is its ability to deploy a manufacturing technology quickly and in the largest scale possible. Intel's manufacturing technology is cutting edge, but only in commercial deployment. The cutting edge technology is developed not in big corporations but in academia and start ups.If you are fresh out of college, start your career at Intel to learn about the industry, tools, and commercial … technology (usually at the beginning of its decline). Leave no later than 2 years, start your own company or join a start up (you will make more for the hours you put in).",
        "summary": "NOT a place to grow your career or income.",
        "role": "Hardware Engineer",
        "date": "Mar 7, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Innovation is suppressed and resisted; the \"copy exactly\" philosophy applies to almost all engineering work. The organizations are suspicious of one another and do not collaborate. Intel management cultivates a blame-oriented culture. Political battles can destroy the career of even a low level engineer. Hostility toward female engineers is accepted; especially those that introduce new ideas and change. Lower level m… anagers do not act when a female is targetted by sexist treatment. Vulgar, demeaning comments and vicious, unfair criticism during presentations in large meetings are tolerated, and even participated in by managers. If a complaint is lodged, HR completely supports management without doing a proper investigation. Co-workers are allowed to review each other, and a good, productive engineer can have their future compromised by jealous co-workers.",
        "advice": "Investigate the circumstances of the departure of talented engineers. Remove low level managers who are known for driving away good people.",
        "pros": "Intel is a very large corporation, and even if your division is eliminated, it would probably be possible to find another position within the company if desired.It is possible to work from home when necessary.",
        "summary": "Intel admits to losing female engineers at a high rate, but won't address hostile work environment issues",
        "role": "Senior Quality Engineer",
        "date": "Jun 19, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- very unrewarding- management do not value work- less bonus compared to amount of work- less profit sharing compared to amount of work",
        "advice": "cut some slack for the engineers",
        "pros": "- big company- security- good health bnifit",
        "summary": "job sucks",
        "role": "Senior Component Design Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No social life. 24/7 work with no break. Compensation looks good but when divided by the work hours, it is less than minimum wage. Most management from engineering positions so they know nothing about human relations. Pushing rather than motivating by management! Mostly, new PhD level grads are hired to make sure they don't have previous experience to compare it with so that people think this 24/7 killing environment…  is \"normal\"! Another reason for PhD level grads to be hired is that fact that most new grads are international and if they don't get/keep the job, they cannot stay in the country: It is used very well at Intel.",
        "advice": "Learn to manage. Motivate; do not push!",
        "pros": "Good benefits. As long as you work out of the fab, it is a great place to work. Vault card!",
        "summary": "No life-work balance! Let me rephrase: No life, all work!",
        "role": "Process Engineer",
        "date": "Aug 22, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No upward mobility opportunities, no risk taking from management regarding allowing someone to move into an upward position; instead they hire from outside even though that person is not as qualified. This tends to send a bad message to existing employees.",
        "advice": "Management should focus on employee promotions and its current human capital as appropriate. Having outsiders fill positions of upper managment sends a bad message to its current workforce.",
        "pros": "Intel's name carries weight both nationally and internationally. It is a good place to have on your resume and might open doors to other potential employers.",
        "summary": "Upward mobility in Legal: 0",
        "role": "Senior Attorney",
        "date": "Aug 31, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "some people sabotage others work, there is zero accountability, there are way too many meetings, apparently the intel process is to document your work so you will be easily replaced because the management does not have a clue technically what is going on",
        "advice": "get a clue technically what is going on, eliminate all documentation go back to the original days of accomplishing wonderful stuff before documenting it, your 360 review plan is idiotic, your 10-10 plan sucks, BTW the 10-10 plan failed at ibm and elsewhere",
        "pros": "most people are energetic, friendly",
        "summary": "validation sucks",
        "role": "Validation Engineer",
        "date": "Oct 14, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Getting set up to work in the Intel environment is very time consuming because of overly bureaucratic restrictions needing oodles of permissions to access even the most basic information needed to perform your work. Access to documents and tools particularly difficult for contractors, with minimal help from company employees, for very complex systems and tools filled with undefined Intel specific acronyms and jargon.…  Yet contractors are expected to perform useful work almost immediately despite the enormous information vacuum in which they are placed. Don't be surprised if you are summarily canned without warning because an impatient manager thinks you should be able to skip the learning curve that always applies to working with new technologies and systems.",
        "advice": "Don't expect new employees or contractors to be superhuman clairvoyants.",
        "pros": "Pay is above average, at least for contractors. Ability to work on leading technologies.",
        "summary": "Capricious treatment of contractors due to impatient management with unrealistic expectations",
        "role": "Senior Software Engineer",
        "date": "Dec 1, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Intense pressure- some people die at work due to the intense stress/pressure. Several people develop severe health complications due to stress.No career growth opportunities.No recognition.Use and throw attitude by management (towards employees).Incompetent and unreliable management.",
        "advice": "Senior management doesn't have a clue about today's market opportunities. The entire company wants to thrive on Andy's (Grove) legacy rather than innovate and build something new.",
        "pros": "Lot of learning opportunitiesSome flexibility at work.Ability to expand your knowledge in various technical and management fields.Since Intel has a decent reputation good for RCG's to start their career.",
        "summary": "There are better places to work",
        "role": "Anonymous Employee",
        "date": "Dec 24, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Terrible culture, terrible management, terrible offices and location, terrible mobility, and terrible salary.",
        "advice": "Re-vamp the entire culture. Improve feedback system.",
        "pros": "There are some merits to working for a big corporation such as Intel. The benefits are nice.",
        "summary": "Terrible, terrible, terrible place to work.",
        "role": "Financial Analyst",
        "date": "Feb 9, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "absolutely no work-life balance. 24/7 job and no appreciation to hard work. People are very secretive in exchanging information and that kills productivity and add lot of stress. Very unhealthy work environment.",
        "advice": "try to retain staff. there is lot of attrition at intel.",
        "pros": "compensation is the best in semiconductor industry.... for process engineer roles",
        "summary": "very dissatisfied",
        "role": "Process Engineer",
        "date": "Apr 4, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Intel doesn't have a hierarchy like I guess most companies in silicon valley. Everyone is in a cubicle to show \"equality\". However, the fact that there's no hierarchy means that you can easily become your boss's boss, if you are smarter and ruthless. Their incentive system is based on smartness, period, but it generates intense competition that people are not free to share their work with you, so that you dont get ah… ead of them. Also, the managers I worked with were not forthcoming. They lied, hid to cover their behind. It wasn't a good experience for me, but it taught me that I'd never want to work for them again",
        "advice": "Just try to be a good, ethical person",
        "pros": "Recognized leader world wide, has some of the best and brightest employees working there",
        "summary": "Extremely stressful, competitive, shady management",
        "role": "Intern",
        "date": "Jul 21, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Intel is a very high-pressure workplace. They cultivate what they refer to as a \"sense of urgency\", which translates into expecting everyone to do the work of two people. If you're a Type-A hyperactive overachiever ADD anal-retentive overbearing control-freak workaholic who doesn't mind essentially turning your life over to the company, you'll do fine. If you aren't, you won't. It's a huge company, and the bureaucrac… y is absolutely ponderous. Everything is all about rigidly defined procedures, and yet it's extremely difficult to make decisions because nobody wants to take responsibility. If you have a good manager there, life is tolerable; if not, it's hell on earth. It has a reputation as a sweatshop, and it's well-deserved.",
        "advice": null,
        "pros": "Pay is good but not great. Benefits are excellent. Bonuses are excellent. Many perks available for employees of such a large company.",
        "summary": "Like working inside the world's largest Dilbert comic strip.",
        "role": "Senior Verification Engineer",
        "date": "Aug 1, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very strong bias against women engineers. Women are leaving the company in huge numbers. Almost no women in high visibility technical roles. I know women with PhD’s that have spent 15-20 years with the company advancing only 1-2 grade levels. When these issues are brought to the attention of managers ( man), their immediate response is that only incompetent women are raising these concerns. HR is not doing anything t… o address it (except talking).",
        "advice": "The company will benefit from diversity. Do something about it.",
        "pros": "Good technical challengesWork on new technology",
        "summary": "Discouraging",
        "role": "Senior Staff Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "overall compensation is low, SPP is too low.",
        "advice": "stop forgetting your employees and focusing only on customers",
        "pros": "nice people , good technology and nice recognition program -",
        "summary": "they can do better",
        "role": "Product Marketing Manager",
        "date": "Mar 12, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "no place to grow stuck in organization",
        "advice": null,
        "pros": "Job safety, people work as it is their grandfathers company",
        "summary": "Dissatisfied",
        "role": "Component Design Engineer",
        "date": "Apr 11, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I'm posting this review to help new Ph.D job seekers avoid the situation I found after I joined Intel as a process engineer. First, most of what they tell you at the job interview is incorrect. Anyone receiving a completely honest picture of the job would likely turn it down, so a lot of sugar coating occurs.After you show up, things change. 24x7 on call for months on end. Boring repetitive work. Insulting an… d downright rude management. What's not to like?You'll also find that those skills you fought so hard for in graduate school aren't even required and someone with much less schooling could do exactly the same thing. Most of the work involves tracking, copying and pasting. These are low level engineering jobs, but internal policy requires that they be filled with recent graduates holding advanced degrees. Many people leave after a year or two, and Intel considers this to be the cost of doing business. The general attitude is \"shut up and get back to work or get out.\"People in the software side of the business seem to be genuinely happy and well treated. Its a large company and great places to work do exist. Just stay away from the manufacturing and process development work.",
        "advice": "\"Great place to work\" is a wonderful slogan. Putting posters up on the wall does not make it true.",
        "pros": "Benefits are equivalent or better to what you'd find somewhere else and the cost of living is lower.",
        "summary": "Stay away from manufacturing",
        "role": "Senior Process Engineer",
        "date": "Apr 28, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very tough cultureContinue to lay work on employees, stretching beyond limitsSignificant opportunity for burn outBiased review process",
        "advice": null,
        "pros": "Smart peopleAbility to work from homeAbility to design own career pathCompetitive salary and benefitsExciting product lines",
        "summary": "Tough Culture",
        "role": "Senior Finance Analyst",
        "date": "May 3, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Terrible work/life balance, little recognition for hard work and accomplishments, no upwards career path in a very flat organization, overly aggressive culture, poor management",
        "advice": null,
        "pros": "Surrounded by smart people, fast paced environment, close to the heart of the company, high compensation package for the area",
        "summary": "not sustainable for long term",
        "role": "Senior Process Engineer",
        "date": "Aug 26, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "It's like high school - groups are in cliques - the \"Indian\" clique, the \"Asian\" clique, the \"American\" clique - the Women at Intel \"clique\" - they even eat at different lunch tables like high school and thereare even unwritten social interaction rules that no one will ever admit to. Predatory managers out to make their quarterly targets no matter what admit they have no \"interpersonal skills\" no time for that so… ftskill stuff - it shows in the culture - rude, mean, uncivilized - not progressive at all.",
        "advice": "Open your eyes - your culture needs major overhaul. Warren Buffet just pulled all his cash out - take notice. Make some changes quickly - from the top down - get rid of your \"retired in cube\" life'rs they're a real buzz kill for excited new graduates",
        "pros": "Hiring quotas in effect for women and minorities now so women can now get hired easier",
        "summary": "Not good at all - predatory environment very resistant to change",
        "role": "Engineer",
        "date": "Oct 11, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Projects are too often cancelled. Workers are not valued. Comany lacks a good direction",
        "advice": null,
        "pros": "The bonuses are nice. Eight week paid sabbaticals every 7 years",
        "summary": "Not the company it once was",
        "role": "Staff Design Engineer",
        "date": "Oct 17, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Beuracracy is incredible, The merit review and annual review system is horribly broken. You will every year be expected to not just do your job but much much more than you are paid for. Internal advancment is heavily weighted against the current employee.",
        "advice": "Walk the talk is the simplest statement",
        "pros": "A tremendous diverse work environment. There are intelegent helpful people all over the company if you want to learn something you will find someone that is willing to teach you.",
        "summary": "We pay you for that we own you",
        "role": "Senior Equipment Tech",
        "date": "Feb 11, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor employee morale.Very poor working environment / atmosphere.Very poor time management with employees (perhaps due to workloads) resulting in VERY common ('the norm') behaviour such as not to show up to pre-arranged meetings.Blame culture, particularly applied to Suppliers.Very common to find unapproachable, 'hot-headed' and unprofessional staff who think that hard nosed / kick-ass attitudes a… re the only way to get results from Suppliers.",
        "advice": "Review your hiring policies / practices.Spend some time and money finding true route causes for: lack of motivation, blame culture. Aim for a semi-pleasant work environment (at least).Don't think that due to the companies size that you will have an indispensable supply of Vendors who will choose to work for you when market conditions change",
        "pros": "Interesting advanced engineering systems / installations",
        "summary": "Facilities / Construction / Engineering - Experience of U.S.A & international sites",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "slave driver - you literally end up working 60-80 hours a week. Middle management is terrible. A lot of politics.",
        "advice": null,
        "pros": "you get to work with intelligent people, among some of the smartest engineers in the world. Though the middle management is very poor.",
        "summary": "Engineering, Marketing Experience",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Tech leaders are very territorial and exclusionaryRed tape and cronyism stifles patents and innovationLots of committees routinely slow down ideas and initiativesMiddle management is all about status-quo, rewards those who don't rock the boatBad behaviors go unpunished",
        "advice": "Make processes transparent. Get rid of an excess of \"need to know basis\"Apply feedback from lower rungs in annual reviews of higher rungsFoster innovation by removing hurdles to new ideas.Intel needs energy, optimism, and much less random paranoia",
        "pros": "Reactive mindsetMicromanagement is not commonDecent payOpportunity to learn",
        "summary": "regretting being here",
        "role": "Anonymous Employee",
        "date": "May 11, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Compartmentalize employee. Arrogance, Type of work very bad. \"PHD Technician or PHD = Technician\"Upper management.",
        "advice": null,
        "pros": "Salary, stable, new carpet and paint.",
        "summary": "Process Engineer",
        "role": "Anonymous Employee",
        "date": "May 12, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Long hours (60+ in a good week)Salary (could be better for the long hours)Managers (most don't care about employee overworked, some are very bullies)Lack of respect (from managers to engineers, it comes down from the top thought)",
        "advice": "The new CEO should fix the R&D enviroment, too many bullies, too many overworked employees.",
        "pros": "R&D is quite fast and great for fast learning.Very smart people.",
        "summary": "Senior Process Engineer",
        "role": "Anonymous Employee",
        "date": "May 18, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "ESPP went from 10% salary to 5% salarybonuses were at industry median.. now going downfocals/raises are a joke.. recent averages : 1%, 2%, 1%.. expect to be at or below average if you dont know how to play politics and can't kiss your manager's ***",
        "advice": "no need to give advice, they can't/won't do anything..",
        "pros": "#1 semiconductor companycomparatively longer project durations hence somewhat relaxed work environmentstable job if you work in big groupmostly good work-life balance unless you don't get along with your manager",
        "summary": "good employer if you just want a stable job at a much lower salary",
        "role": "Component Design Engineer",
        "date": "May 27, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Big. Dumb. Slow. Stupid. Old. It turned out to be just like all the other big megalopolis engineering companies. Disappointed to see the total lack of innovative thinking. Horrible, horrible, horrible, horrible, horrible management. Surprisingly more of a traditional corporate culture than a innovative \"techie\" culture. Heed my warning and stay way. If you can go work somewhere else then please by all means do so.",
        "advice": "Grow up.",
        "pros": "Salary is ok. Work locations were great. So-so salad bars in the cafeterias. Good on campus perks: health clinic, spa... Good social atmosphere.",
        "summary": "Run...it's a trap!!! It sounds like a dream job but it's NOT!!!!",
        "role": "Software Engineer",
        "date": "Jun 30, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Micromanaged, too many middle managers, poor morale, sweat shop but they tell you it isn't, try to manipulate people's lifestyles...once you get into an organization they do not let you out unless medically required. Require you to \"flex\" your hours instead of paying overtime on days off for cost savings.",
        "advice": "Get rid of 80% middle layers of management.",
        "pros": "Pay is better than it first appears.",
        "summary": "Not my preferred place to work",
        "role": "Manufacturing Technician",
        "date": "Jul 18, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Green Badges \"Temps\" or \"Contingent Workers\" are shut out of any and all Intel parties/programs/events. As a veteran I tried to attend their veteran event and was turned away because my badge wasn't blue. The Actual workers for Intel \"Blue Badges\" talk down on green badges. EXTREMELY one sided racial ratio. Nobody speaks English unless they have to. Very poor security, people walk out with items in their purse/luggag… e all the time.",
        "advice": "Hire people who can actually speak and read English fluently.",
        "pros": "Clean, Certain techs do very good work.",
        "summary": "Not a great company to work at.",
        "role": "Validation Technician",
        "date": "Jul 18, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Extremely poor work life balance. To max. the profits squeeze the entry level engineers. Managers want 24 X 7 coverage from same employee. The only way you get leave is if you are sick/ burnout / take leave. Frequent on call coverage. wokring on late wekenights/ weekends. Beginners beware and stay away. you have been warned. Gullible international graduate stundets are ready to take up any job after graduating and ar… e the largest demography in this job role. Even though you are hired for shift 1 (40 hours per week) but it is onlky on paper. In reality it will be minimum 60 hours...and beyond since you are hired as an exempt and your hours dont.. count..You OWN the tool and Intel OWNS you . work permeates every aspect of your life...Process engineers are considered expendable assets since if one leaves there are hundreds in line to replace..huge attrition rate in the fab roles. There is no uniform structure or system for training. most of the training is on the run. Money can be a driving factor only for so long. No proper feedback.",
        "advice": "Completely insensitive. Since many managers went through the same hell...they dont care.",
        "pros": "Challenging and interesting work on cutting edge tools and technologies.",
        "summary": "Slave labor conditions: MUST Read",
        "role": "Process Engineer",
        "date": "Jul 19, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "This is a review of the Westpark in Redmond, WA location. The area where I worked was extremely unorganized, being run by an employee that has no regard for the process of finding/fixing issues. There are no processes or procedures in place so it's a shoot-by-your-hip stressful environment. Employees were unfriendly and unwilling to help and often gave the impression that everyone who works there hates their job. Bac… kstabbing and micromanaging is a consistent problem there as well. Also this place is not 'woman' friendly.",
        "advice": "Look closely at who you hired to run your most current projetct and put some procedures into place so there is a reference to how things should be.",
        "pros": "Free fruit and vitamin water.",
        "summary": "Worst experience working in the Tech Field",
        "role": "Anonymous Employee",
        "date": "Jul 22, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Long hours, one screw up ruins your whole career, way too many type A personalities, very political environment. Managers worried only about climbing the ladder and how their next review will look.",
        "advice": "Stop being so over reactive to every little thing. Stop paying so much attention to what degree an employee has and start letting those with talent lead.",
        "pros": "Decent benefits, but you will work hard for them.",
        "summary": "There are much better places to work.",
        "role": "Operations Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Youre just a number not a person",
        "advice": "Know your people",
        "pros": "Great pay and people every where",
        "summary": "Worst Job Ever",
        "role": "Anonymous Employee",
        "date": "Aug 8, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Review period is useless and you only get a 1% raise year over year, even though cost of living is ~3% every year. Little room for promotion. They are very wishy washy. Some groups will pay for your MBA without question, and some groups won't even pay for your flight to an important conference. The workforce is very old and still stuck in the old way of thinking. Morale is very low and useful programs and projects ge… t squashed by management and other projects that will have no impact get put into place instead.",
        "advice": "Stop being selfish. Let your employees be creative and create solutions that will actually work and not solutions from 6 years ago.",
        "pros": "You get to meet new people.",
        "summary": "Big Slow Company",
        "role": "Project Manager",
        "date": "Aug 21, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Extremely higher than normal pressure, no recognition for performance and always being treated poorly",
        "advice": null,
        "pros": "Good benefitsI can't think of any thing that is positive about the company. They highly discriminate against their people.",
        "summary": "As a Senior Thermal Validation Engineer I created embedded tests for the ATOM processor.",
        "role": "Senior Thermal Validation Engineer",
        "date": "Sep 1, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Terrible for your long term career. Pigeon hole into one element. Cultures terrible. Very political.",
        "advice": "None.",
        "pros": "Big Company with good salary and benefitsFree Coffee and Fruits",
        "summary": "Mobile Communications Engineering Roles",
        "role": "Engineer",
        "date": "Sep 7, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Once great innovative company has torpedoed its workplace, employees spend their days scrounging work spaces. No one has their own desk and there is a university library style atmosphere silent and stagnant. Management has turned against employees on every front of their work environment and do not listen to staff. I would not work here if you have a choice.",
        "advice": "Treat employees like humans not capital resources.",
        "pros": "Desert location means nice winters.",
        "summary": "Call center type workplace with no respect or consideration for employees.",
        "role": "Engineer",
        "date": "Sep 18, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Archaic old out-of-date Intel one-dimensional thinking culture.Green & Blue badge discrimination thingy is killing the company.Wrong hiring, promotion & staff retention criteria & strategy. Only ppl who follow the system are promoted. Technology, culture & innovation interrupters are cocooned up & pushed aside.Unwillingness to change biz model. Self harrakiri in this open globalized fa… st paced world.Poor raise, promotions, reward & benefits.Too many incompetent & inexperienced managers, red tape, paper work & redundant system.Politically debilitating manoeuvres while real issue remain unresolved.Short-sighted planning.Long working hours. Poor work life balance.Insistence usage of old legacy process, defectivity & metrology tools in the name of copy exact when process capability & windows are no longer robust.Missed out on many marts purely due to ego.Dwindling native mart share, ASP & yield.Going to be eclipsed in cash hoard, mart cap, yield, innovation, mart share & ASP in all segment by Europeans & Asian rivals pretty soon.Rampant over-capacity issues. Idling tools.No longer attract the best talent.Repeated program failures.Slow delivery & rampant delays.Headed the way of Nokia, RIM, HP, Dell & MSFT",
        "advice": "Sack 90% of all managers",
        "pros": "Structured training.That's all I can think of.",
        "summary": "Poorly skilled managers. No longer a knowledge based company",
        "role": "Senior Project Manager",
        "date": "Sep 27, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The environment in Intel is tough. Many companies have training programs for new employees, but training runs counter to Intel's culture. If you are new and trying to figure things out, no one will help you. You are expected to learn everything by yourself. Intel also has a habit of taking H1-B visa students who recently graduated and overworking them as much as possible. If you are a new graduate, do not come to Int… el. There are much better companies.As a process engineer, work/life balance is non-existent. Process Engineers are on-call 24 hours per day, and it is very common to receive phone calls at 3 am. Intel refuses to hire shift engineers. The Rio Rancho plant is also being downsized, and 10% of the work force will be laid off in the fall of 2013.Intel claims that it has a 2 year lead on its competitors, but that's a lie. If Intel had a 2 year lead, why would they need to lay off 10% of their work force in Rio Rancho? If they had a 2 year lead, why are their chip sales 5% lower in 2013 compared to 2012? The reality is that Samsung and TSMC are dominating Intel in the cell phone and tablet markets. Intel has focused too much on laptops and PCs, and they have ignored cell phones and tablets. Now, Intel is 10 years behind in cell phones and tablets, and they refuse to consider new ideas, such as licensing their designs to third parties or making chips that aren't based on x86 architecture.If you are considering working at Intel, pay attention to what is happening right now. Intel does not have a realistic 10 year plan. I would not be surprised if Intel lays off more people within 10 years. Intel is shrinking, not growing. Intel is simply not adapting to changes fast enough, and upper management refuses to consider making changes to Intel's business philosophy.",
        "advice": "If you want to make money in the tablet and cellphone areas, then you need to be flexible. Stop focusing on x86 architecture. Make a completely new low-power processor. Stop trying to make x86 low power; that will never work in the long-term.",
        "pros": "You get to work with a lot of very smart people.",
        "summary": "Not the Intel that it used to be",
        "role": "Process Engineer",
        "date": "Oct 1, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Can't let go of the past....will not embrace change: transition to mobile; reduction of importance of microsoft; realization that they are a distant second in mobile where x86 ISA doesn't matter.",
        "advice": "You need technical competence, and it's severely lacking. Decision are made looking backward, not looking forwards.",
        "pros": "They pay reasonably well; there are some pockets of excellence (but these are few).",
        "summary": "holding on to a dying ecosystem",
        "role": "Principal Engineer",
        "date": "Oct 14, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Corporate environment sucks. My group would meet endlessly and never reach a plan or consensus. Meeting which should have never taken place at all (or could have been conducted in under of an hour) would last endlessly.",
        "advice": "Get involved with your people. Like too many companies you'd offshore your work to satisfy your personal GREED.",
        "pros": "Salary is good. Equipment needs are generally met. Most people working there were OK. The work presented few surprises.",
        "summary": "I often wonder how companies with such poor corporate culture can be so successful. I saw a lot of unhappiness there.",
        "role": "Senior Staff Engineer",
        "date": "Oct 27, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "they are micromanagement nazis, they track every minute. no perks, no free stuff, temps are treated like crap, no chance of being hired full time",
        "advice": "stop tracking every minute for temps, it stirs anger",
        "pros": "good experience. thats it. no other benefits",
        "summary": "Bad place to work for temps",
        "role": "Temp Office Worker",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Projects are huge and tasks are divided into too small making visibility of the whole project or architecture very short sighted. Big pictures are only available to very few. Plus it is cutthroat in getting good tasks or assignments. And then if you are unlucky, have to contend with managers that don't have any respect to the engineers that work for them.",
        "advice": null,
        "pros": "Got opportunity to work and get involve in new or current leading technologies in the computing industry.",
        "summary": "Present opportunities to be part in the forefront of leading technologies in computing industry",
        "role": "Design Component Engineer",
        "date": "Dec 2, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Horrible management, very cliquey, corruptness, no support for employees in time of need. All this is my assessment and opinion but not a great place to work.",
        "advice": "Shape it up and be honest and quit lying to get your way.",
        "pros": "Great benefits, great pay if you are lucky",
        "summary": "Good pay but bad bosses",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Several, nit pickings unable to work like adults more of a school child like environment.",
        "advice": "Start over, clean house and get rid of the backstabbers and dead weights.",
        "pros": "The lunch room where we eat",
        "summary": "Very cold and backstabbing",
        "role": "Database Administrator",
        "date": "Dec 4, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Everything. Such a dysfunctional workplace. No direction is ever provided by senior management. Senior management thinks they are the 'king of the castle' and impose fear and intimidation tactics.",
        "advice": "Stop keeping secrets, provide direction, lead by example, stop being hostile/bullying",
        "pros": "You can put Intel on your resume",
        "summary": "Intel Media is a subsidiary of Intel Corporation. Horrible place to work.",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Everything has a process... one of my peers told me 'Intel is where fun goes to die.' I would add... 'and where creativity goes to die.' A student once told me 'why would I work at Intel- it's just a bunch of type A people pissing on each other all day.' Pretty accurate. The culture actually draws out the absolute the worst type A behaviors in people there but of course, it is accepted since the hope is it also draws…  out the best type A behaviors- long hours, internal competition and confrontation on every little thing",
        "advice": "I am glad you have an engineering CEO again. Get back to metric driven decision making. Dont make it so managers have to break/undo something and put it back together to get a good review. Promote people there with high EQ and humanity so everyone doesnt just feel like some widget in a process. Remove RIsk Taking from your values. You know it iisnt true. Everyone there is absolutely terrified to take any risk in case…  it should fail in any way. The one phrase I heard there most was- fly below the radar and move internally to a new position every year, if possible. Figure out how to reward the good type A behaviors but severely punish the bad type A behaviors",
        "pros": "Everything has a process, Intel University, smart people there who will mentor you, fast-paced and challenging. Used to be a metric driven company",
        "summary": "Good learning, good people, unhealthy environment",
        "role": "Human Resources Manager",
        "date": "Dec 6, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Archaic processes, tools and ways of working. Bloated teams with no decision-makers until 3 org levels up makes it very hard to get anything moving forward. The loudest people get promoted.",
        "advice": "Pick a direction and stay with it. Get rid of the redundant teams and useless middle managers (mostly Indian men). Get rid of the stack ranking system that inhibits any collaboration between teams and team members, and makes people hire less competent employees than themselves for the sake of job security. Make sure anyone in a management position has taken some management and leadership training so they don't have t… o yell so hard all the time.",
        "pros": "Pay and benefits are competitive. Work/life balance in my team is also good since there are no deadlines or other commitments, just reference designs that have no identified customer.",
        "summary": "No clear direction, team charter, roles or responsibilities - one big mess",
        "role": "Senior Designer",
        "date": "Jan 11, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "With the recent policy changes, some departments work over 70hrs/week with little or no recognition. Your success is up to your boss. Friends of the managers are promoted.",
        "advice": "Reward who actually improves and sustains the process. Upper management needs to spend actual time in each department to be aware of what is ACTUALLY going on.",
        "pros": "Great people, good equipment, opportunities to work overseas",
        "summary": "Your success at intel depends on your boss...almost entirely",
        "role": "Process Engineer",
        "date": "Jan 13, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Mis-managed projects and process heavy",
        "advice": null,
        "pros": "Good pay and good benefits",
        "summary": "Not a place to progress ur career",
        "role": "Anonymous Employee",
        "date": "Feb 28, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "know nothing else. whole company is ruled by ethnographers, and the company still does not have a clue what end user ex or end to end solutions mean, lack of meritocracy, offers me too things often too late",
        "advice": "stop fighting fires and spend more time planning, know what is really happening in your org, make culture more inclusive, people exploit their relationships/culture to ensure others are not heard, half hour 1:1 culture sucks, people keep jumping from one meeting to next w/o knowing he issues",
        "pros": "flexibility, seasoned mgmt as far as moors law is concerned",
        "summary": "Intel = no meritocracy",
        "role": "Director",
        "date": "Mar 1, 2014",
        "is_current": true
    }
]