[
    {
        "rating": 5,
        "cons": "This isn't a place to slack off - the flip side to autonomy is that I have a lot of responsibility for the success (or failure) of my product. That can be stressful.",
        "advice": "A lot of things here get done by influence rather than obligation. That's great because it prevents it from feeling like it's a big company, but it also can get clique-y and politics play a bigger role than they should. Having clearer expectations of roles would be helpful.",
        "pros": "I love that I have the autonomy to bring my strategy to production.Great *healthy* foodFun offsitesIncredibly smart people who I'm blown away by on a daily basisLove the emphasis on Members First. It's great to work for an organization that cares.",
        "summary": "Responsibility & Autonomy",
        "role": "Product Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Can be very fast paced!",
        "advice": null,
        "pros": "Great culture -- very transparent with company news, filled with intelligent people, and super fun!",
        "summary": "Fantastic place to work!",
        "role": "Insights Team",
        "date": "Oct 28, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Due to the rapid growth and iteration, there tends to be a bit too much compartmentalization. Work on cross-training and don't abstract too much.",
        "advice": "Keep doing what you're doing. LinkedIn is going strong and I have faith in what we are doing!",
        "pros": "Working for LinkedIn has been an awesome experience. Their hiring process for development is top-notch. The tools and practices are well embraced. The management are empathetic and understanding towards a true work-hard, play-hard mentality. The care for employees and their lifestyles is the gold standard among companies in the Silicon Valley.The work is engaging and there is always someone around to answer y… our questions when you need something. There is a strong amount of ownership and transparency, resulting in a collaboration that isn't possessive.",
        "summary": "Wonderful Company with a Strong Future",
        "role": "Web Developer",
        "date": "Oct 29, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "With the company constantly growing, there can be improvements in transitioning into your new role. However, often times, people prefer getting thrown into their job so they can learn as quickly as possible.",
        "advice": null,
        "pros": "LinkedIn is the perfect example of a work hard, play hard company. Everyone here is extremely hardworking and smart, but easy-going and outgoing at the same time. The company has a startup vibe but is growing at a large scale.",
        "summary": "Awesome culture, intelligent people, great work-life balance.",
        "role": "Associate Marketing Manager",
        "date": "Oct 29, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The commute is a bit long but a nice bus makes up for it.",
        "advice": "Continue to share the long term vision with employees. This helps us all work towards the same goals.",
        "pros": "LinkedIn continues to surprise me each and every day I come to work. When the number one operating priority is to build a world class team, you know that they \"get it\". Every decision goes back to attracting and keeping the best talent, and shockingly, the company has and is very successful. The Silicon Vally perks are abundant but it really allows to focus on our work and innovation and not really have to worry abou… t anything else.",
        "summary": "This is what working for a company should be like",
        "role": "Marketing",
        "date": "Oct 29, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You find that you work more, but isn't that a product of loving what you do?",
        "advice": "Keep the opportunities open, keep managing by our values.",
        "pros": "1)The culture at LinkedIn is amazing, they have done a world class job at making the LinkedIn Culture embodied in every office, regardless of location.2)The opportunity to evolve yourself into a better professional is limitless as long as your willing to put in the work, LinkedIn is wiling to invest in you.3)The value, LinkedIn is changing the world and you get to be a part of that. Whether it's your … job or not, we are all spokesman of the brand. When you start here there is no shortage of friends,family,former classmates reaching out to you to ask about how LinkedIn can help them in their career",
        "summary": "Career Changing Experience = Life Changing Experience",
        "role": "Anonymous Employee",
        "date": "Oct 30, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Expectations are high - you need to be prepared to go beyond what you previously expected of yourself",
        "advice": "Continue to stay in front of the competitive landscape and continue to innovate. Use equity to reward your best. As the business matures talent will naturally begin to explore new \"start up\" opportunities. Let's focus on retaining the great foundation that got us here.",
        "pros": "Amazing culture - inspiring and challenging without taking ourselves too seriouslyAmazing products - Best in class solutions to sell to our clients and membersAmazing leadership - the BEST in the business driving the strategy and transfering knowlegeAmazing talent - work with people that make me better",
        "summary": "Exceptional place to work and achieve your goals",
        "role": "Manager",
        "date": "Oct 31, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "We are not growing as quickly now as we have in the past. Each person is in role longer now as we don't have the growth to support rapid career advancement in most departments. From a sales perspective you can make more money at other companies.",
        "advice": "Now that you cannot offer rapid career growth please re-look at comp plans in the sales department.",
        "pros": "LinkedIn is the best place I have ever been employed. The management team is wonderful, they invest in the development of their teams and they provide unique growth opportunity for top performers. Unlike most sales teams, this one actually collaborates with each other and you are not fighting over accounts. The perks/benefits are amazing, the schedule is flexible and there is no micromanagement. I can't even imagine … a better company culture.",
        "summary": "Best job I've ever had",
        "role": "Account Executive",
        "date": "Nov 1, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Regional offices offer fewer non-sales opportunities, so it can make it difficult to make a move if you're looking for a non-traditional career path.",
        "advice": "Continue the rigorous hiring process to ensure culture fit; it works!Consider moving/expanding other departments (non-sales) to regional offices to spread out opportunities.",
        "pros": "All of the perks are well-advertised (food/drink/scooters/etc), and live up to the hype. What really sets this company apart is the people. There is such a genuinely friendly, helpful, and supportive culture fostered here, which is somewhat unusual for sales organizations. You can count on your teammates to help you in planning and execution with accounts, and your management team to champion your cause and stand beh… ind you as well. While I'm sure it's not appealing to everyone, I consider my coworkers great friends, and carry those relationships beyond the workplace as well. It's great to be somewhere where everyone really cares about everyone else!",
        "summary": "A workplace to love coming in to every day.",
        "role": "Account Executive",
        "date": "Nov 1, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- There is a different feel to different departments; LinkedIn values engineering teams the most and sometimes, that means Business/Support teams get left on the sidelines a little bit- It's easy to work long hours and get a little burned out. Everyone is supportive of work-life balance, but you need to make it happen for yourself. There is just too much to do as this company grows and scales so fast.",
        "advice": "Management is doing a great job-- the culture is amazing and I truly respect leadership here! Keep doing those bi-weekly all hands meetings and being true to the idea of transparency. Be sure to invest in not only engineering, but also support teams! I think leadership tries to recognize certain non-engineering teams, but not enough. It's particularly important as certain employees have been with LinkedIn for a long … tenure; we want to make sure to keep them here!",
        "pros": "LinkedIn is a great, exciting place to work. The company truly takes care of employees. Things I love:- Real attention to employees and what they ask for;- Great compensation;- One of a kind culture -- everyone is very nice and generous here and sincerely wants to help you grow as an individual, even if that means moving departments or companies or roles. We work very hard because we care about this compa… ny, and everyone recognizes the need for strong balance!- Real impact; everyone's work counts, including starting analysts. The company is growing so fast and it's exciting to see how your work immediately impacts that growth- strong leadership",
        "summary": "Exciting company; holding true to \"Billion Dollar Startup\" mentality",
        "role": "Sales Strategy",
        "date": "Nov 4, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Base salaries seem a bit low, and commission quotas are challenging yet reasonable;",
        "advice": null,
        "pros": "Company vision, corporate culture, initiatives, etc are all clearly articulated from executive level down; great work/life balance; smartest, most impressive and passionate employees I have ever worked with; management is extremely constructive and very invested in career planning/helping their staff identify and best use their strengths",
        "summary": "Management is great!",
        "role": "Enterprise Relationship Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "maybe too fast-paced for some people",
        "advice": null,
        "pros": "excellent vision, unique management team, strong collaboration, work-life balance, seeing employees as human-beings not machines!",
        "summary": "great culture, amazing team, unbeatable values!",
        "role": "Insight Analyst",
        "date": "Nov 4, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "401k match and bonus can be better",
        "advice": null,
        "pros": "As title, great company, great culture.",
        "summary": "Great company, great culture",
        "role": "Software Engineer",
        "date": "Nov 4, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The company is growing and invariably becoming more like a corporation and less like a startup. That also mean more perks and better systems though",
        "advice": "Fire people who don't work hard/perform because it demoralized those who do. Also, comp could be better",
        "pros": "Awesome culture - people who are driven and excited to come to work. People who can have fun. Some of my best friends are people i work with",
        "summary": "LinkedIn lives its values, mission, and vision",
        "role": "Anonymous Employee",
        "date": "Nov 5, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The locations of the offices could be better.",
        "advice": "Due to the recent surge of headcount, gossip needs to be monitored and controlled.",
        "pros": "1) Culture. 2) Work Hard Play Hard. 3) Trustworthy management and execs with integrity. 4) Respectful, fun and liberal environment. This is a place where hard work and dedication is acknowledged and rewarded.",
        "summary": "Fun, Inspiring and Honest",
        "role": "GCO",
        "date": "Nov 6, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The company is still growing fast and learning as we go due to the disruptiveness of the services. So if one is not comfortable with minimum structure and guidance it will be a challenging place to be.",
        "advice": "Keep the open communication and a close application of our mission and values.",
        "pros": "The way the company's mission and values are at the heart of all the decisions made. Still agile in changing a course of action if outcome is not what was hoped for. Great benefits such as food, gym access and working hours. Each employee is expected to act as an owner and it is really so. Empowering.",
        "summary": "Inspirational mission and values. Positive energy and future outlook.",
        "role": "Product",
        "date": "Nov 9, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "prioritizing can be a challenge...and an opportunityneed to balance what got us here and what is needed for next wave of growth",
        "advice": "keep up the transparency and leadership",
        "pros": "leadership, culture, people, vision, compassionJeff W is a rare and incredible mixture of vision, strategy, execution, operational skills, hardcore leadership and authenticitytalent across the co is top notch.",
        "summary": "A transformative place to super charge your career",
        "role": "Director",
        "date": "Nov 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The lightning speed at which we move and the amount of change that takes place can be challenging for some people",
        "advice": "Keep doing what you are doing and keep communicating",
        "pros": "Everyone is excited to be here, all contributing to the good of LinkedIn as a companyWork with a lot of super smart, ambitious, and truly genuine peopleLots of opportunityFast paced... super fast paced, there is always something new to learn or adapt toCulture, Values and our Mission are very much who we are, not just a plaque on the wall",
        "summary": "Transformative experience!",
        "role": "Anonymous Employee",
        "date": "Nov 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I can't think of anything that I could say.",
        "advice": "hard to say",
        "pros": "Linkedin is a place that instills collaboration. They hire experts in their field that are enjoyable to work with.",
        "summary": "It's a fantastic company!",
        "role": "Recruiting Lead",
        "date": "Nov 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I don't have any cons at all.",
        "advice": "Keep continuing things!",
        "pros": "The culture is truly amazing and the leadership at the company is excellent. I feel that my career has made a completely new trajectory.",
        "summary": "GSO University Associate",
        "role": "Recruiting Associate",
        "date": "Nov 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I don't have any cons at all.",
        "advice": "Keep continuing things!",
        "pros": "The culture is truly amazing and the leadership at the company is excellent. I feel that my career has made a completely new trajectory.",
        "summary": "GSO University Associate",
        "role": "Recruiting Associate",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "If you're not a self-motived person, LinkedIn isn't the place for you. There are a lot of distractions (game rooms, a band room, free food everywhere/all day, InDays, HackDays, classes to take, etc) and you still need to get your daily work done.",
        "advice": "Keep doing what you're doing.",
        "pros": "LinkedIn's company culture is one of a kind. I'm excited to go to work in the morning because I have the opportunity to interact with extremely intelligent people and because I'm still early in my career, it is great to be able to learn from such brilliant minds.The work/life balance of LinkedIn is something I cherish. Although I take the shuttle to and from San Francisco, I still feel like I have enough time…  to do the things I want to do. At LinkedIn, we're treated like valued employees.It's hard not to love your job when you walk around campus and always see smiling faces.",
        "summary": "LinkedIn HQ",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As the company grows and matures there will be some growing pains but overall can't think of anywhere else I'd want to be at this stage in my career",
        "advice": "Keep on doing what you are doing, it's working.",
        "pros": "Being surrounded by impactful people that care about both their mission and the company's mission.Ability and support to change the trajectory of your career.",
        "summary": "Empowered workplace, fantastic opportunity!",
        "role": "Senior Sales Recruiter",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As with any recruiting job- It is an always on function",
        "advice": "Keep innovating at a breakneck pace!",
        "pros": "Leadership, growth, future of the company is very bright.",
        "summary": "This place rocks!",
        "role": "Recruiter",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The pace we 'run' inst for everyone, but it definitely is a great place to work.",
        "advice": "Continue being amazing!",
        "pros": "We are changing the landscape of the professional world - one connection at a time!Committed leadership team.Amazingly smart and talented colleagues.",
        "summary": "Company is amazing to work for!",
        "role": "Senior Recruiter",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Growing bigger - lots of new ppl!",
        "advice": null,
        "pros": "Amazing place to work, transforming your career",
        "summary": "Awesome!",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "So much good food ... just want to keep eating more!",
        "advice": null,
        "pros": "Opportunity to grow and try new things.",
        "summary": "GaGre",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "need a flatter management structure. Too many levels have been created between employees and management.",
        "advice": "do not manage up. Manage your team and increase their chances of advancement",
        "pros": "Ample opportunities, encouragement from the management to the employees",
        "summary": "Amazing Journey so far...looking forward for more to come",
        "role": "Technical Recruiter",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Trying to find a conference room is always a challenge. Many people spend a considerable amount of time on what should be a simple task of booking a meeting space.",
        "advice": "We need more conference rooms, please! Otherwise, keep up the excellent work!",
        "pros": "My colleagues across the company always pull together to help each other out, and we have fun doing it! It's a high-energy atmosphere, and the time flies by. The quality of the food served in the cafeteria is absolutely outstanding. The campus is well laid-out and easy to navigate.",
        "summary": "Life at LinkedIn",
        "role": "Executive Assistant",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As the company continues to grow, it's getting difficult to get to know new hires.",
        "advice": "Have more opportunities to get to know each other to keep our \"close knit\" feel alive.",
        "pros": "To be in an environment where the employees have a \"voice\". They are also the most transparent company I've ever worked for, so as a former entrepreneur it feeds my need to know what's going on.",
        "summary": "Truly Blessed for My Career at LinkedIn",
        "role": "Sales Solutions Support Specialist",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I don't have anything negative to say. A truly wonderful experience so far.",
        "advice": "Keep doing what you are doing, There is so much going on that is so positive. Interested to see what our NEXT PLAY is !",
        "pros": "Culture, compensation, benefits, team unity, executive leadership, vision",
        "summary": "By far the best company I could have ever asked to work for.",
        "role": "Enterprise Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "People here work hard. Sometimes it's easy to forget about that whole \"work-life balance\" thing. This can get stressful!",
        "advice": "Help to foster a work-life balance.",
        "pros": "1.) Smart, driven, and FUN coworkers2.) I'm learning every day3.) I feel appreciated4.) Management encourages me to pursue new projects and ideas5.) No \"set\" schedule (but we work HARD)6.) Free food7.) Free Gym8.) Free Classes (e.g. Yoga, financial planning)9.) Team-bonding events (e.g. ziplining, dinner in SF)10.) Opportunities to growI've worked at a company in which mana… gement never learned my name. (I was there for a year.)I've worked at a failing startup. (That was tough.)I've worked at a lumbering, giant corporation. (Ideas? Forget it. There's other work to do.)After these experiences, I can honestly say I'm very happy at LinkedIn.",
        "summary": "Yes, this is a genuine review.",
        "role": "Order Management",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The rapidness of LinkedIn's growth has not been without its pains. I believe the majority of the employee population has less than two years experience with the company. Some processes have scaled better than others.",
        "advice": "Create more opportunities and support for movement between specialities and organizations (e.g. engineering to marketing and vice versa).",
        "pros": "Some pros include the cooperative, encouraging, and ennobling culture; the fair to generous compensation complemented by many great perks (free meals, well-stocked break rooms, nice workout facility, etc...); and quality leadership and management from managers and officers who value employees and strive to help them be successful.",
        "summary": "Great culture, generous compensation, admirable leadership and management",
        "role": "Web Developer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "pay is somewhat low compared to many companies but the pro's outweigh this point for most. Only when you get older does this become an issue but the company seems young so maybe it outgrows this or is ok with people finding better paying jobs later in life, sometimes feels like a startup (which is good also). There are lots of process and product gaps that need to be developed so sometimes you have to figure things o… ut on your own. This is getting dramatically better as more hiring, money, and people with skills to handle these increase.",
        "advice": "Encourage a longer term environment with providing better pay. Continue to have faith in the internal people to rise to management.",
        "pros": "Product works great, people are smart and nice, culture is solid. This company really knows how to build great products with huge potential to help locally and the world. That's a good feeling. The foundation of culture and morals is high. People act as if they're an owner in something special and that resonates from the top down. It's great to also work with really really smart people. Everyone is a superstar in the… ir own way and not a lot of bloated egos and aggression.",
        "summary": "Culture, People, Product = The Best",
        "role": "Sales",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Due to rapid growth employees can be stretched a bit far at times, and not all processes are fully developed.",
        "advice": null,
        "pros": "Positive environment, lots in inter and intra team collaboration, constant opportunities to learn.",
        "summary": "Positive, engaging workplace- corporate resources, start-up culture.",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "literally none, it is awesome. It is a company that lives the mission and vision; not just a tag line on a website.",
        "advice": "keep doing what you are doing.",
        "pros": "Transforming the lives of millions of peopleIntegrityfunAmazing leadershiplives and breathes employee welfare and internal mobilityThe vision is to create economic opportunity for billions of people. Tough, but achievable.",
        "summary": "A life-changing organization.",
        "role": "Senior Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Our company is in rapid growth mode- so there is not a ton of visibility across teams (yet)- which leads to duplication of efforts and an inconsistent external message (sometimes).",
        "advice": "Keep up the good work :o) The management and leadership and LinkedIn inspire and motivate me everyday :)",
        "pros": "The word 'culture' is thrown around a lot these days... but I can honestly say I've never worked at a company that has a better culture than LinkedIn. Every employee, from senior leadership down, lives and breathes our VISION (Create economic opportunity for every individual), MISSION (Connect the worlds professionals to make them more productive and successful), CULTURE (Transformation, integrity, collaboration, hum… or, results) AND VALUES (Members first; relationships matter; be open, honest and constructive; demand excellence; take intelligent risks; act like an owner)!In my opinion, having a 'dream job' means waking up every day excited to go to work. I feel that way at LinkedIn because of the people I work with and the opportunities that I have to positively impact the lives of professionals. I've never worked harder in my life, but I've never wanted to work so hard for a company. And the reason for that- LinkedIn provides the best environment for pursuing dream jobs!! Both internally and for the world's professionals. And I love it!!",
        "summary": "LinkedIn believes everyone can find their DREAM JOB- even their employees!!",
        "role": "Recruitment Product Consultant",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No San Francisco office for technical positions.Not much flexibility around work from home days for SF employees.",
        "advice": "When you build infrastructure for a city you plan 4-10 years out. LinkedIn is rapidly increasing in size. However, the existing communication systems for new projects and knowledge transfer have been designed for a company half our size. The physical embodiment of our communication problem includes conference rooms with standing room only and the use of outlook for email with a xGB limit. I think a company's communic… ation should be thought of as an infrastructural investment.",
        "pros": "Each team is designed as a startup of around 40 people. Ie, each team is self contained with an organization of data, engineering, designers, and product, everyone knows everyone, actions are swift, teams are focused.If you live in south bay - then one of the best work/life balances around.Very little \"cruft.\"The chefs cook like they are being reviewed by Michelin guide everyday!",
        "summary": "Where Experience Meets Action",
        "role": "Senior Data Scientist",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The commute is horrible on some days. It could be worse if I had to drive myself. With the company wifi-enabled shuttle, it helps me be productive with the time I spend on the shuttle. The extra plus of this con is that I'm not driving!",
        "advice": "Keep up the good work!",
        "pros": "The company really takes care of you and shows it in different ways. Gym-goer? check. Organic-eater? Check. Traveler? Check. Need to bring in kids? Check. Want to volunteer? Check. Side subject you want to learn about? Check.I wish I could list them all, but that would be close to impossible.",
        "summary": "Do I HAVE to go home?",
        "role": "Quality Assurance Technician",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "none that I can think of...",
        "advice": "Keep culture a priority",
        "pros": "Working alongside passionate & super smart people.",
        "summary": "Love the start-up culture & big company benefits.",
        "role": "Senior Technical Program Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "We are currently working to improve cross-team collaboration and company-wide communication.",
        "advice": null,
        "pros": "On a daily basis, I'm given the opportunity to work alongside some of the brightest minds in tech – people who aim to inspire change on a monumental level, and who work tirelessly to create insanely brilliant products.",
        "summary": "Working at LinkedIn has been a truly transformative experience.",
        "role": "Associate User Experience Designer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Very few.....But the 401K Match could be better. Also the day to day is very fast paced and you must be a solid multi tasker.",
        "advice": "Gaining a better understanding of the mid-level management and rep level struggles. Listening to various office conversations is sometimes seems that some reps are only heard through direct managers which can often have a one sided perspective. Even though there are surveys sent throughout the company not everyone feels comfortable expressing their concerns not knowing who is collecting the data. Perhaps more open fo… rums of skip level forums or meetings could enhance the communication and perhaps increase the comfort level of reps being more open with upper management therefore creating a more balanced perspective of the functionality (pros and cons) of all levels.",
        "pros": "Linkedin is the first company I've worked for that actually practices 100% of the values and cultures that are bedded into the structure and environment. Employees from support roles to executive management work with integrity and honesty and execute day to day through open and constructive communication. However you will always find a solid balance of humor and fun in any office and a strong involvement with communi… ty support and employee development and education.",
        "summary": "LinkedIn lives and breathes its Culture, Values and Employee Development",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work hard, play hard-- I am not required to but do check emails at all hours.",
        "advice": "None needed here- they listen to us and we have regular surveys to tell them any gripes.",
        "pros": "Culture is a competitive advantage- people like coming to work. It's fun to be at the top.",
        "summary": "LinkedIn is the best company I've ever worked at- by far.",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I could never work for another company.",
        "advice": null,
        "pros": "This is the best culture and most healthy work environment I have ever worked in.",
        "summary": "I love working for LinkedIn!!",
        "role": "Relationship Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Free food can have downsides!",
        "advice": "Remember the values of the company, and keep letting them guide us.",
        "pros": "To say that I enjoy working here is an understatement. I regularly wonder if it is possible for a company to be more enjoyable to work for. Everyone talks about the perks (free food, great compensation, a work-life balance that is heavily encouraged), but those are just the entry level perks for any serious Bay Area employer.What I really love is the product vision, the incredibly intelligent peers, and worki… ng for a company that actually works hard together to maintain the culture and values.",
        "summary": "Beyond my best expectations",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "If you can't roll with change, this may not be the company for you. As we grew we continue to be nimble where we can be- helping to maintain a start up feel despite the large employee count",
        "advice": null,
        "pros": "I'm working alongside some of the brightest people I've ever met. There is no hidden bureaucracy. Work life balance here is a serious consideration.",
        "summary": "Caring yet competitive",
        "role": "Sales",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As the company grows fast, some new middle managers are not caught up or adapted to the culture and still bring their past management styles in. This should should change.",
        "advice": "Continue to believe that employees are important. It was sad to see Mr. David Henke, SVP, leave recently but he made a big statement during his farewell saying that \"employees are the number one priority' at this company. I hope whomever takes his place continue with this culture.",
        "pros": "Culture, challenging opportunities, career advancement",
        "summary": "The best company to work for",
        "role": "Senior Staff Engineer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Too many amazing co-workers, not enough time to meet them all",
        "advice": null,
        "pros": "Amazing leadership, flexibility, good work/life balance",
        "summary": "Excellent employer that looks out for the well-being of employees",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Growing as quickly as we are, some of our internal support is a bit spread thin. I anticipate this changing in the future, but it is at least a good problem to have (growth).",
        "advice": "Keep doing what you're doing!",
        "pros": "The culture of not just LinkedIn is bar none. The people here all live and breath our values and it is truly inspiring to come to work everyday. Our work is educating professionals and I hear stories each day about how we have transformed their lives!",
        "summary": "Sales Account Executive and Sales Manager",
        "role": "Enterprise Sales Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Depending on the role, advancement opportunities may only exist at the HQ.I've gained weight from all of the free food/snacks/beverages they supply to us!",
        "advice": "Transparency is the name of the game, and always has been. You guys do an amazing job of sharing company news and company insights, while keeping things new and exciting.Keeping the culture we have is no small feat, but we have succeeded in maintaining and even improving upon the \"LinkedIn Way\". I enjoy working for you more than you know!",
        "pros": "LinkedIn's culture is second to none.LinkedIn allows employees the ability to grow and transform in their careers.LinkedIn matches your charitable donations dollar for dollar.LinkedIn knows how to treat its employees like adults and expects only the best from everyone every day.LinkedIn's CEO holds bi-weekly All Hands meetings globally to share company insights and collective priorities.",
        "summary": "LinkedIn is everything you love about a start-up, in a large, global organization. We bleed LinkedIn blue!",
        "role": "Project Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not much to say. Maybe too much free food (at least this is what my wife is saying)",
        "advice": "Keep it up",
        "pros": "- Great people- Great culture- 3 years of true passion",
        "summary": "Best company I have ever worked for",
        "role": "Sales",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "talent dilution in certain teams",
        "advice": "keep rocking it",
        "pros": "I'm drunk on the LinkedIn Kool-Aid and am an unabashed evangelist for its talent brand. This company is ideal for entrepreneurial types, i.e., people who thrive on taking ownership and the effort that doing so requires. It's a meritocratic environment with phenomenal people, benefits, and culture. It feels like there are no limits to what the company can accomplish at the macro level, and what individuals can accompl… ish at the micro level. And because most people I interact with share that optimism and sense of opportunity, the organization will continue to kick ass in the marketplace.",
        "summary": "Dream job",
        "role": "Senior Manager, Marketing",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's no longer a small start-up, so with that comes more bureaucracy and internal checkpoints.",
        "advice": null,
        "pros": "Amazing culture, strong leadership, and support to make your time at LinkedIn a transformative experience for your career.",
        "summary": "The best place I've ever worked",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lots of fun activities that can distract from work",
        "advice": "Doing great job, keep it up as we scale",
        "pros": "Great culture, products to sell, management is awesome",
        "summary": "Amazing",
        "role": "Sales Development Specialist",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The larger the company grows, the more some of the unique attributes of our \"start up\" culture begin to fade.",
        "advice": null,
        "pros": "One of the best things about working for LinkedIn is that I always feel as though I have access to our executive team. They make a point of visiting each office, meeting with the newest hires, and ensuring that they are readily available.",
        "summary": "It keeps getting better",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "LinkedIn is a fast moving company. The positive is that this allows for personal growth and opportunity. Not everyone may enjoy a faster paced environment.",
        "advice": null,
        "pros": "Some of the strong positives of working at LinkedIn-Culture. A strong emphasis on culture makes Linkedin quite different than a Fin Serve type of environment. Mutually respectful interactions with colleagues. Everyone is on the same team.-Mission. The mission of Linkedin is crystal clear. The benefits to others are apparent. I hear often from relatives and friends about their usage of Linkedin.-Opportunit… y. Linkedin is moving at a very fast pace, which opens up opportunities internally to transform your career.-Perks. Beyond the standard tech fare (Kitchen, Scooters, flexible working), Linkedin emphasis inDays to focus on passions outside of work.",
        "summary": "Opportunity to Transform",
        "role": "Marketing Solutions",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "All of the usual things with working with a larger company. Despite the effort made to keep running like a startup there is some overhead and bureaucracy, but much less than other companies.",
        "advice": "Work to reduce code bloat and keep each team as nimble and autonomous as possible! (doing a pretty good job of it, just make sure it doesn't slip)",
        "pros": "The company culture here is wonderful. Everyone is so open and inviting - I haven't met someone I haven't liked! The food is great (brand new cafe!) and the work environment is very chill. All in all a great place to work.",
        "summary": "Amazing Culture, Awesome Food, Great Inviting Work Environment",
        "role": "Associate Web Developer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It is easy to become spoiled, you really have to remind yourself of how it \"could\" be at times.",
        "advice": "Continue to bring in upper management who share the same focus on people and culture, and get rid of the ones who don't.",
        "pros": "LinkedIn really invests in the personal development of their employees, the executive staff continues to keep communication open and transparent, the culture is fun and innovative",
        "summary": "Best company culture someone could ask for in an employer!",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Long hoursHigh expectations (not sure this is really a con - keeps us all on our toes)",
        "advice": "Keep the benefits of the start-up feel and culture - shifting to a big corporation feel and people appreciate the small company feel",
        "pros": "Free foodFun environmentinDay - focus on personal developmentCommunityEncourage creativity and new ideas",
        "summary": "Loving life at LinkedIn",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No downsides...awesome company from top to bottom...I honestly have no cons.",
        "advice": "As the company grows make it a priority to maintain the culture. Jeff Weiner is an amazing and transparent CEO who inspires us from top to bottom. His leadership team is so humble and I'm blessed to be a part of an amazing organization.",
        "pros": "Great culture! Never worked for a company where I LOVE coming to work everyday. How awesome to have a company that invest into their employees careers!",
        "summary": "Connecting the world's professional's one member at a time...",
        "role": "Executive Assistant",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "California/HQ employees get the short end of the stick when it comes to internal events. Work in another city in the US or overseas? Free week-long trip to San Francisco twice a year. California employees can hardly get a hotel room overnight. Total first world complaint, I know...",
        "advice": "Continue to flatten the organization, how many managers of managers do we really need?",
        "pros": "The people are awesome. The products are awesome. Senior management knows what they're doing.",
        "summary": "Great Place to Work!",
        "role": "Enterprise Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Thanks in large part to the ridiculous retail leasing rates in the city, the SF office only gets free hot lunch once a week. That being said there are enough prepackaged sandwich's, salads, and snacks to feed a small army :-)",
        "advice": "Great job so far! #BDS",
        "pros": "Even though our team seems to grow exponentially, with new faces showing up every day, we still manage to hire some of the best people I've ever met. There is nothing better than waking up in the morning excited to go to work because your colleagues believe in the same things you do!",
        "summary": "It's all about the people...",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "continued growth decreases some of the start-up feel and internal flexibility/opportunities, but compared to a big company it is still an amazing culture.",
        "advice": null,
        "pros": "start-up environment, career transformation is a priority, access to leadership to some degree, insane growth, great people, meals, casual dress, 5K stipend for education, and most importantly we're selling disruptive technologies in HR, Sales, and Marketing!",
        "summary": "I love it @ LinkedIn",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- This is a title poor company. Most of my MBA cohort outside LinkedIn are at the Director/VP level. I'm in a comparable job here and am a Manager. Titles aren't a big deal to me, but I have heard that the lower perception hurts employees when they leave the company.",
        "advice": "- Fight bureaucracy wherever you can. Limit meetings and time spent working on internal processes. Free us up to go build cool stuff that will change the world.- Encourage more internal mobility. It happens today within Sales, Product and Engineering. Could it happen across those groups?-Open up offices in lower cost cities. Denver, Salt Lake City, Austin, Atlanta etc.. It is impossible to buy a home in Mount… ain View/Palo Alto and standard of living would be higher outside Silicon Valley.",
        "pros": "- Excellent Senior leadership. Jeff and Mike do a great job of communicating where the company is and where its going.- The vision is inspiring. Creating economic opportunity for the world's 3 billion workers.- Really nice peer-to-peer skill building opportunities.- Monthly hackdays keep the start-up spirit alive even as we grow to 4k+ employees",
        "summary": "Great place to transform career",
        "role": "Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There are some growing pains.* Pains in growing culture: culture is slipping and there is the start of a few too many attempts at minimizing the pain with middle management bureaucracy.* Too many product folks building too many things not necessarily aligned to the company goals: there's more then a few projects being built for the sake of engagement. The bigger picture is not apparent internally and for … sure externally to the actual LI users.* A few too many cooks in the kitchen: sometimes there is too much architecting/talking/emailing and not enough action. Too many teams building very similar tools only for themselves.",
        "advice": "Middle management needs to align with upper management. Stay focused. The company is getting large and company culture -- a strong tight knit group with many shared goals-- is slipping. The amiable, strong and vocal group of bottom up movers and shakers have left and moved on. The new class are more selfish and divisive. They are shakers but not movers.",
        "pros": "Talented developers. Kick ass exec team who are passionate and sincere. Good food and good dev culture.",
        "summary": "Super exec team. Good dev environment. Team is getting big and many things are no longer scaling.",
        "role": "Senior Web Developer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Comp is only uncapped at a certain percentage, and becoming more corporate.",
        "advice": "Continue running pulse surveys.",
        "pros": "The people here are smart, creative and very \"normal.\" Amazing food program and tons of perks (manicures, weekly yoga, hiking/nature trips, to name a few) makes you want to come to work. The quarterly pulse survey is sent to every employee, and actually read by the execuitive team, which actually takes recommendations into consideration and action.",
        "summary": "Great people, great job, great company.",
        "role": "Relationship Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "not as many perks in our office as at headquarters",
        "advice": "Foster more communication across departments",
        "pros": "Great culture and work environment, working alongside great people with a lot of good perks. There are a lot of resources around you helping you to succeed and people really enjoy coming to work every day.",
        "summary": "A great place to work",
        "role": "Senior Relationship Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not necessarily a con but very fast paced environment, sometimes can become a bit hectic due to the speed at which the company moves",
        "advice": null,
        "pros": "Phenomenal company from a cultural perspective. I've been at LinkedIn for 2+ years and the culture has gotten better and better during my time here. LinkedIn is at a crossroad between our start up roots and the multinational enterprise that we are becoming. As a result, there are many characteristics of the company such as the hacker/innovative DNA that are very much like a startup while at the same time we have the … luxuries and infrastructure of a mature company. My favorite thing about LinkedIn is the people. I'm impressed by the people here literally on a daily basis.",
        "summary": "LinkedIn Working Environment",
        "role": "Recruiter",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Heavy workload, but rewarding payoff.",
        "advice": null,
        "pros": "Great leadership cascading from the top down.",
        "summary": "Great workplace environment anchored by strong cultural identity.",
        "role": "Account Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Some of the departments don't to seem to value the culture as much, and old school mind set still seems to persist.",
        "advice": "Really make sure all managers are living and breathing embodiments of the culture, it comes from the top down. Many initiatives seem to be supported but not always practiced which has a trickle down effect.",
        "pros": "LinkedIn truly believes in our culture of transformation, we are constantly supporting the transformation of employees, the company and the world. I have been given SO many opportunities to transform, and I've also seen the company evolve ans aspire to be something I want to be a part of for a long time.",
        "summary": "Company Review - My experience at LinkedIn",
        "role": "Program Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "will totally absorb you if you let itcan be difficult to focus on the right priorities because things are moving so fast",
        "advice": "more focus to help the individuals make decisions about priorities",
        "pros": "innovative products and solution to work onexciting and fast paced atmospherepersonal ownership of projects where strong leaders can make a changetalented individuals that really push you",
        "summary": "Oppty to invent, create, lead, and learn with an incredibly talented team - at a huge scale.",
        "role": "Head of Marketing",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "HQ has a few better benefits and food",
        "advice": "Keep working hard to keep our unique culture",
        "pros": "Believe in allowing and promoting employees to be successful. Allow for work life balance",
        "summary": "Beyond expectations...a truly caring culture....incredibly postive culture",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A few manager duds (though fewer than at most companies). It can become easy to work too hard, and suddenly work/life balance gets lost.",
        "advice": "Continue to encourage creativity. Actively discourage working late hours, and be cognizant of actions that may lead to that.",
        "pros": "Great treatment of it's employees. Good work recognized and rewarded. Great people. Great culture and values, with few, far-between exceptions. Generally smart, competent, motivated people. Creativity and intelligence gets rewarded.",
        "summary": "Love it. Startup speed and ownership with a large company's resources and stability.",
        "role": "Program Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work stress can be intense some time. But overall manageable.",
        "advice": null,
        "pros": "Free meal, free snacks, free health/dental/vision insurance, free gym, free fitness class....The company takes good care of every employee.",
        "summary": "Awsome place to work at",
        "role": "Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "We're growing so fast that sometimes it's hard to keep up with the changes. I don't think this is necessarily a con, but more of an adjustment for most people. Also, some of their benefits could improve like 401k.",
        "advice": "I love our leaders at the company! They are all highly intelligent, fun, and transparent with the teams. My only suggestion would be to have more C level female leaders.",
        "pros": "Working at LinkedIn so far has been such a life changing career choice. At my former company they knew the importance of culture, but had a hard time delivering on it. However, at LinkedIn culture is key. Everyone is so friendly; they want to make coming to work fun, and they live up to their value \"Relationships Matter\". Also, the growth opportunity within the company is remarkable - Please don't leave. It blew my m… ind to see how much internal growth they promote. It's a wonderful way to see many different sides of the business and find your niche.",
        "summary": "Incredible culture & fantastic organization!",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "none that I can think of",
        "advice": null,
        "pros": "Relationships matterwe innovate, we act like owner",
        "summary": "The best place to work",
        "role": "Project Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I haven't seen any red flags yet",
        "advice": "Keep focused on the core values that make LinkedIn great even as we grow into a large company",
        "pros": "The company culture at LinkedIn is something special, management takes great care in hiring the right people with the right experience. Collaboration and team work are some of the things that sets LinkedIn apart and make coming to work every day exciting. Management takes a genuine interest in helping employees transform their careers and learn new skills. Very few organizations are able to inspire employees and crea… te such a positive work environment the way LinkedIn has.",
        "summary": "Best company I have ever worked for",
        "role": "Sales",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "we need more engineers, come join us!",
        "advice": null,
        "pros": "Great team, inspiring leadership, huge impact on the business and on people's lives.",
        "summary": "The best company to do product at",
        "role": "Product Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "...It's really big and I can't get to know everyone??... You're in so many teams at once, and it can get confusing...but you get to go to all the offsites for each team!",
        "advice": "Keep doing what you're doing. Don't ever leave, Jeff Weiner.",
        "pros": "LinkedIn is the best company I've ever worked for. The kitchen is amazing. Gourmet, health-conscious, environmentally friendly, organic food with breakfast/lunch/dinner. The health and wellness class options are great. Good gym. But it's the people I want to emphasize. The CEO is what helps spread the culture. He emphasizes culture. The people you work with are always having fun, and are super supportive. Everyone ac… knowledges everyone else for their hard work. And I see promotions all the time. There are lots of public thank you emails. And the feeling of inspiration/fun/motivation/hard-work/intelligence is very viral. My friends are completely jealous. But I'm even more jealous of the interns that get to work here. ;)",
        "summary": "Intelligent and super supportive coworkers. Fun to the max. Great food and culture.",
        "role": "Associate Web Developer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Getting a bit larger - 900 employees to 5,000 in 3 years. Wowzers. Still, they want us to be a \"billion dollar startup\", so are trying to remove big company barriers.",
        "advice": "Preserve that startup culture!",
        "pros": "Culture, Food, People, Ping Pong, Amazing Products, Amazing leadership, bright future, Love working in the Empire State Building.",
        "summary": "Transformational company, staff, and experience. Top 3 Globally for employees!",
        "role": "Enterprise Sales Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Perks offered in smaller offices do not equate to the perks of the corporate office - but that is understandable.",
        "advice": "Continue to focus on corporate social responsibility efforts.",
        "pros": "On a daily basis I experience and observe examples of the company living its values throughout all levels of the organization. Transformation through collaboration, integrity, focused on strong results - while we have a fun and a sense of humor.The commitment to a monthly InDay giving employees around the globe the chance to volunteer is my favorite perk of working here - I'm proud to work for a company that … offers this opportunity.The bi-weekly CEO All Hands is impressive and unheard of based on other companies I've been a part of.",
        "summary": "Caring for Employees and Communities",
        "role": "Sales",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A little more under the radar vs. Facebook/Twitter/Google",
        "advice": null,
        "pros": "World-class talent, great leadership, very humble/focused team. You will have an opportunity to work on things that will truly help professionals in their careers and in their lives.",
        "summary": "Great place to work with great people and build great things for the world",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Space is the biggest challenge right now...but will soon be taken care of when we move into the Sunnyvale space.",
        "advice": null,
        "pros": "I work with the brightest people and I love how everyone comes together to solve issues and build processes. Collaboration is something I see at work everyday. Also, as employees, you have the opportunity to transform your career at Linkedin. I've watched it happen many times, including to myself!",
        "summary": "Best place I've ever worked!",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Most US-based employees are based in San Francisco, New York City, Chicago, or Omaha...which results in limited US mobility",
        "advice": null,
        "pros": "- Surrounded by smart, hard-working people who all share a passion for the business- Fabulous benefits and perks- Multiple avenues within the business to pursue career goals (several business lines, international growth, etc)- Flexibility, autonomy, and great earning potential- Customer excitement around our products and services",
        "summary": "My Dream Job",
        "role": "Enterprise Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Can't really see any Cons in this wonderful place.",
        "advice": null,
        "pros": "- Opportunity to work with world-class talent- Positive work environment- We work with cutting edge technologies, can it get any better for an engineer?- Open work culture- Good Middle & Upper management- Free food",
        "summary": "One of the best employers I have been with in the past 6 years.",
        "role": "Staff Database Engineer",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "LinkedIn has gotten bigger, but some of the systems haven't scaled with us. We're a bit behind in this regard and it's gonna take a while to catch up.",
        "advice": null,
        "pros": "LinkedIn is a great company and has a strong brand, but what I love more is the environment I get to work in every day. Scooters, cube decorating competitions, fund raising events for charities, hilarious and brilliant coworkers, food, group fitness classes, etc. The list goes on and on. And, not for nothing, I am doing work about which I am passionate. I am 2.5 years in and the honeymoon is definitely not over.",
        "summary": "Best culture!",
        "role": "Manager",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As the company grows we are losing the start-up feel",
        "advice": null,
        "pros": "People, Culture, Pay, Room for growth, exposure to senior management, and great work/life balance.",
        "summary": "An amazing culture, with great people and ample room for growth!",
        "role": "Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You must be self motivated to succeed. Unlike my previous employer, managers will not micromanage you. But, I do not feel this is a con. Really there is no con. I would just say if you are not a hard worker and self motivated, do not apply.",
        "advice": null,
        "pros": "very positive, friendly environment that has me challenging myself and continuously learning from driven and intelligent people.",
        "summary": "LinkedIn Chicago",
        "role": "Enterprise Account Executive",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "In the time I have worked for LinkedIn I can easily say there is nothing that I don't like about the company. With that said, we could use additional parking spaces!",
        "advice": null,
        "pros": "LinkedIn offers an environment that is rich in its culture and values. As an employee I have witnessed and been a part of transformation, collaboration, integrity, humor, and results first hand. It is very gratifying to work for a company that has such an amazing culture and lived by values that are intertwined with the day to day running of the business. LinkedIn puts the human touch on technology in more ways than … one!",
        "summary": "Best Company Ever!",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Agressive sales quotas can make the sales representatives seem too overtly sales focussed sometimes",
        "advice": "Preserve the company values and culture at all costs, then everyone will win - members, customers, employees, shareholders and leadership",
        "pros": "The senior leadership team genuinely work according to the company values, creating a culture which all staff believe in, making it a more productive and happy place to work. That ultimately affects the way we look after our members and customers, and how we achieve the company's mission. Talent is the company's number one priority and it feels like that as an employee.",
        "summary": "A company that leads with values.",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    }
]