[
    {
        "rating": 3,
        "cons": "Poor advancement opportunities. I went to LinkedIn specifically to advance my career, making it very clear when I got hired that my biggest fear was doing the same thing I had previously done. LinkedIn poached me, so I thought the hiring manager would have realized they couldn't expect me to do the same thing for a year.Unfortunately, this is exactly what happened, so I left a year later. Ad Operations is not… orious for this in the industry, but it is especially true at LinkedIn. It seems exciting because LinkedIn is an awesome company with very smart people, but it has also grown far too quickly to give real career opportunities to the majority of employees. Many in my department either leave the department or company in order to find their next step. Senior titles aren't really different. They need to seriously reevaluate their advancement structure.The middle managers also aren't great. They don't have enough experience to really help support the ICs and are also very lacking in their ability to have career conversations or provide training. Leadership also had a lack of professionalism that I don't think is right to talk about here, but made me lose a lot of respect for the company.Big picture - The company is a great, exciting company to work for. I would recommend working here, but not as a Campaign Manager to anyone that has experience in it. Great for a first job, not so great for a second or third.",
        "advice": "Hire better managers! People don't quit companies, they quit bosses. Tons of people have left my department since I left, so I would take a very serious look at the management within Ad Operations. Also, don't just hire the smartest - hire people you can actually provide long careers for.",
        "pros": "Very smart people, great perks (free meals, beautiful office spaces, education reimbursement, etc.), great products, innovative and forward-thinking company vision, excellent executive leadership.",
        "summary": "Great, exciting company with poor management and leadership opportunities.",
        "role": "Campaign Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Company org is confusingA few people are incompetent and political enough it's a real morale killerCareer advancement feels politicalSome people in mid-management don't seem to care much about cultural values",
        "advice": null,
        "pros": "Good work-life balance and flexible hours (for engineering)Perks and benefits are pretty good, perks include interesting speakers, inDay, fun offsitesMost people are good to work withFocus on professional development opportunitiesCompany and product are growing and doing well",
        "summary": "Sounds great on the surface but plagued with day-to-day problems",
        "role": "Anonymous Employee",
        "date": "Nov 1, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Is extremely political. You must toot your own horn to stand out, while shaking hands and kissing babies. New hires aren't really aligned with traditional LinkedIn culture, mostly because they are narcissistic and anxious to consume that kool-aid to up their value.",
        "advice": "Hire better management who want to develop the team, and locate weak links to help those struggling.",
        "pros": "Amazing perks at LinkedIn, including fun activities, stocked fridges, fun environment, etc. Definitely a work hard, play hard balance. Teams can be fun.",
        "summary": "Relationships matter - politically speaking, of course.",
        "role": "Anonymous Employee",
        "date": "Mar 30, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Recruiters do not provide quick responses.",
        "advice": null,
        "pros": "Smart team members. Good scope for growth.",
        "summary": "Network Engineer Interview",
        "role": "Anonymous Employee",
        "date": "Apr 19, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "low salary, lack of compelling leadership, lack of employee diversity, chained to desk",
        "advice": "missed opportunity for dynamic, inspiring leaders and an empowering environment",
        "pros": "Company Culture, overall office environment, InDays",
        "summary": "Account Executive, Sales Solutions",
        "role": "Anonymous Employee",
        "date": "May 1, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The company has become very big with less consideration of constructive feedback on improvements. Most of the leadership team is incredibly strong but some divisions have their missing links.",
        "advice": null,
        "pros": "The company heading in the right direction with tremendous potential for continued growth. Competitive Compensation, Benefits, Employee Stock Purchase Plan, 401(k) matching, free daily lunches, nice office.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "May 19, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "LinkedIn is still searching for its overarching brand and identity which leads to confusion of purpose within some business units.Also, with rapid hiring over the last few years LinkedIn really had the opportunity to diversify its mix of leaders and employees vs 'more of the same' backgrounds that were hired or promoted. It's difficult to innovate without fresh perspectives.",
        "advice": "Bring new employee backgrounds into leadership positions to spur innovation. Reward risk taking.",
        "pros": "LinkedIn is well respected externally (analysts, partners, members) which helps sales and marketing efforts. The leadership team is attempting to solve large economic challenges which makes for solid employee motivation and corporate vision.",
        "summary": "Searching for its identity",
        "role": "Marketing",
        "date": "Aug 23, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Slow movingOver inflatedOverly complicated product set",
        "advice": "Be more agile and take some risks! Remove some cooks from the kitchen and simplify!",
        "pros": "Salary, Benefits, Work-Life Balance, Office Locations",
        "summary": "First to market, last to advance",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Bad team culture, too aggressive and too push",
        "advice": null,
        "pros": "Great company culture and good compensation benefit",
        "summary": "Business analyst",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Despite 10 years of existence, still relatively young since IPO a few years ago and still immature regarding consistency, predictability and accountability. Not as great for more senior and experienced profiles as for Millennials to develop themselves (Very limited training and opportunities). Still struggling due to lack of focus and prioritization to grow other total addressable markets like CRM and L&D despite…  acquisitions and new product initiatives. Still a small town internal mentality, quite passive aggressive, hypocrite culture backstage, where people are very consultative but will do whatever they want afterwards leading to redundancies and complacency, still clinging fiercely and proudly to being scrappy over and over again, which at 300K revenue per employee only they should rethink moving forward. Lots of Operators focused on doing things fast and furious even it means scratching and redoing the same over and over again, but very little strategists -except at the very top- with big picture and collateral damage effect skills willing to do the right things right first time.Paradox of 70% of Individuals having a year or less in the company, among them lots of millennial, meaning talented but young with limited experience and expertise, when 80% of directors and up have been promoted from within over the years so lack of diversity of thoughts, making it quite hard to enter their circle, get alignment on new and/or different ways and often facing a very polite and very politically correct but \"been there done that mentality\".",
        "advice": "#1 Optimize. Better Systems and Tools badly needed for better productivity . Also Think Center of Excellences and Try outsourcing/nearshoring/offshoring of non core competencies in a controlled way. No need for so many full time headcounts in so many expensive fancy offices around the world when main job is to be behind a phone calling customers or publishing content online behind a computer.# 2 focus ruthles… sly on next total addressable markets and reprioritize better priorities and resources instead of just dabbling with new opportunities and maintaining most resources on improving existing products.",
        "pros": "Very eloquent CEO, Powerful Brand, currently very trendy and hype, still great growth of members and customers, Friendly culture polite, respectful and PC, Great benefits (especially 401K) and onsite perks, Great for Millennial to start their career and develop themselves (training and opportunities). Very slick PR, Transparent Communication and respectful collaborative culture on the surface, willing to optimize and…  scale now. Great potential if it can convert tests in other addressable markets into additional significant revenue streams to their main cash cow Recruiter products. Can either become an even bigger success story in its market regarding world domination and expansion like a Facebook, a Google or Amazon or be the next Twitter or Paypal (Layoffs/Restructure).",
        "summary": "Eloquent CEO, Great potential, Still struggling to convert new opportunities and to scale",
        "role": "Senior Manager",
        "date": "Oct 13, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Seating arrangement is moving to open office plan.We are switching to \"umlimited vacation\" policy.The engineers who like to design and create products are leaving the company in droves now that growth seems to be tapering off. The folks who are still around are more into \"leadership\" and \"mentorship\" than doing real work. This creates a vicious cycle where the engineers who like to push stuff take on more and…  more and eventually realize that they might be better off at a startup.All in all the things which made linkedin great fun place to work are going away. I think it might have something to do with the fact that are profits are miniscule and continuing to eke it out at our size is a challenge for current management.",
        "advice": null,
        "pros": "Collaborative culture.Benefits are decent - include generous 401K match (50%) and include things like yoga classes, tai chi classes, aerobic classes.",
        "summary": "Not that great any more",
        "role": "Software Engineering",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Some mid levels of management are absolutely incompetent. Many were promoted prior to company hypergrowth and are by no means qualified. The culture is also super political. If you've got an \"in\" with someone high level, you're forever safe. If not, good luck. You're going to spin your wheels.",
        "advice": "None because it won't matter.",
        "pros": "Some of the smartest and most talented people I've ever worked with. Good perks including very good food. Great office locations. I got to travel Internationally which was great! I enjoyed my time there but would not ever go back.",
        "summary": "Great people, products, and perks but VERY political and clique-y",
        "role": "Anonymous Employee",
        "date": "Nov 9, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The review system is not transparent and fair.",
        "advice": null,
        "pros": "The company has a great mission and great products.",
        "summary": "Software Engineer in Security",
        "role": "Software Engineer",
        "date": "Nov 10, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Within the org that I was in (GSO - Global Sales Org), salary for technical individuals are capped at below market, so eventually most technical people go to other companies after a few years. The senior management has a very \"old corp\" culture when it comes to promotions (\"pay your dues\", \"let's not set a precedent\", \"we'll talk in a year\") that is based on age and tenure rather than skill. The management structure … also favors MBAs managing technical teams, so the technical ICs have to teach their managers, while not getting meaningful feedback and support. This I believe was unique to the GSO and not a problem for other parts of LinkedIn.Career path was another problem. There's a very low ceiling within the GSO for an IC. You'd hit that ceiling very quickly and will have to make the decision to either be a manager, or be an IC with a capped comp even though you are providing more value year over year. Within the GSO, management is the holy grail (a bit like old corp) for many people, and because managers don't do IC work, some ICs try to learn how to be managers by getting other people to do their work. It's a talker's culture within the GSO, not a doer's culture. There are more meetings than war room sessions. People sit down and talk about execution, talk to stake holders, looping in everyone but their grandmas, and then get the poor IC who is the lowest paid person at the table to slug it out. Management often take credit for that work by representing it to senior leaders without crediting back to the IC.Morale was a problem on our client facing team because their managers are very much \"yes men\" serving the sales teams, that means the client facing team has to work all hours, have surprise quick turn around projects, and are faced with management practices that are contrary to LinkedIn's core values (such as a manager saying \"I'd be careful about your professional image\" when a teammate voiced concerns about being verbally abused during a meeting).The senior leadership also has an ineffective way of dealing with talent competition. The comp package seems to be tightly regulated and capped below market, it is fairly easy for competitors to swoop in with what seems to the candidate as amazing offers. The management's response to this has been to create uncertainty with the new position, and attempt to offer delayed rewards (we'll promote you in a year) - basically anything that doesn't involve in materially making good on a better offer. The person leaving will be subjected to repeated meetings with their manager and their superiors to question the candidate's intent, whether if they were team players, and whether they'd want to let their team down. All in all, not a great way to try to win someone back, and makes them more determined to leave.",
        "advice": "LinkedIn has a vision for employer - employee partnership. Reid Hoffman's vision is extraordinary so please let's all live up to it! GSO is a business facing org, but that doesn't mean Reid's visions no longer holds true. If team members are not treated equitably, offered market rates, supported with learning opportunities and career trajectories that are more than pats on the back, then we'll get closer to it. And y… es, the grass is indeed greener on the other side.",
        "pros": "Great work life balance (at least for the projects and tools team, for the client facing team, it's bone crushing hours). The location of the office is very convenient. The team's culture is great, very positive, supportive and optimistic. Team lead and managers lead with empathy and are very open to feedback.",
        "summary": "Insights Analyst - a nice stepping stone but not where you want to be for long",
        "role": "Insight Analyst",
        "date": "Dec 27, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Limited Advancement, self involved management",
        "advice": "Work for your people and not your buddy buddy friendships",
        "pros": "Autonomy, free lunch, paid health",
        "summary": "Ok at First",
        "role": "Customer Advocate",
        "date": "Dec 31, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Company culture is getting diluted. So many egos in upper and middle management. Losing touch with the employees",
        "advice": "Focus on the people who make the company so great. Egos are getting out of control.",
        "pros": "Top in it's field by far. Very innovative products. Exciting space with a lot of room to grow.",
        "summary": "A lot of egos....",
        "role": "Anonymous Employee",
        "date": "Jan 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Testing is done by developers, which means as a QA your main job is to come up with scenarios and hand those to them. As a result, the priority is to hire more developers and (to put it nicely) employ less QAs. While this makes developers be more disciplined in designing with testing in mind, it also means less chances for QAs to learn and do new things.",
        "advice": "Use your QA team for what is meant to do: Testing the s--! out of the product and automate where it makes sense. Let developers code with unit testing in mind.",
        "pros": "Great benefits, free food, flexible hours, decent load, great perks, good salary.For developers, working here would be a dream job, as long as they don't mind being responsible for the testing as well (See below).",
        "summary": "QA here is not like everywhere else",
        "role": "Test Engineer",
        "date": "Jan 17, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Some of their management choices lately have been leaving a lot to be desired, the LSS vertical is turning into a mini SFDC (which is not great in my opinion).",
        "advice": "Hire managers who can manage a team AND get sh*t done, not just the latter.",
        "pros": "Casual environment, good perks, some respected/respectable leadership.",
        "summary": "Sr HR Representative",
        "role": "Senior Human Resources Representative",
        "date": "Jan 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Could do better at really tapping into skillsets and giving people the chance to shine at what they're good at",
        "advice": "Even if the company is growing at a rapid pace, take the time to listen to the feedback/concerns at all levels of your organization and be open and inviting.",
        "pros": "Really great perks and benefits. A great internal learning/training environment to support career growth. Offers relative autonomy when it comes managing projects.",
        "summary": "Great benefits, but could do better at managing growth",
        "role": "Anonymous Employee",
        "date": "Jan 21, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "What matters most is money in my paycheck. They told us they pay in the 60th percentile of other competitive positions. This is false, we are under the 50th percentile of others in our industry and management just tells us we aren't truely \"x\" position because we don't do what others do, knocking down our skills and saying we are paid competitively per the job we do.",
        "advice": "Don't advertise competitive pay and then justify why your position isn't as valued as others in your industry and therefore you are paid what you feel is the 60th percentile. Upon hearing this and then being disappointed by the reality of the adjusted offer letter where no one was increased in pay has been a haunting shadow lingering over our jobs. A lot of others feel this way, really hoping everyone gets a nice bum… p in pay for performance reviews and not just matching inflation rates. I love my job because of the environment but the less than stellar pay will eventually force me to look elsewhere for employment.",
        "pros": "We were bought out and joined a great company. They are generous with time off benefits snacks. As far as who we work with, we have a superb staff and a great team, we are still the same as far as being bought out till now. They haven't changed our culture they have added to it. I love this aspect.",
        "summary": "Great Benefits, Great people, Low wages",
        "role": "Content",
        "date": "Jan 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "What matters most is money in my paycheck. They told us they pay in the 60th percentile of other competitive positions. This is false, we are under the 50th percentile of others in our industry and management just tells us we aren't truely \"x\" position because we don't do what others do, knocking down our skills and saying we are paid competitively per the job we do.",
        "advice": "Don't advertise competitive pay and then justify why your position isn't as valued as others in your industry and therefore you are paid what you feel is the 60th percentile. Upon hearing this and then being disappointed by the reality of the adjusted offer letter where no one was increased in pay has been a haunting shadow lingering over our jobs. A lot of others feel this way, really hoping everyone gets a nice bum… p in pay for performance reviews and not just matching inflation rates. I love my job because of the environment but the less than stellar pay will eventually force me to look elsewhere for employment.",
        "pros": "We were bought out and joined a great company. They are generous with time off benefits snacks. As far as who we work with, we have a superb staff and a great team, we are still the same as far as being bought out till now. They haven't changed our culture they have added to it. I love this aspect.",
        "summary": "Great Benefits, Great people, Low wages",
        "role": "Content",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unless you have a certain personality, you're never going to fit in to management. I never really fit in. I never said the right things or hit it off with the right people.",
        "advice": "Seriously evaluate your managers and make sure the people on the fringes are being heard. Not everything has to be roses and unicorns.",
        "pros": "Benefits were great. Culture was great for awhile. Everyone seems happy. There's a lot of positive vibes. This declined over time.",
        "summary": "Decline",
        "role": "Global Customer Experience Advocate",
        "date": "Feb 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Limited Career Pathing, you're a little bit on your own",
        "advice": null,
        "pros": "Really good perks and benefits",
        "summary": "Great Place to work",
        "role": "Anonymous Employee",
        "date": "Mar 2, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Really variable hiring bar depending on the department. Incredibly slow to make hiring changes (ie let bad workers go) which can be toxic for working teams. Very metrics driven, sometimes to a fault.",
        "advice": "Better hiring bar for managers. Hire slow, fire fast.",
        "pros": "Lots of support for your professional development - it's very common for employees to change roles or teams over the course of their time there.",
        "summary": "Culture of growth but a slow-moving company",
        "role": "Anonymous Employee",
        "date": "Mar 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Team Moves incredibly slow (might not apply to everyone)Bad refresher stocksMaintenance mode developmentExtreme tech-debt was taking a huge toll on development.My team wasn't really exciting, and was mostly just maintaining the existing product. I felt like the engineers weren't given much freedom to design, as most of the time the architect would baby sit us.",
        "advice": "Trust your engineers. Let them work on fun projects. Encourage people to actually participate in inDays.",
        "pros": "Great Food, Coffee, Snacks, and PerksGreat initial offer and stockGreat 401k matchingInDay -- a Day a month to hack/or paint/or whatever.Overall a good environment with some intelligent engineers and awesome perks.",
        "summary": "Nice Perks",
        "role": "Software Engineer",
        "date": "Mar 21, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Slow growth, they still do not focus on develop new business",
        "advice": null,
        "pros": "Lots of chance work on challenging data problems",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Mar 27, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The company is becoming increasing susceptible to the usual problems of large companies: politics, flat-footedness, BS, etc. Growth prospects and company morale are currently low. Sadly, the company is a bit of a pseudo-meritocracy.",
        "advice": "Working at LinkedIn is no longer viewed as an exclusive privilege. Better start thinking about how to retain your talent pool.",
        "pros": "The company is known for its top-notch talent, high power work environment, high quality engineering infrastructure, and company pride (for now).",
        "summary": "Good talent pool; average comp and growth prospects.",
        "role": "Senior Software Engineer",
        "date": "Mar 31, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "in Competitive environment, fast pace,",
        "advice": null,
        "pros": "Lots of perks, good benefits",
        "summary": "Finance Manager",
        "role": "Anonymous Employee",
        "date": "Apr 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Bad management - lack of meaningful vision and too much micromanagment- Made an effort to recruit experienced individual contributors but not good at retaining them or using them well",
        "advice": "Stop promoting the bad management don't really deliver and also make their people unhappy. Be better at recognizing people who care about the company and the work. And by \"recognizing\" I don't just mean promotions or compensations.Build real trust, especially between team members and managers.",
        "pros": "- Good perks and continue to improve- Lead player in the space; interesting data to work with",
        "summary": "overall bad experience",
        "role": "Anonymous Employee",
        "date": "Apr 14, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Some ancient technologies and processes (SVN, JSPs, bad tooling, etc.). Getting code reviewed and deployed is a painful process. The tooling hinders more than it helps.Trying to become an \"engineering culture\" place, but isn't a technology company. This seems to be driven from management as opposed to from the ground-up, in an attempt to attract more Bay Area talent away from companies like Facebook and Googl… e.Current turbulence as large restructuring in departments occurs and the stock price has fallen over 50%, causing a pivot in business plans.",
        "advice": "If you truly wish to be \"member's first\", take a hard look at the dark patterns and the anti-member behavior/spam on the site and fix the experience. Stop gauging things off of b.s. metrics and figure out if the product has actual utility and how to enhance that.",
        "pros": "The pay and the benefits are nice.There's a pretty decent work-life balance (but can be bad, depending on the team).There are some genuinely smart people working there.There's a solid mission that I believe a few people actually believe in.",
        "summary": "Trying to be an engineering culture...",
        "role": "Senior UI Engineer",
        "date": "Apr 19, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Internal people within certain demographics are possible",
        "advice": null,
        "pros": "An off the shell company that is hyped up a lot",
        "summary": "Good if you are good",
        "role": "Senior Data Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Communication. Though there are a lot of meetings to keep the employee's well informed, but changes often come with little notice or no notice. There seems to be a big disconnect especially being an employee from the company acquired by LinkedIn. There is a lot of chaos and disorganization due to the constant change and staffing issues. Lots of hiring and lots of lay offs.",
        "advice": "Listen to the worker-bees. Communicate effectively and confirm that changes are effective. Waiting last minute to make major changes causes stress, increased workload and chaos.",
        "pros": "-Benefits-Perks-PTO-Casual Work Environment-PartiesLinkedIn does an excellent job with keeping their employees engaged with the perks, days off, cafeteria, etc. You don't see benefits as such elsewhere. They have a lot of perks that help the environment and are flexible with work/life balance ... for the most part.",
        "summary": "Great Company - Lack Communication",
        "role": "Administration",
        "date": "Jun 25, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The culture is very young (millennial). There is another review out there telling Gen Xers and baby boomers to stay away and it's unfortunate that the review is very accurate. They promote work life balance well but if you are older and have different outside of work challenges you may find yourself alone. The biggest non-work problems I heard were \"where to stay for Coachella?\" or \"have you eaten at xxxx in the City… ?\" or \"I didn't like the food today\"Again - great place to work IF you fit in.",
        "advice": "Not sure I have any. Management seems on the young side there - I guess - Keep up the good work?",
        "pros": "Culture of this company is amazing. Jeff Weiner has been able to grow a strong culture and values even at 9000+ employees. Benefits are better than even some of the best companies in the valley. Overall mission of creating economic opportunity is meaningful and you feel connected.",
        "summary": "Great place to work IF you fit in",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Politics politics politicsToo many people who would not pass the interview if they interviewed again- Too much talent dilutionToo many people with more clout than technical skill leading to bad decisionsCulture highly dependent on team",
        "advice": "Under-performing people need to be cut loose.Talk to your IC's instead of having them bubble up issues.",
        "pros": "Great payGreat benefitsInteresting problemsSome very very smart people",
        "summary": "Used to be great",
        "role": "Site Reliability Engineer",
        "date": "Jul 7, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "You really have to buy into the LinkedIn way. Most of the work force is very young and value inDays and outside activities over actually doing their work. Sometimes it's tough to get actual work done because everyone is so wrapped up in doing other things.",
        "advice": null,
        "pros": "Cool work environment, good pay.",
        "summary": "Senior Relationship Manager",
        "role": "Anonymous Employee",
        "date": "Jul 21, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The small company culture feeling is completely wiped out as we have grown so large in the last couple of years.",
        "advice": null,
        "pros": "Benefits continue to be amazing - summer and winter break, unlimited days off, gym membership, food and much more.",
        "summary": "Relationship Manager",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "inexperienced management, very little compassion and consideration for employee well being",
        "advice": "restructure management based on employee evaluations",
        "pros": "strengthen relationships with cross functional partners",
        "summary": "multimedia designer",
        "role": "Multimedia Designer",
        "date": "Aug 6, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Decision making is poor; you are asked for provide inputs , but generally decisions are already made.",
        "advice": "Focus on new employees when you on-board them and train them on culture and what to expect from them. Check why your most recent hires decides to leave early (less than 2 years)",
        "pros": "Good food, nice facilitiesMany new projects to work on",
        "summary": "Pros and Cons",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Frontline managers are often not equipped with the leadership skills needed to get the best out of people. Increasing focus on red tape (time tracking, budget restrictions, etc) as the company grows which can seem at odds with the core value of 'act like an owner'. Matrix org structure means there can be lots of of duplicated effort can make for frustration and confusion between various teams.Office culture -…  especially in sales - is focused on the under 30s crowd which can make it harder for older workers and those with families to feel at home.",
        "advice": "Free food and perks only go so far - focusing on manager effectiveness is key to retaining talent in the long term",
        "pros": "One of the world's best CEOs with an inspiring vision and authentic approach. Interesting products and smart, passionate, friendly people. Lots of opportunity if you are smart and a good networker. Great office facilities and benefits.",
        "summary": "Inspiring company experiencing some growing pains",
        "role": "Customer Success Manager",
        "date": "Aug 27, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Misalignment between overall company culture/values and what is actually managed down/the way people actually treat each other. Easy to plateau in most positions., even thought the work isn't always that challenging. Compensation is below market for most other tech companies in the Bay Area and you're not a \"cool\" or hot enough company to get away with that, sorry.",
        "advice": "Listen to your employees. Don't keep hiring the same type pf people over and over again - same goes for promoting the same employee type. The loudest voice isn't always the smartest or even hardest working (even if they proclaim they are over and over again).",
        "pros": "Flexible work hours, fun people (mostly hire young people, which can be a pro and a con), nice \"perks\" to incentivize people to stay, overall good culture.",
        "summary": "Lots of culture kool-aid, doesn't value employees as much as they say",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Unambitious in projects and hiring- Unambitious with overall company goals- A lot of upper management seemed like a large echo chamber. Big on phrases and methodology, small on execution and imagination.- Low salary for big tech co's",
        "advice": "Take risks. The company has done some excellent work in the past but now seems complacent in the marketplace. Try new ideas, have some failures and try to expand your market and your product to people outside those similar like your employees.",
        "pros": "- Great benefits- Brand name- Talented IC's- Your work has huge scale- Good company to learn communication practices and strategy",
        "summary": "Some good people but uninspired company.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They pay was promised at 20% over other people in the same position but it is not even close, we are one of the lowest paid.",
        "advice": "Dont lie to people, I was so severely discouraged by the promise to meet the industry median payscale and get us at 20% over then we were told no pay adjustment was needed.",
        "pros": "The people are great, the culture is really fun for a corporate environment.",
        "summary": "Low Pay",
        "role": "Video Editor",
        "date": "Sep 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work over time a lot",
        "advice": "Take your time and make sure we do necessary things",
        "pros": "great colleagues and great technology",
        "summary": "Work over time a lot",
        "role": "Anonymous Employee",
        "date": "Sep 27, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "* Too much internal politics - lack of cross-team camaraderie* Technology (Infrastructure groups) can tend to re-invent the wheel* Used to be a leader in open-source and on the cutting edge of technology. With the exception of work done in search (galene), kafka, and mobile, they have lost that edge. Little innovation still done.",
        "advice": null,
        "pros": "* Good benefits and compensation.",
        "summary": "Large company feel, too much internal politics, loss of innovative edge",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Starting to feel like a huge corporation with red-tape galore and HR hoops to jump through. Inability to be nimble and adapt to changes quickly.",
        "advice": "Employees are people, too. If you've hired someone, you've committed to them a certain level of effort and support.",
        "pros": "Amazing brand/name, great perks, people are generally smart and driven.",
        "summary": "Don't distract from challenges with perks",
        "role": "Anonymous Employee",
        "date": "Oct 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "fast paced life style good for younger",
        "advice": null,
        "pros": "Good work life balance, low stress",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unfortunately as we grew, the company started became riddled with politics. Countless number of folks \"resting and vesting\" and a very inept middle management layer that drove many great employees out of the company.",
        "advice": "Take your pulse survey seriously and get rid of all of the lazy, incompetent, jerks that are weighing the company down.",
        "pros": "Jeff Weiner is arguably one of the best CEOs in Silicon Valley and LinkedIn is very luck to have him. When I joined the company, it truly felt like a happy family and we were firing on all cylinders -- explosive growth, great products being launched, and stock price doing well. The perks were (and probably still are) amazing and I miss the awesome food and chair massages.",
        "summary": "Used to be a great company",
        "role": "Anonymous Employee",
        "date": "Oct 24, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Middle management is filled with kool-aid drinking sycophants- Incompetence gets rewarded while real talent is often overlooked because there's minimal accountability (see: employees are gold)- Some deadweight projects, teams and employees from earlier years staying around even though they contribute very little",
        "advice": "Tighten up the accountability, especially at lower levels. It's ok to admit mistakes and take proper steps to address the structural issues that have caused them.",
        "pros": "- Some of the smartest people I've worked with at every level, in every job function. People are motivated.- Amazing benefits, treats employees like gold- Always moving and changing things up (though at differing paces; may be pro and con)- Has come a long way in undoing legacy bad practices from its startup days",
        "summary": "Luck of the Draw",
        "role": "Software Engineer",
        "date": "Nov 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lack of delivery focus",
        "advice": "Reward the best and not the most political ones",
        "pros": "Compensation, benefits, perks, freedom and flexibility, nice people",
        "summary": "Director Operations",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Never get too comfortable with anyone in a leadership position. You can think that you are best friends, and that they really like and respect you; then turn on you on a dime.",
        "advice": "Stop pretending to embrace the supposed \"Culture and Values\" when you know that you will do whatever is in your best interest; even if it means terminating your most valuable, and highly productive employees.",
        "pros": "All the regular perks of a tech company - unlimited paid vacation, in addition to 1 week paid time off over Christmas, as well as July 4th. Free food, snacks, drinks. Casual atmosphere - you can wear pretty much anything you want. Full of tattoos and piercings? They embrace that.",
        "summary": "Awesome Place to Work, but be prepared to be suddenly let go - even if you are the top performer on your team",
        "role": "Anonymous Employee",
        "date": "Dec 7, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "work life balance can be issue",
        "advice": "keep up great work",
        "pros": "great work environment, smart people",
        "summary": "HR",
        "role": "Human Resources",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "stress is there every where so keep on doing it.",
        "advice": "work well on the projects",
        "pros": "good place to work in this place",
        "summary": "ok ok in the internet world",
        "role": "Anonymous Employee",
        "date": "Feb 3, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "I don't feel like much pride is taken in the work being done there. They don't put enough effort toward getting things right and fighting for the user. It seems like the business objectives come first, not the user/consumer.",
        "advice": "The product is good, but not great. It can definitely use improvement. Also, the stack still needs improvement too. It still takes too long to get something done. Great job with the culture though. It's a fun place to work.",
        "pros": "LinkedIn is definitely better than most places. It's a lot of fun, and the people are really nice.",
        "summary": "A fun place to work.",
        "role": "Senior Web Developer",
        "date": "Jun 27, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lots of Kool-Aid, everyone thinks they are changing the world (it gets old,) and it is extremely political, make sure you have an internal sage/mentor",
        "advice": null,
        "pros": "Great Benefits, fun atmosphere, casual dress",
        "summary": "Great Company, Very Political",
        "role": "Anonymous Employee",
        "date": "Nov 13, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "--Product mgmt has culture of entitlement and think \"if we build it they will come/use\"--Middle management is inexperienced and immature--Fast decision making--No cafeteria--Send more email is the accepted answer to nearly every product issue--Too much data to make sense out of",
        "advice": "--Stop sending so many emails to customers--Hire strategic thinkers and good people managers for the Director role--Stop hiring so many \"young guns\" who manage by HBS textbook cases but have no real experience",
        "pros": "--Lots of autonomy--Visibility with senior leaders is high--Trusts employees to make right decisions--Fast decision making--Lots of data",
        "summary": "Better from the outside",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Super political. Not about being good, but how much you suck up or fake it.Not a good place for sales people. Maybe for 1-2 years to get some experience and then go where you will not have to listen to BS.",
        "advice": "If less than 1 percent make it to Club, then management should take responsibility.Stop trying \"to sell\" your employees the \"open and honest\" culture, when no one wants to hear about what is not working. Again if nobody hits their targets, then something is wrong.",
        "pros": "Free Food. Mostly very nice people.",
        "summary": "Not that good.",
        "role": "Sales",
        "date": "Aug 24, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Let me repeat what I said at the start. LinkedIn US is a great place to be. I have worked at LinkedIn Dublin and that's a total different story. Here is why I left Linkedin Dublin:A cult like culture that nobody really likes and wants to admit. There is too much B.S. and empty buzzwords. For example as a sales rep they say you're evaluated on \"leadership, leverage, results\". That is a lie. When it comes to th… e evaluations they only look at results.Horrible sales territory. Linkedin is good at over hiring for specific countries because they know that certain individual sales reps will never make their quota.Ridiculous sales targets. As inside sales you have to bring in way over half a million dollar.The relationship with the field sales reps is close to hatred. Field reps stealing your accounts is a normal thing. And the worst part is that your managers in Dublin don't do anything about it.The field sales reps are generally of a lower quality than the inside sales people because Linkedin does not have a strong employer brand in most European countries outside of the UK.And in general senior leadership in Dublin is of a very poor quality.",
        "advice": "1. Be honest. Cut the B.S. and tell sales people that it's about the numbers.2. Next time negotiate a better deal when it comes to sales territories.3. Be honest, I have to repeat this one. There is too much political nonsense in this office. Managers repeat buzzwords without even knowing what they mean.",
        "pros": "LinkedIn as a company is a good place to be. Especially if you work in the US because you're close to the real leaders and the market is much more developed and open to your services.I have worked at LinkedIn Dublin and that's a total different story. The positive side of LinkedIn Dublin:Initially they could hire the best of the best. So real smart people to work with and learn from. However, this is chan… ging as a lot of good people have left and the company is getting a bad reputation as an employer.Another plus is the free food. It's really good food.And there is a decent onsite gym you can use. I like it.",
        "summary": "Avoid LinkedIn Dublin",
        "role": "Account Executive",
        "date": "Oct 6, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Work-life balance, compensation good but not fairly distributed, politics, politics, politics.",
        "advice": "Please don't be fooled by attempts to paint a rosy picture when employees really want to be heard, and not in front of their direct managers.",
        "pros": "Like most employees I do love working with LinkedIn, but it saddens us to watch the organisation's cultural values of integrity and flat hierarchy succumb to internal politics. A prime example is the recent flood of over-enthusiastic reviews here on Glassdoor, all posted within the space of a few days, following some very negative reviews just before the month of October. Convenient... When CEO Jeff Weiner, highly re… garded by all employees, visited the offices, the entire building was repainted, cleaned and employees were told not to approach him personally and any questions were vetted beforehand.Working at LinkedIn is exciting and challenging, but you will be putting in the hours.Your salary won't reflect your skills, only which territory you happen to be stuck with. This sadly cost us some valuable team members. Out of a team of exceptional, stellar sales people, perhaps 10% can expect to hit annual target.There are some fantastic perks, like free food, entertainment etc, and you are almost guaranteed a great career post LinkedIn, but we'd love to see some changes put in place soon.",
        "summary": "Politics, politics",
        "role": "Sales SMB",
        "date": "Oct 17, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Having the feeling you should feel fortunate to work for LinkedIn. Sometimes too cultish, and what you were sold at induction wasn't what you got when returning to work at your respective office. Sold a great work/life balance; certainly didn't get it.",
        "advice": "Don't get too caught up in processes and corporate speak. Improve internal systems to track leads, and ensure campaigns are sent to the appropriate contacts in the database. Lots of elementary mistakes made!",
        "pros": "Ample opportunities to grow within the organisation if you are ambitious",
        "summary": "Don't believe the hype",
        "role": "Marketing",
        "date": "Jan 11, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "targets in sales not adapted to the territory. Management too much focus on figures but some territories involve much education for free. Figures don't reflect the work done- emerging markets and mature markets shouldn't be considered as the same",
        "advice": "Look more at the global picture. If nobody in a same team reach his targets perhaps smethink needs to be changed or considered. Europe is not ONE single country. The specifities have to be taken more in consideration.The US are not the world and UK is not Europe.",
        "pros": "free food, gym, flexibility- growing fast-innovator products",
        "summary": "All depends on your position and territory",
        "role": "SMB Account Executive",
        "date": "May 26, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "targets in sales not adapted to the territory. Management too much focus on figures but some territories involve much education for free. Figures don't reflect the work done- emerging markets and mature markets shouldn't be considered as the same",
        "advice": "Look more at the global picture. If nobody in a same team reach his targets perhaps smethink needs to be changed or considered. Europe is not ONE single country. The specifities have to be taken more in consideration.The US are not the world and UK is not Europe.",
        "pros": "free food, gym, flexibility- growing fast-innovator products",
        "summary": "All depends on your position and territory",
        "role": "SMB Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Workload expectation were excessively heavy. Consensus was, you were expected to work beyond your contracted hours. leaving on time at the end of the day was frowned upon, even when you'd managed your workload. Repeatedly extending work hours beyond your contract actually dilutes your equivalent hourly pay significantly. Living to work instead of working to live is not for everyone. I've seen hardcore workaholics thr… ow in the towel there for that very reason.",
        "advice": "LinkedIn specialises in recruitment and takes pride in tempting happy workers away from other corporations. The company makes a mockery of this by having a high turnover of staff and often neglecting to keep hold of valued personnel and keep them happy. Work-life balance is important to most people, LinkedIn managers who don't respect that are severely undermining the reputation of an amazing company.",
        "pros": "Prestigious company and leaders in their field. It's hard to get your foot in the door but well worth it, even for a short period, because you'll learn a lot and it looks great on your CV. Excellent pay. Global opportunities to work out of offices abroad, even temporarily if your job allows. All meals, drinks and snacks are free. Great social activities. High calibre staff. If you have a great manager then you'll pos… sibly be there a very long time.",
        "summary": "Amazing Company - Excessive Workload - Extended Hours",
        "role": "Campaign Manager",
        "date": "Oct 8, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "My previous review was totally different, the company has changed.LTS sales in certain regions may struggle in terms of career growth, and you are expected to do much more with limited resource support.LinkedIn is never lacking of talent in sales field because of its strong employer branding. Getting talents is easy for LinkedIn, If you are seeing a job being posted for a while and not filled, it only…  indicates the position is not urgent, recruiter doing pipeline or hiring manager is fussy.LinkedIn treats sales well with benefits but the growth opportunities are limited. During interviews you will be told stories like internal promotion or so-called \"transformation\", probably also \"young, energetic employees's fast growth\". Such chances happening lesser and lesser, although the company is growing quickly, most hiring managers prefer to give opportunity to candidates with more years of work experience or MBAs, rather than providing chance to internals who want to learn and grow. I did not see many promotions and transformations happened - comparing with a few years ago the company is no longer flexible in terms of giving internals opportunities.If you are about to get an offer from LinkedIn as sales, ask recruiter the following questions:- what is my level? (In certain regions, they lower your rank and even you are experienced sales, you may find your level is the same as junior sales in US who only has 3-4 years of working experience) - this impacts your internal opportunity and future growth path.- what is the expected growth for my territory? Besides the effort I am putting to grow revenue, what are the supports coming from LinkedIn to help the territory grow in order to achieve the desired result?- Is my quota or account growth ratio reasonably linked with the market situation?- how many people in my team are making number?- in the past 6-12 months, how many people in this team had been promoted or having a career transformation?",
        "advice": "Senior management: the company is losing the its \"start-up culture\",More management layers being added and I don't remember when was the last time have a skip-level meeting. The company is getting more political. Please, suggest giving more opportunities to internals and make that happen, the emails from top management are encouraging but there are many barriers for internal growth.Middle management: most of … them lacking of product knowledge and only able to talk at high level. Understanding the product's pros and cons are key to coach front line sales. Please be \"people manager\" and start to spend sometime with the individuals in the front line team.LinkedIn is lacking of appreciation, and employees don't really get a sincere \"thank you\" from the senior management.In the recent 12 months, I witnessed more cases that hiring managers do not pay respect to both internal and external candidates.",
        "pros": "worklife balance; people are inspired to work; fantastic office; good health & wellness benefits; line managers are caring and supportive; good collaboration within team; great product",
        "summary": "Still OK but losing its core value",
        "role": "Talent Solution Sales",
        "date": "Dec 5, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Way too many layers of management, most of which are pretty weak brown nosing culture puking yes men. Too much propaganda about being entrepreneurial when in reality they are NOT. Product management is weak. They don't actually innovate anything, they just fast follow.",
        "advice": "Streamline your offering and dump almost all of the online sku'sStop using LinkedIn lingo and start using customer lingoStop promoting based on culture and start to look at talentMake your products easier for your members to understand",
        "pros": "Access to really sexy data, great brand in the market, no legit competitor",
        "summary": "Middle Management Sucks",
        "role": "Global Account Manager",
        "date": "Dec 30, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unfortunately as the company grows, middle management are rife with ego and thoughts are focused on building mini empires. This is diluting the amazing culture that once was and is turning into a bureaucratic machine that has lost its startup culture.",
        "advice": "Pay close attention to the politics in EMEA offices. You are losing top talent which are being replaced by drones and \"yes men\"",
        "pros": "Excellent communication from leadership, strong vision and genuine attempts to change the worlds economy by opening up connections and providing education to advance ones career.",
        "summary": "Great Vision with mediocre middle managers",
        "role": "Anonymous Employee",
        "date": "Jun 5, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "A very young workforce. A lot of 20 something year olds who are in their 1st job and completely lost in wonderland. all fun all day, sometimes childish. They take everything for granted and will have a wake up call when they work for a non internet company. The culture is a bit creepy as you can read in many reviews, but its true. They keep expressing they are a start-up, but they have been around for 13 years! and t… hey use too many buzzwords. hyper growth, leverage, leadership. Not surprised the company is not making any money. They have their employees focus on side projects which have nothing to do with work, but show ' leadership'. They take out an entire day per month for that. If you are a client, dont expect anything done until next week.Furthermore the only good place is talent solutions, this is the only product that works and where the money is made for the company and for the sales reps.. the other divisions have often people with limited knowledge combined with arrogance, especially outside of the Dublin office (e.g. London, Amsterdam, Paris). Last but not least, their processes and internal systems are extremely slow and can be a real showstopper for clients and will give sales teams headaches.",
        "advice": "Hire less people straight out of university. Yes, the sales development team is an important team, but the canteen looks like your average uni. Drop the buzzwords. Hyper growth is not true and almost sounds like an 80's term.We all know that members sign up, but they dont use the platform as much as you would like them too. So growth is relative.",
        "pros": "Well known brand, company benefits, the product itself.",
        "summary": "OK place for a starter",
        "role": "Anonymous Employee",
        "date": "Jul 13, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Micro management in sales which is very draining, no manager support, many bosses but no leaders. All buzzwords to give false sense of reality. High turn over of staff in sales, constant hiring and firing creates uncertainty of career progression. Managers are more concerned about their progression rather than their teams and will often take credit for your work. Hair loss and contact glasses for anyone who manages t… o make it past 12 months",
        "advice": "Stop pretending everybody is happy and actually address issues. Why ask colleagues for manager Survey when they risk getting fired for it.",
        "pros": "Free Food, interesting colleagues, lots of travel and training in sales. Lot's of activities and events to take part in.",
        "summary": "Very Political and un realistic targets for different markets especially in Sales solutions",
        "role": "Account Executive",
        "date": "Aug 10, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Career opportunities limited, startup feel going",
        "advice": "Stick to the basics",
        "pros": "Great culture, people, ethics, vision",
        "summary": "Head",
        "role": "Anonymous Employee",
        "date": "Oct 21, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Everyone is overworked. Little flexibility with home working - so even if you work hard managers expect you to be in the office at all hours. Frowned upon to leave at six. Lots of people seem to leave when pregnant or sick as it's not a supportive environment.",
        "advice": "To keep people working hard with passion allow more flexibility.",
        "pros": "Great perks, lovely people! Interesting work and travel to great places.",
        "summary": "There's work to do to make it a better environment",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Low base salary in comparison to other tech vendorsOriginally a great start up culture with a can do attitude, but now extremely restricted due to rigid corporate structures. After 4 years, hearing alot of \"thats not my job\" commentary",
        "advice": "Hiring so many mangers from large structured corporates will in fact impact on the organisation and overall culture, encouraging micro management styles to be the norm.Introduce pyschometric assessments into hiring to test for personality personas",
        "pros": "Great technology enabled business to deliver round sales goalsSmart people",
        "summary": "Sales Manager",
        "role": "Regional Sales Manager",
        "date": "Nov 13, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management, Politics, Loosing the start up charm, .....................................................................",
        "advice": null,
        "pros": "Culture, Team, Stock, Colleagues, Diversity - All great",
        "summary": "Z",
        "role": "Operations Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Long working hours- a lot of politics- they say a value is open honest ocnstructive - but that is not hte case",
        "advice": "More visibility on what is going on not just saying things for show.",
        "pros": "- Opportunity to learn- Nice colleagues- Comfortable working environment",
        "summary": "Customer Success Manager",
        "role": "Anonymous Employee",
        "date": "Jan 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Over 3 years with LinkedIn and the company has transformed from its start up vibe to a big corporation. Bad work life balance and new managers with lack of compassion and empathy. If sick or pregnant you struggle.",
        "advice": "Emotional intelligence is more important than anything else in middle management. Support counts when things get tough, not when everything is smooth.",
        "pros": "Opportunities to learn and expand your career if you are willing to overwork yourself.",
        "summary": "Great company, average middle management",
        "role": "Anonymous Employee",
        "date": "Jan 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "US location gets more priority.",
        "advice": "Nothing.",
        "pros": "Awesome place to work for.",
        "summary": "Good work life balance",
        "role": "Anonymous Employee",
        "date": "Jan 31, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "India Sales leadership (talent solutions) does not have a vision or at least is not getting percolated . Too many leaders churned in last few months & senior resources also are not cared for.This is the thing with new age companies Talent is not cared for as they will always have pipeline of talent ready to take over!",
        "advice": null,
        "pros": "1 Lots of freedom to practice your work2 Great minds to work with3 Free food,gym,pick up drop et all!",
        "summary": "Account Manager",
        "role": "Sales Manager",
        "date": "Jun 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "lower salaries than industry standard",
        "advice": null,
        "pros": "CulturePerks (onsite gym, medical insurance, free meals)",
        "summary": "LinkedIn",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Overly consultative environment, very flat Organisation and slow decision making can cause frustrations in timeliness to act. Very US centric model which can make localisation a challenge",
        "advice": null,
        "pros": "Culture is amazing - people like coming to work and are smart, motivated and engaged. Benefits are also very strong - gym, food etc",
        "summary": "Great company to work for - wonderful people and culture!",
        "role": "Manager",
        "date": "Jul 15, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Pay increases and promotions are not regular. Lower salaries than industry standard",
        "advice": null,
        "pros": "Good benefits, gym facilities and classes. Diverse culture and like minded employees. Flexible and autonomous working.",
        "summary": "Ad Operations",
        "role": "Ad Operations",
        "date": "Jul 28, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The really good people are now leaving for Stripe or Slack or Airbnb.Little focus on career development.The managers that are succeeding are the usual crowd of unscrupulous self-obsessed manipulators. No-one seems to check that their teams are suffering.Not a lot of training/development opportunities.OKR system doesn't work - it's done very differently depending on your manager.",
        "advice": "Instead of just watching your back and pushing for your own promotions, focus on being an inspiring leader. Stop acting paranoid and afraid all the time.People coming from SalesForce are eroding the good LinkedIn culture and values, I've often heard them them smirking about how they think it's just silly and in SalesForce it was tough but real.",
        "pros": "On-site gym, free breakfast/lunch, nice colleagues. Work is simple but there is a large amount of it.",
        "summary": "Good Benefits but Headless Chicken Management Plans",
        "role": "Customer Success Manager",
        "date": "Aug 27, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The cons are based around the role and day to day management. I like to work with integrity - doing the right thing when no one is looking. Right now my team is being encouraged to do the wrong thing, and everyone is looking! Weird right? Well if you want to go to a job where it's all about box-ticking and no one looks at what you're doing, then this role is for you. Only count on your base pay though, because commis… sion is hard to get with the compensation structure.",
        "advice": "Stop celebrating 'fake wins', your teams reputation depends on it. Your employees are not proud of their achievements because you are too busy celebrating things that look good, as opposed to celebrating hard work and meaningful customer interactions - we are all cringing. Try to replace your team full of brains with robots if you plan continue the same way.",
        "pros": "Great office, great company perks, fantastic international feel in the Dublin office - my colleagues are what make my day. I love our vision, our products are super and there is definitely more space to make things better which promises a nice future even with Microsoft.",
        "summary": "Customer Success Manager",
        "role": "Customer Success Manager",
        "date": "Aug 30, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "High sales pressureRegular process and structure changes can be frustrating",
        "advice": null,
        "pros": "Product roadmapBenifits, talent is really #1 priorityPeople",
        "summary": "Sales",
        "role": "Sales Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not always practice what they preach",
        "advice": "Treat all people fairly, be consistent, implement your culture and values across the board and not just in some cities",
        "pros": "Great company to work with, very young, fresh and new perspective.",
        "summary": "Great company-but a little too picture perfect",
        "role": "Manager",
        "date": "Oct 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "1. Worst management, especially in a team called \"GCO\"2. Employees are treated worse than slaves3. Talent is the least thing recognized4. Micromanagement and favoritism makes GCO the worst team to work with5. No Exit interviews conducted to understand why an employee left",
        "advice": "Please grow up and understand the so called \"LINKEDIN VALUES\"",
        "pros": "1. Wonderful ambience2. Great food3. Great facilities that includes food, cabs, timings, compensation and benefits, fitness programs, parties, to name a few.4. Young and energetic crowd5. Most of all, the BRAND!",
        "summary": "Management needs to act Humane",
        "role": "Enterprise Support Specialist",
        "date": "Nov 9, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "MS takeover was badly handled.",
        "advice": "Keep shareholders informed",
        "pros": "Great and ambitious company with nice outlook",
        "summary": "Too many changes",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "They hired managers and leadership from call centres for the Dublin office and this has a direct impact on how the Dublin operation is run. They aim to standardise everything from how 1-2-1's are run to when to have sales meetings to how to basically speak and think. LinkedIn Dublin is not the same company as LinkedIn outside of Dublin is anymore.",
        "advice": "It's ok to have your own thoughts. It's ok to challenge certain ways of doing things and it's ok to put your personal spin on your teams.",
        "pros": "Has the potential to be a great company (the great company it once was)",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Quite number driven & internal politics",
        "advice": null,
        "pros": "Amazing company culture & strong platform",
        "summary": "Manager - Corporate Sales",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "This is gonna be very huge:I truly respect Jeff and his Team, but not the managers in Bangalore location. GCO is the worst group to be a part of. You will need to kill you self-respect in order work in GCO. The company has very good values, but no one follows them. During the skip level meetings with HR and Directors, they would ask us to be open, but when you give open feedback, you'll be under the worst man… ager's radar. You will be targeted all the time. I've seen a lot of good people leaving the company because of the managers, and their worst behavior.There are a lot of gossip mongers on the floor, and if someone doesn't like you, you will be unnecessarily have to face the consequences. In fact, I was one of the victims. My manager has ruined my career, and forced me to resign. I tried escalating this issue to Akshay, but I thought not to waste my time because people doesn't know the meaning of honesty. There was no exit interview. If your manager doesn't like you, you will be treated very badly at the time of exiting the company. I was humiliated too on my last working day.My manager who has ruined many lives is still in LinkedIn, and leading a bunch of inefficient people. People has no guts to complaint against her.Jeff, please save the sold talent which is wrong hands in Bangalore.The close associates of director, and the managers would get promoted. It is not a place for talent.",
        "advice": "Stop the politics!",
        "pros": "During the initial days, the company was awesome. Everyone in the company used to be very good.",
        "summary": "Customer Advocate - GCO",
        "role": "Customer Advocate",
        "date": "Dec 7, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No quality check on managers & some should not be in the position. Poor leadership & lack of change to address a big issue occurring globally.High turnover due to managers, HR aware but often ignore the issue, creating frustration in the teams. It can be political & often the best people are overlooked in favor of someone aligned to managers. Workload & collaboration a constant issue that is always re… ported as priority in employee voice survey but mostly ignored. Lack of career progression.",
        "advice": "listen and action the employee voice survey for reoccurring issues that come up ever year. Create trust again by actioning known & reported issues. Remove politics",
        "pros": "growth & international opportunity (vertical transfer), great products (in some business lines) fun environment and lots of perks like gym , food etc",
        "summary": "Good & Bad, not the company it once was",
        "role": "Sales",
        "date": "Dec 12, 2016",
        "is_current": false
    }
]