[
    {
        "rating": 1,
        "cons": "For a small company, it's highly political. It contradicts itself on several levels:1. By claiming to hire the best, but it hires incompetent leaders (especially middle management) and keeps legacy poor performers who are in the wrong roles (a.k.a., the Peter Principle).2. There is further hypocracy by not abiding by its values. It has become too layered with management that is inaccessible and won't shar… e information.3. It claims to be a global company, yet it mandates that in order to have any career path, you must be at the HQ in Mountain View. Exceptions are made to certain telecommuters on a hush-hush basis--but not to others--therefore creating unfair practices. As an internet company in this century, I would expect more flexibility in order to retain and attract employees.4. Benefits are marginal at best for an internet company trying to compete against the big boys. You may as well work at a bank.5. Wants to be a big player and has the attitude of its neighbor, but it is not implementing practices to compete.6. It's impossible to have a career path at LinkedIn when they have poor management, poor communication, and oversight of great talent.",
        "advice": "-Have 360, anonymous, and skip-level reviews to uncover those who are ineffective.-As a global company, be more innovative with work-life balance issues by openly allowing for telecommuters and opportunities for those who don't reside in the SF Bay Area who can't relocate. Be consistent with this practice since there are exceptions within the company and that's unfair.-Learn from your neighbors in Mountain Vi… ew and Palo Alto about how to be innovative with compensation, flexibility, and career paths.-Don't profess to hire the best when you haven't.-Practice what you preach and walk the talk.",
        "pros": "LinkedIn has an awesome brand with the potential to be a great company and a market leader. There are slivers of very smart people. The products are cool.",
        "summary": "Don't expect to transform your career at LinkedIn",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Cult-like leader and followersSenior management just riding out vestingMajor politics - hard to get anything doneNut jobs at the helm with little to no experience leadingRanks filled with B players who think they are A players (umm, A players go to Google)",
        "advice": "do some work other than politics with people as pawns. you make too much money to do nothing",
        "pros": "few and far between, frankly, can't think of any",
        "summary": "Horrible - the place is filled to the brim with nut jobs",
        "role": "Manager",
        "date": "Oct 15, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Arrogant staff doesn't even begin to cover the stuck up attitude of the team. They are so busy standing up in meetings to tell the managers how much they love working there, that any constructive criticism is seen as heresy, unappreciated and not reviewed seriously. The staff is not nice in general selfish environment that has snowballed to be that way by the snarky managers.There's a handful of senior level … team members that think it's funny to 'haze' new hires by not acknowledging their existence for their first 2 months. They tweet cruel comments about the other staff members. They also tell other team members when individuals are put on performance improvement plans. So these bad apples ruin it for the rest of the team. Many other team members simply aren't interested in getting to know you or anyone else new or not because it doesn't serve their bottom line. For a sales team, it's funny there's no camaraderie or even general warmth. When you have a company that preaches culture, but management participates in no actual way to improve it and the foot soldiers are destroying it, the decay of morale begins.Little to no training; it's sink or swim and they like it that way. So longer term employees have to pitch in and take time out to aid the same questions over and over because newbies get no overviews. In reality, it does not set one up as a new hire nor as a senior member as it's time consuming. It creates a hostile workplace where it's a weakness to ask questions and seek advice on improvement and there's nothing in it for senior team members as its not their job. One would normally direct them to their managers, but that's if you actually get time with your manager. They are usually in meetings or traveling so good luck.Not competitive compensation in comparison to other bay area .coms.",
        "advice": "Airing the failures of the other team members (even in confidence) means you're airing my business to others too. I don't trust you.\"Keep doing what you're doing.\" is not constructive. Be specific about what is going right, what can be improved, and measurable ways one can improve.When people are speaking to you,actually look at them and listen--put the iphone down. If you ask them a question, listen … to their answer because chances are I don't have your undivided attention and it's demoralizing to to not even be given the respect of eye contact especially in a one on one meeting.Don't allow toxic individuals to infect the staff with negativity--even if they are top performers.",
        "pros": "Snacks and meals providedGood locations world wideBrand Recognizably",
        "summary": "Don't believe the hype!",
        "role": "Account Executive",
        "date": "Jan 20, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Bad IT management, poor coordination with other IT Departments. The left hand doesn't know what the right hand is doing and blame often ends in the wrong area.",
        "advice": "IT VP - Do you really think you know what's going on? Hold Team base Skip reviews or individual ones. Don't think people would really tell a VP the truth for fear of losing their job being honest.",
        "pros": "People- non managers are great smart and fun to work with.",
        "summary": "Miserable IT Department",
        "role": "IT-",
        "date": "Apr 2, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "My manager asked me to notify them in advance if I would intend to leave. I gave a 6 weeks notice and asked them if I could use a part of that time for the parental leave. They terminated my employment immediately. The manager told me the reason of the early exit was that I'm going to work for their major competitor. It seems some people had brought Yahoo's worst practices to LinkedIn. Now I'm feeling stupid of givin… g an early notice",
        "advice": null,
        "pros": "It used to be a great company, where we had to deal with fascinating search and analytics challenges. After IPO lots of talented engineers and managers has left, making the whole environment much worse",
        "summary": "Be careful with the resignation notice",
        "role": "Software Engineering",
        "date": "May 15, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Complete Circus like atmosphere....Management is way to inexperienced to even manage a McDonalds, and seemingly more concerned about them selves rather than their team. People kiss up like I have never seen...its comical. Very transactional sale, not the place to go if you want to blow it out...you just play the game and you will be average at best.",
        "advice": "Wake up, there is a real world out there! If you dont want to understand how to listen to whats wrong, then dont preach \"open and honest\" communication. I feel for those that get suckered into this \"cult-like\" culture. Not ready for prime time..(especially in the enterprise)",
        "pros": "Free food.One day a month off (\"In Day\")Everyone thinks its \"cool\" that you worked at Linkedin...(ha)",
        "summary": "If your a seasoned Sales person.....take Linkedin OFF your list..",
        "role": "Sales",
        "date": "Aug 7, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Super political..culture of kiss up.Middle management couldnt manage a mcdonalds.Cult like vibe...Very transactional sale. a 40k deal is HUGE in the Linkedin World.",
        "advice": "Wont do any good...they live in dream land. The ONLY people that are making money are those that joined pre IPO.",
        "pros": "Free foodWhen folks find out you work at Linkedin they are jealous.",
        "summary": "If your a real sales person, this is not the place for you.",
        "role": "Sales Solutions",
        "date": "Nov 4, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Employees are not promoted based on performance, but rather based on how well they are able to brown nose and become managers favorites. I have consistently performed and reached around 130% or more of my quarterly goals, and yet my manager has consistently given me negative feedback and held me down from a promotion (NO ONE is able to be promoted unless their manager gives their approval).The company does a … very good job making sure the first couple months employees are shown what an amazing company they are working for, but the moral and happiness of employees who have been here for 9 months or longer is INCREDIBLY low and the turnover rate is high (management does a great job keeping this out of the media's attention).The career trajectory is very poor for certain business lines as well.",
        "advice": "Listen to the advice your employees are giving you, and promote employees on a performance based metric rather than their ability to brown nose and kiss up to their managers; this will not only help the company retain talent and increase the satisfaction of the workforce but also make the company more productive.",
        "pros": "Great team members. A very young and lively workforce that are a lot of fun to work with. The office location in San Francisco is terrific as well, right in the middle of downtown and has the hustle and bustle of downtown SF. Great location right by the Montgomery Bart Station as well. The office is very nice as well.",
        "summary": "Not What They Make It Seem",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Base salary is low.When I joined this company two years back it has the good Developer and QA ratio. Now the developers has tripled and never hired any QA in my team.There is no scope for learning new technologies.Work-life balance is very bad due to daily regressions and frequent Production releases.",
        "advice": null,
        "pros": "Good benefits and perks.Lot of free food.There are good entertainments but you cannot participate due to the work load.",
        "summary": "Not a good company for a QA Engineer",
        "role": "Senior QA Engineer",
        "date": "Mar 23, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Garbage projects. Unfair promotions. Can't gain any skill. Irresponsible mangers and co-workers. People who stay in the company like easy jobs, not seeking any challenges. awful place for engineers.",
        "advice": null,
        "pros": "Options which I got before IPO. So people leave after their options are vested for 4 years.",
        "summary": "Smart people left, are leaving. The worst company for engineers.",
        "role": "Senior Software Engineer",
        "date": "May 31, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Incompetent management, no direction, political decision making, who you know makes your career, not a performance based place-you can be fired on a whim",
        "advice": "Fire the senior leadership of workplace",
        "pros": "Pay is competitive, food is free, you can play games at work, even drink beer, if you like long hours for not even a pat on the back, you will love it",
        "summary": "Roller coaster ride",
        "role": "Senior Project Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Chaotic mid-management- Lack of diversity, majority is asian- Dishonesty is encouraged- Member information is available to any employee",
        "advice": "Get rid of current mid-management and hire more mature people, you can afford it now",
        "pros": "The salary and benefits are above the industry average and that's about it.",
        "summary": "Chaotic management and not much diversity",
        "role": "Senior Software Engineer",
        "date": "Mar 6, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Too much office politics, rude management and peers. Now it is just a big company with poor quality people.",
        "advice": null,
        "pros": "Honestly I don't think there are any. Food maybe.",
        "summary": "Working at LinkedIn",
        "role": "Anonymous Employee",
        "date": "Apr 3, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I worked here as an intern for two summers, as well as a contractor, and also offered a full-time position, which I accepted. I was supposed to graduate in summer of 2013 and start work shortly thereafter. However, I've been a long time sufferer of depression, anxiety, and insomnia. I missed my summer graduation date and instead graduated in December of that year, due to my health issues. I informed my former boss ab… out my health issues, at which point he reduced my illness to being \"sad\" (demonstrating a complete lack of understanding of depression) and then proceeded to tell me that my full-time offer was rescinded.This company encourages a lot of physical health, and will even have pee color charts hanging in the bathrooms to tell you what healthy pee should look like, but does ABSOLUTELY NOTHING to help with mental health (unlike Google, which has programs specifically for mental health, because unlike LinkedIn, they actually understand the importance of mental health). I still have friends that work at LinkedIn, and they inform me that they are STILL doing nothing to this very day to assist with mental health.This is a company that will pepper you with gifts, treat you like a king, and make you feel like a part of the family, until you share that you have mental illness. I literally got care packages sent to my home while in school, with hot cocoa and LinkedIn travel mugs and sweatshirts and other absurdities. This company understands how to basically mess with your mind, but not help it.If you are a software engineer, and you have mental illnesses (you probably do, we're a wacky bunch), do NOT work for this company. They won't help you, and they will just kick you to the curb if you let them know of your situation. Go work for Google instead, since they actually help you AND understand your mental health issues.This company made me learn that honesty is really not the best policy. Thanks for that, LinkedIn.TL;DR: Company treats you like a king until you show mental health problems, they do nothing to help those mental health problems, and instead kick you to the curb. Do not invest your talents here, go to Google or Twitter or anywhere else, really.",
        "advice": "Don't treat your employees with mental health problems like they're broken pieces of garbage. HELP THEM.",
        "pros": "Honestly, the cons absolutely outweigh any of the pros. Read my cons section further to gain insight into this. They give you a great salary, flexible work hours, and they feed you, but it means nothing if in the end, they kick you to the curb for having depression.",
        "summary": "Don't work here if you have any mental illnesses",
        "role": "Anonymous Employee",
        "date": "Jul 30, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Un-achievable revenue expectations to please the stock exchange. These are only reachable through questionable deal practices and stabbing colleagues from other offices in the back.",
        "advice": "You aren't a start-up. Stop claiming that to excuse all of your missteps and abuses of employees.",
        "pros": "Free food and more t-shirts than any person would ever want. In exchange, you must give up your life, your family and personal well-being. PR and HR do a terrific job forcing employees to write positive reviews and augment the CEO's support rate to push down and hide the truthful not so lovely ones.",
        "summary": "Don't be blinded by the logo - Terrible Place to Work",
        "role": "Anonymous Employee",
        "date": "Nov 13, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The company has grown fast and will probably continue to. That means constant change to everything.",
        "advice": null,
        "pros": "The company culture is fantastic, the work is interesting, and the benefits are unreal.",
        "summary": "Fantastic place to work!",
        "role": "Anonymous Employee",
        "date": "Jan 2, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No room for growth. The goals for gaining a promotion are inconsistent and often given to the favorites of the group. If you are not ready to launch a full time political campaign to supplement all of your side projects for a promotion then don't expect one.I have had 9 managers in the few years I've been here. They change so often its hard to build on a plan for advancement.Director works remotely, n… ever shares with team when they are in town. They openly tell peers they think each member on the team is \"replaceable\"",
        "advice": "Work on morale of team and change top management to someone who values their team.",
        "pros": "Great pay, great benefits - Standard of tech unicorn companies",
        "summary": "A game of favorites",
        "role": "Account Manager",
        "date": "Jan 21, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Engineering is really good and fun to work but not This IT finance controllership org.Almost all teams Rollup to one VP , and that person controls all people under.People are well connected under this person so cannot voice out else you are fired .",
        "advice": "To fill the process gap if an employee wants to switch the team then the manager should not be involved because the chances are less since usually managers would not encourage that but company claims that they are ok for transition. You would like to move from team because you are not liking it therefore manager would not support. This is strong process gap and HR is being following all traditional copied policies. T… hey must come up with new set of policies to fix this issues.HR just sits there to fire or hire .that's it.",
        "pros": "IT controllership org is full of junks added and they just scratch each other's back, try not going into team. Well you cannot go unless you know some one:))Many good and Horst employee quit over a year.",
        "summary": "Only good talks n talks with no action",
        "role": "Senior Business Process Analyst",
        "date": "Feb 3, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- LinkedIn is not an engineering driven company.- Lots of antiquated technologies and plenty of technical debt.- Level of talent is very low. B players hiring C players.- Middle and upper management is extremely political- Pretty heavy brain drain: most talented engineers leave after their 1 year cliff- Overall, engineers are overpaid for their level of talent. Most people are content with the ter… rible state of things, as long as it's not hurting their careers or paychecks.",
        "advice": null,
        "pros": "- work/life balance- good food",
        "summary": "Where mediocrity meets politics",
        "role": "Software Engineer",
        "date": "Jun 2, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They just don't care about their employees. Forgot my exit interview nor did they even care to do it. Went through the purchase of lynda.com and it was awful. There is no transparency, no one knows what is going on and it is totally a fear based culture of perform or your job is no more. Had the absolute worst manager of my career who was very disconnected and not qualified to do their job. If you are lucky to get a … good manager who cares about advancing your career, then great- otherwise you will be blocked with no hope of getting to another position and leaving is the only alternative and doing the same job forever and things are totally not fair. It was an awful, very stressful experience and you are basically working in a boiler room.",
        "advice": "Get managers who are qualified to lead and care about the career advancement of their employees, instead of micro managing very experienced professionals. We were hired because we could do our jobs well, let us do them well.",
        "pros": "Free food, benefits, vacation, casual work environment, co workers are experienced and helpful, good company to have on resume.",
        "summary": "Sales",
        "role": "Account Executive",
        "date": "Jul 6, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you're a contractor, you're screwed.Big companies like LinkedIn, Google, and Facebook hire contractors to do the grunt work and they're basically considered as the working class of the company. Most contractors work hard to become permanent meanwhile most full-time employees don't do much just to fly under the radar. Sad to say at LinkedIn that is exactly what happens if you're a contractor. There are no p… romises to extend or convert unless you kiss up to the right people. It's all politics at LinkedIn and you will work on a project that goes into a black hole or never become anything. Full-time employees are encouraged to expand their horizon, present their ideas, and do whatever their heart desires but only to be shut down by budget cuts. It is not all rainbows and butterflies at LinkedIn, most people stay because of the perks but in the end working day in and out for free ice cream? definitely not worth it. If you're thinking about doing temporarily work in hopes of becoming permanent, don't go to LinkedIn. You have a better shot at Facebook at least the managers are more experienced.",
        "advice": null,
        "pros": "- Free breakfast, lunch, ice cream, beer, gym, FTO, great matching 401K- Reputable company in the tech industry- People are nice (for the most part)",
        "summary": "Contractors, do not apply.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Egos.Sexism.Top>Down management.Zero creativity.Lack of team environment.Ego maniacs.If you want to solve real customer problems, don't work here.This place is all about pushing sh*t on users, not solving their needs.",
        "advice": "Let your teams solve for customers. Stop using your (rich) selves as user examples. I can't list all the times I heard rich VPs (& the CEO) use themselves as examples of our users. LinkedIn is NOT built for the average worker. It's built by rich white men, for rich white men.",
        "pros": "Food.Looks good on resume.Bike rides around campus.Work/life balance was pretty normal.",
        "summary": "Worst year of my professional career",
        "role": "User Experience Designer",
        "date": "Jul 16, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "(Review applies mostly to engineering tracks)- Extremely political. Rising in the ranks depends on who you can brown nose. Not merit/output based. If you have ambitions that you think you will work very hard in your first couple of years and get to a respectable position, this is not your place at all. At this point, unless you really want to cruise through and rest&vest, this is not your place.- … Mid-management have no vision of the products they lead, teams they manage. For most teams, that is pretty bad. For infrastructure managers, this is suicide. Yet since it is more imperative to actually make buddies with upper management than actually deliver something, these people do get hired and promoted, and you watch in shock.- Talent leaves very fast due to aforementioned reasons. Extremely heavy brain drain at this point, especially on the infrastructure and engineering tracks. A previous review from last year said B players hiring C players. At this point, it is more like D players hiring H players. The level of interviewers dropped dramatically, and the hiring bar has been lowered so much just to be able to keep staff on some of the products.-I honestly don't know where all the positive feedback comes from to Glassdoor, since I haven't met any of these people.",
        "advice": "Your job is to deliver results. Listen to the negative feedback. Take a closer look at the tech organization to see where it failed.",
        "pros": "- Food- Some good talent still remains in select teams, very scarce though- Once a company that retained great talent, though not anymore.",
        "summary": "Linkedin is not what you think it is",
        "role": "Software Engineer",
        "date": "Jul 21, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "* Nothing to learn, except maybe politics.* Engineers around you are mostly mediocre(at best).* Technical management usually consists of people who are incompetent technically.* Management structure is very deep. Every tiny bit of functionality is factored out in a separate team, with it's own management structure.* Fix the culture. Technical culture is non-existent here. Your engineers should be smar… t and bold, not the reverse (which they are right now).",
        "advice": "* Rise technical bar, to be able to hire smart people.* Fire incompetent people and merge the remaining ones into broader teams under a flatten management structure.* Hire the best people. Engineers who care about the product they are building. Managers who care about their team, not their position.",
        "pros": "* Pay is good.* Food is decent.* You do not have to do much(if any) work.* With only mediocre people around you rising in ranks is easy(though requires lots of politics).",
        "summary": "LinkedIn is not a tech company.",
        "role": "Senior Site Reliability Engineer",
        "date": "Sep 24, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Manager has too much power and some of them are not professional at all. Work life balance is bad.",
        "advice": "The company should give more freedom to employees to change teams if it is not a good fit. Currently it looks like managers have too much power and feedbacks to upper management doesn't quite work.",
        "pros": "Lots of resources at the company, like Android/iOS classes. Food is good.",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Oct 25, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Extremely politicalExtremely political (like NATO)The site remains insanely unstablePrivacy gets lip service but no resources from an engineering perspectiveEveryone has access to member profiles (hello FTC)Management is learning as it goes (they're all very young)Management doesn't talk to each other",
        "advice": "Hit the reset button on management.",
        "pros": "Free foodThe promise to go public (for the past 5 years)Management is aloof enough to let you do your job",
        "summary": "All promise, no substance",
        "role": "Senior Software Engineer",
        "date": "Dec 27, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Blind technology leadership, not invented here attitude towards standard open source technologies. For example the 'open sourced' Zoie project implements a cheap hack for realtime search using Lucene, that was presented to and rejected by Twitter. Voldemort is yet another copy of Amazon's Dynamo, however it falls far short of Cassandra. LinkedIn has numerous open source and internal projects that show technology come… s last, egos, first.",
        "advice": "Money wasted on 4th or 5th rate technology is not in an investors best interest. Headcount that doesn't produce anything worthwhile is a waste, and should not be kept around to boost the egos of managers.",
        "pros": "It's a 'hot' company, that's about all.",
        "summary": "Technology arrogance without the ability",
        "role": "Software Engineer",
        "date": "May 5, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Micro Management. Not treated as an adult. No home work life balance. No vacation policy which has translated into Managers not giving or 'allowing' time to be taken. No upward mobility. Compensation is not comparable for location. Management is il trained with little experience and little professionalism. Management has poor time management which results in the employees scrambling.If you come to work here you w… ill be 'sold a bridge' as they say.",
        "advice": "Treat your ENTIRE sales team ( and your other employees) with respect! If you want them to work hard for you then pay them for how hard they work!!",
        "pros": "No dress code. Location is ok. Adulation from people that don't know better. Get to grow with a growing company.",
        "summary": "I was told something and experienced something completely different.”",
        "role": "Anonymous Employee",
        "date": "Mar 11, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "very poor managementpromises made before you are hired will not be keptpay is lower than similar roles elsewheremanagement is intensely hierarchicalpolitics more important than substance",
        "advice": "Refresh the leadership team within marketing solutions, to start yielding results from the talent you have hired.Live the LinkedIn valuesEncourage growth, communication, learning, ideas and change",
        "pros": "Name brand company: good to have on CV, people recognize itSocial networkbuild solutions rather than sell productsmultinational",
        "summary": "Poor management spoiling a good company with promising roles.",
        "role": "Sales Account Manager",
        "date": "May 21, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is no clear vision or direction from the top down. The leadership attempts to compensate for this with an endless stream of weekly multi-hour \"town hall\" meetings ostensibly to \"improve communications\" but in reality do not tell the employee base anything that's not already known. I've never spent so much time in valueless meetings.",
        "advice": null,
        "pros": "Good employees are the biggest asset of this company. Good ideas by a few knowledgeable people.",
        "summary": "Ugh",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The management over me was somewhat lacking in communication skills. This made it difficult to connect properly with people I needed to talk to to complete projects. No respect for people as a whole.",
        "advice": "you cannot abuse your employees forever and expect to achieve long term value creation.",
        "pros": "Nice building and decent computer equipment/software. decent benefits, good location.",
        "summary": "Unfulfilling",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They want all their employees to be brainwashed so that they can seem enthusiastic at all times but without having an actual opinion of their own. They need robots not people with ideas. They ask continuous overtime even though they do not pay the extra hours worked every day!",
        "advice": "Reconsider the way you treat your employees, the fact that you give free food is not the way to gain a happy employee, at least not an experienced professional. An employee must have a personal life in order to perform , not to be at work 14h a day!!!",
        "pros": "free food, company phone that you can use for personal calls also",
        "summary": "brainwash corporation",
        "role": "Sales",
        "date": "May 27, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management in Dublin are all into the culture of the company and want all employees to enthusiastic at all times but without having an actual opinion of their own. The culture in Dublin is all about using the corporate buzzwords, make sure that you words like \"transformational\", \"billion dollar startup\", \"ownership\" or \"culture\", creating a environment where well connected employees become spoiled and think they are … the best of the best, but probably would not be successful in another major company.Success and promotion is more based on who you know and who likes you then any sound business logic. This may be because middle management is very inexperienced, from what I could see most are promoted into role and still trying to learn how to be managers and preferences to support their \"friends\" then make hard business choices.Linkedin is by far the most political environment that I've ever witnessed, manager is always involved in internal fights, instead of working towards one goal they fight for political power. Everyone smiles and says they are your friends by they are looking out for themselves. Making many of the sales people very unhappy but afraid to voice concerns in fear of their jobs.Compared to hiring standards and creative thinking in other online companies in Dublin, Linkedin is more close minded, managers are inexperienced and staff only looking to get a the brand name on their CV before moving on. Not a good place for people with with ideas of growing..",
        "advice": "Having a culture is good, but it not the only thing and embrace different opinion and diversity among your employees, it will create friction but that is how you get new great ideas!If an employees is working 8 to 12 hours a day and still can't reach their targets, there is somthing wrong with the targets not the employee.Start trying to remove the politics, put focus on delivering across departments.…  The biggest obstacle to performance is turf wars between local office and Dublin. Learn from your other companies in Dublin about how to be innovative with EMEA.Improve the hiring standards, if you want the best staff, hire the best!",
        "pros": "Like other online companies in Dublin they offer free lunch, healthcare and stock option.The brand is well recognized so good name to have on your CV.",
        "summary": "LinkedIn Dublin - Very political, employees only out to get the brand name on their CV.",
        "role": "Account Executive",
        "date": "Jun 25, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management in this company is distinctly lacking experience and procedures to follow. They want to position themselves as employers on a par with the likes of Google and Facebook, but they are significantly lacking programmes for staff development and training to make this the case.Training repeatedly promised during my time there, was never delivered. Procedures and the ‘LinkedIn way’ of doing things were co… nstantly alluded to but never clarified or laid out through training or mentorship. This was particularly evident with standards and targets, where concrete targets were NEVER clearly communicated. Requests for feedback go unanswered, quarterly reviews don’t happen (!), and when this is questioned, vague, non-committal responses are provided… again, highlighting the inexperience of the management.Standard processes and procedures are non-existent in the LinkedIn Dublin office. Promotion ladders are quickly climbed for favoured staff members, where others are deliberately excluded from application. There was no evidence of a HR involvement with internal departmental management or promotion.It is clear that a policy of over-recruiting for certain teams exists as a means to hedge their bets in terms of handling market growth. Unfortunately, LinkedIn’s lack of monitoring or projecting their growth and lack of understanding their customer requirements means that they have no way to predict the volumes they expect their staff to handle… over-staffing in these departments leads to a low case numbers and poaching between team mates in an attempt to reach unrealistic targets. These staff are kept in an extended probationary period as a way to dispose of them when it becomes necessary. Unfortunately for LinkedIn, Ireland is a small place and this practice of ‘probationary recruitment’ has been noticed by some of the main recruitment companies.The most frightening example of poor management staff handling I witnessed was during the visit of the CEO Jeff Weiner in Dublin, Irish employees were asked to be seated in the front row and meet him whereas the foreign employees from Brazil, Italy, Portugal, and France were asked to step back. There’s a word for that…discrimination.For a company providing recruitment products LinkedIn’s own recruitment procedures are alarming and considerably off base from their supposed ideals. Calls from initial recruiter outside available contact hours, repeated rescheduling interviews and meetings as managers were ‘travelling’ or ‘sick’ meant that a recruitment period of 6 weeks required 5 interviews, each with different members of staff and HR representatives, and a language test.Even after head-hunting and recruiting from other well-known Dublin based companies like Google, PayPal and Facebook, the obvious ineptitude of management levels in LinkedIn Dublin means that many of these staff left within a short period to return to their previous employers.It is clear that LinkedIn (Dublin) is still in shaky start-up territory. A massive recruitment push to prove to the American offices that Dublin is effective venture has led to selection of poor, inexperienced managers who, without guidelines to follow or a clear idea of how they want to expand the company (or maybe they do know, but they never communicate them to staff) are flying blind and believing their own hype.",
        "advice": "no advice to give",
        "pros": "Free lunch, free drinks, snacks and parties... product, platform, members and clients...",
        "summary": "Terrible. direspectful for any employee and member... the management is filled with inexperience...",
        "role": "Anonymous Employee",
        "date": "Jul 30, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Bad management- Racism- Some male managers are so inappropriate with female stafmembers, its all condoned by management",
        "advice": "Go get education on how to manage people.",
        "pros": "- free food- Gym- Good location- free snacks- Free drinks",
        "summary": "Disappointed",
        "role": "Anonymous Employee",
        "date": "Aug 20, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Employees are very competitive with each other. No one wants to work as a team. It's every man for himself, dog-eat dog atmosphere. Training was very poor, was asked to meet impossible deadlines. Management thinks this type of issue is funny.",
        "advice": null,
        "pros": "Pays well compared to competitors. good vacation time. The opportunity to meet and network with other employees. you run into good people along the way.",
        "summary": "Very bad place to work",
        "role": "Anonymous Employee",
        "date": "Oct 23, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The Politics are vicious and unpleasant, The atmosphere is one of fear and is extremely fake. The Senior Leadership team are the lowest common denominator here in Dublin and have created a fearful environment. I don't know anyone there who was truly happy except the brainwashed few who think that management will reward them when instead they will take the credit. They keep pushing a startup culture which deosn't ring…  true in a 10 year old company with 400+ people in Dublin. It seems to be an excuse to maintain a lack of accountability, broken or no processes and the turf wars alive.",
        "advice": "Remove the Senior Leadership team in Dublin and replace with some new blood. Dead wood is killing the tree.",
        "pros": "Free Food, Product, LikedIn Dublin as potential but weak and selfish leadership is dragging it down",
        "summary": "Appalling Senior Management at LinkedIn Dublin",
        "role": "Anonymous Employee",
        "date": "Oct 31, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Did not like the \"giddiness\" and the lack of authenticity about the place. Left now",
        "advice": null,
        "pros": "Nice surroundings. Nice building. I enjoyed working with some of the people in my area",
        "summary": "Are these reviews genuine?",
        "role": "Sales",
        "date": "Nov 7, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Poor management, hard work not rewarded. Employees do not respect the so called leaders, who graciously tell you they have taken a step down to grace you with their presence. The oracle. Leading the greatest finance team in the world.Managers steal ideas and are motivated by their own progression.Company values open and honest culture but often opaque and will straight lie, dishonesty is the norm.Managers…  hire their compatriots without experience for the role. Top talent.",
        "advice": "Be more like the US company. Managers should listen to feedback and not steal ideas and take credit from others when not due. Don't force employees to be be happy and threaten employees when the do not rate you as you would like in the employee engagement survey. Live the company values, don't just pay lip service.",
        "pros": "Free FoodSome good people (mostly unhappy to work for this company and looking to move on) Some really good companies in Dublin with fantastic work culture to work for in the futureClose to the luas",
        "summary": "International Finance (Dublin) Perception",
        "role": "Finance",
        "date": "May 28, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All the decision are made in Mountain View HQ, all the other offices are still service offices for the majority of the role and departments, aggregation of great talents without a real company mind. Most of the team are working on their own without infra team collaborations.",
        "advice": "Start to care about the whole pictures of problems, spend time to understand where employees are spending the most of their time, verify if there is room for improvements, ask them if they are happy with that role, ask them where they would like to grow.Improve controls of productivity of managers instead of focusing only on low level employees.",
        "pros": "Free food, good perks packages overall, nice opportunity to growth but not in all departments.",
        "summary": "Crazy management, they can't control the growth speed of the company",
        "role": "Information Security Engineer",
        "date": "Jun 7, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Don't fall into the trap of believing the corporate dream they are trying to sell you. You are right back in high school where people talk behind your back and decisions about your future are based on how compliant and discrete you are.Prepare to work unreasonably long hours to reach unreasonably high targets.",
        "advice": "Provide more support to staff, especially when they are asking for it.",
        "pros": "Good compensation plans (health insurance, food, cycle to work,...)",
        "summary": "Bad: too much politics and not enough experienced managers.",
        "role": "Sales",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Horrible senior management (directors). Full of buzzwords about \"company culture\" and \"company values\" but it doesn't mean anything. It's just sad because it's a waste of really talented employees (sales department, account executives).Very political organisation in Dublin. It's pretty bad because even big companies like IBM, Dell, and Oracle are not this bad.",
        "advice": "Open your eyes and be frank and honest with your employees. They can see you are fooling them with all the corporate buzz talk. It is nonsense, stop doing it. Just be honest in an sales organisation it's about making sales not all the other nonsense.",
        "pros": "Free foodNice colleagues, some very smart people that were hired at the start.Nice brand on your CV for when you leave.",
        "summary": "A poorly managed cult office",
        "role": "Account Executive",
        "date": "Oct 16, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very bad middle management without any experience",
        "advice": "Consider to hire better Middle Management and be less political with promotions!",
        "pros": "great opportunity to learn and grow professionally",
        "summary": "political!",
        "role": "Relationship Manager",
        "date": "Jan 4, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Work environment has become toxic since business performance is slowing down. Middle Management's weakness is very apparent now that leadership is required to motivate sales force. Tactics such as performance improvement plan or \"firing\" threats seem to be the only method that management is using. Overall sales environment is incredibly low and everyone is concerned about their future and ability to make any $ since … quotas are not even close to being realistic.",
        "advice": "Wake up and listen to your sales teams. Stop pretending like it is a short term issue or performance of some individuals. It is obvious from the morale in the office that something is very wrong and needs to change. There will be a mass exodus very soon. I do not recommend any senior sales professional join the LinkedIn team any time soon.",
        "pros": "Cool Work environment, free food.",
        "summary": "Relationship Manager",
        "role": "Relationship Manager",
        "date": "Apr 9, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The culture was for from where it needed to be.A lot of inexperience managers that defaulted to micro-management.A lack of real transparency when it came to promotions.Very political environment.",
        "advice": "Invest more in culture, hire better middle management who manage with compassion. Deliver more transparency.",
        "pros": "Great productExcellent executive teamWith hyper-growth comes great opportunitiesGreat pay and benefits",
        "summary": "Terrible culture, with micro-management rife",
        "role": "Anonymous Employee",
        "date": "May 15, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Most employees who work here get the work done (more like robots) vs people who think and are invested in the team/customers- Attitude internally is that customers will always come to us and while we're doing well now, LinkedIn will phase out at some point so treating customers badly isn't the way to go but I see team members doing it all the time unfortunately. This same attitude transcends down to Managers an… d the rest of the team.",
        "advice": "Keep your attitude in check and treat your customers well because this will take you farther than an evaluation.",
        "pros": "- Company has been doing well in relative to the industry- Have offices around the US",
        "summary": "Incompetent Employees with little customer service",
        "role": "Insight Analyst",
        "date": "Sep 25, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Depends on team but typically poor pay compared to market, poor management, high turn over rates",
        "advice": "More support and training on tools. Better trained managers who are versatile in employees styles",
        "pros": "Decent benefits (but base salary is rather average compared to market)",
        "summary": "Would not recommend to a friend",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No big salary increase so make sure to play hard from the start.Asking a lot and lot more.No work/life balance",
        "advice": "Employ less managers and get more ICsRetain your best employee. It's cheaper than finding and training new ones.Find value in people",
        "pros": "Good perks. Gym and healcare and dentust. If lucky gets stocks as well . Wage good but way too much work.",
        "summary": "Great company. Doesn't keep on promises. No tracking record or metrics. Managers approachable but inexperienced.",
        "role": "Advertising Specialist",
        "date": "Nov 6, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Cult culture. Horrible middle management. Political B.S. all over the place. Joining this cult was a bad idea.",
        "advice": "Cut the nonsense and start telling the truth. It's not all rainbows and butterflies.",
        "pros": "Free food. Nice colleagues. Nice office.",
        "summary": "Cult",
        "role": "Sales",
        "date": "Feb 20, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Do not put your family at risk by relocating for their physiological contract. They feed you with amazing stories, it is opposite when you arrive. Managers are managers not leaders, all the positive reviews here are forced from LinkedIn. If you do not follow their cult you are out. You cannot be your own person at this company.",
        "advice": "Get leaders that help staff not these managers that force you to be who you are not. Managers are as fake as they get. Behind closed doors they are mentally abusive.",
        "pros": "Free FoodFree snacksKnown BrandIf you are pretencious or easily manipulated this is the place for you.",
        "summary": "If you are a leader LinkedIn is not the place for you, they need followers. If you do not follow their \"cult\" forget it!",
        "role": "Account Executive",
        "date": "Feb 25, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Too much marketed. People working there are self obsessed and egoistic. Average people with below average team players",
        "advice": null,
        "pros": "Any average MNCHired wrong person at India office. Only good thing if you working at USA office",
        "summary": "Too much marketed company",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If I have to mention the downside of working in linkedin thn this page wont be enough. They treat contractors as slaves and in a very disrespectful way. Moreover, they fire pregnant ladies as preganant ladies tend to take maternity leaves and they replace her by hiring someone for lesser salary. Some of the managers in Content Review team and trust and safety treats women in a very disrespectful way. They micromanage…  them to a great extent where women cry on duty because of the illtreatment. An organization of such a stature is doing such things and there is no one to hear the story of the contractors who work day and night because they are made to work so. Contractors are asked to do night shift without giving transport. At night they switch off the AC and nothing is available except water. Contractors suffer a lot and when they want to discuss about their issues they are fired immediately. It is a trauma for every contractor who work there. The contigent HR is so rude that she keeps threatening people. The managers of trust and safety treats you in very unprofessional way and they don't spare even women who are much experienced in the team.",
        "advice": "Please inculcate little human values in your system. An organization is built by people, learn to respect them",
        "pros": "Good ambiance, good brand",
        "summary": "Never go and work in Linkedin as a contractor they will ruin your life",
        "role": "Trust and Safety Associate",
        "date": "Jun 4, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Micromanaging and lack of inspiring leaders in some departments, very standard leaders, not expect in a great company like Linkedin",
        "advice": "You need to care more for people!",
        "pros": "Great bran and collaborative people",
        "summary": "Growing at scale",
        "role": "Manager",
        "date": "Jun 9, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "promotions only happen to brownnosing people and are in no way related to actual work performance.Motto members first is hollow phrase. Which is not that bad as it is a business",
        "advice": "pay attention to actual work performanceand do not promote your best friends any longer.",
        "pros": "Great benefits and compensation, also great opportunities to gain certificates and educate yourself",
        "summary": "Linkedin Dublin",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "May be it differs from team. But i had a bad experience.Within a matter of two months, 5 of my team members quit because of the inhuman behaviour of the Trust and Safety Content (Contract) team. Women employee was asked to quit as she was pregnant. Time and schedule of work was not assigned properly and was frequently changed as per the convenience of the team leader and manager. No moral responsibility towar… ds the team members from the manager. Right from the way we are treated to the opportunities offered to contract employees, everything is unethical on the grounds of employment. Long labour hours (More than 45) is expected to be put and no inputs from the contract employees are accepted. Besides all, they treat contractors as slaves and work like robots without any cross question to the manager's decision.",
        "advice": "Jeff Weiner, Akshay Kothari Please have a look into the contractual teams that are headed and lead by bias thought process individuals, leading to the loss of potential future employees.",
        "pros": "1. Good Food.2. Good Ambiance3. Lots of opportunities for the full time employees to learn and grow.",
        "summary": "Inhuman Visual BIAS between contractors and full time employees",
        "role": "Contractor",
        "date": "Oct 13, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "except the brand name, almost everything. Your work life balance sucks on top of that I had a bad manager with no assistance in ramping up.any new analysis/job expected to be completed by lunch time!",
        "advice": "tell the candidates what they are really getting into",
        "pros": "Brand! Civil dress. free food and sweets",
        "summary": "Sales strategy analyst",
        "role": "Sales Strategy Analyst",
        "date": "Oct 13, 2016",
        "is_current": false
    }
]