[
    {
        "rating": 2,
        "cons": "It's a highly political environment where the people who get ahead are those who promote themselves the most. The management pretends like everything is hunky dory, but the culture isn't the greatest and morale is low. It's a product-driven company where engineers aren't recognized and don't get much respect. Having said that, we keep growing and making money, so something is definitely going right.",
        "advice": "Start rewarding performance not politics. Make tough decisions and stop holding so many meetings with just executives.",
        "pros": "The stock options are going to be worth something, so it's worth coming if you can negotiate a large grant. The hours are pretty good, I leave the office by 6pm so it's not a bad place if you mind your own business and are satisfied collecting a paycheck and vesting. There are all the usual perks like free food. Hackdays happen every month.",
        "summary": "Not an engineering-friendly company, highly political",
        "role": "Senior Software Engineer",
        "date": "Aug 13, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-LI is led by inexperienced middle mgmt who lead by fear & intimidation. Most mid-mgmt have little or no experience leading and are quite often promoted because of \"who they know\" rather than \"what they know & what they can offer\".-The sales compensation package is very low compared to other silicon valley companies, and when the sales team figures out how to make $, \"the house\" changes the rules to regai… n the advantage.-LI offers a small share of stock options. Upper mngmt receive the lions-share and are able to exercise them long before the foot-soldiers.-The exec mgmt team doesn't know how disgruntled the rank & file sales team is-LI strings a lot of job seekers w/ contract positions to save $ by not offering benefits. Most good non-perm employees do not get perm job offers until well after 1 yr of work.",
        "advice": "-hire and compensate seasoned pros and not kiddies-need to reevaluate mid mgrs-re-recruit past LI talent-privately interview seasoned LI personnel and former employees to get the real picture of what is going on behind the scenes",
        "pros": "Linkedin has great brand awareness and people are very eager to speak w/ you when you conduct a sales call. LI offers very good perks & benefits (on-site massage, fully stocked kitchens, meals are provided, lots of freebies. Good communication from a top-down perspective. Big names speakers are invited to address LI employees.",
        "summary": "Glad to be LinkedOut - great product, but weak leadership & weak compensation",
        "role": "Corporate Solutions Account Executive",
        "date": "Sep 20, 2011",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Mid/lower management, (especially int he sales org) can be a BIG miss.-There are a few good sales managers but by and large, incompetency reigns supreme at this level. They have a sales manager with literally 2 years of sales experience, \"trying\" to lead tenured reps who've carried a bag for a decade. The result? Downfall of many reps due to \"cultural clashes\"-Post first week training, on boarding is…  nearly non-existent. Very cliquish and overall sense of negativity on the floor.-Little to no career development unless you're in the 23 year old crowd.-One of the most political environments I've encountered in my career",
        "advice": "Middle management is the chink in the chain hurting LinkedIn and you're losing reps at all levels, both physically and emotionally. Don't take your middle manager's words for it, try to get an ear on the ground yourself.",
        "pros": "-From the outside looking in, one of the most innovative, forward thinking companies in the valley.-Tech darling of wall street-Solid, visionary exec leadership who seem genuine, believable & competant-Transparency at the top-Free food and good perks",
        "summary": "Proceed with a very powerful zoom lens.",
        "role": "Account Manager",
        "date": "Jun 28, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "People aren't promoted based on merit, but on who is better friends with the managers. Check out how many of the first sales managers and directors were childhood friends. Some new reps are hand chosen to get the best territories, and their careers soar with promotion after promotion in short periods of time without putting in the honest and hard work others put in. If you can be on that list, LinkedIn is a dream com… e true. If you aren't, you're going to make your managers rich while they promote people with worse numbers than you consistently. You would think that in sales, where closed deals and hard numbers are the only things that matter, it would easily be a meritocracy. LinkedIn proves this is not so.",
        "advice": "You're going to watch the best people leave if you don't treat them appropriately. The lure of stock options can only hold employees with talent and integrity for so long.",
        "pros": "Very smart, friendly, outgoing people from great schools and past companies.",
        "summary": "Great opportunity ruined by politics and cronyism",
        "role": "Sales Development Specialist",
        "date": "Aug 19, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It is very political. The middle management team has so many meetings and doesn't have time to actually \"manage\" the team. When they do \"manage\" means micro management to control over everything. They pick favorite people and promote them. The promotions for the other people don't happen.",
        "advice": "Consider promoting people who have ability to take more responsibilities rather ask us to apply for the position and let us compete. Provide clear feedback for the candidates who apply for the promotion. More clear guideline for the promotion.",
        "pros": "Culture, transparent top management team, high energy, free food, great benefits, good pay.",
        "summary": "Overall OK, but many \"new to the corporate world\" and can be VERY political",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "-Hostile environment: Bullying and workplace violence. I've personally experienced this as well as others across my organization.-Middle management is unable to manage expectations from executive leadership team resulting in burn out and demoralization of those doing the work on the ground.-Many of the inspiring leaders that built up Linkedin to what it is today have left or will be leaving Linkedin soon.… -Very political and hierarchical",
        "advice": "Listen to the people actually doing the work.",
        "pros": "-Smart co-workers-Fast paced environment-Frequent opportunity to beta test new products-Free catered lunches, drinks, snacks, Froyo",
        "summary": "Not what it used to be",
        "role": "Anonymous Employee",
        "date": "Apr 13, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "1) There is a failure to foster and grow talent, leading to high churn and dissatisfaction among tenured employees. I've been here for 3+ years and have been vocal in my desire to expand my role and grow my career. We lack the internal structure to support employees like me who want to stay at the company but need guidance on where opportunities may lie. So people either get frustrated and leave or simply stay to ful… fill their vesting period and get increasingly disgruntled in the process.2) Inconsistent culture and work/life balance: I have only experienced the Marketing team where employees struggle with being overworked and unable to enjoy the \"fun\" aspects of working at LinkedIn. Other teams like engineering and product appear to be the opposite.",
        "advice": "Invest in your existing talent -- look to grow from within before hiring from outside, even if it involves risk and training.",
        "pros": "1) The perks are great -- free food at every corner, monthly inDays to stretch you beyond your usual work, exercise classes, flexible work schedule, and more.2) The potential of the company is also hard to ignore -- we're on a trajectory to do great things and the market agrees (as reflected in our stock price).",
        "summary": "Company focuses on making professionals successful but fails to deliver that same service to its own employees.",
        "role": "Marketing Manager",
        "date": "Sep 19, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "I worked in Global Sales Operations for 4 years, so this perspective is unique to that.Long hours are expected; don't expect less than 45-50 and often 55-60 near the end of quarter. Do not expect management to honor work-life balance by default. Most rank-and-file employees that support Sales work long hours.There is dissonance between stated values and actual working values; for example, a commonly s… poken mantra is \"members first\" -- yet there are few member support options other than email (no phone center) and LinkedIn is embroiled in a lawsuit concerning spamming new users' contact lists because of an unclear and confusing user experience.No clear path of promotion for many positions in GSO.Much of the advertised \"company culture\" excludes parts of the company outside of Mountain View; there is no true \"hackDay\" and \"inDay\" outreach. This leads to \"Two Companies\" syndrome, where one side lives LinkedIn culture and the other doesn't have opportunities to participate.Middle management is \"dog eat dog\", incompetent, and highly political, which has led to a lack of collaboration between departments and a promotion of the idea that you're on your own.",
        "advice": "Practice what you preach. Promote more from inside the company, especially Yahoo! outsiders. Give your employees long-term goals outside of \"doing your job better\". There is a lot of dead weight in middle management; use better methods to analyze their performance including feedback from their subordinates and take appropriate action.",
        "pros": "Free food. The facilities are great and are updated often for the better. Benefits are good. The intern program is one of the best. Despite dysfunctions in various organizations, the company's outlook is healthy.",
        "summary": "Tells a good story; doesn't really live up to it",
        "role": "Ad Producer",
        "date": "Sep 27, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Bad manager's.- Thanks to LinkedIn's hypergrowth we have promoted a lot of new managers who are just candidly bad.Switching of standards- I believe this orientates its self around bad manager's many times, they will say one thing and measure by a different standard then what was communicated. Leading to complications, also i have witness managers stop their team members from being promoted, when a hiring mana… ger wanted said teammate.Lastly, the hiring experience at LinkedIn could definitely be improved.",
        "advice": "Please spend more training to help your lower management. We are having a loss in quality thanks to the management hiring spree we went on last year...... they are not quite up to snuff and definitely don't always live up to LinkedIn's standards.",
        "pros": "LinkedIn has a very compelling mission objective.Thanks to their ideals they often bring in great people who likewise demonstrate caring.LinkedIn definitely believes in training and often times will allow you greater resources to improve.LinkedIn does a hell of a job of getting people new to the company really excited and mobilizing these people to speak their praises. (Note how long most of the g… lowing review have worked at LinkedIn).They best way to describe LinkedIn's culture: \"We are a bunch of workaholics who like alcohol.\"",
        "summary": "Lofty ideals muddle by the inadequacy of people",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too much focus on planning and short-term metric optimization, not enough on risk-taking and innovation",
        "advice": null,
        "pros": "Success comes easy to LinkedIn",
        "summary": "Overrun by consultants",
        "role": "Anonymous Employee",
        "date": "Feb 21, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Lack of innovation. Lack of passion from employees",
        "advice": null,
        "pros": "Stability of the company for average engineers",
        "summary": "Needs innovation",
        "role": "Associate Product Manager",
        "date": "Feb 26, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Expect a total frat house. Seniors and leads in the early to mid 20s. Drink the cool aid and you'll fit in. As a technical program manager, you'll likely report into an engineering manager or director, who most likely knows absolutely nothing about program or project management. Or cares about your career or what you do.Linkedin does not value the project or program manager role, and there is a heavy bias to engi… neers are all that matter. In engineering, there is roughly 1 program manager to 50 engineers and you are treated like a ,general dogs body. If you enjoy doing admin work, this is for you. The career ladder is lovely, but bears absolutely no relation to reality. There is no leveling across the organization, so career progression and promotions are entirely a draw of luck based on your department, and not skill.",
        "advice": "Set up a centralized project management team who truly advocate for best practices and care about the discipline. Don't treat this staff like admins.",
        "pros": "Pay is competitive, perks are average for industry. This is a product driven company, as opposed to engineering (Google or Facebook) or design (apple).",
        "summary": "Program managers - do not apply",
        "role": "Technical Program Manager",
        "date": "Mar 13, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Poorly managed projects and lot of debt in engineering. Compensation is average and company is growing more and more political. Some groups have very bad work/ life balance.",
        "advice": "Train your middle management or hire from outside, you are no longer small and already stock has started taken hit.",
        "pros": "Decent compensation. Revenue making products, free food.",
        "summary": "Growing politics and nepotism",
        "role": "Software Engineer",
        "date": "Mar 26, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Disclosure: For obvious reasons my comments don't apply to all departments. In some places of the organization you will find everlasting heaven.I've experienced very poor retention policy in my department. Focus on hiring people and keeping them stuck in frequently silly and repetitive duties, getting more and more frustrated. While one of the core values is \"be open, honest and constructive\", i've experiment… ed promotion of dishonesty.Very competitive work environment.During interview you may be promised bright career potential, just to convince you to take the offer. Reality may be very different.",
        "advice": "Get rid of undereducated managers and don't hire overqualified people. Find a better use of the talent you hire, as you promise.",
        "pros": "Great perks, free food, nice offices, opportunities to travel to different locations. If you are lucky, you will be working with some of the brightest minds in Silicone Valley.linkedin looks after the hard to get specialists very well (mostly for web developers and data engineers).Decent salary.Frequent cool parties. Prestigious brand to have on your resume.",
        "summary": "Rat race. Dishonesty. Tone of politics. Great perks! Tone of free gadgets ;)",
        "role": "Anonymous Employee",
        "date": "May 24, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "With the hyper- growth LinkedIn is losing it's culture and values. It's has become very political and competitive amongst employees. There is no structure and can be very brutal at times.",
        "advice": "Get the right management team in place. What we have now is bringing downLinkedIn's branding on which Jeff worked so hard for....",
        "pros": "Great benefits and perks! Awesome co-workers",
        "summary": "Sr. Management",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Culture and values are for chumps...at least in sales. They're a way to keep individual contributors in line. Leadership defied values regularly in my business. It's well-known that integrity is not something this leader cares for. Team leads contacted HR, but HR blew them off. Don't think this is an issue across the company, but it's a major issue in my team.Not the best and the brightest here. Compared to t… he other major tech companies...LI people are just not that smart. Take a look on LI at profiles of the sales people who work here and you'll see. The comp is also average because they can't afford to hire the best. It's also one reason for the amazing reviews. It's a great job for people who don't have a shot at working with and for the best so they're thrilled with what they get at LI.LI is behind on product innovation. The product is usually a copy of whatever FB launched a year ago.Get as many RSUs and the highest comp you can when you join because once you're in they are stingy.",
        "advice": "Considering the stock performance lately, might want to take a long hard look at those below VP level and see what's really going on.HR needs to be cleaned up in a serious way.",
        "pros": "LI brand is strong within the industry (amazing PR team and employees are asked to post positive reviews before rankings come out) so you should be heavily recruited after some time here.Work life balance = good.Each business @LI has a different culture. Depends on who the leader of the business is and the leaders they have hired. Also think HQ has a more positive culture than the sales offices.Interviews…  are dead easy. One reason there have been alot of bad hires.",
        "summary": "Disappointing",
        "role": "Sales",
        "date": "Jul 10, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not a great place to work - engineering/product leadership is downright unpleasant; lots of silly politics and meritless recognition. Total cult of the CEO to the point of being ridiculous.",
        "advice": null,
        "pros": "Great idea and considerable potential",
        "summary": "Good ride overall - but the Culture is awful",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2014",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "In terms of execution, too many middle-tier management gets in the way. There are way too many newbie \"manager\", \"sr. manager\", \"director\" titles who are trained or gifted in management.",
        "advice": "Train your the managers. Manager employees to their fullest strength.",
        "pros": "Company itself is in a great market, profitable and doing great things for professional networking.",
        "summary": "The good times might have passed",
        "role": "Anonymous Employee",
        "date": "Oct 6, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is a major disconnect between what the leaders preach and what managers practice. My time was not \"transformational\" nor was it for anyone in my department. Also, lots of dogma.",
        "advice": "Focus on providing training and exposure to entry level employers",
        "pros": "Typical Pros: food, office, speakers, talented executives, clear priorities from CEO.",
        "summary": "Big talk, little substance",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The title really says it all. This is a boys club and it's easy to tell when you look at senior leadership. What once used to be a start-up, fast and nimble work place has become a political, lumbering corporate machine that's lost it's way. Starting with old products that fail to evolve to the ridiculous quotas that don't make sense, LinkedIn is on the decline.If you weren't one of the fortunate ones to get opti… ons pre-ipo and make your millions to then be jet set around the country to build 'collective tissue' then be prepared for the corporate ringer and to work your way up the ladder tier by tier. (unless of course you went to school with one of the sr leaders and they're hiring you).Coming on board as a Relationship Manager? Good luck! Quotas are hilariously high but the mission has been accomplished! Saturate the market, push out the talented hunters and keep those who are content enough to move to the Relationship Management side until they realize they're way more valuable when they leave and can spread their wings.Wouldn't be a fair review without mentioning middle management. They're a joke. Just look at their profiles and see how many people are in roles they are far from qualified for. And with new layers of sales being created every year, the bar continues to be lowered! There are literally, 5-6 layers of managers until you get to a director level. I'm not exactly sure how many layers there are anymore but it's a ton.",
        "advice": "Fire yourself. Take your money (that you openly talk about how much you make at sales kickoffs) and try making it without your boys club.Jeff Weiner is an outstanding CEO but it stops there. Of course... there are exceptions. There have to be when it's a numbers game. When you have 1000 managers... there are always exceptions.",
        "pros": "Cool offices, great perks, benefits, smart and fun co-workersName Brand Company for your resume",
        "summary": "Very political, boys club and fizzling fast - Don't drink the Kool-Aid",
        "role": "Relationship Manager",
        "date": "Feb 4, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Hiring too many young people to do senior jobs that they cannot do. I have seen too many people set up for failure. They are not given a chance.",
        "advice": "Hire more quality people. One person cannot complete the role of 3 good people. Just because the salary and benefits are amazing does not mean people have to or should work 70+ hours a week.",
        "pros": "Great work ethic of peopleCo-workers wanting to do the best",
        "summary": "Internal Communications for LinkedIn",
        "role": "Anonymous Employee",
        "date": "Feb 7, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Confused Management, no professional growth, dictatorship process, lot of negative environment and lot of insecure employees, no work life balance, no clarity in ownership, lot of confused leaders",
        "advice": "Help the team grow",
        "pros": "Company benefits , good stock options, good salary, closer to the bay, free food, lot of fun events , good PR management",
        "summary": "Work like experience getting worst",
        "role": "Anonymous Employee",
        "date": "Apr 11, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "People seem to think it is a nice place to work with an amazing culture, an opposite of Amazon, while really, it isn't. It is worse, because Amazon does not go around touting its great work culture ,where as for LinkedIn, there is a pretense of great culture, almost cult like, which starts the day of your interview. You will hear all the buzzwords and phrases from the very start. Things like \"act like an owner\", \"rel… ationships matter\" etc. will roll off your tongue easier than your name!Pretty limited growth opportunities for those with 5+ years of experience. Also, hard to move up if you are not friends/ ex-colleagues with the boss or haven't gone to to a Ivy league school. Your senior management will likely not respect you unless you are a Ivy league or Top B school grad or have worked at McKinsey/ Bain etc. Very very true esp for the sales org. If you have worked for Google or such companies before, that helps too.There is a sense of insecurity among line managers and mid level managers, which prevents them from promoting the best talent and instead promoting the \"yes men\". Standing out is difficult. If you've drunk the kool aid and are not hugging every second person you see, you might not be able to move up.Also, the other review about the top leaders group being an \"old boys club\" - they couldn't have said it better. Spot on. It is a club that only takes people like itself. Another thing you need to do is to act like you are 18 and at your first party. You will see a lot of jumping around, dancing around in sales offsites etc. If you are not a party animal and not good at pretending to be one, be prepared to feel left out.Another issue is lack of collaboration across functions. Most leaders and groups are seeking success for themselves and in the process, the bigger goal does get overlooked many a times. It is hard to act like ONE linkedin, very hard.The culture seems to be better for some groups, so do check with someone on the internal side if you can before you accept an offer. I have heard of great leaders across all groups - sales, product, marketing etc. but also pretty bad ones. So, some research will do you good.Overall, it has been a positive learning experience, but can definitely do with better culture, which always starts top down.",
        "advice": "If you hire smart people, listen to them. Replace your line managers with those that are actually concerned about their team/ work/ company Get real, it isn't as rosy as it appears.",
        "pros": "LinkedIn is a great place to work for those who are just out of college, in the early years/ stages of their career. At this point, one enjoys the various benefits the company has to offer like InDays, days that are organized around a theme such as giving back to the community etc. Other benefits like Free food, gym etc. Other pros include: decent 401 K match at 50% of your annual contribution, which is 9K USD for 20… 15. Health care, dental, vision coverage etc. are what you would expect from a silicon valley employer of repute. Finally, you will get a look of admiration when you tell people you work at LinkedIn, generally good for your profile. Work life balance also manageable in some groups, it was crazy times in 2012, but 2015 is much better. You can work from home when you need, some people do more routinely than others, and it is fine.",
        "summary": "Great company with potential but bad culture holding it back",
        "role": "Anonymous Employee",
        "date": "Sep 15, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "A complete lack of focus. We have no true competitors so we aimlessly wonder. Trying anything and everything. Everything team feels an inch deep and a mile wide.",
        "advice": "Being CEO and head of product doesn't work. You can't run a company and micro-manage the product team. Let the people you hired do their job or the trend of hemorrhaging employee will only grow.",
        "pros": "Pay and benefits. Decent culture at the main campus.",
        "summary": "It's easy when you're the only one on the hill...",
        "role": "Anonymous Employee",
        "date": "Sep 16, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "* Teams are bigger than they need to be* Co-ordination like activities are more valued than hands on technical contirbutions",
        "advice": null,
        "pros": "* Good work life balance* 50% 401k match* Good ESPP program",
        "summary": "-",
        "role": "Staff Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Senior Engineers are not held to a consistent standard for both hiring and promotions.The engineering tools' systems are a nightmare. If it wasn't built in house, it will not be used. No opportunity for open source solutionsMid-managers are unwilling to fix structural problems.Senior Managers are promoted on their ability to ignore structural problems.Feedback to any leadership is met with hostility a… nd retaliations.Lack of commitment to invest in automation.",
        "advice": "Open feedback to management.Change the tools culture to have a higher commitment to reliability/consistency.Invest heavier into automation by forcing the SRE organization to automate.",
        "pros": "Good compensation.Good benefits.Executive leadership appears to be trying to improve the company.Plenty of great things to do if you can budget your time well enough to do it.",
        "summary": "Poor tools, mid-level leadership hold a great place to work back",
        "role": "Senior Site Reliability Engineer",
        "date": "Jan 31, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "\"Old timers\" who have grown up with the company rule the roost and get promoted over and over again without an apparent clear reason, and there is a big gap between how they experience LinkedIn as a workplace vs how newer employees perceive it - little effort to bridge the gap and instill trust and loyalty.The company comes first, before it's employees, and it is \"not the right fit\" for an amazingly large num… ber of newer people... This is in spite of the mantra about supporting personal transformation... Please look inward, LinkedIn, because there are many amazing employees with whom you have missed an opportunity to cultivate growth and mutual benefit, and who have left actually feeling demoralized.Some disrespectful behavior from management in high positions (yelling, scoffing, sarcasm, bias of the \"privileged few\" who are out of touch with the masses, blaming, and other CYA behavior) is left unaddressed and continues on and on - the employees leave and the managers never improve.Words and actions too often do not match, e.g. \"I really want this to be a group decision / solution so please provide feedback and input\" really means \"Here js my plan already formed by me and now I want it executed, I expect you to support it and bring solutions where needed, if you can't solve the problem yourself then you are part of the problem so get out of the way.\"Expectations are oftentimes unrealistic given the current organizational growing pains, again please empower and support your employees to succeed...It's a fend for yourself environment and leadership does little to set folks up for successGeneral lack of empathy from management and luck of the draw whether you have other strong partners to help you succeed.Strong bias to protect and reward leadership and maintain the status quo without actually driving towards progress to really help the company succeed.\"Act like a startup\" mantra helps the company move fast but results in too many disparate silo-ed groups, with too little process which is needed in order to succeed at scale by supporting collaboration and leveraging each other's learnings",
        "advice": "Focus on better collaboration, coaching and drivers for individual, managerial and team successPractice what you preachBad management behavior should be rectified, at all levels of seniority, be true to your spoken values and help people improve and feel safe... Notice who is leaving and who is succeeding... High level folks need support too...Cultivate an ego-free, supportive and learning min… dsetProvide more transparency cross-functionallySupport cross-team collaboration instead of focusing so much on having parties all the timeImprove onboarding!!!Managers should act in support of their team members and not \"throw the baby out with the bath water\" when they struggle with expectations, when employees leave it just reflects poorly and publicly on the managers and the company as a whole...Revisit the questions you ask in the Sirotta survey, slice and dice it by seniority, tenure etc, great job to employ it and do so twice a year, yet you are totaling missing a critical set of feedback; many people feel insecure, told to do more and do better, lacking support, lacking time to innovate, and lacking autonomy - they feel dispirited - this is really a statement re more senior hires I think you probably do a more decent job with junior hires.I really want you to flourish and succeed so I hope you won't dismiss this as bitter commentary, and rather accept it with an open mind - like I said Sirotta doesn't ask all of the important questions....And by the way GTO seems the unhappiest part of the company... Isn't that Ironic?I will not recommend any more of my friends to apply until I see radical change because too many have had awful experiences regardless of division, function or role and I regret having encouraged them to apply or stay.",
        "pros": "Opportunity for rapid advancementBenefits are unbelievableCompelling missionHuge potentialDoing a lot of good in the communityGood paySmart, talented and nice colleaguesDecent work life balanceInteresting problems to work on",
        "summary": "It's \"not a good fit\" for a lot of people!",
        "role": "Anonymous",
        "date": "Feb 5, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Significant gap between where they are and where they need to go. A preference for \"getting shXt done\" (company value) over strategic thinking and following good business plans. In the past year, LinkedIn made a concerted effort to bring in more seasoned professionals to address the process and systems gaps. The culture doesn't embrace the processes required to mature and move to the next level of strategic and opera… tional sophistication. The culture is locked into the move fast and get shXt done approach despite it being a close to 10000 person company, which causes endless re-work.",
        "advice": "The teams outside of engineering and sales add great value to running the LI business. Human capital and people are critical assets and should be not be treated as a tactical consideration that is made at the very last minute before major issues/decisions are made.",
        "pros": "Amazing benefits and great pay.",
        "summary": "HR",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Senior Management is very closed",
        "advice": "Change players at the top",
        "pros": "benefits are good and compensation",
        "summary": "Director",
        "role": "Anonymous Employee",
        "date": "Feb 24, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- management does not care about you- elitist culture from top down- limited career growth",
        "advice": "Add empathy/compassion to the CPP. That should be table stakes for being a manager/director/VP etc.",
        "pros": "- well designed office- healthy cafeteria- gym onsite",
        "summary": "Software Engineer in SF",
        "role": "Software Engineer",
        "date": "Jul 29, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "LinkedIn's culture only applies to certain groups and people, for example inDay is not available to everyone. In some groups employees cannot participate, in other groups activities and the amount of time need to go through an approval process first, however there is a set limit for hours also in certain departments that can be taken per quarter.Micromanagement of employees is the preferred management style, anyt… hing besides the main task e.g. types of meetings need to be on the list of approved meetings and can only take a certain amount of time per month, quarter, etc. Employees will receive a warning if they spend too much time going to and coming from a meeting which makes it difficult to prepare for meetings or even just go to the bathroom before or after. You will not be treated like an adult but more like a toddler with strict boundaries.If you point out to management that the department should live by LinkedIn's values and culture you will be told \"if you don't like it, the door is wide open\" and \"we will move you away from the groups and departments that live the LI culture so you are not exposed to it if you continue complaining\".Team outings, summits, offsite events, conferences, or team building activities are only available to employees in a certain location or in a certain group.There are no career development or training opportunities. You were basically given this one job but cannot advance.",
        "advice": "Top management and management in headquarters is unaware how employees are treated in different locations.",
        "pros": "LinkedIn's CEO is one of the bestValues, culture and mission are commendable",
        "summary": "Hostile Work Environment",
        "role": "Anonymous Employee",
        "date": "Aug 13, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is a lot of implicit bias at LinkedIn. The gender ratio is pretty balanced at low levels, but the opportunities for growth are still limited to a boys club.One effect of this is that I have never seen anyone in the product management or product marketing orgs have a good return from maternity leave. When these women come back, they are put into less visible and less interesting roles...or in one recent … case, pushed out of the company within a year of coming back. These are capable women who are seen as non capable by the senior leaders the minute they announce their pregnancies. As a true example, when I announced my pregnancy to my vp he replied \"congratulations... I think.\"There is a lot of lip service around the length of leave and benefits to new parents, but the biggest benefit is to go back to a job that you care about and...I haven't seen that happen.",
        "advice": "New hires should not be prioritized over existing employees when hiring-- especially women who return from maternity leave.Managers should care about people, not just metrics.",
        "pros": "Free (and generally great) food. Smart colleagues. Lots of mandatory fun events like a company wide chili cook off and team offsites.",
        "summary": "Bad Maternity leave experience",
        "role": "Product Manager",
        "date": "Sep 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Pays lower than peers & their products lack development of what you'd expect from a tech company. Leadership doesn't like ideas that differ from their own (despite what they claim about their culture). If you don't speak like them, walk like them and act like them, you'll have it tough here if you last at all. Cliques & gossip is the norm at LinkedIn. And don't be older than 30.",
        "advice": "Live what you say about your culture and values. Diversity of ideas and viewpoints may actually aid your growth",
        "pros": "Great benefits, food and work/life balance. Very smart people aligned to a goal who truly love and believe in LinkedIn's vision. The best database of people and jobs in the world. You will learn or improve while you're here",
        "summary": "Sales",
        "role": "Sales Manager",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There have been a number of job reductions as a result of the Microsoft acquisition. It is sad to see many great people leave. We have had turnover in finance, legal, hr since this happened. We've also lost a number of engineers. Not as exciting as it was under Jeff solely. Things have changed.",
        "advice": null,
        "pros": "Benefits, pay, stock, cafe, professional pics, IT reachable on site",
        "summary": "Finance",
        "role": "Finance",
        "date": "Dec 12, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Basically if they dont like you, they will set you up to be fired. Change info on cases to get tou in trouble. Harrass you to male you feel uncomfortable. Will and can be intimidated by others success. Dont want you to get ahead and will get rid of you if they feel you are a threat or will trump the leaders personal goals.",
        "advice": "Be mature and act as a leader. This isnt a popularity showcase or highschool.",
        "pros": "Got off to a great start. Overall friendly place except for the department I was in put on a front for about a month.",
        "summary": "Support group",
        "role": "Accounts Receivable",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Terrible tech stackImpossible to push anythingShort term focusPolitics",
        "advice": null,
        "pros": "Free foodLax hoursInteresting speakersFreedom to work on what you want",
        "summary": "Highway to mediocrity",
        "role": "Anonymous Employee",
        "date": "Apr 3, 2011",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "\"Top Down\" Management StyleSenior Management is disconnected from EmployeesVery PoliticalHeadquarters is disconnected from Satellite officesLong-term vision is not aligned with the realities of the marketProduct development is sub-par.",
        "advice": "Spend some time listening to your employees, you might learn a thing or two. The users seem to be taking a back seat towards monetization.",
        "pros": "Brand RecognitionEmployees are NiceFree FoodCompany is relatively stable and has a long-term visionTech support is responsive",
        "summary": "The most fun I never want to have again",
        "role": "Sales",
        "date": "Apr 14, 2011",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No opportunities for career growthOffice space is cluttered",
        "advice": "Get you act together",
        "pros": "Free FoodGymInteresting problems to solve",
        "summary": "Great potential, but management, leadership sucks",
        "role": "Anonymous Employee",
        "date": "Apr 16, 2011",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Extremely politicalInexperienced and weak technology leadershipEngineers are not valuedEngineers spend >50% time dealing with turf battlesExecutive team disconnected",
        "advice": "Learn to build a real technology organization and stop reward failures and punish successes",
        "pros": "Good brandInteresting problem spaceDoing well financially",
        "summary": "Extremely political work environment",
        "role": "Senior Software Engineer",
        "date": "Feb 12, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Processes are brokenFake atmosphereAll issues are covered up and not addressed but at some point they will be discovered",
        "advice": "To senior management: finance is shockingly bad! Mianagers are extremely incompetent and have no clue.",
        "pros": "Free foodTravelling and big budget if you work in sales and marketingCan do attitudeInformal atmosphere",
        "summary": "Employees were invited to answer in a positive way",
        "role": "Finance",
        "date": "Jul 25, 2012",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management is terrible, some eng managers are super sharp and hardworking, however. There is no work-life balance, everyone works like a dog.",
        "advice": null,
        "pros": "Ok benefits, ok food, has a small gym and they try to celebrate milestones, can be pretty festive.",
        "summary": "Bureaucratic and management is chaotic.",
        "role": "Anonymous Employee",
        "date": "Dec 29, 2012",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "no appreciation for excellence. lot of backstabbing. don't open your mouth about things you don't appreciate or you will be outcasted. some country managers can be evil. Out of 60 reps, less than a handfull achieve their quota. good days are long over!",
        "advice": "keep hiring young guns because the more experienced employees will leave the company, bit by bit. mind the headcount. it can become a saturated market.",
        "pros": "the perks are great, salary is alright and as a young grad or professional you can learn a few things here.",
        "summary": "Over-hyped company to work for",
        "role": "Sales",
        "date": "Sep 19, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Very limited career progression opportunities if you are in sales. There's no concrete promotion criteria. Targets unrealistic. Management incompetent, brainwashed, racist. If you are a lousy manager, can apply to Linked- high probability you will get hired as we are not very selective.",
        "advice": "Start treating people like adults not like college kids",
        "pros": "Free food, pension and healthcare benefits",
        "summary": "Not great at all",
        "role": "SMB Account Executive",
        "date": "Sep 25, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Less than desirable culture in Singapore. Middle management are clueless, very political and offer very little assistance in growth and development.Note to sales people: Don't join LinkedIn Singapore if you want to make some money. No one hits their target. Not because of a lack of talent, but due to unrealistic goals in a ridiculously small assigned territory.",
        "advice": "Spend more time with your team on the ground in South-East Asia. It's not enough saying it, you need to actually do it. Your middle management team are painting a false picture. You will find yourselves losing some incredibly talented people.",
        "pros": "Great technology and one that will no doubt continue to have a huge impact in the market now and in the coming years. Free lunches.",
        "summary": "Great technology, poor culture",
        "role": "Enterprise Sales Manager",
        "date": "Oct 11, 2013",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Top downIt's a pure sales organisationMoves very very slowly",
        "advice": "Optimise the business outside of direct sales. operations ability to be more efficient is being killed by putting all the companies focus on direct sales",
        "pros": "Able to learn a lotThere is free lunch and snacks",
        "summary": "Good but very salesy and top down",
        "role": "Senior Sales Operations Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "A lot of talk about being top 1%, but very many people did not seem to be focused on the business. Underperformance was widely accepted. Also, you need to fit in to there culture, there is very little room for the individual, if you not fit the norm of the young , hip employee that love LinkedIn.",
        "advice": "Put some proper management process in place. Treat people as individuals.",
        "pros": "Very good perks and salary, nice office environment and a highly transparent company. Cool product",
        "summary": "All culture and no focus on the business",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It is a very political environment where everybody is afraid to speak up.Managers, both junior & senior, are more interested in their own careers then in the company.The company values are used as buzz words at every possible occasion, but never put to practice.Above average employees are micro-managed into leaving.",
        "advice": "You have hired a lot of really smart people. Trust them to do their job without micro-managing them into leaving the company.",
        "pros": "They know how to hire good people. I have met numerous amazing people working here, smart, dedicated and very friendly.",
        "summary": "Not nearly as good as senior management pretends it to be",
        "role": "Anonymous Employee",
        "date": "Nov 8, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "LinkedIn suffers from what others on Glassdoor have called a 'cult like' belief in its mission to help the world's professionals. This belief is drilled into people from day 1 and any deviation from the script is met with disapproval.Middle Management in the London office is/was poor. I suspect this may be down to the legacy of the old guard who have very generous share options and as a result don't want to r… ock the boat.In LinkedIn Marketing Solutions - the sales team are king. If you are not in the sales team, you are there to service the sales team. This as you can imagine leads to a lot of resentment. Not short of ego at the best of time the behaviour of some of the sales team can be insufferable especially if you challenge their thinking on a client.",
        "advice": "Try to dial down the LinkedIn culture - You're not Facebook or Google yet you try and appropriate their culture and call it your ownRefresh the old guard who have a bigger mouthpiece but offer little valueThink beyond the sales team. There's some brilliant supporting functions but they are usually relegated to a footnote in meetings",
        "pros": "I'm writing this 12 months after I left LinkedIn Marketing Solutions as I believe sufficient time has passed to offer unbiased and constructive notes.The perks are good - such as free food, gym, and other fitness classesOpportunity to travel and meet a broad set of smart and nice colleaguesOpportunity to grow or expand your skills in adjacent areas of interestsGood fun / social events",
        "summary": "Drink in the Kool Aid at your peril",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "After 2015 , LinkedIn has been growing very rapidly. With hundreds of new employees joining every quarter, the culture has been impacted negatively. Office politics, favouritism and managers favouring those that rate them well in annual surveys - typical big org management problems have now crept into LinkedIn. Used to be a great place but has lost its good culture",
        "advice": "Encourage HRBPs to have more discussions with employees to understand the issues. Build trust with employees. Hire good leaders who have good EQ",
        "pros": "Good office. Some nice colleagues. Lot of importance given to transformation and growth.",
        "summary": "Used to be a great place",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Sad place to work with unrealistic targets and a complete lack of collaboration, you are on your own....period. You have to find out how things works by trial and error. I was very surprised by the unconnected work environment and very boring useless routines, no dynamics at all. Working hours is like a competition, the one who stays long hours wins.",
        "advice": "Get your self educated and learn how to run organisations and how to motivated teams. Stop management by fear. Have worked in large organisations before with very good managers, who where trained and educated. That is a rare finding at LinkedIn DUBLIN and the result is employee turn over.",
        "pros": "Lots of perks and a good introduction. Pretty attractive package offered at the first place that led to assumptions that you would make some money.",
        "summary": "Not the most inspiring place to be",
        "role": "Account Executive",
        "date": "May 6, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Below the very top level - generally poor quality management. The reality is that LinkedIn offers a great working environment but doesn't pay above the industry average so doesn't attract the very best managers - for ambitious ones it is more a good place for them to get on their CV then move on to a well paid role in another tech firm.Account exec role isn't structured to do large deals - you do one deal and…  pass the account onto a relationship manager. Companies more often than not use a first deal to test the solution on a small user group. Causes much frustration amongst AE's as they put a lot of work in for a small deal - then a year later a less experienced RM takes an order (often after very little effort or customer interaction) for a much bigger deal and gets all the credit.The Account Exec role is very hire and fire. In the time I was there a number of AE's got terminated in their first year (often for missing one quarter of target, or simply because their manager didn't like them). No Relationship Managers (or sales managers/directors) were fired in that period - it is a much easier and better role - although not fulfilling if you're an out and out salesperson that wants to do deals - they generally just process renewals and the quality of salesperson in the RM world is much lower.Lots of uncertainty with recent Microsoft acquisition - culture will almost certainly change for the worse and who knows what kind of place LinkedIn will be to work in a year.",
        "advice": "Stop hiring and firing people after 6 months - it takes longer than that to bring in large deals in the real world. Don't give managers absolute authority to sack people they don't like - safeguards need to be put in place.",
        "pros": "As a whole a good place to work with excellent benefits. Free food and snacks, good parties, company wide trip to Vegas etc. Generally - the people at LinkedIn are awesome and you will meet a number of friends for life here.",
        "summary": "Don't take an Account Exec role - hire and fire environment",
        "role": "Account Executive",
        "date": "Dec 13, 2016",
        "is_current": false
    }
]