[
    {
        "rating": 3,
        "cons": "As I said in the \"pros\" above, it all depends on which division or team you land at the Company. Different divisions or teams can vary widely in terms of working environment. You may land in a good place, as I said before. But you may land at some bad places, where the environment is almost hostile, and all interactions are very loaded. You may spend more time dealing with the inner politics of management and your co… -workers than with actual work. It may also have rather unreasonable working hours and make your life quite stressful. Finally, even though employees are supposed to move between teams fairly easily, that may not always be the case, and you may see yourself stuck in a not so desirable situation.",
        "advice": "Remove all obstacles for moving between teams. Even though that is supposed to happen, it can still be made difficult in some teams. If all employees were allowed to move freely between divisions, it would make clear that some divisions need to improve.",
        "pros": "First: it has some great benefits. The Health Insurance is top notch, and these days that is really important. It also has a number of morale events, the campus is really good (especially with the latest additions), you most probably will have your own office, there are free pop and Starbucks coffee, and it is fairly easy to get equipment. The payment is good as well. In addition, depending on which division or team … you land, you may find a great work environment, that will allow you to make your best work and work with some great people, and have reasonable working hours.",
        "summary": "Depending where you land, it may be a great place to work",
        "role": "Software Development Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Long hoursForced ranking system forces your manager to rank some people low -- even if their entire team is composed of \"star employees\"Raises are only inflationary unless you get promotedThey underpay -- especially for entry-level employeesConstant pressure and stress from management to performGood people have been layed offA lot of politics involved in promotions",
        "advice": "You say you value talent over experience. Not true.",
        "pros": "Your experience here is well recognized outside of the firmCan switch jobs every 2-3 years",
        "summary": "They work you hard, and underpay you, but the experience can help when you leave",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Highly structured.Abrasive and aggressive people.Your experience will vary from group to group.",
        "advice": "Revisit the awards system, it's incentivizing the wrong behaviors.",
        "pros": "Great benefits.A lot of smart people.Good to start a career and learn.",
        "summary": "Your mileage may vary",
        "role": "Anonymous Employee",
        "date": "Aug 30, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too much politics. Some groups are fine the others are worse, especially in old groups like windows and office. .",
        "advice": "Cut the layers of management. Cut Program manager. Everybody should be devs except a few manual testers. . . . ....",
        "pros": "A lot of high quality people. tons of projects that you can choose to work on. . . . . . . ..",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Working across a large corporation can be difficult to enact and effect change, which is very similar to many large companies.",
        "advice": "Develop a strong, clear vision and help the disparate internal organizations to understand, work together and follow through on this vision.",
        "pros": "It is a large, internationally recognized corporation. It possesses a market leadership position across the software industry (and generally across the computer/IT related technologies).",
        "summary": "Working at MIcrosoft",
        "role": "Product Manager",
        "date": "Sep 7, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lots of long hours. Expect crunch times every project, usually lasting anywhere from 25 to 40% of the product cycle. Deathmarches, as they are called, can put unrealistic expectations on you, 70-80+ hour weeks for months at a time, including weekends.",
        "advice": "Trim the ranks of middle management. When you dissolve divisions and liquidate groups, trim some of the management fat as well. Managers should be managing their people more than their products.",
        "pros": "Great training and mentoring programs. A fabulous company to start your career. Excellent benefits and good starting salaries. Brand recognition. If you want to work for the biggest and the best, Microsoft is the place to be.",
        "summary": "Microsoft",
        "role": "Software Test Engineer",
        "date": "Sep 9, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There are so many corporate re-organizations that it is rare to have the same manager for a whole year in a row. All career development & advancement is based on competitive performance reviews. People who end up having multiple managers during the course of a review year are at a significant disadvantage when it comes to promotions and career growth because the managers who conduct the review have often only wor… ked with the employee for a very short period of time, and are unaware of the larger contributions a person has made prior to that person becoming the manager.",
        "advice": "Limit the frequency of corporate/group reorganizations. For a manager to provide an accurate performance review, she must have at least a full year of experience with the people she is managing.",
        "pros": "There are no stupid people to deal with. The work is interesting. It has a fast-pace environment. There is always something new to learn, and a new challenge just around the corner.",
        "summary": "Technical Writing at Microsoft",
        "role": "Writer",
        "date": "Sep 11, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "If you have a bad manager or management chain you will be stifled and may not get fairly assessed come review season. Most people tend to be both smart and competitive.",
        "advice": "Too many management layers. Too much power given to low-level managers.",
        "pros": "Microsoft has excellent benefits and professional development opportunities. If you have a good manager and management chain, job satisfaction will be high. You can still learn a lot about what not to do even when things take a downturn. There are almost always opportunities to learn and grow even when the political winds change direction.",
        "summary": "Great benefits and work/life balance. Job satisfaction can vary.",
        "role": "Program Manager",
        "date": "Sep 12, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lots of politicsLots of brown nosing to get promoted.Review process sucksTreated as something the company can throw away if not required.",
        "advice": "Lets become more flexable and think of the customers more. We are a company that can't respond to our customers. We also treat customers and peers beneath us.",
        "pros": "Good Medical and gym benefits. Cheap Microsoft software and the ability to get onto lots of dog food projects. Well structured career",
        "summary": "Review Headline",
        "role": "Program Manager II",
        "date": "Sep 16, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work was not challenging or interesting enough. A lot of code that is just doing routine things. It is not just Microsoft, however, it is necessary by the nature of the work. I am just not so much of an engineer, my background is in math and theoretical computer science, so I enjoy interesting things where you have to think, not just seeing technology work.You have to be excited about your work. You do not ha… ve to work 14 hours a day (or even 10, really), but you do have to be excited and want to learn new technology, get a better developer (or a better Microsoft developer, more specifically) or getter tester, or manager, etc. This may seem like a good thing (and it really is!) --- but this is also somewhat forced. You have to identify where you want to grow (when you work there full-time) in a written form, then the company will help you - coach you, move you to another project, etc. You cannot just say \"I just want to work here for my 40 hours and get paid\". You have to find out yourself what you want to do. You have to load yourself with work, come up with new ideas, take the initiative, etc. This is required. So they are requiring and taking some of your emotional or spiritual energy in this way.Too much admiration for Microsoft. Gets annoying to see all those monitors and posters and emails, advertising, how happy is everyone is at Microsoft. Even though it is not far from truth, a lot of people are very happy and very excited from working there.... - but this also gets annoying. Seriously, I cannot stand some many people claiming to be excited about their work every day, everyone from smiling drivers of the shuttle cars on campus to those working in the cafeteria, to researchers, developers, managers... It looks too good to be true, made me feel uncomfortable.During my internship I was not given enough information on what was expected of me. It took me some time to understand that people just expected me to take the initiative. For example, they may not tell you \"you have to do it by next Friday\" --- but you will have to ask \"what do I have to do and by which date?\" If you don't, they will think you don't know what's going on (because you don't care to ask around) so not interested, or you are not a productive worker. They will find somebody else to do the job, or the project will move slower (they have many projects; sometimes 2-3 teams, doing the same thing, so at least one can succeed :)), and you will get a not-as-great review and may be eventually asked to leave. Although, I admit, this is fair in a way. If you have the initiative, go for it.A lot of emphasis on getting the work done (which is good), but not as much on making people do what they are good at. The responsibility is totally on you. You have to figure out what you like and what you don't, what you are good at or not good at. You have to take the initiative. (Then, in many cases, you will actually be able to move to a position that you want.)Many developers, testers, etc. are, it seems, not too great in terms of their skill, as Microsoft is a big place. However, talent is always recognized, and people are always trying to get better. If your background is limited and you need to learn a lot, but Microsoft still takes you --- then prepare to work a lot, too. It may actually be a lot of hours every day. (Yet again, nobody will count, and you can do it at home.)Redmond location - there are some commute issues. Microsoft is working on that (like their \"the connector\" is a great thing), yet this will always be an issue.So-called starbucks coffee is no good, and cafeteria food is average (I have seen pretty much their best cafetereia during the on-campus interview.)",
        "advice": "Don't repeat all the time how great is Microsoft. There is already enough enthusiams from below.",
        "pros": "The benefits were decent. The pay for a summer intern is above the industry standard.There is a lot of respect shown towards the work of all employees and interns alike.Everyone is doing real work.No micromanagement at all. I was only told once in the beginning I was kind of expected to be at work from 10 to 4; however, I repeatedly showed up at work at 1 p.m. and there was not a single remark about it. (… Of course, it was my problem when I had to work on some weekends to have the work done, but again, nobody was counting when I was working and for how long.)Very open structure, a lot of communication going on (not necessarily a plus for me, but Microsoft is very communication-oriented).Great technology.Everything is optimized. Like, you think it might be a good idea how to improve something: signs in your building, meeting schedule, some internal rules - you send an email, and you immediately get a friendly response, and people start working on implementing your suggestion (or disucssing it) as long as you want it.Seems to be very fair for reviews, promotions, salary increases, etc.If you are invited for an on-site interview, you will get reimbursed for everything. You can negotiate another day in the hotel, negotiate where you want to fly from and to, ask for another 5 free taxi vouchers, etc. They don't care what you where for the interview (or when you work there). They don't care if you have a weird haircut or sexual orientation. Only your skills, your passion for technology and for the customers, and your enthusiams matter. A lot of appreciation for the good work you do.",
        "summary": "Best or average, depending on whether you have passion for technology and ready to take the initiative all the time.",
        "role": "Software Development Intern",
        "date": "Sep 20, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Current economy and situation has created a logjam of once good people in the senior ranks of those who are interested in protecting their careeers at all costs, and willing to prevent those coming up from advancing in the process",
        "advice": "I'd suggest cleaning out at the most senior / partner level rather than at the lower level next time. Realize that good people will leave once the economy improves.",
        "pros": "Great benefits, smart people. Almost everyone is trying to do the right thing. Some good opportunities in the entertainment division.",
        "summary": "Good safe harbor",
        "role": "Group Program Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The overall hierarchy, and politics that takes place every where and every time.The downside particular for MSIT for new hires is that the work is not as exciting and challenging, and you'll be left wondering a lot of times is it worth spending time here versus else where. However, It will be good for people that is interested in IT processes.",
        "advice": "Learn to lead with intrinstic motivation and values, instead of just offering stocks and money.",
        "pros": "Great benefits - Drinks, Salary, Flex schedule, Tuition reinburse, Vast amount of books & trainingLots of variety of work in Microsoft, and have opportunity to explore different areas.",
        "summary": "Microsoft IT isn't a good place for college grads",
        "role": "Software Development Engineer",
        "date": "Sep 28, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Review system sucks. I don't like the way they meseaure people. Some bad managers as I heard of. My manager is okay, that is why i stay with same group for long time",
        "advice": "less middle managers, ask them to do the real job instead of just talking and picking",
        "pros": "Flexible work, okay paystub,benefit is very nice",
        "summary": "Overall.MS is a good place to work",
        "role": "Program Manager",
        "date": "Oct 1, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lack of innovative culture, too many middle-aged people whose primary concerns are their family as opposed to creating the next killer app. No longer has the \"we will change the world\" mentality, has become a company whose primary purpose is to serve shareholders.",
        "advice": "Promote innovation, be more agile, and put innovation and employees before shareholders. Nobody wants to work at a technology company in order to \"fulfill their duties to their shareholders\". People would rather go work at a place where the primary objective is to change the world.",
        "pros": "Work with incredibly smart people, access to advanced technologies and know-how. Ability to create products and features used by literally billions of people worldwide, the ability to have large impact.",
        "summary": "Incredibly smart people, no longer has the passion",
        "role": "Software Development Engineer",
        "date": "Oct 2, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "too many directions, and lots of unnecessary competition among different divisions within the company. it might've been better off if microsoft were split into three during the antitrust suit.",
        "advice": "think from customer's point of view, not from microsoft's or window's point view. make product easy to use, not piles of features that no one knows how to use.",
        "pros": "excellent medical insurance, all your family gets covered without penny out of your pocket. majority employee gets his own office.",
        "summary": "Microsoft is becoming the next IBM.",
        "role": "Software Development Engineer",
        "date": "Oct 7, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "bad managementtoo much overheadprocess over resultperfomance review does not really measure performance. In fact, I have no idea what does it measure.",
        "advice": "less overhead. focus more on result and less on process. get ride of the performance review, which is giant waste of time",
        "pros": "flexable work time and great training. working with very smart people who are very good at what they do. good pay",
        "summary": "Not too impressed",
        "role": "Anonymous Employee",
        "date": "Oct 9, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "In the 10 years I've been at Microsoft, the company has more than doubled in size, bureacracy has increased by an order of magnitude, and many great engineers have left for better opportunities elsewhere. We're involved in EVERYTHING and screwing it up because due to the continuous over-promising and outright lying by mid-level execs to their managers. There are too many people wyo are not engineers working for this … engineering company, and they are NOT the folks at the front who have accounted for virtually all of those laid off.",
        "advice": "Change from the top down. If you want to \"cut the 10 percent\" every year, apply that to those at the top also, like Jack Welch did. And stop screwing around with these \"trios\" or \"triads\" - you can't build anything by committee.",
        "pros": "Great, smart, friendly people, big company involved in many areas (a pro and a con), excellent benefits.",
        "summary": "It Ain't What It Used To Be...",
        "role": "Lead Software Development Engineer In Test (SDET)",
        "date": "Oct 15, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "a. Review system is ridiculous, only the managers' good friends are recognized.b. There are lots of politics at the middle management level, so many times the project that you've worked hard to complete might be cancelled just because one mid-manager did not like the other mid-manager.c. So many layers of management, it's bewildering.d. So many cost-cutting measurements, butd.1 Marketing Managers go t… o Paris with their espouses for a week with all expenses paid by the company.d.2 1 billion (with a B) dollars were spent in bonuses with the top management, even with their horrible results.e. There's no way for someone to grow a career unless you go to management.f. There's a reorg every 6 months where everything changes, including your manager. So you need to re-work your relationship with the manager, who already has his/her group of friends to protect.g. And last but not least: the specter of another layoff always looming at the horizon.",
        "advice": "1. Flatten the structure, put those mid-managers to work!2. Change the review system so peer opinion is valued more than manager's opinion.3. Please say once and for all if we'll have more layoffs.4. Resign! You did not make the cut in 10 years, didn't work until now and it will not work in the future!",
        "pros": "a. Very knowledgeable people.b. Access to technology.c. Excellent benefits.d. Seattle region is beautiful all year round.e. Good diversity.",
        "summary": "Used to be an excellent place to work, now with layoffs it's just like any other.",
        "role": "Software Development Engineer",
        "date": "Oct 24, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Slow product cycles do not keep up with Industry- 2-3 year product cycle means that the pace of innovation and progression is very slowLaggards and awareness of broader indusrty is low- Sometime you feel that they don't pay attention to important trends in the industry that will bite them in the long term.",
        "advice": "Balmer needs to go and introduce a CEO who can manage this behemoth- the only other suggestion would be split the company into atleast 3 pieces- Windows, Office & Entertainment and Devices.",
        "pros": "Excellent benefits- transport, healthcare, work from home, cafeteriaTraining- numerous great training sessions on messaging, positioning and options to expand",
        "summary": "Excellent training- great benefits, but not innovators- bogged down by politics, multiple mandates that can distract.",
        "role": "Product Manager- Office",
        "date": "Oct 25, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Crowded place, can get easily lost there. Incompetent managers. Review system sucks big time.The work place can get very unfriendly because every because everybody fights for good reviews",
        "advice": "Try to understand people better. Don't just copy other companies, foster innovation inside the company as well. The review system is crap",
        "pros": "Lots of cool technologies. Many leading products are developed at MS. Some teams value innovation, security and quality, but not all.",
        "summary": "Why working at MS?",
        "role": "Software Development Engineer",
        "date": "Oct 31, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Juggernaut career climbers who destroy a group to make themselves look good. A company who's only strategy is to draft behind innovators and maintain profits for the big shareholders. Impossible to get anything done without getting buyoff from tons of people. Employees are incredibly unaware of what's going on in the rest of the industry. Strong sense of entitlement.",
        "advice": "Stop buying other people's innovations and start really putting your own blood into the game. That's the only way this company is going to learn how to own what it sells, care about the customer, and really be accountable instead of just talking the talk.",
        "pros": "Good pay and benefits; good work/life balance on my team, but it depends what team you're on. It still looks good on a resume.",
        "summary": "Customers don't matter",
        "role": "Content Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Management seems to be full of managers and leads at all functional levels either technical or non-technical.",
        "advice": "Managers need to be better trained to guide and advise the staff.",
        "pros": "Great benefits with lot of talented and technical people from all over the world. Very diversified.",
        "summary": "Microsoft's workplace and benefits.",
        "role": "Anonymous Employee",
        "date": "Nov 4, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Geeky and nerd culture is prevalent.- You feel as if your whole life revolved revolved around Microsoft",
        "advice": "The company needs to put its best brains into the web-based application and web-content fields so it can effectively compete against Google and the like. The paradigm shift towards Web-based computing is looking more and more possible especially for the average consumer. The workstation will always have its place but it may get limited and confined to professional use",
        "pros": "- Lots of opportunities to learn. This is especially good if you are just starting out your career- Given a lot of individual responsibility unlike some other companies- Depending on what you are working. the work can be rewarding as it will have a very wide audience",
        "summary": "Great place to learn",
        "role": "Software Development Engineer",
        "date": "Nov 16, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "average salary/bonus, low stock price, less risk averse towards new technology",
        "advice": "Lets be more like WIndows 7/ZuneHD in both the consumer and business market to win share!",
        "pros": "Best benefits, smart group of people to work with",
        "summary": "Smart group of people, average salary/bonus, best benefits, less risk averse towards new technology.",
        "role": "Software Development Engineer",
        "date": "Nov 21, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "PoliticsRidiculous curveOutside experience is not valuedVery few people know how to listenFocus on details and processes that don't matterBelief that they are successful because of their mistakes not in-spite of them",
        "advice": "Flatten the org... way too many levels and fiefdoms",
        "pros": "Smart team matesOpportunity to change the world",
        "summary": "Slow and political",
        "role": "Program Manager II",
        "date": "Nov 21, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "bad managers can screw up ur career, can take years to rebuild, I've had both good and bad managers, have been promoted so I know what I'm talking about, very political. Employees who have been working here for 5+ years really know how to screw others in reviews (ex. your friends talk badly about you behind your back to your manager). Employees don't really know whats going on outside of MS and generally don't care (… or care about customers too much). average pay",
        "advice": "Train your middle managers and execs instead of just getting them into a room once a quarter. If a manager gets bad reviews from his reports and the team has high attrition and low morale through the annual poll, move him. don't give him a chance to get back at people who gave him the bad review.",
        "pros": "smart people, challenging work, can move around to other opportunities without leaving city or company, free drinks, really good benefits,",
        "summary": "Great if you find the right team + manager.",
        "role": "Group Program Manager",
        "date": "Nov 22, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Progression through the company is slow given the static nature of management. Bonuses and pay raises are very small and stock awards vest too slow.",
        "advice": "Make the company more of a meritocracy. Trim products and businesses that the company does not have a core competency at.",
        "pros": "Work life balance is great. The work is creative and intellectually challenging in nature. Great training and mentoring provided to all employees",
        "summary": "Working at Microsoft",
        "role": "Program Manager",
        "date": "Nov 26, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Review system designed to force people up or out, and pits peers against each other.- Bureacracy and mgmt overhead adds significant cost to getting things done.- Mgmt direction changes frequently",
        "advice": "Build on your existing assets and deliver products that end users want.",
        "pros": "Working with a lot of really smart and competent people. Chance to work with a huge range of software technologies. Fairly generous corporate policies and benefits.",
        "summary": "MSFT can be a really good place to work and develop your career.",
        "role": "Program Manager II",
        "date": "Nov 27, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Work/Life balance can be bad (depending on your team), recent layoffs have dampened the morale of employees (nobody knows if there will be more layoffs), lots of pressure to perform better than your peers and get promoted, too many layers of management, too many meetings (so work is often done after hours), huge amounts of process get in the way of getting work done, hard to move inside the company (almost the same i… nterview process for internal & external candidates)",
        "advice": "In the interest of morale, layoffs - if they can't be avoided - should be done in one large cut instead of dangling them over the workforce for a long period. Hierarchies should be flattened and useless layers of management cut. Make it easier for people to transfer inside the company and good teams will attract more talent while bad teams will fizzle out naturally.",
        "pros": "Competitive pay package, great health insurance & benefits, lots of little perks, access to cool technology, challenging & interesting workplace, smart & diverse coworkers, employees are encouraged to advance their careers within the company, good training classes, opportunities for promotion (depending on the team you're in)",
        "summary": "Good and Bad",
        "role": "Program Manager II",
        "date": "Dec 4, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The way review process is set up, it forces developers to put substancial efforts on being 'visible'. I think these efforts could be spent more on development activities.",
        "advice": "Quality should be one of the very key aspects of review process and career growth. Visibility probably has positive sides, but in reasonable amounts.Another aspect which concerns me is that often we're 'catching up' with competition. I think we have enough talent and resources to actually be at the front of innovation and competition.",
        "pros": "Opportunity to work on a wide range of technologies and products.Working through couple of release cycles on big projects, helps building wide range of skills, essential for shipping a product.Good benefits; lots of trainings, tuition assistance for continuing education.",
        "summary": "Good place to broaden and deepen skills, participate in development of wide range of products",
        "role": "Software Engineer",
        "date": "Dec 12, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Indecision with upper management led to layoffs with recent acquisitions.",
        "advice": "Don't buy companies if you don't know what you are going to do them.",
        "pros": "Smart and Collaborative Environment - always felt surrounded by competent individuals that were capable of working in teams.",
        "summary": "Smart People, Indecisive Upper Management with recent acquisitions",
        "role": "Consultant",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Boring! Other companies in industry are doing much more interesting things.- It's a huge company, don't expect to feel much camaraderie with coworkers or be kept informed of (the few) interesting things going on in the organization.- Very top down (compared to startups and other companies in the software industry).",
        "advice": "- Innovate more.",
        "pros": "- Good pay/perks for the area, job stability.- Not as many long nights as at a startup.- Company has a lot of resources.",
        "summary": "Comfortable but boring",
        "role": "Software Development Engineer Intern",
        "date": "Dec 16, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Unbalanced worklife, management favoritism and restrained career growth",
        "advice": "Management should ensure more knowledge of reports in terms of skill set and allocate amongst each for desired career growth of each individual",
        "pros": "Ahead of technological curve, great place to get in touch with latest and greatest",
        "summary": "Software developer at Mircosoft",
        "role": "IT SDE II",
        "date": "Dec 20, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It's hard to get things done because the company is so large. There are many people that seem more interested in building their empire. There is also a culture of \"appear smart\", it would be humorous if it wasn't so ridiculous. Pick your division, it's amazing the number of \"smart\" people running divisions that are not performing as well as they should. However, there will continue to be the mind-numbing strategy rev… iew, mid-year review, prssm, wssm, target setting, budget review.",
        "advice": "Steve needs to step down. Good person, very smart person, but his leadership choices are amazingly bad. Just look at the org chart, who is still there and who has thrown in the towel and moved on.",
        "pros": "There was a time when one could truly change the world while working at Microsoft. There was (and still can be) a purpose in the work. The people are great, the benefits are even better.",
        "summary": "It's hard to watch ....",
        "role": "Anonymous Employee",
        "date": "Dec 21, 2009",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Only negative feedback on performance, then they smash you in the review. Everything is a competition, and there are many hidden expectations. Watch every word you say, because it *will* come back to you.",
        "advice": "You do a great job of talking the talk, but not so much actually walking the walk. Learn how to actually train or hire competent managers. Managers who aren't supporting their people need to be trained or replaced. Employee development shouldn't be a cutthroat experience.",
        "pros": "Outstanding benefits. Really, the best I've ever gotten. Good work/life balance. 3 weeks of vacation from the start. Work is sometimes interesting.",
        "summary": "Windows 7/8",
        "role": "Senior Software Development Engineer In Test (SDET)",
        "date": "Dec 22, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Glacial speed of promotions after you reach the principal/director level.Stock doesn't move in the positive direction.Hard to have an impact. Too many stars have to align before anything gets doneVery insular and inward looking culture.Hardworking technical employees aren't always recognized. The more politically astute/aware you are: the better off you are if you are looking to be promoted.The re… view process can be extremely demoralizing. Very good employees can get pulled down in the stack rank because their managers aren't strong or well established.",
        "advice": "Encourage more innovation. Today any project that isn't seen to have the potential to be a $1Bn business (or part of one) will be cut. As a result, we rarely build anything new.Reward people who \"get-it-done\". Microsoft is full of people who write specs, pretty powerpoint decks, vision docs etc. Strong engineering talent is misused and misdirected into merely creating architectural sketches and vision documents w… hen they would be much happier building cool products.",
        "pros": "Great Benefits package (health, health club, 401k match)Flexible work environmentYou get your own office that you dont have to share with any one else.Reasonable compensation if you are not aspiring to be a high flier.Great co-workers and peers.",
        "summary": "Glacial pace. Expect to spend at least 2 years before you ship a product",
        "role": "Anonymous Employee",
        "date": "Dec 22, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lazy seniors, too little work lets done. Growth and learning process lacking. too many people doing one thing.",
        "advice": "Leadership need to be emphasized. Too little control at the top.",
        "pros": "the pay compensation is excellent. You are not burdened with loads of work. easy to get personal time off.",
        "summary": "Excellent pay package compensates for lack of growth",
        "role": "Marketing Manager",
        "date": "Dec 28, 2009",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Stupid higher management who just care for their own careers and not really customer and company, performance review process is completely screwed, too much bureucracy and too much waste of time in collecting statuses and doing useless meetings",
        "advice": "Money is a good motivation but getting driven by creating something awesome is even better. Stop thinking about money and start thinking about how you can create technology which can improve people's lives. Money will come automatically.",
        "pros": "Good challenges at work, knowledgeable dev leads, intelligent collegues and individual office space.",
        "summary": "Just another technology company",
        "role": "Senior Software Development Engineer",
        "date": "Jan 4, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "the startup kind of feel is missing. Management is more middle aged and hence innovation and new ideas take back seat to tried and tested methods",
        "advice": "encourage new ideas.. start innovating rather than reacting to competition. We have a tremendous brand value and we are not utilizing it properly to increase our market share",
        "pros": "This is one of the best places to work in the SW industry, Talented and awesome coworkers. you get to learn so much from peers",
        "summary": "Great place start your career",
        "role": "Software Development Engineer In Test (SDET)",
        "date": "Jan 5, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Its not the same company it was even 2 years ago, let alone 10-30 years ago.No Work/Life Balance (depends on the team)Lack of civility between co-workersToo many layers of managementDirector level and above trying build their own empires instead of focusing on the bigger picture",
        "advice": "Admit what worked 2 decades ago is no longer working so the company can move on. A big shakeup is required.",
        "pros": "Good pay and very good benefitsGet to use the latest (MS) technologyGood opportunities to change roles every couple of years (but less than before)",
        "summary": "It all changed with the layoffs",
        "role": "Program Manager",
        "date": "Jan 5, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "senior management seems to lack any vision, all roads lead to redmond, very very political, market is saturated with our current products and leadership is week on new and upcoming technologies",
        "advice": "What are our core values and products? Do we really need to keep loosing so much money on things like search and mobile before we make them profitable? Let's return to being thought leaders instead of followers.",
        "pros": "Great health benefits, good salary and opportunities for bonuses, well regarded in the industry, free soda, huge customer install base",
        "summary": "Nice benefits",
        "role": "Systems Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Majority of software employees are socially retardedToo many Indian visa workersWeather in Seattle sucks",
        "advice": "Stop micro managing. hire smart people and let them do their job. Consider not having one manager to every 3 people, its a little too heavy of a ratio dont you think",
        "pros": "PayBenefitsWork enviromentGet to work on the latest technology",
        "summary": "Good pay, socially retarded people",
        "role": "Software Engineer",
        "date": "Jan 9, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Projects at Microsoft face a lot of overhead, and this hurts the smaller innovative ones. The many layers of bureaucracy built to support the large businesses are applied to the smaller ones. And the many inter-dependencies (technical and business) often interject unwilling stakeholders.",
        "advice": "Besides figuring out how to effectively grow innovative projects, the biggest improvement would be for the senior leaders (i.e. the presidents) to show some inspiring product vision.",
        "pros": "The benefits are top notch and the pay is competitive. It's important to come in at the right salary level though, as it's difficult to catch up to where you should be through the normal review process.",
        "summary": "Cushy job, frustrating agility",
        "role": "Anonymous Employee",
        "date": "Jan 15, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Very political. More important to look good than to perform well. Little support from other groups as everyone is evaluated relative to each other. If I do well, then someone else has to do poorly. If you happen to work in an area that is in favor with the company's execs, then life is good, itherwise it can be very poor. Even if you are a super performer, if you are in a group that is out of favor, you will suffer.",
        "advice": "Consistently apply the review model across all levels of management. Increase visibility and transparency between GMs and above and below. Select a direction and fund it appropriate to the results you want to achieve.",
        "pros": "You really can change the world at Microsoft. The complication is that it has to be in an area that is in favor within the company, otherwise you are doomed to insignificance and continual justification and reductions. Great benefits, some really smart people who are passionate about what they are doing.",
        "summary": "Work at Microsoft only if you are in an area that is \"in favor\" with executives.",
        "role": "Anonymous Employee",
        "date": "Jan 25, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "the salad days are over, and the process for doing things is laborious; Microsoft gets in its own way a great deal of the time; trying too hard to be all things to all people so the USP is hard to nail and communicate to customers, too focused on reviews and leveling, too bureaucratic",
        "advice": "shakeup management",
        "pros": "incredible resources, full of smart people, nice atmosphere, plenty of different career opportunities, huge portfolio of products, sustainable long-term business",
        "summary": "Still a great company, but ... lost thought leadership to Goog, APPL",
        "role": "Marketing Manager",
        "date": "Jan 27, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "competitive coworkers makes it a hostile working environment for poeple to enjoy work. too many departments resulting in the delay of projects",
        "advice": "did not like virtual team environment and writing bi-annual performance review when it is not necessary - did not make the teams do any better",
        "pros": "great benefits, great location, and very resourceful for employees. opportunities to travel and get in contact with various people in the industry",
        "summary": "my time with msft",
        "role": "Anonymous Employee",
        "date": "Jan 27, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Staff is over-booked on their workloads. Job coordination between sites or locations is stressed. Communication between sites and locations is lacking.",
        "advice": "Take notice on what your direct reports are telling you and listen.",
        "pros": "Lots of hours and hard work but pay is good for Fargo, ND. Benefits are excellent. Most people are good to work with and friendly.",
        "summary": "Lots of hours",
        "role": "Software Development Engineer In Test (SDET)",
        "date": "Jan 28, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Politics are rampant in all groupsLots of people collecting paychecksBullying wins over common senseAdvancement is limited unless you move to Redmond",
        "advice": "Operations Management team -Promote from within. The eBay management team took over and tried / failed at implementing a single architecture support org. Change doesn't happen overnight and you have to understand the group before you have yet another org change to cover up your blunders. Need a better model and get rid of the eBay groupies.At higher levels don't base reviews on cross group collaboration w… hen you choose what projects people work on. If you don't assign cross group projects you shouldn't be measured on this. Seems so obvious.Product Development / QA / PM Management team -You rock! Love the new structure QA / PM / DEV. Drives fast iterations and clear lines of ownership!Microsoft Management -Get better ways at evaluating employees. You have all this technology to understand metrics but don't apply this for employees performance. Divisional VP's seem out of the loop and middle managers are lost leaving IC's to wander. Get some accountability for the managers of managers and those commitments that you say are supposed to be open and passed around to be measured ... WHEN WAS THE LAST TIME YOU FOLLOWED UP ON THESE?!?!",
        "pros": "Pay is really good if you've been there a while.Benefits, vacation, sick time all generous.Facility is outstanding.Good opportunity to learn.",
        "summary": "Great pay and Benefits with no advancement. Good place for rest and vest types...",
        "role": "Operations Program Manager",
        "date": "Jan 29, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- below average pay-low bonus",
        "advice": "- Done an awesome job with xbox and Windows 7!- Gotta start recognizing employees more",
        "pros": "- Windows 7++ Best OS in the world! and they let you learn all about it!- Switching groups is easy and there's lot of options: search(bing :( ), gaming (xbox), cloud (azure), OS (windows), mail (hotmail :( ), Apps ( Office)",
        "summary": "not so great",
        "role": "Software Development Engineer In Test (SDET)",
        "date": "Feb 2, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "if you dropped to bottom 10% of performance, you are done. Unlike the years before 2009, they will cut off those guys",
        "advice": "stop the layoff",
        "pros": "a lot of teams you could choose to jump if needed, though not many openings in the past 2 years",
        "summary": "big company on the down way",
        "role": "Software Engineer",
        "date": "Feb 8, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Difficult to climb the ranks if entering in the high 50's to low 60's leveling - resolve to be a cog in a machine.",
        "advice": "Clean up the fat in the exec ranks, divest!",
        "pros": "Exposure to the complexities of innovation vs regulation in an enterprise leader and global company",
        "summary": "Great place for recent college grads, not an innovator",
        "role": "Program Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too many levels of middle management, lack of respect for individual contributors, ruthless upper management.",
        "advice": "Stop trying to reinvent the wheel. Innovation is great, but experience and expertise does count for something. Laying off folks with experience and expertise doesn't pay off. Outsourcing is not a cure-all, and in the long run increases costs and lowers customer satisfactioin.",
        "pros": "Great benefits, smart people. Lovely large offices. Reasonable food and drink easily accessible. Nice company store.",
        "summary": "Outsourced to the max",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "no clear management direction; always re-orging with no clear reason why; it's who you know, not what you know or do-very political; very Redmond-centric - strange for a supposed technology company",
        "advice": "Stop the constant re-org's and let people get work done; cut out the political reward system",
        "pros": "Pay and benefits; infrastructure and tools to do job",
        "summary": "If you live in Redmond and don't mind constantly re-justifying your existence due to reorgs, you'll like it here",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The downside is that you have to have a good manager. Like everywhere, if you get a bad manager, you are screwed - this is amplified at Microsoft.",
        "advice": "Too much in the way of middle management at Microsoft. The SLT needs to wake up to the fact that without ICs, there would be nothing - don't keep promoting and investing in leads/managers that year on year perform badly in mspoll.",
        "pros": "It is a fun environment with lots of smart people. You will be working for one of the best technology companies around today.",
        "summary": "Pick your position/manager well.",
        "role": "Program Manager",
        "date": "Feb 18, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Culture is whacked...like joining the flat earth society. Hold onto your hat. Worth getting a year or two experience but then move on.",
        "advice": "You're not the only employer on the earth. I'm going to take all my hard earned experience to someone who will appreciate it.",
        "pros": "Benefits, major budgets, smart people",
        "summary": "If you're experienced pro coming into Microsoft, beware",
        "role": "Senior PR Manager",
        "date": "Feb 24, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "You are responsible to drive your own career - believe this. Networking with all those who have input in your annual ranking is important.",
        "advice": "keep looking for great people!",
        "pros": "There are a lot of positions - plenty of good things to do, but choose carefully. You don't want to get into a position that isn't set up for success.",
        "summary": "Good experience can be gained at Microsoft.",
        "role": "Anonymous Employee",
        "date": "Mar 1, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "But a toxic culture. Especially for vendors who are treated as second class citizens.Trust me, the people at MS are smart. This said, the toxic culture kills any creativity that surely exists within its talent pool. Good luck if you take a position as a vendor. Be prepared for not so subtle abuse.",
        "advice": "Ability to recognize talents. Drop the abuse and trial by fire. Encourage collaboration and idea sharing amongst your employees. Foster creativity. Get rid of Ballmer.",
        "pros": "Mentally stimulating and quite challenging work. Extremely smart co-workers. Free software, an abundance of educational opportunities. MS has an army of smart people.",
        "summary": "Paying your dues...",
        "role": "Support Analyst (Vendor)",
        "date": "Mar 2, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "1. With the wrong manager, there's nothing you can do to succeed2. If your project goes into crunch mode for the longterm, you could find yourself stuck with 80 hour weeks and no alternative other than to do them or leave the company, because there are ways to hold you on your team if they don't want to let you leave (related to: wrong manager)3. No raises without a promo, I hear, currently4. Jobs can be … so narrow, and involve so much administrative overhead, that you spend a lot of your time on work that doesn't enhance your skill set or make you more employable elsewhere in the future5. The company's spending money on what seem to be money-sinks right now, which is good if you want to get into a money-sink team with a fancy title and leave it in a couple years for another company, but not necessarily good for the long term6. Don't say you were not warned: the same job can be titled and compensated very differently depending on the organization. In general, money-sink groups like search and Xbox tend to offer better compensation than bread-and-butter established groups like servers, Windows client, and Office.7. Even if you carefully select a team to join based on its manager, which is the recommended way to do it at MS (choose manager first, then job), this can get up-ended by a divisional or departmental reorganization that can give you a manager that is not a good fit for you and there's not much you can do about it",
        "advice": "Invest in your successful franchises. They're still going to be bringing money in for years to come. Instead you're IE'ing them, and ignoring them figuring that you don't NEED to spend money on them. Reality: If you DON'T continue to invest highly in them, that is only going to accelerate the move to the \"cloud\", an area in which you have much more competition.",
        "pros": "1. With the right manager, you have access to potentially life-changing career advancement opportunities2. In some groups, you have the chance to work with people who are the best in the industry3. If you've got a family and want free insurance coverage for the whole brood, MS is the place for you4. Casual-dress culture and the tradition that still endures of periodic \"morale events\" for teams is nice… 5. If you're in the right position in the right group, you can get exposure to Microsoft business expertise (even if you're in a technical discipline) that will stand you in great stead in the future",
        "summary": "It ALL depends on your manager",
        "role": "Programming Writer",
        "date": "Mar 10, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "-some groups have mid/uppper managers that micromanage or hold people back...lack of trust and autonomy-some people value having their egos stroked above having great work accomplished. Some take credit for other's work.-managing your management is a bigger indicator of success than delivering quality work that get results-very rare for bad managers to change or be removed because the system supports them… . Fear of retaliation prevents workers from being honest to their management when there are ethics issues or people are being treated disrespectfully.",
        "advice": "-root out bad managers. Find a way to do it. Break down the old boys network. Stop the rewards system that encourages people to knock other people down to make themselves look better.",
        "pros": "-many opportunities to move around within the company-can learn on the job to expand skills; some very smart and talented people to learn from-good upward growth for junior-level people-budgets to execute large-scale and global projects that wouldn't be possible at small companies-knowledge and use of technology",
        "summary": "Can be amazing, can be painful",
        "role": "Group Manager",
        "date": "Mar 11, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "MS have some bad managers who are excellent individual contributor and no people management skill. I had one with no people / social skill.",
        "advice": "Please find people managers and not promote IC",
        "pros": "MS is great place to work. Health benefits is the best and none to match. If you are very young, compete for everything with some excellent skill set, this is the place.",
        "summary": "need good managers",
        "role": "Software Development Engineer In Test",
        "date": "Mar 16, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "It is sort of a \"union shop\" for lack of a better work. A decent fraction of management are promoted just because they've been there for a long time and haven't totally screwed up.",
        "advice": "Anyone with direct reports should have a 360 review at least once per year.",
        "pros": "Healthcare is great!comp is ok",
        "summary": "Microsoft, it doesn't completely suck",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Little opportunity to grow, you compete against old timers who have been there their entire life, so your only chance to make it is if they die or retire.",
        "advice": "N/A",
        "pros": "Working with smart people from around the world, access to the latest technologies, first world facilities, superb benefits.",
        "summary": "If you don't join right out of college, forget it.",
        "role": "Software Development Engineer In Test (SDET) II",
        "date": "Mar 23, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "It was a little too large for me.",
        "advice": "Please make the organization more lean and flexible so that we can compete with Google! Why not allow and encourage workers to buy the best phones in the market: the iPhones!",
        "pros": "A lot of growth opportunity, great benefits, and a great reputation to put on your resume.",
        "summary": "Great job",
        "role": "Software Development Engineer",
        "date": "Mar 25, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Culture is very dependent on which organization you join at MSFT. Not all have the same focus on drive and resutls",
        "advice": "The leadership in some organizations would do better by beig more transparent and more communciative regarding decisions and reasons for such",
        "pros": "Great opportunites to learn and work with great people. Awesome benefits -- medical, dental, vision, retirement, stock, MS Prime, all of the extras",
        "summary": "Good company with many personalities",
        "role": "Senior Program Manager",
        "date": "Mar 25, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Tremendous internal competition makes sharing best practices difficult. Focus in many groups is \"internal\" vs. market-oriented meaning that people are rewarded for successfully navigating through the bureaucratic maze rather than solving real problems.",
        "advice": "Stack ranking must go--force best practice sharing to speed innovations. Stop wasting developer time on re-building mouse traps which can be bought much more cheaply on the open market.",
        "pros": "Great benefits, smart people and exposure to interesting problems. Significant resources if you work on a hot project. Great place for someone beginning their career or wanting to learn high tech.",
        "summary": "Great first job",
        "role": "Group Manager",
        "date": "Apr 1, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too bigToo many senior peopleHard to move once at a senior roleNo salary incrementTuition benefits not much",
        "advice": "Good exposure to lot of areasWorking with smart peopleAbility to move around the companyVery good benefits for health and dentalToo bigToo many senior peopleHard to move once at a senior roleNo salary incrementTuition benefits not much",
        "pros": "Good exposure to lot of areasWorking with smart peopleAbility to move around the companyVery good benefits for health and dental",
        "summary": "Development Manager",
        "role": "Development Manager",
        "date": "Apr 4, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Its a huge company with too many people doing similar or variant tasks and the company culture fosters competition but it invariably turns out to be back-biting politics.",
        "advice": "Cut the long release cycles and try to deliver innovations quickly to market.",
        "pros": "Microsoft hires really smart people from all levels and hence there is a lot of intellectual horsepower. It also has the Trio model of PM, Dev & Test for feature development though sometimes PM and Test might be absent.The trio model is unique as it is supposed to foster innovation by looking at three different points of view, but in my personal experience, either Dev or PM tends to dominate depending on whet… her the product is a back-end product or has a lot of UI.Test is always on the receiving end since they have to play catch-up both in testing the products and also developing automation.",
        "summary": "Great place to learn about the ins and outs of software development",
        "role": "Anonymous Employee",
        "date": "Apr 9, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not open to new ideas.Processess are slow, it easier to create a new process then get rid of an old one.Probably not going to do well going forward in the consumer space.",
        "advice": "Fear the underdog, make better products and stop just doing the same thing over and over because it worked for Windows and Office.",
        "pros": "The company has a hand in a lot of things, so you can find something you like.Makes software everyone in the world uses.Career growth is unlimited if you work the system.",
        "summary": "Good company with good people, just needs to be turned in a different direction.",
        "role": "Software Development Engineer II",
        "date": "Apr 14, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "not fair, manager fight for political reasons, not merit based promotion, top manager does not know or try to learn technology, it is becoming a local government agency",
        "advice": "change ceo, hire those who start up good small companies. don't managers who failed into new management positions, if they failed, they have to start from scratch",
        "pros": "good health benefit, good big campuseasily get insulated, meet many peoplesocial opportunities, nice view in seattle,good office",
        "summary": "big corporate buraucracy",
        "role": "Software Development Engineer",
        "date": "Apr 14, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Politics and hubris. The folks that have only known an MS a career are very adept at company polotics, and there is a very strong \"not invented here\" mentality that keeps their accomplishments from being truly great. The main claim to fame is watching someone else open up a market or idea, and then buying them out.",
        "advice": "Take a good long look at your mid to front-line management. The senior leaders are defintiely heading in the right direction and have vision, but you're getting cut off at the knees by those who are simply maintaining the status-quo while paying lip-service to the initiatives and ideals espoused by the leadership. And you're going to need to look hard, these folks have made careers out of looking busy while blowing s… unshine up your rear.",
        "pros": "Benifits - they can not be beat unless you join the United States military or get a long-standing government job",
        "summary": "A great place to be mediocre.",
        "role": "Build Engineer",
        "date": "Apr 19, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Over the years, politics play a more and more important role in career advancement. Managers stretch employees too thin. Also competition among employees is fierce and overly heated. Constant reorgs happen in almost every product group and mellow managers are thrown out in reorgs. The ones remain in the managing positions drive employees to the verge of breaking them, which is counter-productive.",
        "advice": "Need to really care for employees. Throw out the ridiculous annual review model!",
        "pros": "Good physical working conditions like private offices, on-site showers. Good benefit programs. Smart and competitive co-workers.",
        "summary": "Too much politics in ladder-climbing, overly competitive and thinly stretched employees.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "1) Companies wo frequently comment about work-life \"integration\" probably have a problem with it.2) Tougher to find next role at level 63+3) Feel too pressured to do a new job every few years. Would like to enjoy being a \"professional in place\"4) Data quality needs improvement",
        "advice": "Train managers to help employees to grow and develop. Seems like managers are just trying to manage their own careers and metrics.",
        "pros": "1) Well recognized company name and products helps you cut to the chase when talking to IT decision makers. No time wasted on positioning your \"best of breed\" solutions2) Resource rich3) Health benefits",
        "summary": "Field Sales - Now what?",
        "role": "Sales Representative (Opportunity/Territory Manager)",
        "date": "May 2, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Super political. If you are not on the good side of your manager and management chain, then you are screwed at this company.",
        "advice": "Upper and Senior Management SUCK at Microsoft. They need to get away from the \"toys in the sandbox\" mentality and do what is right for the company. Management also needs to seriously work on how they communicate with \"underlings\".",
        "pros": "Day to day people that I worked with were fantastic. Mostly willing to help others out when needed. GREAT benefits.",
        "summary": "Yeah, I would work there again...",
        "role": "Solution Manager",
        "date": "May 3, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- The management often seems like they don't know what they're doing - certain products look like they have no business plan- Engineering excellence is low in most people's priorities",
        "advice": "Management should put stronger value in good engineering; perhaps we should incorporate that in the review process and in the manager selection process.",
        "pros": "- Interesting, often bleeding edge Computer Science problems are a regular part of my job- The compensation isn't bad",
        "summary": "Interesting Problems, Poor Management",
        "role": "Software Development Engineer",
        "date": "May 8, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The company has way too much politics. I've been on many teams and got many promotions. Early in your career it is more about merit and what you deliver. Once you get to the senior levels and look to principal levels, it is all about politics and who you know - personal connections trump merit. There are many middle managers that have not delivered much stay in their positions because of good connections upwards. As … a company we need to be better and quicker about reducing the layers and removing people that are not accomplishing much - there are a ton of other smart capable leaders waiting for those roles that can do a better job.",
        "advice": "Program management discipline has lost its course. It's all about managing processes, filling out checklists in specs, keeping your sr. management happy. A program manager's number one priorirty should be about building the right product ! I see so little passion for the building the right product at Microsoft. Bring back passion for building the right product!",
        "pros": "Some of the smartest people to work with everyday, lots of passion for customers. Great benefits, the healthcare plan alone makes it hard for me to ever leave the company. Easy to move between groups and work on almost any important innovation in the technology industry.",
        "summary": "Great people but politics hamper innovation and career growth",
        "role": "Senior Lead Program Manager",
        "date": "May 9, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Review process sucks! Very weak feedback regarding career advancement.",
        "advice": "Cross group collaboration is extremely poor. Lack of vision from Sr. Management is appalling.",
        "pros": "Microsoft has the best benefits and it wants to take care of its employees. Had the opportunity to work with very sharp and smart people.",
        "summary": "Great company, not so great management",
        "role": "Anonymous Employee",
        "date": "May 9, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The company offers good benefit, but not at-par salary for employees who joined the company earlier than the new employees.",
        "advice": "revisit company policy about compensation for employees serving the company for years and make sure these loyal employees are rewarded for their loyalty",
        "pros": "Microsoft is a global leader of IT technology. The company is always trying to find ways to innovate and impact the world.",
        "summary": "good company",
        "role": "Anonymous Employee",
        "date": "May 13, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Below market salary. Communication between people on the team is terrible and even though they know it, there is nothing they will do about it. The offices are dark and dreary. You are pretty much dropped at a desk and it's your responsibility to figure everything out on your own or ask people, eventhough no one really seems like they have the time or interest in answering your questions.Expect to spend 2 yea… rs before you feel a little bit comfortable.",
        "advice": "Become more customer focused!",
        "pros": "Very interesting work and bright people! Excellent benefits and flexibility in work schedule. Opportunity to move to different areas within the legal department. High level legal issues involved.",
        "summary": "Long hours, interesting work, desolate work environment",
        "role": "Paralegal",
        "date": "May 20, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Keep making the same stupid mistakes as a company, and those who make the mistakes keep getting rewarded and promoted until they really mess things up big. Then they are dismissed only to start the whole cycle over again. This feels like insanity!",
        "advice": "Focus on customer satisfaction (quality, key needs met, compelling product updates regularly) and they will happily buy your products. Keep employees happy (work-life balance respected, end death marches, give them honest career feedback and advancement opportunities, reward the people who do good work not the people who create their own crisis then solve it) and they will continue to work hard for you.",
        "pros": "Results-oriented culture, plenty of resources to get things done, people are helpful. Reasonable focus on learning and employee development. Generally get the right computer equipment to be productive.",
        "summary": "Good environment but politics ruining honest rewards and promotion",
        "role": "Senior Software Development Engineer Lead",
        "date": "Jun 3, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Some business owners that I know doesn't know much of what they are doing, they are simply doing what they were told to do any never try to drive the overall growth of the company",
        "advice": "I think this reflect to my cons of working at Microsoft, I don't think everyone is so bright as you think and a lot of people are simply sitting on their ass and collecting salary. I think a business person needs to know a bit more about the technical side, as same as the enginneering team may want to know a bit more on the business side.",
        "pros": "Working at Microsoft gave me a pretty good experience that you could get a chance to work with one of the brightest people.",
        "summary": "Excellent work place",
        "role": "Technical Program Manager",
        "date": "Jun 7, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "My managers have been decent, but not necessarily great for me. To a large extent, it's about personality, and I'm a bit difficult. My current manager has been great.There's a bit of a bubble mentality among some employees -- not all -- who don't necessarily see other options available to our customers.To make an impact, you need to be deep within your role; having a broader perspective isn't necessar… ily valued.You need a thick skin to handle the abuse from outside the company.",
        "advice": "Don't buy into your own propaganda that only Microsoft is capable of accomplishing certain goals. That's not the case, and such a worldview is dangerous to the company.",
        "pros": "The compensation is good for reasonable amounts of work. Maintaining a solid work life balance is easy. When I have a team I click with, coming to work is nice.",
        "summary": "Mixed feelings",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Feeling tiny, expendableLess than thrilling work in most groupsTechnology has much room for improvementOverwhelming politics, infighting, etc.",
        "advice": "Communicate to your employees. Mini Microsoft is running your public relations. Employees just feel defeated, and left to their own devices to piece together the motives for your often bone-headed moves.",
        "pros": "Free drinksFree bus passQuality insight into how software companies workBig company name to have on your resumeGood pay",
        "summary": "Web Developer",
        "role": "Anonymous Employee",
        "date": "Jun 15, 2010",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "-Infrastructure causing communication breakdowns-Difficult to collaborate to impact change-No efficiency in project management/ resource management",
        "advice": "Manage resources and people more skillfully",
        "pros": "- Great resources- Good facilities- Good people",
        "summary": "Quality Assurance for Customer Service and Support Group",
        "role": "Program Technical Lead",
        "date": "Jun 16, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "unstable - products (and jobs) are killed often; layoffs are frequentno placement help when products are cut, despite stellar track record and top-notch reviewsno clear focus or vision for the company at largewhile they are making strides with Windows and Office and continue to lead (versus OSS, though??), they are #2 at best with other offerings - Xbox, search, phone, etc.",
        "advice": "put processes in place to ensure you are able to retain talent when products are cutquit chasing the competition and focus on an area where you can win - like impeccable customer service",
        "pros": "strong benefitsfair payability to move around the companygood networking opportunitiesyou can work as hard or as little as you want to",
        "summary": "\"benefits are good; be prepared to compromise integrity to get ahead\"",
        "role": "Senior Marketing Manager",
        "date": "Jun 17, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "There are some dumbasses too and you just gotta wonder sometimes. Cutbacks and layoffs are taking the magic away. Wish it was in the City.",
        "advice": "Millennial employees have different expectations about their work. You need to shape the work environment to suit them better. They are the future of the company.",
        "pros": "Cool technology here. Smart people but not the nicest people for the most part. Your own office! Great resources to support your office work.",
        "summary": "Dog eat dog",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Microsoft is run like many small companies that don't coordinate well. While, it's trying to change the current climate an attidue makes it diffcult to try very different things. And it's easy to see how the internal process has difficulty keep up with or leading in the competative landscape. Passion about doing great things can get dampened pretty quick by institutional inertia and disagreement about how things shou… ld get executed.",
        "advice": "Microsoft has many many great assets at it's disposal. If we could just get our act together, get our ducks in a row, we would be doing much better. We need to take bigger bets with our less profitable businesses, and not try so hard to hold onto small disperate business groups each trying to make thier own profit.",
        "pros": "It's a fairly easy lifestyle and work enviornment. There is a high focus on personal quality of life and family. A steady work ethic will establish a long stable life here.",
        "summary": "Comfortable place for good workers. Hard place to push change.",
        "role": "Anonymous Employee",
        "date": "Jun 25, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lower than average compensationArchaic software development methods (fixed planning / development / stabilization schedules)In-house cafeterias could be betterThe push is towards \"coolness\" instead of \"usability\"",
        "advice": "Please understand, date-driven development is bad, and it's not mandatory for cross-team coordination.Innovation is great, but usability is more important. We should polish the product instead of cramming features in.",
        "pros": "Exceptional benefitsIf the team is right, you get to work with some of the brightest minds of the planetMost full time employees get an office and privacy",
        "summary": "Good place to work for... junior devs",
        "role": "Software Engineer II",
        "date": "Jun 25, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "But it's not all rosy. There are certainly a lot of things to be aware of, if you have never worked at Microsoft.When I joined, I was surprised by a few things about the organization:1) It's true that promotions are hard to come by. You could go on for years with pretty good annual reviews but still not be promoted for various reasons. This is incredibly frustrating and had I known this earlier, I wou… ld have done more then rather than to learn it after several years. But I believe it takes a certain type of person. You need to know how to manage upwards extremely well. Talk to your manager. Be firm about what you want and when. Be incredibly focused on what moves the needle. And have great impact and influence on others. It's easy to be distracted on other things.2) It takes a long time to get things done. Because it's such a large organization, great ideas take time to cultivate and turn into solid strategy, priorities, and action items. There are so many people to get buy-in from. But if you build the relationships and understand how the system works, you learn to factor that into your daily work and projects. If you come from an entrepreneurial background and you are used to doing things quickly or on a whim to test out, etc, then I would caution you to think hard about this. Get used to simple things sometimes taking months to complete.3) There are a lot of managers here who don't do a good job of balancing both their individual contributions with their managerial responsibilities. It's definitely hard because a manager wants their team to perform well but they also want to contribute directly to the organization's success. Balancing this effectively is hard and few do it very well.",
        "advice": "I hope that management will learn to cultivate better managers and empower managers to find creative ways to recognize employees more frequently. Also, due to the various divisions at Microsoft, collaboration ACROSS divisions can be very hard, despite the consequences on our business that exist if collaboration doesn't occur.",
        "pros": "This perspective is from the Online Services Division, specifically the ad platform teams.Similar to many other reviews, it is nice that we have beautiful offices, pretty decent compensation (more on this later), and super smart people.Unlike many other divisions, Microsoft is not the dominant force in this particular industry. So the varied stereotypes of a \"monopolistic Microsoft\" or \"large company … intent on a closed software system\" here, do not necessarily hold true. You can see that in conversations with customers. They want us to do well. They want us to be a strong, viable competitor to the other big players in the online advertising industry. This is a huge plus when it comes to the willingness of customers to work with us, especially given our big name. It also manifests in a strong focus and collaboration among the dedicated engineering, business group and sales teams. It's a pro in the sense that the advertising business needs to be an open ecosystem and that is refreshing if you've never worked here before.One other pro that I'll mention is the fact that there is incredible talent in the strategy teams. There's a ton of great strategic work going on here that you can get behind and use as your north star. Knowing that executives are working hard to make sure we're well-positioned in the industry makes the work all the more worthwhile. That determination is clear throughout the organization.",
        "summary": "You learn to appreciate what working for Microsoft really means.",
        "role": "Senior Product Manager, OSD Advertising Platform",
        "date": "Jun 25, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Generally not a very dynamic place, compared to other high tech companies. Big on process and complex (and deep) org charts. They like to lock in development cycles for at least a year at a time. Interesting decisions seem to be made based on complex internal politics among the many, many high-level managers.",
        "advice": "Look at how other companies are achieving greater agility -- it's not with heavy processes and lots of Program Managers.",
        "pros": "Pay is good. Benefits are fantastic. They are very systematic in terms of performance reviews. There are some good people and they have lots of opportunities for training and networking within the company. Relatively secure -- going to be around for a while.",
        "summary": "Good for some people",
        "role": "Anonymous Employee",
        "date": "Jun 26, 2010",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Be prepared for the bureaucracy. There will be times when requests must be vetted through what seems like dozens of teams before anything gets done.",
        "advice": "Stock awards given to me were about as worthless as the underwater stock options they replaced. Need more financial incentives.",
        "pros": "Free sodas and a reasonably smart group of people who are always willing to work with you and work late.",
        "summary": "OK",
        "role": "Anonymous Employee",
        "date": "Jun 28, 2010",
        "is_current": false
    }
]