[
    {
        "rating": 5,
        "cons": "Long commute distance, not convenient for me to go to work. But carpool is good choice for people who does not prefer to driving to work.",
        "advice": "Raise the compensation and benefits to certain level please, I know quite a few employees leaving MS for this reason.",
        "pros": "With flexible working hours I like the good work-life balance here in MS. Also, the campus is beautiful. Although the food is not as good as it in Google, still a good choice.",
        "summary": "Sde II",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's easy to get spoil by Microsoft benefits",
        "advice": null,
        "pros": "- Good career development plan",
        "summary": "Great company to work for",
        "role": "Software Development Engineer II",
        "date": "Jun 25, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I have no complaints about microsoft.",
        "advice": "None",
        "pros": "Microsoft is good company to work for, good benefits and good co-worker around you.",
        "summary": "Sr. PWB Designer",
        "role": "Senior Printed Circuit Board Designer",
        "date": "Jun 27, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Work-life balance gets unbalanced for many people. It's definitely possible to keep a healthy work-life balance, you just need to be disciplined about protecting your personal and family time.",
        "advice": null,
        "pros": "Big challengesHuge potential impactGood compensationGood benefits",
        "summary": "Terrific place to work",
        "role": "Senior Software Development Engineer",
        "date": "Jun 28, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes have to work overtime",
        "advice": null,
        "pros": "Great company culture. People are nice.",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Politics More overheard Silos across teams",
        "advice": "Build great productsContinue Innovation",
        "pros": "Culture Perks Location People Products Campus",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Jun 30, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "becoming out of touch with technology",
        "advice": null,
        "pros": "great company to work for. respected",
        "summary": "AE",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Redmond centric could be a con when located in abother state/country",
        "advice": null,
        "pros": "Excellent company o work with. Excellent performance can be achieved driven by the tools and highly skilled personel",
        "summary": "My view of Microsoft",
        "role": "Anonymous Employee",
        "date": "Jul 3, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Very large company, which can lead to change taking longer than you want.",
        "advice": null,
        "pros": "Innovative, thought-leader CEO, focused and inspirational mission",
        "summary": "Superb employer with many career opportunities",
        "role": "Group Manager",
        "date": "Jul 5, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Game of Thrones management. Management is equal parts brutally bad and some of the best in the world. Need to remove crap managers.",
        "advice": "Focus on being the best company in the world to work for again. And fix the healthcare mess.",
        "pros": "Wide portfolio to move around the company and work on awesome products if you ever get bored.",
        "summary": "Amazing people! Amazing tech!",
        "role": "Senior Program Manager",
        "date": "Jul 6, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Very big company, things move slow at times.",
        "advice": "Great leaders for the most part - keep pushing on collaboration and helping others win",
        "pros": "Great people and opportunity to learn a lot, opportunity to truly be an expert in your space.",
        "summary": "Sr. HR Director",
        "role": "Senior Human Resources Director",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "not sure i have something now",
        "advice": null,
        "pros": "nice work, really fun thing",
        "summary": "test review",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Frustrating hard work, great salary a world that you dont want to be without",
        "advice": "More fun",
        "pros": "Family, fun, transparency , unique, lovely peace love world desire hard work",
        "summary": "Unique",
        "role": "Information Analyst",
        "date": "Jul 7, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Tons of work, tough competition, slow career growth.",
        "advice": "The current compensation system compared to the previous one is better for the company but worse for the employees.",
        "pros": "Big impact, smart people and sometimes cool projects.",
        "summary": "Nice place to work",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Microsoft will take every hour of your time if you let them, it takes discipline and work to maintain balance between personal and professional life, but that's the case anywhere these days.",
        "advice": null,
        "pros": "Benefits are progressive, with a focus on wellness and preventative care. Lots of family oriented assistance as well. Team members are smart and collaborative.",
        "summary": "Been here 20 plus years and still love it",
        "role": "Anonymous Employee",
        "date": "Jul 11, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work to be done in mobility",
        "advice": "Keep going",
        "pros": "Great benefits and great people",
        "summary": "sales director",
        "role": "Anonymous Employee",
        "date": "Jul 11, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lots of reorgs in the last two years.",
        "advice": null,
        "pros": "Knowledgeable coworkers, lots of opportunities",
        "summary": "SE 2",
        "role": "SE II",
        "date": "Jul 12, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Balmer and his myopic Windows only view. With Satya that appears to now have changed for the better.",
        "advice": null,
        "pros": "Great and talented, people, great benefits,",
        "summary": "CTO",
        "role": "Principal Development Manager",
        "date": "Jul 13, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Vendors contracts have changed to the 18 months on 6 months off rule. They generally won't just extended you in positions anymore.",
        "advice": null,
        "pros": "Excellent Company generally pays higher, flexible at a very fast past environment.",
        "summary": "Microsoft review",
        "role": "Coordinator",
        "date": "Jul 13, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Barely any, I can't think of any. I left because of a better job offer. Barely any cons, great place to work.",
        "advice": "Dont really know what to say, many are really good people. Manage well, make good decisions. Good management, good place.",
        "pros": "A good place to work, I dont really know about the cons. Probably no to very little cons, very good place to work.",
        "summary": "Good",
        "role": "Anonymous Employee",
        "date": "Jul 13, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Large organization comes with its own challenges, larger projects with conflicting priorities sometimes don't align well",
        "advice": null,
        "pros": "Smart people to work with and learn from, lots of opportunities in different parts of the company",
        "summary": "Sr. Program Manager",
        "role": "Senior Program Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Upper management plays favorites, hard to move up into actual management unless you have extensive previous experience, they like to play the card \"it's not what you know, but who you know\" card. Only issues are with management, but it doesn't affect day to day too bad.",
        "advice": null,
        "pros": "Awesome benefits, relaxed environment, fun co workers, and a lot of resume boosting opportunities.",
        "summary": "Consumer product advisor",
        "role": "Consumer Product Advisor",
        "date": "Jul 13, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "complexity, bureaucracy, slower merit increase and focus on efficiency creating additional workloads in the short term.",
        "advice": "Reduce transactional work from finance and let them focus on value added tasks.",
        "pros": "culture, diversity, working from home, career opportunities.",
        "summary": "Sr finance manager",
        "role": "Senior Finance Manager",
        "date": "Jul 14, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's not easy to navigate thru the organization, and growth may come slower than expected. If you can't adapt easy to changes, this company might not be for you.",
        "advice": "Transformation come with a very extensive planning. It's important to have all areas aligned towards the same goal. Microsoft is close, but have work to do to achieve the ONE Microsoft.",
        "pros": "You are free to propose and create. This company moves fast. Change is the only constant. Be prepared to be challenged to the limit.",
        "summary": "Great Company with great people.",
        "role": "Technical Account Manager",
        "date": "Jul 14, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Slow internal changes, strange or obsolete internal processes. Sometimes not very effective.",
        "advice": null,
        "pros": "Big brand, big company with not bad benefits and high professionals around. Last couple of years were all about changes and company getting rid of many old problems.",
        "summary": "Interesting place to work",
        "role": "Support Escalation Engineer",
        "date": "Jul 14, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Politics- Uncertainty due to layoffs",
        "advice": null,
        "pros": "- Smart people- Cutting edge tech- Great salary- Awesome benefits",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Jul 15, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not necessarily an overall con, but the upward mobility is based on your ability to relocate, which I cannot do right now. I understand that this is how it is with most jobs anyways, but I felt like I had to mention this as a sort of personal con.",
        "advice": null,
        "pros": "The benefits are fantastic and there are massive amounts of opportunities for upward mobility.",
        "summary": "Inventory Control Expert",
        "role": "Product Advisor/Inventory Control Expert",
        "date": "Jul 15, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not always agile enough to adjust to market opportunties",
        "advice": null,
        "pros": "great benefits, competitive pay, good work/life balance, innovative products and services",
        "summary": "Great place to work",
        "role": "Account Executive",
        "date": "Jul 15, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "lack of focus in certain areas",
        "advice": null,
        "pros": "work life balance is good",
        "summary": "Good place",
        "role": "Anonymous Employee",
        "date": "Jul 15, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Due to the size of the company, do expect some legacies in both code and management.",
        "advice": null,
        "pros": "Great company recovering from slow days. Lots of new initiatives. Attracting lots of talents from schools and research institute.",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Jul 15, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Losing badly in mobile space.",
        "advice": "Don't fire people.",
        "pros": "Still having great presence in Enterprise segment.",
        "summary": "SDET",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The Labor policies didn't make much sense. You are unable to take holiday pay on top of the 40 hrs worked in a week. Instead they forced you to take an extra day off to keep you at 40 hrs paid for the week.",
        "advice": "Change the labor policies.",
        "pros": "Great Work Life Balance considering it's retail. Employees are passionate about the product and services. Health insurance is amazing along with other incentives like stay fit reembursment.",
        "summary": "Associate Experience Manager",
        "role": "Associate Expereince Manager",
        "date": "Jul 17, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Limited ability to have management involvement due to customer load and daily work volume.",
        "advice": "have a greater emphasis on securing the existing footprint of the install base to ensure the customer maintains the Microsoft share. so much emphasis is set upon net new space that the install base is risked to the new startups.",
        "pros": "Outstanding career growth, ability to change roles, explore opportunities, pay/compensation and benefits, innovation and team spirit.",
        "summary": "Account Manager",
        "role": "Anonymous Employee",
        "date": "Jul 18, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Retail - Work life balance varies week to week. Due to this particular location career opportunities do not arise as frequent.",
        "advice": "Acknowledge employees for the work provided.",
        "pros": "Microsoft Retail as it is not Microsoft Corporate still takes care of its employees based on appropriate compensation for workload, benefits (health, vacation, and sick leave), and team/work atmosphere.",
        "summary": "Consumer Service Advisor",
        "role": "Consumer Service Advisor",
        "date": "Jul 19, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Too many layers of org, matrixed and redundancy.",
        "advice": "Keep making necessary changes from the top down to modernize Microsoft to stay relevant and competitive.",
        "pros": "Empowered to be innovative, disruptive, game changer.",
        "summary": "Senior Manager",
        "role": "Founder of Small Startup",
        "date": "Jul 20, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Typical business related problems as any large company",
        "advice": null,
        "pros": "Very dynamic work environment, fast-paced, work autonomously, great pay and benefits.",
        "summary": "Microsoft is a Great Place to Work",
        "role": "Hardware Development Manager",
        "date": "Jul 21, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Less Salary. Microsoft has great benefits, but most of the benefits doesnt apply to most of people.",
        "advice": "Management is realising that they have to step up in order to compete with Google, Apple, Samsun, Amazon etc.",
        "pros": "Fun placePeople are very energetic and smart.I would highly recommend Microsoft.",
        "summary": "Fun place to work",
        "role": "Software Development Engineer",
        "date": "Jul 21, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- People are really competitive here. If you are in a team of more senior people, then you don't have to worry much but if you are in a team with more junior people (i.e. ones who are closer to your level), then it can get messy really quick as everyone is trying to proof how their contributions matter the most.- Frequent reorgs and changes in strategy. If you are one of those people who can switch directions fas… t, then you can thrive over here. However if you are one of those people who get really attached to your work, then the reorgs will have a toll on you.",
        "advice": "Due to the organization hierarchy, there are more people at the grass root level who know what direction that the company really should be moving in. Provide easier and more accessible channels for them to lead the company in those directions. It doesn't make sense to ignore them and then after a few months move in that direction because another competitor has implemented that concept into a working product.",
        "pros": "- Company really invests in you! The quantity and quality of courses available really allows anyone to grow and improve their understanding.- Lots of people who help you succeed! I was lucky to have an amazing mentor and a fantastic manager.- If you get bored with one problem, you can always move on to something else that is equally interesting. Microsoft really offers a wide variety of problems to work on (f… rom games to enterprise software to search to mobile phones to operating systems to ...)",
        "summary": "Excellent place to work at!!",
        "role": "Software Development Engineer In Test (SDET)",
        "date": "Jul 22, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None None None None None",
        "advice": null,
        "pros": "Technology, Career opportunities, Culture, Work/life balance",
        "summary": "Great Place to work",
        "role": "Program Manager",
        "date": "Jul 22, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There isnt much of a downside",
        "advice": null,
        "pros": "Get people to work with, always fun and never a dull moment",
        "summary": "Service Advisor",
        "role": "Anonymous Employee",
        "date": "Jul 23, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "long commute from where I live but they provide shuttle transportation. I really don't have much to complain about.",
        "advice": "Do more to incorporate CSG staff into the larger group",
        "pros": "Great employee benefits, good work life balance, a lot of flexibility to make my own schedule, fun work group",
        "summary": "Staffing Consultant",
        "role": "Staffing Consultant",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "lot of competition within team for promotion",
        "advice": null,
        "pros": "good benefits , good salaries",
        "summary": "working at microsoft",
        "role": "Software Development Engineer In Test (SDET)",
        "date": "Jul 23, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None, I have nothing bad to say.",
        "advice": "I have none.",
        "pros": "I loved every day I worked there. Awesome experience.",
        "summary": "Best company I ever worked for.",
        "role": "Program Deployment Manager",
        "date": "Jul 24, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There's not much to say here except that I wish I was offered full-time and not just part-time. I would have stayed longer if it wasn't for the limited schedule I was working.",
        "advice": "Keep doing what you're doing. I know some people have issues in this particular area but I had a great experience and wouldn't change a thing.",
        "pros": "Incredible work environment, demanding but rewarding, fast paced and yet very easy to manage, and just an overall great experience despite only working there for a brief period.",
        "summary": "Great Company, great products",
        "role": "Anonymous Employee",
        "date": "Jul 25, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Some teams are more mature than others. If working in a team with lots of senior colleagues, career growth is slower than average growth velocity of peers.",
        "advice": null,
        "pros": "Excellent environment. Enlightened, transparent management. Great products. Lots of opportunities to learn and grow.",
        "summary": "Senior Software Development Engineer",
        "role": "Senior Software Development Engineer",
        "date": "Jul 25, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Competitive pressure from all sides require us to be responsive and not reactive. Must B cautious.",
        "advice": "Keep going with the Cloud First, Mobile First strategy. We will win.",
        "pros": "Great working for a diverse and people focused company. Satya is an amazing leader that has the right vision for Microsoft's next 20 years.",
        "summary": "Awesome CEO. Amazing company.",
        "role": "Anonymous Employee",
        "date": "Jul 27, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Other departments don't much respect your time. You set up a meeting wherein everyone is supposed to be free according to their calendars, and they still don't show up.",
        "advice": "Give your underperforming employees a bit more \"kick\". The purposes of the higher-up directors and VPs can sometimes be nebulous and clouded in corporate jargon. When the actual directing happens, sometimes projects will be given ridiculously short delivery timelines and set up to fail.",
        "pros": "Everyone was smart, helpful, professional, and friendly. Your work contributes and builds on that of others. Your manager encourages you to take breaks and balance your work with downtime. Free drinks, free coffee, decent cafeteria food. The company is currently in an upward trend of gaining respect.",
        "summary": "The People Were Awesome",
        "role": "Program Manager",
        "date": "Jul 27, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "The services org is becoming more and more like a typical consulting company. Thus may be good for investors, but a lot of great talent choose to work at Microsoft because it was different. Now, not so much.",
        "advice": "Microsoft is headed in the right direction as far as products. Services need changes to adapt and compete with others.",
        "pros": "Some of the smartest people I have ever met work at Microsoft. They have a lot of products and services which means a lot of opportunities for the employees.",
        "summary": "Microsoft Review",
        "role": "Senior Consultant",
        "date": "Jul 28, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None I think of really good to me",
        "advice": null,
        "pros": "It waa a ok expericencd",
        "summary": "receotiinist",
        "role": "Anonymous Employee",
        "date": "Jul 29, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not so many opportunities to promotion.Company is too big to use cut-edge technologies",
        "advice": "Be more open to new techs and should have the guts to adapt even with the downside of temporarily losing revenue.",
        "pros": "Work life balance is best here.Have the choice to work on focus area.Not so political in decisions.",
        "summary": "Good company to work with",
        "role": "Software Engineer",
        "date": "Jul 31, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A lof of process, sometimes there's not a lot of choice as to the available tasks to work on",
        "advice": "More transparency",
        "pros": "Good benefits, you learn a lot, good coworkers, interesting challenges, respectful and cery enjoyable environment.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Large company makes it hard to have freedom in work",
        "advice": "Keep it up!",
        "pros": "Pay, Time off, culture, and working with very smart people",
        "summary": "Great company--good bosses are all the difference though.",
        "role": "Anonymous Employee",
        "date": "Aug 1, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I cannot think of any cons of working there. It was a great place to work in.",
        "advice": "I would like to tell the management to keep up the good work they are doing in hiring and keeping the best talent.",
        "pros": "It is the best company. They care for their employees.",
        "summary": "Microsoft Experience",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Microsoft is a large company with many levels of management. They are not always together on vision and things take a long time to get done.",
        "advice": "I would advise management to listen to engineering and other ICs as they provide great ideas. While I understand management is important, IC ideas should be considered.",
        "pros": "Microsoft provides a great opportunity to work on impactful software. They are very professional and allow many opportunities to interact with top talent.",
        "summary": "Software Engineer 2",
        "role": "Anonymous Employee",
        "date": "Aug 2, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No cons, I just enter to Microsoft by a merged company and the new business didn't fit well on Microsoft strategy",
        "advice": null,
        "pros": "Microsoft is a global leader in software, with a strong business drive and a clear and well communicated strategy. It is a company ready to shape the world future",
        "summary": "Phones Category Operations Manager",
        "role": "Phones Category Operations Manager",
        "date": "Aug 4, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Still a big company and that move slowly. Major decisions still come day from the top",
        "advice": null,
        "pros": "Work life balance, changing culture to be more fast and responsive, intelligent passionate people",
        "summary": "Product Manager",
        "role": "Anonymous Employee",
        "date": "Aug 4, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lots of travel, management could have a bit more training, but it's hard when things move so fast. All and all, top notch.",
        "advice": "Www.AnthonyHarwelik.com",
        "pros": "Smart people. Best company on earth. Lots of time to learn, fortune 5 clients.",
        "summary": "Great",
        "role": "Systems Engineer",
        "date": "Aug 4, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "office Politics happen fairly frequently",
        "advice": null,
        "pros": "Big companymany products you can work on",
        "summary": "Good company",
        "role": "Anonymous Employee",
        "date": "Aug 4, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The large company comes with a lot of bureaucracy which hurts work.",
        "advice": "We need to do a better job connecting with customers.",
        "pros": "Great benefits and pay. Pretty good work life balance. Nice people, and cool events sometimes.",
        "summary": "Pretty Great",
        "role": "Anonymous Employee",
        "date": "Aug 5, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "needs to eject older Microsoft 2.0 (Baller era) ways, it's happening, but not fast enough",
        "advice": null,
        "pros": "Immense opportunities abound across a wide variety of products, technologies and geographies",
        "summary": "Seeing Microsoft 3.0",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Compensation is not competitive than other high tech companies",
        "advice": null,
        "pros": "Flexible working timeGood resourcesInteresting projects",
        "summary": "Working at Microsft",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lack of proper documentation",
        "advice": null,
        "pros": "Great culture to work in!",
        "summary": "Great place to work - if you aren't a pushover.",
        "role": "Service Engineer",
        "date": "Aug 6, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Big Companies might make some people feel that moving upwards is hard and long.",
        "advice": "N/A",
        "pros": "Great salary and benefits, Tele work available.",
        "summary": "Support Service",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Career growth is a bit difficult.",
        "advice": "Less manager.",
        "pros": "Work space is super great!",
        "summary": "SDE",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Many things depend on the team you would end up working.Work-life balance for intern might be tough, especially if you are trying to do a really great job on the project",
        "advice": null,
        "pros": "One of the best internship programs in the US. Great place to learn hands-on stuff about developing software.Plenty of interesting people to learn from.",
        "summary": "Great place to do internship",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Seattle is an expensive area",
        "advice": null,
        "pros": "Very good working environment in Redmond",
        "summary": "MSFT",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Haven't really found one yet.",
        "advice": null,
        "pros": "Very good benefits. Truly care about family and help with your career. Opportunities for travel within the company.",
        "summary": "Technical Account Manager",
        "role": "Technical Account Manager",
        "date": "Aug 7, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Navigating the large corporate environment can be difficult.",
        "advice": null,
        "pros": "A great, challenging work environment.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Aug 8, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Only 50% 401K match, some companies offer 100% matchMedical deductible is quite high for family",
        "advice": null,
        "pros": "Great and smart people around you",
        "summary": "Top 5",
        "role": "Anonymous Employee",
        "date": "Aug 8, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The job gives freedom to create your own schedule and drive your own success. This is really tough to do, and it's easy to fail at. Internal transfers are a lot about networking, which can be difficult depending on your own situation (specifically, where in the company you're stationed - Philly is not great for networking - Charlotte, DC, Dallas and Seattle area are the best for sustained success).",
        "advice": "Don't try to penny-pinch with an extremely profitable business with extremely talented people. Just let the people be successful, create opportunities for them to shine, and more profit will come. Don't get into the \"Reduce Costs\" game...",
        "pros": "Benefits are great, internal processes are really well thought out for the most part, and there is a great vibe around the direction of the company overall. The Premier division places an emphasis on work-life balance (mixed success, but the effort is there).",
        "summary": "Great Company to work for",
        "role": "Premier Field Engineer",
        "date": "Aug 9, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Work/lift balance is a little tough at times. Given the magnitude of bugs or failures in a product like Windows, fixing them is a process that will result in many late nights and giving up your weekends.",
        "advice": "Management is often so bogged down with balancing engineering and business goals that they will sometimes be disconnected with the product, and the time it takes to perform certain tasks. This is something both manager and IC should work on, but it is still a challenge.",
        "pros": "The salary is fantastic, the benefits are top-notch, and the products you work on truly do change the world, so it is easy to find meaning in your work. The people you meet here are genuine and very intelligent, which is great considering how much time you spend with them.",
        "summary": "Great Place to Work",
        "role": "Software Development Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Understaffed. It forced everyone to learn more and work harder though which is a pro.",
        "advice": null,
        "pros": "Amazing retail environment. Very fast paced with lots of energy. Awesome people and customers. Plenty of room for advancement.",
        "summary": "Microsoft Store",
        "role": "Consumer Product Advisor",
        "date": "Aug 10, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I am really happy hear - not much to complain about!",
        "advice": null,
        "pros": "Very competitive salary, incredible benefits and perks, flexible work schedule, great people and culture",
        "summary": "Best Company I Have Ever Worked For",
        "role": "Anonymous Employee",
        "date": "Aug 11, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No cons really. Its an amazing company!",
        "advice": null,
        "pros": "You work on real life projects and have the opportunity to make a real impact.",
        "summary": "Amazing company!",
        "role": "Research Intern",
        "date": "Aug 11, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Understaffed for the amount of work they do.",
        "advice": null,
        "pros": "Good direction with good people.",
        "summary": "Sr. Program Manager - Shared Data",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's a lot thinking and hours out of you day but its worth it at the end when you see your project turn out amazing",
        "advice": null,
        "pros": "great job but must be very creative because everyone depends on you.",
        "summary": "amazing",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Expect to get reorged every year and that your products will never see daylight. Especially if you work outside of Redmond.",
        "advice": null,
        "pros": "Microsoft offers amazing benefits to its employees. You will never find better. The people who work there are smart and have great experience.",
        "summary": "Smart people, Great benefits",
        "role": "Anonymous Employee",
        "date": "Aug 13, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No downsides apart from a very competitive climate that made it difficult to advance.",
        "advice": null,
        "pros": "I enjoyed my position with Microsoft and learned a significant amount during my time there. I was stretched beyond my comfort zone often and grew as both a leader and a presenter in this role. Great company to work for and a great opportunity.",
        "summary": "Great place to work!",
        "role": "Technical Evangelist (Contract Presentation Role)",
        "date": "Aug 13, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "To hierarchical and too many managers in the company",
        "advice": "Cut down on the hierarchy and make the management more agile to customer needs",
        "pros": "Great work environment and amazing peers to work with!",
        "summary": "Awesome Company!",
        "role": "Software Engineer II",
        "date": "Aug 13, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Surrounded by smart people sometimes you feel a bit weird.",
        "advice": null,
        "pros": "Good Career opportunities. Very diverse teams. Good Environment. Surrounded by smart people. Quite exiting projects. The benefits are awesome.",
        "summary": "Software Development Engineer",
        "role": "Anonymous Employee",
        "date": "Aug 14, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "a bit slow development process, too many overlapped projects across orgs",
        "advice": "user and data-driven decision",
        "pros": "good culture, user-driven decision, work-life balance, good benefit",
        "summary": "Good workplace, and getting better",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Since it is a huge company with 90,000 employees around the world, your contributions at times may seem puny and irrelevant",
        "advice": "Keep up the good work!",
        "pros": "- Highly talented people in the team to learn from- Variety of projects to work on and ability to move across teams with ease- Managers that are technically strong and great mentors as well- Above average salary and benefits",
        "summary": "Great people, awesome culture",
        "role": "Software Development Engineer II",
        "date": "Aug 17, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Too much middle managementToo much politics",
        "advice": "Remove the fat that links the teams and let the engineers talk to each other.",
        "pros": "Great company to work for. Great benefits; lots of flexibility; lots of interesting projects; good pay; Good life/work balance......",
        "summary": "Great place to work for",
        "role": "Software Engineer II",
        "date": "Aug 17, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes it's a bit uncomfortable to work there because u have to stand for long periods of time so it's really tiring",
        "advice": null,
        "pros": "Good job pays good and really great for people who know technology well. This is a great job for most people",
        "summary": "Very good job",
        "role": "Anonymous Employee",
        "date": "Aug 18, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "technology innovations - missing new challenges in work",
        "advice": null,
        "pros": "Flexible hours is the biggest advantage.",
        "summary": "Nice to work",
        "role": "Anonymous Employee",
        "date": "Aug 18, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing that I know of...",
        "advice": null,
        "pros": "Technically Challenging and good work life balance",
        "summary": "Senior Software Engineer",
        "role": "Senior Software Engineer",
        "date": "Aug 18, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Company reputation turning around but still suffers a bit,.",
        "advice": null,
        "pros": "Top performers very well compensated.Play with amazing technology all day!Company going through amazing transformation.",
        "summary": "Bring your best.",
        "role": "Principal Technology Solutions Professional",
        "date": "Aug 18, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lack of direction from management. Very political and bureaucratic.",
        "advice": null,
        "pros": "Lot's of freedom and great work environment.",
        "summary": "Great Environment",
        "role": "Business Analyst",
        "date": "Aug 18, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Have worked with some teams that seem absolutely cutthroat. Lots of politics involved, but that seems to be changing a little bit.",
        "advice": "Cut the political crap, make things better for everyone, not just things that make you look good.",
        "pros": "I have an amazing manager, and get to work on great projects. We work hard, and do it as a team. Very rewarding, and a good cooperative environment, at least within our own team.",
        "summary": "Great place to work, on a great team",
        "role": "Designer II",
        "date": "Aug 20, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's in constant re org and it's very confusing",
        "advice": null,
        "pros": "It is a great company to work for",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Aug 20, 2015",
        "is_current": false
    }
]