[
    {
        "rating": 2,
        "cons": "It's cut-throat.. While management is sharp and focused on company objectives, there are huge issues with managing resource related issues. The environment is very much, survival of the fittest. Everyone wants to be in the limelight and management does very little to discourage internal competition and backstabbing. It's not a team oriented atmosphere.",
        "advice": "Give higher recognition to team members who foster mentorship and team work.",
        "pros": "Oracle is a big company that warrants name recognition. Resources and opportunity are available for those who are hard working and love a good challenge. Good sharp, management team. Provides good training and opportunities for advancement.",
        "summary": "Oracle, good solid company, not so good in fostering a team oriented, collaborative environment for employees",
        "role": "Senior Sales Consultant",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Monstrously large company, communication from people even 2-3 levels up from you is worthless. I really think they have no idea what it is that we do.",
        "advice": "Stop being such pansies and cheapskates worried about keeping your jobs do what you know is right! This company makes a ridiculous amount of money. And to the one at the very top ... start spinning off, this company is set to implode under it's own weight, your customers are starting to get pissed at our overall inability to deliver a viable product.",
        "pros": "They really allow/force you to taker a lot of training, take advantage of it, ride out this economic storm and then move on.",
        "summary": "Take the training and run!",
        "role": "Principal Consultant",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "** So why are so many Oracle employees so concerned about pay raises/not enough money? Let's take an UNBIASED look:(FYI: I'm talking on behalf of my department, I am NOT talking about every single department at Oracle)- Worked here for almost 6 years and NO pay raise. I'm in danger of losing my home, plus daycare, and other bills (Mortgage has gone up, daycare has gone up...). What can I do?!- We support … a workforce of thousands in the whole area and it can be VERY stressful. Which isn't so bad if we had better incentives.- 2 times I've gotten a bonus in my 5 years: A 25$ gift card to Chilli's, and a 10$ gift card to Starbuck's... I got a better bonus than some of my co-workers!- Departments here have a budget on which to pay the employees increases and bonuses. We were promised a pay increase percentage (To cope with rising costs), which kept getting reduced and reduced and reduced until it went to 0%. And guess who got the increases and bonuses? Upper management (I have a few contacts who have shown me this).- When I first came on board I was promised opportunity for growth (promotions, training, pay raises.). So we decided to to start a family, work on the house, etc. Now I can't EVEN put in anything into my 401K because I live paycheck to paycheck. Not to mention stock options and flex plans (I come from a poor family, I did NOT have a base I could start from. I've had to work up the ladder by myself with no IT or Business degree.).- Compared my salary to the exact same jobs around here using 3 different websites. I'm being paid 69% less than average. I repeat, I am NOT exagerating about my experiences with Oracle. These are jobs with the exact same responsibilities I have, except they support way less people than us.- Apart from the pay, chances for career growth are about 0.0001 %.- Recognition messages are just a bunch of words that are forgotten 2 minutes later.",
        "advice": "We're not asking for millions, we're just asking for a chance to cope with the rising costs, to have some piece of mind for ourselves and our kids. I'll ask you a few questions: How would you feel like if you could NOT afford your kid(s) any Christmas presents? If when you get your paycheck you're left with a few dollars or in the negative (Not because of bad spending, but because you can't keep up with the rising co… sts)? Do you have to worry that you don't have enough money to put in your kid(s)' savings/funds, etc. let alone OUR funds?",
        "pros": "In my department: Teamwork, flexibility regarding family schedules and emergencies, excellent benefits and insurance packages, good work environment (Love those gyms and the cafeterias), co-workers and most of the people are very friendly, [immediate] managers will level with you and are very friendly and approachable (Even though they're controlled by upper management).",
        "summary": "EXCELLENT company to work for... if you're not interested in career advancement or money!",
        "role": "Software/Hardware Assurance Technical Support",
        "date": "Jan 12, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Politics, poor salaries, red tape. Surprising lack of resources for such a big company",
        "advice": "Oracle used to employ the same model as Microsoft in term of compensation -- i.e. base salary is low, but you are supposed to make it back on the options. Needless to say, that hasn't worked out very well over the past few years. If Oracle is serious about getting the best & brightes (and I'm not convinced they are...) they need to change the compensation policies.",
        "pros": "Great brand recognition, can be a good springboard for other jobs.",
        "summary": "Couldn't afford to keep working for this company",
        "role": "Principal Member of Technical Staff",
        "date": "Jan 27, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Regional Management team act as puppets on a string. Upper management team is not always honest and does not communicate effectively with the sales force. Huge turnover. Morale is typically very low on sales floor.",
        "advice": "Take the time to listen to your sales force. Provide more positive feedback. Be honest. Value the people on your team that do a good job.",
        "pros": "Opportunity to break into a large successful company. Good entry level job to gain knowledge on Oracle products. Opportunities to move within other Oracle LOBs is possible. Employee backgrounds are diverse which makes it an interesting place to work.",
        "summary": "Oracle University is a good start into the industry, but not the best place to work long term.",
        "role": "Education Sales Representative",
        "date": "Jan 30, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Difficult to relate how your work translates into something that matters, takes too long to get adoption from customers. Constant supposed bakeoffs of technologies creates an insanely political environment, the best or most innovative technology frequently doesn't win, the most tenured or savvy leader does. Only one leadership style is highly rewarded, brash and ambitious.",
        "advice": "Focus on innovation and technology and not bashing the competition.",
        "pros": "Good name brand for resume. It is the best database, very useful to have oracle db knowledge and skills for other technology positions. Decent training curriculum for both technical and soft skills but recently cut back a lot.",
        "summary": "Acquisition not innovation",
        "role": "Senior Manager, Technology",
        "date": "Feb 23, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "crappy middle management in applications division. culture is centered around pleasing manager and not doing the right thing or real work. work here if you can \"thrive\" in Oracle's corporate culture which requires you to have no consciousness or honesty",
        "advice": "no advice. you can't change the management at Oracle. Just fire all mangers",
        "pros": "Oracle has a good brand recognition. you marketability increases, when you are looking or job. good work life balance (this is a downside too. you can sit in Oracle for many years without doing anything)There is opportunity to move with Oracle. You can move from engg to consulting to salesYou can work at Oracle if you just want to collect salary and not do any real work",
        "summary": "shitty place to work",
        "role": "Senior Applications Engineer",
        "date": "Mar 8, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "1) abundant mediocrity2) More rewards for playing politics rather than for technical skills3) Too much of middle-management obsolescence. Incompetent managers and directors stiffling creativity of the engineering teams.",
        "advice": "Senior Management is quite talented. The middle management should be held more accountable, and required to be more technically current and skilled.",
        "pros": "There is Job security,The company provides very good health insurace,It is a big company with lots of diverse technical projectsLots of acquisitions bringing in new directions and talentsOracle is a \"green\" company, that has flexible hours, and promotes a culture of telecommuting and flexibility, so long as work gets done.It is culturally diverse.",
        "summary": "Would be a great company if they fix the middle management.",
        "role": "Consulting Member of Technical Staff",
        "date": "Mar 10, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No recognition inside the company. No way to grow to managerial position in spite of qualifications.",
        "advice": "Recognize the work of high potential candidates, else you will see high turnover rates",
        "pros": "Work from home option. Good recognition outside the company",
        "summary": "Good company from outside.. not fair inside",
        "role": "Senior Software Engineer",
        "date": "Mar 25, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Disrespectful toward employees, you are made to feel like a number, no friendships there, just a dog-e-dog place.",
        "advice": "There is a better way to treat employees",
        "pros": "Strong Product Suite, Strong Financially Positioned Company",
        "summary": "If you need a job then okay otherwise look for a different company.",
        "role": "Consulting Sales Manager",
        "date": "Mar 26, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "tied to old technologies; less of focus on people",
        "advice": "invest in people and product quality, don't allow people to take short cuts",
        "pros": "stable env., strong company, strong people",
        "summary": "strong company; best for experienced executives",
        "role": "Software Engineering Director",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Below industry avegare pay, lot of politics, project stealing between teams is common, very cut throat atmosphere",
        "advice": "Good luck!",
        "pros": "Get to work on cutting edge technologies, good benefits, ample parking, some good talent works here",
        "summary": "Get in only if you get a good package",
        "role": "Senior Software Engineer",
        "date": "Apr 16, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Stagnation. No advancement opportunities. No opportunities to change projects. No one leaves, so the only way you'll have to do anything new will be to leave yourself. Not Invented Here mindset means that you'll be using frustratingly poor tools when very good open source (i.e. FREE!) alternatives are available. Combativeness across development teams.",
        "advice": "Help us advance. We want to get better at what we do, and that only makes us more valuable to you!",
        "pros": "The work is interesting and challenging. The opportunity is there to work with cool, cutting edge technology. I've found the pay to be on par with similar positions in the area, but no other company around here comes close to matching the benefits package. I've had to decline new positions because I could not afford them after considering the difference in benefits. Ellison is he first CEO I've had for whom I've had … any respect.",
        "summary": "Mixed bag.",
        "role": "Senior Member of Technical Staff",
        "date": "Apr 25, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Extremely political - competence is not basis for future - like most companies, true. Some promotion by attrition - easiest candidate gets the position, regardless of skill.",
        "advice": "Merit-based promotion",
        "pros": "Good name on resume - helps with impressing recruiters (but not always companies).Depending on group, opportunity to learn.",
        "summary": "Typical big company",
        "role": "Principal Product Manager",
        "date": "Apr 29, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "not a good place for career growth..",
        "advice": "pls give more attention to career development of lower position employees",
        "pros": "Get as much training and move out..do not spend too much time in consulting..",
        "summary": "Do not stick around for a long time..",
        "role": "Principal Consultant",
        "date": "May 2, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Employee unfriendly and no recognition for hard work.",
        "advice": "Don't ignore the hard-working employees.",
        "pros": "Oracle benefits inclusive of health, oracle gym and work hour flexibiity. IN present economic types, Oracle is a relatively stable company with enough cash reserves and marketing muscle.",
        "summary": "stable but not necessarily career growth",
        "role": "PMTS",
        "date": "May 2, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You stay in you position for a very long time, promotions occur rarely",
        "advice": "Do not trz to work on a country-level basis but let people work on a truly European/Global level (consulting projects for instance)",
        "pros": "A stable job with average or slightly above average benefits",
        "summary": "Stable but can turn into a dead end",
        "role": "Consultant",
        "date": "May 4, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "This is a very cut throat company and they are not known for treating their employees with the greatest of respect. Management does not have the upmost in talent. They are incredibly cheap with things such as travel, awards, team lunches. The processes to close a deal are too overwhelming. For eg. you have to negotiate contracts with the lawyers on the customer side, but Oracle will not put a lawyer on the phone.",
        "advice": "To focus on long-term revenue and not developing the skills of their employees, as opposed to whatever revenue is on the table for the week. To treat everyone with respect and create a more positive working environment, to promote long-term revenue growth.",
        "pros": "You are selling the best products in the industry. When competing against other companies to win a deal, you have an advantage, because everything Oracle owns is the best. It is easy to get in the door with customers because everyone uses at least one product within the Oracle product stack. It is a good thing to have on your resume.",
        "summary": "Great work experience for your resume, but not a company you can retire at.",
        "role": "Applications Sales Manager",
        "date": "May 6, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too much management. They nickel and dime their employees. Training is constantly being cancelled. They act like they are doing you a favor letting you keep your job.",
        "advice": "Give some of the money to the guys actually doing the work versus the managers driving the German autos who work from home and act like cheap car salesmen.",
        "pros": "Sometimes have good training opportunities. Salary is decent, but not great. Good chance to learn new technologies when on decent projects. Most of the technical staff is awesome, other than the typical few outliers with big EGOS.",
        "summary": "Oracle is a good experience so long as you work for a good practice.",
        "role": "Senior Principal Consultant",
        "date": "May 7, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Slow, political, groups are defensive, unwilling to help sometimes.",
        "advice": "Stop doing things simply because others are doing them or to meet some company-wide requirement. Do things that make sense and are reasonable, and communicate more effectively; instead of all the 5000 emails and checklists that nobody can follow, nevermind act on.",
        "pros": "The gym, the flexible hours (though usually long anyways)",
        "summary": "Typical 80000 lb gorilla, not all that interesting place to work in despite all the acquisitions made",
        "role": "Development Manager",
        "date": "May 13, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "IT infrastructure is trash.SOPs designed to be a hindrance, not to facilitate your work.Every staple requires approval.",
        "advice": "Take a hard look at processes.",
        "pros": "Fair amount of flexibilityCasual environmentVery good benefits, free gym.The company is doing well (for now)",
        "summary": "A place to sit it out until retirement.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "employees don't share in the financial success of the companyvery employee unfriendly, no sat surveys, performance reviews not required, it's like working in a prision. and if you don't like it, it's fine with them for you to leave.",
        "advice": "they know what they are doing and don't care if people leave.",
        "pros": "great on the resume, most are impressed with the companyfinancially successful companyif you don't want to work too hard, it's good, but don't expect much for career developmentgreat place for women with children and working from home",
        "summary": "A good day at Oracle is when you don't get fired or laid off",
        "role": "Anonymous Employee",
        "date": "Jun 7, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "* Big company means lots of process and/or repetitive process.* Loyalty factor is blemished given Microsoft claims economy is impacting them and laid-off strong performing employees with companywide job eliminations. This in turn puts a permanent blemish on their loyalty factor for those working or thinking of working there in the future.",
        "advice": "Please do a better job of promoting all the great products you make. And thank you for finally rebranding with \"Bing\" instead of \"Live Search\"! If you can just get rid of the rest of the \"Windows Live\" branding, you may clear the fog that confuses everyone about your offerings, which includes the employees themselves.",
        "pros": "* Big company means lots of career opportunities.* Great benefits program for you and your family.* Depending on the Team, work/life balance is possible.* Lots of smart people to work with and to compete against.",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Jul 3, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Value/identity of the individual, in what is now a massive company, is hard to discern.",
        "advice": "Figure out ways to hold on to people who are good at what they do.",
        "pros": "Very information rich work environment, opportunities to self educate on the company's products and related technologies abound. Vast array of products and technologies profer a very wide choice of opportunities with the respectitve teams.",
        "summary": "Information rich environment",
        "role": "Anonymous Employee",
        "date": "Jul 9, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Lack of advancement opportunitiesToo big of an organization",
        "advice": "Right people ==> right jobs",
        "pros": "Flexibility in hoursWork from homeWork / Life BalanceDiversityopportunity to play with state of the art Software ProductsGood health benefits",
        "summary": "Working for Oracle",
        "role": "Anonymous Employee",
        "date": "Jul 22, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "You can get fired as easy as dropping your pants. Only performance counts in Oracle and there is no such thing as being too senior to be fired.",
        "advice": "Please review your pay policies. Some of them don't make sense especially to those who are new in your organization.",
        "pros": "Things are not rigid hence you can make your own rules and ways on getting things done as long as it is within the GAP (Generally accepted policies) of Oracle. Of course it has to be legal and ethical, and follow the revenue recognition principle. The point is that you are not micro-managed to do your job and you can have full control (Depending on managers but I see it happening a lot of times) on how you want to do…  your job.",
        "summary": "Oracle Singapore",
        "role": "Anonymous Employee",
        "date": "Jul 25, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "ArrogantIncompetent ManagementLack of communicationLow payLots of processLittle trainingLittle career path mobilityTop heavy senior managementPoor treatment of employees",
        "advice": "Pay your people accordinglyRemember that we are in a customer services businessRemember that you are a product companyEnable your clients more",
        "pros": "You gain a lot of experience of how not to run a companyGood productsSome great peopleVery well knownGreat Benefits",
        "summary": "Definitely not the cream of the crop...",
        "role": "Consulting Solutions Manager",
        "date": "Jul 29, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "management is dis-respectful of employees, very tough quota setting which sets you up to beat up customers because of oracle's revenue goals",
        "advice": "put better value compensation wise on sales reps because they are the ones who interface with customers and put higher value on customer satisfaction instead of obtaining made up revenue goals from oracle management",
        "pros": "brand recognition, great products, great place to learn or start your hi tech career, incredible sales training, good benefits, good customer base",
        "summary": "tough place to work",
        "role": "Sales Manager",
        "date": "Jul 29, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Poor retention policy, hard to find room for professional growth, stressful culture, low morale among people, success of a particular group is always averaged with the rest of the company resulting in lack of success appreciation",
        "advice": "Improve corporate culture and retention policy",
        "pros": "Fairly flexible work time, good for the resume, free tea (need to have 20 words but don't see more pros)",
        "summary": "Stressful culture",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "I was at a company that was hired by Oracle and helped them integrate information for a few months as an Oracle employee with full health benefits and 401(k). It seemed a bit strange to get this for a few months, but not much makes sense in the corporate world. I did not work in Redwood City. I never saw one Oracle employee come to our office. I worked by e-mail and on the phone with Oracle counterparts. It seemed a … bit impersonal. Also, I was confused as what to do the last day I was there. There was a lack of communication around how to turn in your badge and laptop. I inquired the last minute and was told to just leave everything at the desk. There was no exit interview by HR or even any signed paper work. Oracle seemed very impersonal and did not seem to care about employees that they did not deem essential. This wasn't the first time I was laid-off by a large corporation and comparatively speaking Oracle lacked sensitivity.In addition, there was very poor communication around the acquisition process leaving employees nervous.",
        "advice": "Since you acquire so many companies, provide better communiation to the employees of the acquired company. Also, use a little humanity when dealing with employees.",
        "pros": "Great benefits. I've worked at many companies in the Bay Area and by far Oracle has the best benefits I have ever seen too bad it didn't last longer. I was at a company acquired by Oracle and was laid-off. They honored the acquired companies severance agreement quickly. In addition, even though they laid me off they gave me a prorated bonus based on the acquired companies terms. I thought this was fair. think Oracle … acquirse and lay-off so frequently they have a very good process in place and are run like a machine.",
        "summary": "Company Acquired by Oracle",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Pay is below market. Bonuses are stingy. Stock option grants are small and infrequent while Larry and his cronies give themselves millions every year. No concept of professional development. No company events whatsoever (i.e. holiday party, summer picnic).",
        "advice": "One thing I always gave Oracle credit for was that they were at least genuine. The company doesn't care about its employees -- and they never claim to.",
        "pros": "Decent work-life balance. Great health club on campus for employees at headquarters. Freedom to work from home. Opportunity to travel internationally.",
        "summary": "Director in Oracle's global alliances and channels team.",
        "role": "Director",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "NO pay raises. No advancement opportunities. Too many management levels; almost no real communication from upper management. Executives get high pay and stock options; workers get nothing. Stock purchase plan for employees is a joke. Morale is non existent at the employee level. We were told on the All-hands calls to quit asking questions about pay raises.",
        "advice": "Give pay raises. Understand that it is now a recession, but there were NO pay raises during the 'fat' years in the past 5-6 years either. Also, replace the computers more often, most users are using 5-6 year old PCs and laptops. Quit using the IT department as guinea pigs for all new software.",
        "pros": "Work from home option is widely used; benefits are reasonably good. There is not much else to recommended Oracle as a good employer; too much overhead and management levels.",
        "summary": "Another tech Co. loses its' way",
        "role": "Systems Engineer",
        "date": "Aug 19, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Pay raises are non existent. Thats pretty discouraging when the CEO gets $500 million in cashed stock options....and forget about bonuses....only certain employee levels are entitled to bonuses and those are \"discretionary\"...They also have this rule that you have to be in a position for certain amount of time prior to being considered for a promotion...like longevity means anything?Promote people based on perfor… mance....HR also says they consistently perform market analysis of salaries to ensure they are competitive, that's a laugh....They are competitive in a good economy, otherwise, forget it.",
        "advice": "What goes around comes around....I am not sure if you learned anything about people/employees all these years about being in business...Working for a company, is supposed to provide you with some form of material benefits, a certain panache, that you are proud to work for Oracle...And please don't respond with \" Then leave and go work for someone else\"....is that the standard corporate policy?",
        "pros": "The work from home option is the best i can think of, as it allows you to spend time with your family....and the flex time, plus the technology you get to work with and the ability to move between groups....that's about it.",
        "summary": "Decent company for starting and building your knowledge",
        "role": "Oracle Database Administrator",
        "date": "Aug 24, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It has gotten very stressful in the last 2 years, with management asking for more and more 'productivity' with fewer people. This translates to poor morale, and ultimately bad products. The people who have been with the company longest, know the most, are now the worst paid. Does that make sense? The raises really tanked after 2000, followed by the stock options, and then the bonuses disappeared. How do we share in t… he company's success?",
        "advice": "BONUSES + RAISES = HAPPY EMPLOYEES = GOOD PRODUCTSCOMPENSATE YOUR MOST EXPERIENCED PEOPLE",
        "pros": "It's stable, and the work is interesting. I do credit executive management for keeping the company stable through these turbulent times.",
        "summary": "No Bonuses, No Raises, We are not rewarded for the company's success",
        "role": "Principal Member of Technical Staff",
        "date": "Aug 29, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "helpful bureaucracy, utterly opaque management, poorly designed roadmap.",
        "advice": "Start actually supporting the technical standards claimed supported.",
        "pros": "Excellent benefits, progressive telecommuting policy, helpful bureaucracy.",
        "summary": "A Principal Application Developer's view",
        "role": "Principal Applications Developer",
        "date": "Sep 21, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Highly impersonalVery politicalToo many parties to close a deal (The Oracle Bus)No real sense of loyalty or mission among employees",
        "advice": "Oracle has gotten the world's attention through its database technology and aggressive acquisitions. Stock price has performed well. However, there doesn't seem to be a good sense of comraderie, team spirit, or unity at the worker ranks. There needs to be a more personal touch from the top to let employees know that they belong to an organization that cares about them.",
        "pros": "Virtual work location (work from home)Descent pay compared to the industryGood stock performanceOne of the dominant player in enterprise software",
        "summary": "OK salary, but no sense of mission",
        "role": "Senior Sales Consultant",
        "date": "Sep 28, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Little if any pay raisesLittle if any promotions and most promotions do not make any sense as it seems not to be based on ability",
        "advice": "Treat people better - your employees are your contact with customersGive fair pay raises - its not like you are not making a crap load of money off of the employees",
        "pros": "Good benefits packageGood people to work with for the most partSeems to always be a feeling of not knowing what is going on behind the scenes",
        "summary": "Support",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The company is huge and it takes time to improve processes. Getting direct manager supportto make changes is crucial and sometimes that doesn't work either.",
        "advice": "From the top down, it is nice to have support. But the top doesn't care about down, so things keep going as is and don't change.",
        "pros": "Oracle does have a great benefits package and is very supportive of telecommuting",
        "summary": "It is a huge company. This company is Dilbert's company.",
        "role": "Anonymous Employee",
        "date": "Nov 4, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Limited innovation, occurring only in some groups.Excellence is not duly recognized or rewarded.",
        "advice": "Lately, engineering excellence has suffered. Time to Invest+Focus on innovation.Create a culture of internal collaboration rather than competition.Reward the middle of the pyramid across all teams as they drive the core execution.",
        "pros": "Best of breed products. Most of them through recent Mergers and Acquisitions.",
        "summary": "Sales/Marketing Vs Engineering Machine",
        "role": "Engineering",
        "date": "Nov 6, 2009",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Right hand never seemed to know what the left hand was doing......lot's of organizational confusion",
        "advice": "Push decision making down into the organization; improve communication between groups",
        "pros": "As a software company they can pay well",
        "summary": "Business Development Manager",
        "role": "Business Development Manager",
        "date": "Nov 8, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Poor rewards for performance. Bonuses are small and pay raises non-existent, even after a promotion.Developers expected to work long hours to meet deadlines.Not the most fun environment.Company does not try to make employees feel appreciated.",
        "advice": "There needs to be a bigger effort to recruit and keep top talent aboard. Developers need to feel appreciated and rewarded for their performance. The company should also try more to make the environment a fun place for work.",
        "pros": "Opportunities to work on challenging and interesting problems.Competitive base salaryGood overall benefits",
        "summary": "The definition of corporate culture",
        "role": "Senior Applications Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Oracle consulting:Bureaucracy at work,management is lacking authority,no consistent vision/strategy,no idea who my boss is and why I have to report to him/herhave a lousy 2 week vacation for 3 years of service",
        "advice": "Sell Oracle Consulting to someone who cares to buy .....coz what you are doing is prduct support Not consulting",
        "pros": "Oracle Consulting :Benefits for medical & dentallive anywhere in the countrybonus,internal documentation,401k & layoff packageGreen card,diversity at work",
        "summary": "oracle consulting",
        "role": "Consuling Project Manager",
        "date": "Nov 21, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Oracle is not the worst place to work in the world, but the company clearly doesn't care about its employees.",
        "advice": "Value your employees.",
        "pros": "Everyone knows the name and it looks good on a resume. While they underpay you at oracle, you can parlay the job into a much higher paying job elsewhere.",
        "summary": "Good place to have on the resume",
        "role": "Consultant",
        "date": "Nov 21, 2009",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Oracle's enviroment fosters unhealthly internal competition. You had to watch your back. I'd get praise by management, but jealous team mates made my life hell. They refused to share information, no mentoring and I felt like I was in high school where there were cliches. You either fit in with the \"in crowd\" or you are an outsider.",
        "advice": "Get rid of the internal competition. Foster more of a team oriented environment and reward employees who foster that spirit.",
        "pros": "I loved management and the opportunities at Oracle. My manager was wonderful and encouraging.",
        "summary": "Loved the company, had issues with the employees.",
        "role": "Senior Sales Consultant",
        "date": "Jan 4, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Poor managementPoor leadershipLack of motivationLack of career growthLack of belongingnessLack of direction",
        "advice": "Reduce the no. of layersLook inside for talentRespect your subordinatesReview your employees work regularlytalk to employees regularly",
        "pros": "Has a vast number of applications to sell to a large no. of customersRecession proofEasy place to workCan spend time with family",
        "summary": "Good for Sales, poor for development",
        "role": "Director of Product Management",
        "date": "Jan 4, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Little to no recognition. Extremely limited commission. Little room to advance unless you want to manage. Politics play a key role in advancement",
        "advice": "Have a more competitive comp package and more career advancement opportunities so good people don't keep leaving. Micro managing and call stat numbers will keep driving employees away",
        "pros": "Great benefits. Flexible hours. Nice to have the Oracle name on the resume for other opportunities. Have a large book of solutions to offer",
        "summary": "Glass ceiling",
        "role": "Applications Sales Representative",
        "date": "Jan 18, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Under appreciated employeesPoliticsLots of brown nosesUnfareness to women in technology",
        "advice": "Be honest",
        "pros": "Big name on the resumeView everything from the database perspectiveGymCafeteria",
        "summary": "Having kids while employed by Oracle means \"underperformance\"",
        "role": "Lead Software Engineer",
        "date": "Jan 25, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Pay adjustments are few and far between.Compensation is below par for the industry.Opportunities for advancement are fairly limited.",
        "advice": "Have more frequent salary adjustments. Pay more attention to growing the company organically instead of through acquisitions. Be more agile.",
        "pros": "They have good Benefits.They have an honor system for sick time.You have a fair degree of professional latitude.",
        "summary": "Decent place to work, but don't count on bonuses or pay hikes.",
        "role": "QA Manager",
        "date": "Feb 4, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too gigantic. I feel like a miniscule cog in a big machine. Nothing exciting or cutting edge to work on.",
        "advice": "Don't just try to run a tight ship, but try to inspire the work force. Building a bunch of clones with who don't think out of the box works in a tough economy, but you'll lose all the talent when the economy gets better.",
        "pros": "Some decent people. It doesn't seem like I'll have to work more than 40 hours. Great brand to have on the resume.",
        "summary": "Recently Acquired - Looking for something else.",
        "role": "Senior Software Engineer",
        "date": "Mar 15, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "My specific experience is yielding my negative review, but I will focus on more general issues also.Work-life balance, including telecommuting flexibility is available, but whether you get it depends on your specific manager. Because of the top-down approach and the power of managers, there is wide variation. Recently it seems there is lessened flexibility with more people being asked to telecommute less and … much more pressure overall across multiple groups to push harder and put work above life. Given the economy it is not surprising that management will take advantage if they can.Direct from HR, there are really no 360 reviews and no peer reviews. Definitely there is too much red tape and not enough listening by or communication from management. I do not feel there is an employee voice. There is minimal communication from senior management about company direction and there are no regular appropriate-level meetings to both help employees understand their value and their role in company success, or to boost morale - not even quarterly or twice a year.I am seeing this top-down management approach stifle innovation, cause power struggles and lower morale. Recent experiences have shown specific management to have expectations that are completely unrealistic and in these cases management at multiple levels is very inflexible.",
        "advice": "Push for 360 reviews and peer reviews to encourage management to learn from and take into account employee feedback and to balance power.",
        "pros": "Benefits are comparable with other companies. HQ on-site amenities are excellent and under construction for improvements with a wide range of healthy foods. Cafeterias are working toward local produce and environmental balance. Oracle has plenty of great ideas for going green and other reasons to be proud as a whole.",
        "summary": "Top-down management style in some groups, review formats lack balance",
        "role": "Anonymous Employee",
        "date": "Apr 3, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Overspecialization of the sales force causes negative customer relationships. Many conflicting agendas to continually navigate. Poor pay for internally promoted people",
        "advice": "Figure out that the focus should be on helping customers and not gouging them year after year. Business practices are often confusing and unfairly applied at the customer level",
        "pros": "Excellent medical benefits that are very generous. Large company with staying power and continued growth in the future. Potential ability to move into new roles if you are motivated",
        "summary": "Reasonable place to work depending on who and what group you work in",
        "role": "Applications Sales Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Acquisitions have near doubled company size. Navigating through the complexity of the resulting environment is daunting and can seem overwhelming.",
        "advice": "Oracle is a good company, and indeed can be a great company some day but seems like there's some way to go just yet.",
        "pros": "Great place for starting and mid level engineers to learn standards based product development practices, get exposure to a vast array of products, particularly in the areas of middleware and server technologies. Employee benefits are industry leading.",
        "summary": "Great place for exposure to diverse products, and technologies but limited professional growth opportunities.",
        "role": "Anonymous Employee",
        "date": "Apr 15, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management has minimal management experience, managers so afraid of job security they are afraid to challenge senior management on issues that should be resolved, some managers allow employees to create hostile work environments for other co workers and do nothing to resolve",
        "advice": "Evaluate managers on their performance, create employee surveys on work environments, create a less stressful workplace by allowing free thinking and creative solutions (be open to change)",
        "pros": "Flexible schedule, looks good on resume",
        "summary": "Looks good on your resume but don't expect to love your job!",
        "role": "Education Sales Representative",
        "date": "Jun 6, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "No promotion or salary increase for the last 3 years while the task performed has been exceeded the job description.",
        "advice": "Need to take care of low level employees that are the main driving force of the company.",
        "pros": "Big company. Allow working from home.",
        "summary": "Oracle culture is not my culture",
        "role": "Principal Application Engineer",
        "date": "Jun 7, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "After you reach a certain level, there are very few opportunities for advancement at Oracle. Standard HR practices are virtually non-existent: no performance reviews, no raises, no bonuses, limited ability to move around within the company. There appears to be no interest from management in understanding or addressing employee dissatisfaction.",
        "advice": "Executive management should explain the company strategy to employees; address employee concerns. It may be acceptable to freeze salaries and stop paying bonuses; just explain why. Mr. Ellison appears to be well compensated by the company. Other high-performance employees do not seem to be as lucky.",
        "pros": "Oracle is a large and stable company with plenty of cash flow. There's no fear here of going out of business, or being acquired. The company offers versatile hours, supports working from home, and has decent facilities.",
        "summary": "Dead-End Job",
        "role": "Product Manager",
        "date": "Jun 14, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Many middle managers do not have either management or technical skills.- There are many principal engineers who have poor programming skills. Many times, I laugh when I see their code. They have stayed at Oracle more than 10 years and do not care about performance and re-usability of their code.- There was no salary increase for a couple of year.",
        "advice": "Please, train managers to have better leaderships!",
        "pros": "- Flexible work hours for most teams.",
        "summary": "......",
        "role": "Anonymous Employee",
        "date": "Jun 14, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Your areas of working is restricted. It is tough to wear different hats and work on different areas. The pay and compensation is very very bad and is very unfair.",
        "advice": "The leadership varies from group to group and each person has their own style. There is no particular advice for anybody.",
        "pros": "They have the latest technology. Their products are all cool. Nice brand name. Flexibility is good. Work life and personal life balance is good.",
        "summary": "General",
        "role": "Principal Software Engineer",
        "date": "Jun 23, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Promotions only for political reasonsRaises few and far between (3 years at last count)No formal reviews, means management free to do as it pleases with employees fate",
        "advice": "Support Oracle internal policiesTreat individual contributors fairlyTake some people management courses; being a 'good engineer' doesn't qualify you for people management",
        "pros": "Good benefitsAbility to work from home (however, this is at local management discretion)Professional cultureGreat colleagues to work and collaborate with (although upper management encourages feature competition)",
        "summary": "Great Divide Between Management and Individual Contributor",
        "role": "Principal Software Engineer",
        "date": "Jun 24, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Scope for Career Advancement is less.Compensation is not that great.Training opportunities are limited.Growth is coming only through Acquisitions.",
        "advice": "Improve work culture and promote excitement at the work place.Provide Innovation opportunities. Allow and enhance internal growth & not just by acquisitions.",
        "pros": "Good work and family life balance with work from home possiblity.Well established and a stable company.Competition is Dying.",
        "summary": "Good place to work if you just want a nominal paying job. If you are looking for career advancement look elsewhere.",
        "role": "Senior Consultant",
        "date": "Jul 3, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Less holiday than any company I have ever worked forCompeting with Indian workers all the timeConstant power struggle. VP comes and go all the timeThe main focus of development is to figure out how to impress upper management rather than making good productsInnovation means copying ideas from other company innovatively",
        "advice": "No advice at all. I salute all of you.",
        "pros": "Oracle is a successful Fortune 500 company. It has hugh cash reserve. It makes a lot of money.Oracle OpenWorld is great! I've been there several times",
        "summary": "Best strategy: Stay a few year and leave. It has good starting salary",
        "role": "Developer",
        "date": "Jul 9, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Really bad business decisions at the A and B level.",
        "advice": "None for now.",
        "pros": "Well-respected company. Looks pretty good on a resume.",
        "summary": "Poor at major acqisition integration",
        "role": "Business Development Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Soul-less senior management in north american salesInept upper managementNo one can articulate company strategyBoundless egosA greed culture",
        "advice": "Look under the vast hood that is Sales and make an attempt to understand why the best are leaving. Keep upper management from turning Oracle into a software sweatshop.",
        "pros": "Decent benefitsTerrific global executivesFair mindedLots of cool products",
        "summary": "Work here if you like swimming with sharks, drinking cool-aid, and being confused.",
        "role": "Vice President",
        "date": "Jul 14, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Bureaucracy : you spend less than 15% of your time actually sellingCountless efforts to actually get anything done internallyPolitics, politics and more politicsYour promotion depends on who you know, not who you are or what you do.Little support from middle managementIf you can't handle the constant pressure on numbers, find another company to work forIn a nutshell, if you're not a self-start… er, with a clear vision of your career path, able to handle the pressure don't work here",
        "advice": "Well if it was possible to simplify a lot of internal processes that'd be really helpful.Due to the size of the Cpy I doubt it's possible though at a manager level.A more realistic approach of the business would be welcome too.Too much by the book approach from managers. They're missing the point of achieving results with a strong, successful teamThat doesn't get you anywhere at Oracle except you're a…  skilled politician and a PR pro.",
        "pros": "World-class products to sell, that's a lot when you are a sales personClearly a resume builderThe strategy and vision of the market is impressive in many waysSales training is probably the best you can have out thereSome Perks",
        "summary": "Not a good place to work in at a low level (probably better if you're in upper-tier management position)",
        "role": "Inside Sales Representative",
        "date": "Jul 15, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Heavy workload- Too secretive- Very little communication from upper mgmr",
        "advice": "Communication to employees would be helpful in understanding company roadmap.",
        "pros": "- Good benefits- Okay work culture",
        "summary": "Less chance for growth",
        "role": "Anonymous Employee",
        "date": "Jul 18, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Poor R&D and product development. Too much Bureaucracy and incompetent middle management",
        "advice": "No comment",
        "pros": "Flexible work hours. Employees can work from home remotely if he chooses too.",
        "summary": "Bad experience",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Travel gets to be real old real soon. Monday through Thursday and some times Sunday through Friday depending on client",
        "advice": "Management should be more flexible and allow for employees to work from home if possible to save travel expense related to projects",
        "pros": "You get good training on a regular basis and the company has huge knowledge base for its products. Get to travel to San Francisco",
        "summary": "Consulting",
        "role": "Principal Consultant",
        "date": "Aug 2, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "People are not valued for their knowledge and-or experience. Things are done because it is the way it has always been done vs. finding better options or listening to better ideas. Hierarchical and stifling with a culture of fear of the managers above you. Everyone is always guessing what the head creative person wants, and good ideas are killed based on guesses vs. being presented and finding out.Fight for a … better idea against the opinion of a manager; you might be looking for a new job.",
        "advice": "Care about employee growth. Trust others opinions and collaborate more within the team and outside of the department. The stability of the contract system leaves everyone feeling precarious. Contractors just go along with what the managers say since they will stay longer if they do.",
        "pros": "The pay is reasonably good for the work. The name looks good on a resume. Good work quality produced and knowledgable group. Good peer level coworkers to work with.",
        "summary": "Didn't drink the cool-aid",
        "role": "Former Brand Creative Contractor",
        "date": "Aug 3, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- too much of breadth, no depth- massive attrition- terrible pay, good benefits- management weak, india-centered",
        "advice": "change the top !",
        "pros": "(review pertains to only i-flex solutions inc that becase Oracle Financial Software services)-good sw product range- no layoffs unless really bad performer",
        "summary": "Patchy work enviironment overall; pockets of structured, organised work",
        "role": "Relationship Manager",
        "date": "Aug 5, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Slow career progression, sub-par salaries, poor investment in R&D, no cohesive strategy",
        "advice": "Need to review all business units and take a critical look at current performance and strategy for future",
        "pros": "Varies significantly by group - but most groups allow good work/life balance for the role.",
        "summary": "Company too big and too unfocused to be competitive in individual verticals",
        "role": "Anonymous Employee",
        "date": "Aug 11, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "It's a large company so it's hard to make connections outside your department. Way too many corporate emails on things that don't encompass your area.",
        "advice": "I've heard lots of complaints about compensation. It appears that once you join the company it's difficult to get a raise.",
        "pros": "Good benefits for the size of the company. Pleasanton has a nice facility with parking, cafe and work out facility.",
        "summary": "Oracle - Pleasanton",
        "role": "Anonymous Employee",
        "date": "Aug 12, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "very relax corporate culture, 3 people do 1 person's job. underpaid. no bonus or raise. crappy benefits. good people find something else and move on quickly",
        "advice": "larry knows his ****",
        "pros": "I could work from home abroad for about a month every year, that was the only good things. the food was not bad either, but you had to pay for it of course",
        "summary": "Oracle",
        "role": "Member of Technical Staff",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "overall poor compensation packageno career advancement opportunity, especially for femalespromotion not based on merit, but mainly based on relationship and buddyshipweak organizational alignment and structuremanagement lack of leadership skills and some lack of ethics, not role model for employees",
        "advice": "1. be a role model to employees2. clearly communite vision and strategy to employees, ensure message is cascaded down to each level3. be fair, promote good people, not because of buddyship and relationship4. promote more women to senior positions5. switch corporate culture to cultivation and collaboration to improve productivity, so that people feel motivated and proud to work for Oracle. Google is a … great example.",
        "pros": "various information/resources and latest tech trendfast-paced and competitiveflexible for work from home",
        "summary": "Review about working at Oracle USA",
        "role": "Anonymous Employee",
        "date": "Aug 13, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No pay raises at all, ever! No promotions unless you are in the senior managers inner circle. You can work your but off and not get recognized. I have specifically recommended that my friends not apply to work at Oracle unless they are unemployed.",
        "advice": "1. Develop a real set of metrics to measure employee performance and stop rewarding people who are not producing results.2. Pay raises must at least match the cost of living increases or don't even bother.3. Oracle is one of the most successful companies in the world. Act like it.",
        "pros": "Oracle has average pay and benefits. The company will allow some time off it you are really sick and need more than just a few days off.",
        "summary": "Bad corporate culture - no raises",
        "role": "Technical Director",
        "date": "Aug 14, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The org takes very good, smart people and turns them in to people who don't trust each other.",
        "advice": "This particular BU requires a re-org to optimize communication and opportunites for growth.",
        "pros": "In the Oracle BU, you could be a specialist. At Sun, I had to be very good at many things.",
        "summary": "Oracle and Sun Reduction in Force",
        "role": "Senior Buyer",
        "date": "Aug 25, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Upper management does not seem to care about lower level employees. It takes FOREVER to fill an open position due to all the approvals needed all the way up the chain. Management can't seem to stay on a course, changes their minds all the time as to what direction to take with projects and assignments.",
        "advice": "Look into why you have SO many job openings, and why so many people are leaving the company, particularly ex-Sun employees. Your processes are unnecessarily cumbersome and antiquated. You should adopt some of the Sun processes. Every single thing you try to do at Oracle takes an inordinate amount of time, and approval processes are ridiculously lengthy and go all the way up the management chain.",
        "pros": "It's a job. The salary and benefits are decent.",
        "summary": "Not recommended",
        "role": "Senior Member of Technical Staff",
        "date": "Aug 30, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Top-down managementBusiness-orientedChaotic software processSalary below average",
        "advice": "Trust your employee more please",
        "pros": "Brand companyBenefit is decentStable company",
        "summary": "Oracle as it has always been",
        "role": "Senior Applications Engineer",
        "date": "Aug 30, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Nick you every little thing. Now they want us to pay for our own parking. If you take a stretch of on site they want you to cover your own mileage even if it's well beyond a job you'd normal accept.",
        "advice": "listen to the customers. Listen to the people in front of them day to day. When you take over a company the take it over. Sun's management had some real problems and these problems continue to make everyone's life miserable.",
        "pros": "You have a paycheck is repeated to you over and over again.",
        "summary": "none",
        "role": "Field Service Engineer",
        "date": "Aug 30, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "No respect to employeesManagers are too technical with no management exposure and experiencePay way below industry averagesNo real career path",
        "advice": "Remember employees is what makes a company.. Its not the acquisitions or revenue generated",
        "pros": "Technical vision of the leadersLarry's charismaAbility for the company to build a sense of pride within its employeesWork-life balanceGreat place to start your career and quickly get out into the industry",
        "summary": "Technically exciting but not employee friendly",
        "role": "Anonymous Employee",
        "date": "Sep 5, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Limited career advancementNot team orientedProjects not very interestingConstant cost-cutting/not replacing lost headcount is exhausting.Infrastructure is poor - always cost vs productivity and low cost always wins. Nearly every project I've been on for the last 2 years has been canceled. When started they were all the highest priority - something Larry wanted - and within 2-3 months of hard … work, all were canned for the next new thing Larry wanted.",
        "advice": "Put yourself in our shows, would you want to work here? Seems that more senior managers are more concerned with surrounding themselves with yes-men than with strong managers. The net effect is that individual contributors feel jerked around because there is no one looking out for them.",
        "pros": "Flexible work scheduleWork from homeOn-site gymClose to public transportation",
        "summary": "Here but if the economy were better....",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Salaries and bonuses are much less compared to other companies in the valley. Most people get market salaries when they join, but they soon fall behind their peers because their salaries don't increase very much over time. The view within the Finance org is that people are expendable - there isn't enough effort put in to retaining good people.",
        "advice": "Do a better job of making employees feel valued.",
        "pros": "It's a large multinational company with varied operations, so we exposed to many facets of the business. The company is very well run so it's a great place to get a firsthand view of how things get done.",
        "summary": "Pros and Cons",
        "role": "Anonymous Employee",
        "date": "Sep 10, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too large --- too many people not contributing to their fullest potential. I came from a previous work environment where productivity was encouraged and rewarded (handsomely). At Oracle it didn't matter if I tried or not --- no one noticed and if they did, there was no reward. Innovation not encouraged ---- I had one Sr. Director tell me that my idea, thought it was correct and had merit, would be too hard to impleme… nt in a company like Oracle. I proved him wrong by rolling up my sleeves and getting my hands dirty. The result impacted every geography and was unprecedented for its time. But I was one voice in a huge wind tunnel and in the end, I was bored out of my mind.",
        "advice": "Pay attention to the talents of the people in the company and provide opportunity for them to apply themselves in new and innovative ways. Reward them.",
        "pros": "Brand recognition ---good to say \"I worked there\"Nice cafeteria's at HQ",
        "summary": "The Big BOOOOOOracle",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is very little planned leadership or accountability. Crisis Management seems to rule the day. If someones continually screws up as an employee or a manager, no one takes the time to address the issue or fix the problem.A very ethically-challenged organization. You are required to take ethics training every 2 years, and you just look around and see all of the violations. Some are downright criminal. But … what do you do when Larry himself has a enormous conflict of interest (see NetSuite)? I also don't trust the anonymity of the tool used to report violations.The company loves to offshore and use H1-B workers. The problem here is they seem to hire very incompetent people. Your job will be to put out fires that they create.Middle Management knows whats going on, but has no authority to do anything. Whether it is rewarding job performance, hiring or firing people, everything is run from the top. This means you get the same bonus at the guy who shows up to work 3 days a week. This also makes it very undesirable to pursue a career here.",
        "advice": "Accountability is huge for employee morale, slow down and figure out why you are putting out fires continually and correct the problems.Cheap offshore labor conflicts with the law of supply and demand. You get what you pay for. Figure out what the real cost is of using cheap labor. Flying people highly-trained individuals to client sites ain't cheap. Getting sued by companies for having crappy software ain't … cheap. Also, I believe our poor reputation will catch up with us.Layoff decisions should not be made by people who don't know who the productive employees are. If your not allowed to tell the middle managers, ask them who there best employees are. Also, who lays people off on Tuesday? Why the surprise attack? Pick up an \"HR for Dummies\" book.Quit hiring and keeping your poor-performing friends as management.FYI, the corporate card is not your personal piggy bank. I don't like seeing you bust out the corporate card for an after work gathering. I make less money then you, I pay for my drinks at happy hour, you can too.",
        "pros": "1. Initially, you can negotiate a good salary.2. Some really smart people work here.3. Looks good on a resume, \"punches your ticket\"",
        "summary": "A flexible well-paying job (depending on how you negotiated coming in) that will make you pull your hair out.",
        "role": "Senior Software Engineer",
        "date": "Sep 22, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Madenning environment to complete any sales cycle with cryptic applications, and excessive work process overload. More time spent on mundane, clerical type activities such as various approvals, quote generation, opportunity tracking, contract adjustments, imaging, contract generation, forecasting, paperwork...so many mindless activities distract you from what is most pertinant to your job success, talking to customer… s and solving real business problems. Long, frustrating learning curve to get up to speed with all the internal systems necessary to perform your job duties.",
        "advice": "Mgmt more concerned about their hopelessly inacurate call metrics, deal data stats and forcasting, than contributing toward real growth. No one is brave enough to challenge the hierarchal inertia, or shield the salesrep from all the burdensome distractions. Too much mgmt., top heavy organization.",
        "pros": "Great place to learn about technology, with numerous opportunities for internal growth. Lot's of job recognition and awards. Great reputation among tech companies, and Oracle name carries prestige. Quality people, and large, international, diverse workforce.",
        "summary": "Sales",
        "role": "Applications Sales Representative",
        "date": "Oct 8, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "All depend upon your immediate manager and his whims. No uniform culture, evaluation etc.If you get a crappy manager you life will suck.Also with IDC,CDC etc one is expected to work in the morning, during work hours and then again late in night. This is by default expected.",
        "advice": "There is too much middle management whose only job seem to be saying yes sir, to anything the top management says. You can be a good manager only when you understand what you are committing to, how much resource you have and what can be done. Everybody is afraid to bring any bad news to top management.",
        "pros": "Give a sense of campus at HQ. Good benfit like health care, gym.",
        "summary": "ok place but there are much better places",
        "role": "Principal Applications Engineer",
        "date": "Nov 11, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Salaries are low for industry consequently have high turnover rate (3 mgrs in 2 years). Good work performance not recognized with monetary rewards (bonuses). No cost of living increases. All good talent leaves company within 1 - 2 years.",
        "advice": "Take care of your employees and pay them well and they will take care of your company. If you don't Oracle basically becomes a training ground for professionals and then they move on to company that treats employees better and with much higher pay.",
        "pros": "Flexible work schedule (flex-time, work from home)",
        "summary": "Lacks Professionalism",
        "role": "Global Commodity Manager",
        "date": "Nov 11, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Very limited growth in Oracle",
        "advice": "Need to differentiate based on performance",
        "pros": "Good companyLarge companyGood productsGood management and productsGood customers in various industry and standard based products in",
        "summary": "Limited growth",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "- Very proud crowd who think they know everything about everything, and that clients are idiots- Most have no experience in strategy, but more so sales or financial analysis, but again, know better",
        "advice": "How about knowing what you are speaking about, instead of simply replicating the same slides from client to client? That would be new.",
        "pros": "- Access to CIOs, CFOs, VPs at a large circle of clients and prospects- Interesting and high potential opportunities- Coordination of complex and fast-paced \"strategy\" engagements with clients and other Oracle organizations (services, product management, etc.)",
        "summary": "You call this strategy?",
        "role": "Director, Strategy Insight",
        "date": "Nov 25, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Culture killer. Take over occurred, staffing cuts made in wrong places. Slow adopter of new technology for internal use, home grown systems that are difficult at best to use",
        "advice": "Far too many layers of management. Not all managers are qualified to be at the level they have risen to.",
        "pros": "stability, a place I could have camped out if seeking mediocrity, for many many years to come. Opportunities to learn Oracle specific software",
        "summary": "Cultural take over",
        "role": "Anonymous Employee",
        "date": "Nov 27, 2010",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "1. Very poor work recognition culture - Doest'nt worth hardwork here2. Managers are very secretive about anything relates to money3. No salary rises at all (I have'nt seen one in last 3 years).4. No bonuses (Only for manager preferred people)5. Stock options (Only for manager preferred people)6. No promotions (Only for manager preferred people)",
        "advice": "Please treat hard-working employees fairly with pay rises and bonuses.",
        "pros": "1. One of the biggest software company",
        "summary": "Poor work recognition",
        "role": "Principal Software Engineer",
        "date": "Dec 6, 2010",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Management is brutal, clearly they have no interest in training the sales reps. Management was not trained very well, yelling and public humiliation of their reports was common. The comp structure is overly complicated, we were never sure what we were getting paid for.The internal IT tools for reporting and data gathering we used were ridiculously slow. Trying to navigate the internal systems (both IT systems…  and approval chains) to book deals took up a large part of our time.I was surprised at how difficult it is to get promoted at Oracle. The field sales organization will not hire sales reps from Oracle Direct, period. If you are interested in field sales it is best to come into field sales from outside Oracle. It is also difficult to be hired into management, and the pay for management is lower than the sales reps so there is little incentive to do so.",
        "advice": null,
        "pros": "Lots of products to sell. Opportunities to network. Oracle is a great name to have on your resume. Pay is decent for Austin.",
        "summary": "Pay is decent, but don't expect good management or advancement opportunities.",
        "role": "Oracle Direct Sales Executive",
        "date": "Jan 4, 2011",
        "is_current": false
    }
]