[
    {
        "rating": 4,
        "cons": "Oracle often gives great salaries when you join. But after that, its very much slow to give an increment. Unless you have a great manager who can root for you, to get a good bonus, its difficult to get your salary raised.",
        "advice": "Give better salaries to employees ;)",
        "pros": "Its a great place with some really sharp and smart people working in the company. I have met numerous people who have worked in Oracle for over 10 years, and still going strong. I guess, you can say that they are now super specialized, but still, the overall benefits are great. It is also provides a great relaxed atmosphere to work, and the culture is very laid back. Very flexible working hours, and a less stressful … work environment.",
        "summary": "Great place to work.",
        "role": "User Experience Designer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some of the internal organizations are too large.",
        "advice": "Big decisions need to be taken with the perspective of the smallest problem. That makes solving the problem that much easier.",
        "pros": "Technically a very challenging company with a lot of room for growth. Good experience in a good team in Oracle has a lot of respect outside the company. Being a part of a successful company allows one to participate in all aspects of a software product development life cycle.Oracle allows employees to further their education, a part of which is refunded. This gives an incentive for employees to become more qualif… ied.",
        "summary": "Oracle-From the perspective of an employee",
        "role": "Consulting Member of Technical Staff",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle is a very complex organization. I do not necessarily see these as \"downsides\" rather realities... In a nutshell the challenges will come from the following: Acquiring 43 companies in three years does not come without complexities. Couple the acquisitions with the fact that Oracle is a \"self-service organization\" and you should plan to spend the first six months of your time trying to understand who, how, what … system, what group etc. The quicker you map these things out the better off you will be. Oracle is a results oriented organization so quarterly pressures are standard. If you are looking for potluck lunches try another company. Larry is a strong believer in multiple sales reps calling on the same customer. This can cause challenges with customers and sometimes creates tension internally.",
        "advice": "We should strongly consider streamlining some of our internal processes and internal systems. The acquisition strategy is working... continue to aggressively invest where it makes sense.",
        "pros": "Working at Oracle offers a wealth of benefits... Here are a few to consider: First, you will benefit by having a top-tier software company, like Oracle, on your resume. Second, successful sales reps are compensated handsomely for their success. Third, the level of intelligence and experience of many of your coworkers and extended teams will be extremely high. And last, you will have good access to the executive level…  at many companies.",
        "summary": "There is no better time in history to be at Oracle.",
        "role": "Sales Representative",
        "date": "Jun 12, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Demanding at times, low perks.",
        "advice": "Keep up the good work.",
        "pros": "Great company to work for.",
        "summary": "Great company to work for",
        "role": "Senioor Software Developer",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle is BIG.. and as such politics are par for the course. However, for the most part, its a bunch of smart people all trying to do well in their jobs.. It does seem like middle management gets in the way of the workers and sometimes doesn't clearly present the real problems to snr management so they can do something about it. So overall.. just the communication flow and the agility of the organization seems to be … slow -- like an elephant.",
        "advice": "set up an EFM (enterprise feedback management) system... so that you know what's really going on at the front lines -- by allowing workers to provide anonymous (or not) feedback. Especially, in the software business it seems like the mental work that people bring with them and develop is very important... and yet, that human capital seems not to be fully leveraged.",
        "pros": "Oracle has been known for various different things over the years... but the synergy of their current solutions (DB, ERP, CRM) is very compelling...especially for some verticals. Thus, it's a great place to be a salesperson at... because it simply is most of the time the BEST product to sell andThink about all the companies you would invest in.. and go work for them. Warren Buffet says you should get a punch … card with 10 different allowable punches over the life of your investing career..",
        "summary": "Oracle is slowly taking over the world",
        "role": "Pre-Sales",
        "date": "Jun 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No big upside in compensation",
        "advice": "instill intrapreneurship",
        "pros": "Opportunities in many areas as Oracle's footprint in software is large",
        "summary": "Oracle is a good place to work, but not a place for the best",
        "role": "Senior Product Manager",
        "date": "Jun 13, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Compensation is not very competitive",
        "advice": "Less politcal play",
        "pros": "Balance between life and work",
        "summary": "Balanced life/work work place at Oracle",
        "role": "Principal Software Engineer",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Compensation is not up to the mark",
        "advice": "Value the employees more",
        "pros": "Career opportunities to grow, Flexible work environment",
        "summary": "Great company to work for but",
        "role": "Senior Product Manager",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Salaries are low (if you have been there a while). Not as good to employees as some other large companies. Lots of long time veterans so sometimes growth can be stifled. Lots of politics and some groups have a lot of backstabbing etc, going on. Turf wars between VPs etc. are also quite common. Also, promotions are quite slow in some divisions and it takes a long time to go up the chain (if you leave and come back, yo… u can short-circuit some of that).",
        "advice": "Pass on more of the results of the good profits to employees (raises, bonuses etc.).",
        "pros": "Large Company - diverse opportunities. Good benefits. Stable company. Growth opportunities exist but vary by division and group. Company growing by acquisition so lots of new areas coming on and there is constant change.",
        "summary": "Decent place to work.",
        "role": "Product Manager",
        "date": "Jun 15, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Don't even consider asking for a budget - anything budgetary is dealt with by a politburo. Work/life balance, what's that? Don't be surprised by internal competition, it can be as challenging as external competition. When you're interviewing for a job, make sure you ask the highest possible salary - once you're in, don't expect significant raises.",
        "advice": "sometimes you have to make a clear decision, not everything can be left to the survival of the fittest",
        "pros": "If you know what you want and have the energy to do it, it's all possible. If you're waiting for something to happen, you're probably working for the wrong company. Work with some of the most creative and technically astute people. Never a boring moment, seize the day. \"Not possible\" is not in this company's vocabulary.",
        "summary": "survival of the fittest",
        "role": "Vice President",
        "date": "Jun 16, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "With Large companies you can get lost in the masses. The communications up the management chain can be laborious (you really have to push to move things up the ladder).",
        "advice": "Focus some of that energy on workforce. The company is strongly focused on growth and as a consequence we have more than doubled the workforce. It is time to focus on these people and make sure we keep the best.",
        "pros": "Good pay and benefits, good management practices. Your managers are always willing to listen. Decisions that are made at the lower management levels are usually very good.",
        "summary": "OK, but lots of potential to be better",
        "role": "Principal Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Ordinary compensation, very typical of a big company",
        "advice": "Too much control at the top, need greater devolution of powers. Need greater vibrancy",
        "pros": "Big company, wide variety of opportunities",
        "summary": "Management feedback",
        "role": "Principal Sales Consultant",
        "date": "Jun 17, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Its big! So a lot of people seem lost.My knowledge is limited to Fusion Middleware (Application Server) platform area and cannot comment of DB or APPS teams - the problems are- dysfunctional - there is the obvious \"right arm doesn't know what left arm is doing\" syndrome.- SDLC is not strictly followed -- engineering process gets a little chaotic/ ad hoc. the initial set of requirements/restrictions that y… ou start with almost never hold true. Some thing or the other will change and you'll have to accommodate for it.- schedules are very aggressive but in my opinion not realistic. To give an example, product hasn't shipped 18 months after a previously advertised \"code freeze\" date.- you work a lot but get a sense of not having achieved as much.- if you like to code a lot, then this isn't the place :(- nobody makes firm commitments on requirements/schedules - I guess it is a way to make sure anything you don't know now can be made a \"requirement\" later.",
        "advice": "Stop doing big bang releases. Tier the process so that there are fewer dependencies, the requirements are crystal clear.Rolling development process is not viable and will drive away employees coming from all the companies that are being acquired where there is more structure.",
        "pros": "It's a big company, so there are options to choose from - moving groups is possible, even changing career tracks (Engineer to PM, etc.) is a possibility. The company is stable and won't be going away soon :) - as long you are doing a good job, there is little worry that you'll be laid off. The health and 401(k) benefits are generally decent. As always - combination of right place, right time, hard work, positive ener… gy will pay off in the long term - have a 5 year + window.",
        "summary": "I don't hate my job :)",
        "role": "Development Manager",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Huge bureaucracy, difficult to get decisions made in a timely manner, lots of intellectual theft within company",
        "advice": "Train your managers better, support them",
        "pros": "Good pay, great benefits, interesting work. If I am bored, it is my own fault.",
        "summary": "Good enough for me",
        "role": "Consulting Member of Technical Staff",
        "date": "Jun 18, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long hours, travel, very competitive",
        "advice": "give more to community",
        "pros": "smart people, great technology, great strategy",
        "summary": "Oracle is one of the best tech companies to work for",
        "role": "Director",
        "date": "Jun 19, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "In many ways Oracle doesn't know how to deal with consultants. They were and are a great database company and probably should have stayed in that business. Once PeopleSoft was purchased they should have dropped the line of Oracle HR software and embraced PeopleSoft software.",
        "advice": "I am not sure Senior Management wants to hear anything from a consultant. They don't understand or want to understand our lot in life.",
        "pros": "If a consultant wants or needs to 'come off the road' Oracle provides many opportunities to accomplish this. other consulting firms its the road or the highway",
        "summary": "Oracle, a decent place to work",
        "role": "Principal Consultant",
        "date": "Jun 19, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "One of the downsides to working for Oracle FS is the internal policies and precedures (althought nessicary) sometimes being a pain to deal with.",
        "advice": "Hire more product managers to support sales and presales.",
        "pros": "One of the best reasons to work for Oracle FS is the flexibility and oppurtunities that such a large company brings. Within such a large company there are a number of oppertunities within Oracle. Affter getting aquired by Oracle, there hands off management (at my level) has been a positive.",
        "summary": "Working for Oracle Financial Services as a Mantas Sales consultant is pretty good.",
        "role": "Sales Consultant",
        "date": "Jun 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Old technologies. Not fast enough to embrace new technologies. Very large corporation",
        "advice": "Faster adoption of new technologies and opportunities",
        "pros": "Good work life balance. Great people to work with",
        "summary": "Good balanced work",
        "role": "Senior Software Engineer",
        "date": "Jun 20, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "HR is disorganized - Appraisal, bonus, stock all on different cycles so cannot link togetherAlways cost cutting to meet margins.Although you can do more with less in US, emphasis is to hire in lower cost areas to save money, when you are really making the US employees work twice as hard to manage local and abroad resourcesTop down approach. Less innovation from the bottom up. A hierarchy driven culture.",
        "advice": "Synchronize HR/people processes. It hurts morale and sets up the manager for failure and disgruntled employees.",
        "pros": "Oracle always leadingAggressive cultureBig company benefitsSurrounded by smart peopleUpper management has their act togetherSales organization is world classGreat gym if you have the time to use it",
        "summary": "Good company, but HR could be refined in a big way",
        "role": "Development Lead",
        "date": "Jun 21, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Larry's hatred of Microsoft means we have to avoid their stuff wherever possible. We don't use Exchange servers, and our email system is clumsy and painful. We seem to rewrite even basic applications for internal use - why are we using \"Oracle Chat\" when there are at least ten good alternatives already out there? Comp is on the low side, but they do give out options.",
        "advice": "Invest some money in marketing your products! It's galling to see SAP's ads touting software that's nowhere as good as ours when we're not saying anything in return.",
        "pros": "We're acquiring some of the best-in-breed software and are serious about tying them together to form best-in-class industry solutions. It's the Cisco model applied to software, and thanks to SOA, it's working. For people who have been acquired, the pace can seem slower, but if you can correctly leverage the huge sales force and pipeline, there is a huge customer base that you can sell to.",
        "summary": "Good solutions; poor marketing.",
        "role": "Vice President",
        "date": "Jun 23, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Salary is not competitive if compared to the market and bonuses are really bad, sometimes nonexistent. The fact that Oracle has acquired many companies has changed the company soul. Now it looks like one place with many different companies inside.",
        "advice": "Oracle needs a more clear direction besides more methodology for developing products.",
        "pros": "Senior Management doesn't complain if you need to work from home. Besides that, Oracle benefits such as health care and 401k are really good.",
        "summary": "Great place to work despite of bad salary",
        "role": "Principal Member of Technical Staff",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pay, and politics. Raise pools have been extremely weak over the past few years, and apparently will stay that way as long as we keep buying companies. Part of the problem is they're trying to keep cash on hand for M&A activity, and part of the problem is all the new companies we buy come with people making much higher than Oracle-average salaries, which skews the #'s for the rest of us. On the politics side, Ora… cle management culture puts far too much weight on titles and the number of employees a manager has, resulting in a tendency toward premature promotions, power grabs and cutthroat reorgs.",
        "advice": "Share the wealth - many of us have worked our tails off during Oracle's buying spree over the last few years, and have suffered from the salary penny pinching as a result. Now it's time to reward those that stuck it out.",
        "pros": "Oracle is a solid, stable company, doing some fairly innovative things, especially considering its size. There's a good bit of opportunity, and you can succeed if you work hard and have talent.",
        "summary": "Mostly happy, but for the money",
        "role": "Director",
        "date": "Jun 25, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extremely limited to no opportunity for career advancement",
        "advice": "Oracle could be so much better if it was more of a meritocracy.",
        "pros": "Its a winner in enterprise software space",
        "summary": "Good place to work but extremely limited opportunity for career advancement",
        "role": "Senior Director",
        "date": "Jun 26, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can get lost in the size and employee pool. The management structure setup is highly complex and often I find groups of employees working on similar or relevant areas unaware. The knowledge share competency could be improved.",
        "advice": "Keep pushing the envelope.",
        "pros": "Large, stable company. Good benefits and culture. Leadership communicates well and often. Even in a downer economy, Oracle is still producing good numbers for the Street. The flexible culture allows good hours and work from home or telecommuting. There's good lateral movement opportunities, and given how many companies Oracle buys, you have a decent chance to switch compentencies or area of expertise if you choose to…  go after it as such. Co-workers vary with the group you are in but are generally effective and smart. The area of growth now is Asia, and there are plenty of good opportunities there.",
        "summary": "Oracle is a good large IT company if that's your cup of tea",
        "role": "Principal Consultant",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's a big company. Sometimes you are lost in bureaucracy. Fast/quick moves towards new market trends are difficult.",
        "advice": "None.",
        "pros": "Good perks, work/personal life balance.",
        "summary": "Good salary, good perks, good work/personal life balance. Yet, it's a big company, so it will boring from time to time.",
        "role": "Oracle Solutions Architect",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you are expecting a guided career path or even a mentored career path, then this is not the place. Competitive atmosphere with a little bit of dog-eat-dog thrown in. But then you should go to IBM if you want someone to babysit you, I guess.",
        "advice": "Loosen up those purse strings, for crying out loud. We are giving you 150% growth year after year.",
        "pros": "Strong product stack which contributes to bottom line (more importantly Oracle's bottom line). Fusion makes for a startup atmosphere (so we don't have free massages and all you can eat buffets), a never-ending learning curve, entrepreneurial culture.",
        "summary": "Welcome to the Dark side.",
        "role": "Principal Product Manager",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "you will stagnate unless you keep moving within the company",
        "advice": "Cut the crap already! You wouldnt be here if it wasnt for us! Stop taking all the credit idiots, and show some respect to your subordinates and team mates!",
        "pros": "Good future with a strong commander in chief, combined with job security.",
        "summary": "Statisfied by not on a multi-orgasmic level",
        "role": "Senior Project Manager",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It is a large corporation, with lots of moving parts...",
        "advice": "Attract the best talent and do your best to train and retain it.",
        "pros": "Good compensation and benefits, good work/life balance. Opportunity to work with some of the best and the brightest in the industry.",
        "summary": "Great place to start your career.",
        "role": "Senior Member of Technical Staff",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Its a very large organization which causes more bureaucracy.",
        "advice": "More freedom to different departments",
        "pros": "Job Content is very good & the work is challenging",
        "summary": "Satisfactory",
        "role": "Software Engineer",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Red tape associated with behemoth organizations, Slower career growth",
        "advice": "Listen more to your employees, do not try to save incompetence. promote younger people with innovative ideas",
        "pros": "Brand Value, Huge number of opportunities, Global exposure",
        "summary": "Orcle is one of the better places to work",
        "role": "Senior Principal Consultant",
        "date": "Jun 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company bureaucracy, not a lot of in-house innovation.",
        "advice": "Allow more fluid movement of resources across business units.",
        "pros": "Stable company with big-company variety of projects.",
        "summary": "One of the best big companies in the Valley",
        "role": "Technical Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle seems to have lost focus once it started going on a buying spree. Too many disparate technologies to glue together in an unrealistic timeframe",
        "advice": "Not very good leadership skills.",
        "pros": "The technology is great. Good group of people.",
        "summary": "Oracle is a good place to work for ...",
        "role": "Senior Manager",
        "date": "Jul 2, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Middle management sucks! Too many VPs and too much title inflation in the company. Product development is not assimilating the acquisitions well, while the sales and other sides of the business are doing a much better job handing acquisitions.",
        "advice": "The company is getting too big and the management pool is very poor. HR department does nothing but very basic stuff. People development is very poor. Good management does not exist in the company anymore. Apps product development organization has grown like weed with no justification. If software is commoditizing, we cannot see that in the way software development is managed in the company. If you want to aspire you… r company to be managed like GE, you better start reading Welch's and Bossidy's books because i cannot see any trace of those best practices in the company.",
        "pros": "Good Pay. Stable Job. Aggressive and action oriented environment. Executive management is great.",
        "summary": "Aggressive, action oriented and exciting company. Middle management sucks! Not much innovation here but great execution!",
        "role": "Senior Director Engineering",
        "date": "Jul 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some executives are highly political creatures with strong anti-innovation mindset. Try to work for newly acquired executives (or startups Oracle has bought), if you want to learn and grow. Working with Oracle long-timers is usually a bad idea unless there is a specific smart person.",
        "advice": "Identify young leaders and groom them. Invest in people or you will be a dead company in 10 years. So many smart people, so little innovation.",
        "pros": "A large, stable, successful company where you can move around and grow. There are 1000s of smart, capable people. The company has good benefits and salary. Its a good place to work when raising a family. Sales, engineering teams are great.",
        "summary": "Great place to work if you can find a leadership role",
        "role": "Group Product Manager",
        "date": "Jul 11, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Working from home is expected. E-mail needing replies can come in at any time. Customer escalations can be stressful. It is such a nice environment (campus and cafeterias) that it is stressful to think about not meeting expectations and possibly being laid off.",
        "advice": "Keep investing in the database technology",
        "pros": "Great benefits except 3.5 weeks vacation seems average. RDBMS is industry leading and has great technology. HQ has excellent cafeteria choices. HQ campus is beautifully landscaped and very attractive. Managers have engineering responsibilities so they can understand technical issues and relate to their direct reports. After a certain number of years, you are practically guaranteed an office.",
        "summary": "World-class database technology plus a growing applications business",
        "role": "Consulting Member of Technical Staff",
        "date": "Jul 13, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Consulting is seen as the ugly step child to development/database/sales",
        "advice": "Raises need to be better than inflation for high achievers",
        "pros": "Solid Technology Name that opens doors",
        "summary": "Oracle is a solid place to hone your skills",
        "role": "Senior Principal Consultant",
        "date": "Jul 15, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There was no career path for sales people most people including top performers left after a while. Either you moved into management or you moved on. The sales team I worked with seemed to be a body shop with high turnover which could explain why the training was so good.",
        "advice": "More defined career path for sales.",
        "pros": "Oracle had a good training program for those not familiar with the database and application market. It was intermixed with working with existing sales people to get people up to speed quickly. The building was nice as it had a nice cafeteria and large free onsite gym to workout in.",
        "summary": "Good place to train for your next job",
        "role": "Account Manager",
        "date": "Jul 30, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Favourism, Favourism and Favourismas long as u r good pal's with your manager's, you would go long way.No Ethics, Money Talks, the company would not want to loose a single penny on you.The day you are on bench and the quarter is bad you are out of the company. Live'sin todays $$$$'s no long term investement on its employees. There are no standards followedwhen it comes to Promotions or Appraisals … or Bonus time, it is the managers who decide.so if you are a good pal of your manager you grow.",
        "advice": "When you expect your employees to be loyal to the company, give back the same loyality to your employees",
        "pros": "You are working with a Product Company, they make the product, the sell the product, they support the product.This gives you unlimited product exposure. There is no limit to the training Programs one can take.",
        "summary": "Join us only if you have no other Option.",
        "role": "Senior Principal Consultant",
        "date": "Aug 5, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle's legacy culture is a little on the cutt-throat side. Many people from Oracle (not by acquisition) can seem to view other co-workers and / or other divisions as something akin to \"Co-opertition\". I think this has some good and bad sides. I like healthy competition and working with people that are go-getters. I do believe that sometimes the competition aspect can lead to short sided decisions (based on one's ow… n bonus, team or other factor) that can be long term bad for the company, long term or larger team.Seemingly tough to find that right life / work balance: at least in the sales and conuslting ranks (where money is being made / brought in), I find it difficult to sometimes balance life and work. I see many people struggling to do the same. I have ended up in a position in particular that I think really helps the situation for me and my family but I see many people that will miss their kids or other family responsibilities. Bottom line, many work crazy hours and expect you to do the same. It seems to be more about being able to answer the e-mail at an ungodly hour (the apperance of working hard) than being efficient, effective and then going home.",
        "advice": "I don't have their job and their pressure, so I have no advice for Sr Management. And despite some of the things I say above, I have no idea how I would run a company of this size any differently.Likewise, I believe Oracle has done a crazy great job with acquisitions and has again created a grocery store full of products, applications and technology that surround our competition in the market. Bad econ times … seem to be upon us in 2008 and yet, I feel very safe here at ORCL (it helps in this case that I am making my numbers currently).",
        "pros": "It is a big company with a grocery store of applications and technologies. I feel very safe here and I am from one of the acquired companies. Always good to be with a winner. I have also felt that Oracle has given me a fair shake and has advanced me and enhanced my chances at career recognition and promotion.Health insurance is the best of anyone on my block (IBM, Sun, Yahoo, Bea (now ORCL), Deloitte.… I think you can have lots of opportunities to make of yourself what you will.",
        "summary": "Oracle is a big safe ship, but the crew works very hard...",
        "role": "Practice Director",
        "date": "Aug 8, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too big - harder to do new products on a very old legacy product",
        "advice": "create different small focused groups and create new innovations around a particular business product",
        "pros": "creates innovative products - although must say not always successful. Good from an engineers perspective",
        "summary": "satisfied with Oracle if you are working in ST, especially the database.",
        "role": "Principal Member of Technical Staff",
        "date": "Aug 12, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You can get lost in the crowd. Onboarding process is very hap hazard and it takes a while to get used to settle in. I don't think they are the best paymasters in town.",
        "advice": "Stop shopping around and organize what you have now. Focus on integrating the current groups and companies nicely so they can be synergized.",
        "pros": "Looks good on your resume. You can maintain good work life balance if you want. Hiring process is not very lengthy - maybe 3-5 interviews and background, reference checks. They are devoted to cutting costs and as a result reliance on technology is high. I like the bonus structure and the fact that they are paid out quarterly as opposed to yearly. It may take a few weeks to get used to everything but life gets easier … after that.",
        "summary": "Not a bad company to work for.",
        "role": "Project Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's a big company -- there's bureaucracy and plenty of questionably useful employees.",
        "advice": "To continue to reward good work and shed some of those questionably useful employees. And to stock Diet Root Beer in the kitchens.",
        "pros": "They treat their engineers well and reward good work. The quality of the people in the database is quite good, and they are more interested in what you get done than your seniority, etc. There is also a lot of flexibility about work hours, telecommuting, etc. It's a big company, with lots of job opportunities within, so if you find yourself sick of what you are doing, you don't even have to switch companies.",
        "summary": "The database division is a good place for developers.",
        "role": "Principal Member of Technical Staff",
        "date": "Aug 14, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not a lot of bonuses or and no real proft sharing....not a lot of raises so get your high salary up front...Oracle could do better in providing more or at least significant employee perks instead of the ones that we can't use.",
        "advice": "Get away from old ideas. If you are going to tell everyone that Oracle's software is the best, can you at least make sure that the same software works for your employees?",
        "pros": "Good Work Life Balance, salaries are good ( could be better) Oracle provides training courses on its software to its non-IT employees and allows its employees to work remotely quite often. It is possible that you and your manager will not be in the same office or even the same city. This takes some of the pressure of people who hate being micro-managed",
        "summary": "Oracle - neither here not there!",
        "role": "Contracts Manager",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not much opportunity for advancement in some positions. Too process heavy.",
        "advice": "Salaries need to keep pace with inflation. More competitive benefits.",
        "pros": "I enjoy the fast pace and flexible working hours. Great working environment.",
        "summary": "Oracle offers a great working environment with great people...",
        "role": "Senior Administrative Assistant",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "People looking for scapegoats too often.",
        "advice": "Acknowledge the realities of the marketplace. Don't let up on the gas, but acknowledge the market today.",
        "pros": "Very creative people. Like minded organization.",
        "summary": "Oracle - Success with a price?",
        "role": "Sales Manager",
        "date": "Aug 20, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle does not go out of its way to make employees feel 'fuzzy' . All business all the time. Not necessarily a downside but it could be for some. The best reason to work for Oracle (see above) could also be a downside for some.",
        "advice": "Flexibility in salary negotiations.",
        "pros": "Oracle provides ample opportunities for advancement. However at Oracle it is essential to understand that you are on your own! You must create your own opportunities and networks. Oracle rewards those employees that are aggressive and that set out to be leaders.",
        "summary": "Lots of opportunity for those who understand the Oracle culture.",
        "role": "Principal Consultant",
        "date": "Aug 22, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too many processes. It's hard to go into projects that are cool and interesting. Deadlines are not met and projects extend beyond reason. I would like to see a more agile approach similar to Google.",
        "advice": "I would love to have free lunches. It will encourage meeting often with co-workers.Projects should be more flexible and able to descope features or prioritize features more often",
        "pros": "The company is great to learn new things. It has a great name with a lot of recognition. Great to start and build your career. Pretty big and complex projects with large number of people. You can have access to great training and meet really smart people.",
        "summary": "Great company to start your career",
        "role": "Software Engineer",
        "date": "Aug 25, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited career growth. Lower salary comparing to other companies. Big gap in salary for 2 equal position. Unfair treatment to different employees. Some were allowed to work from home and from remote. Some weren't .",
        "advice": "There are title inflation. Far too many directors and senior managers with no direct!",
        "pros": "Very flexible timing. Work from home or remote location.",
        "summary": "Real work from home job if your manager approve it",
        "role": "Principal Software Engineer",
        "date": "Aug 26, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited career advancement opportunities, low or no pay increase. Telecommuting people are even working from India for weeks. During that period of time time folks are not reachable.",
        "advice": "They should provide competitive pay increases given that Oracle has been very profitable company in recent quarters.",
        "pros": "i flexible oracle's flexible work. Telecommuting, good fitness center, seems like turnover is low.",
        "summary": "review of oracle workplace",
        "role": "Senior Software Engineer",
        "date": "Sep 1, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There is not much opportunities for career growth.",
        "advice": "To understand how Oracle's competitor does business.",
        "pros": "Oracle offers great flexibility at work.",
        "summary": "Oracle is a great company providing great work life balance.",
        "role": "Principal Member Technical Staff",
        "date": "Sep 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Low advancement opportunities - not very open to internal mobility. No internal community - you have to be independent. The company's culture does not include providing any career guidance to employees. Training is available but not actively pushed.",
        "advice": "Invest in your people. Put a premium on collaboration. That will translate to better customer relations.",
        "pros": "Great brand name. Company is growing fast.They pay a good salary. Benefits are standard although not very generous.Culture encourages telecommuting and flexibility in managing your own time. Oracle has a very focused business strategy. Results oriented.",
        "summary": "Results oriented but only work here if you are independent!",
        "role": "Senior Director",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle is a big company: management was out of touch and disconnected from the small guy.Growth is slow in some areas and opportunities to significantly influence the company aren't that many.Too much middle management, too much red tape.",
        "advice": "Reduce middle management, figure out a way to make all internal processes faster.",
        "pros": "Multinational successful company, powerful brand. A variety of technologies and products allowing you to learn a lot. Good compensation and salary package. In my department I was happy with the work / life balance. As everywhere that may vary depending on the exact team / department you're in though.",
        "summary": "Good place to start your career.",
        "role": "Software Engineer.",
        "date": "Sep 6, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Longer you work there the less your comp package is in line with your position. Too many duplicate positiions",
        "advice": "re-evaluate comp for people every 3 years, how about dividends on your stock?",
        "pros": "treats employee's with respect, great management, salary",
        "summary": "Oracle is a great place to work,",
        "role": "Director",
        "date": "Sep 7, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The cutting edge is sharp. Often leading the way on the technology has drawbacks, but in the long term, it can and has paid off.",
        "advice": "Listen to the employees more. They are the backbone and the closest with the customers. They can provide a better ear to what the customer needs. Also, the employees are who make the company, as much as the Senior Management.",
        "pros": "Oracle has changed over the last ten years. The management staff are willing to help anywhere possible. The opportunities for knowledge growth are everywhere. You definitely get out what you put into it.",
        "summary": "Oracle is one of the top places to work.",
        "role": "Principal Support Engineer",
        "date": "Sep 8, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There tend to be lots of processes which are not integrated with each other across organizations. Frequent reorganizations. Lots of overtime. There are very high demands for your time and the environment is very face-paced. This can cause a high degree of stress for those that are trying to keep more of a work-life balance.",
        "advice": "Communicate more regularly on yearly strategy and how employees can contribute to company success.",
        "pros": "There are lots of opportunities to become a manager and many ways to get involved with challenging work. Good place to work for those that are very independent. If you can prove your value and have a good level of professionalism, there is a good chance that you will be able to move into a management position.",
        "summary": "Challenging work in a challenging environment",
        "role": "Service Delivery Manager",
        "date": "Sep 8, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As with most large corporations, there is a little bit of bureaucracy. In terms of headcount, there is very little organic growth and that diminishes advancement opportunities as you move up the ladder. Work life balance can get skewed at times. Working for groups, which deal with mature product/features, will lead to stunted professional growth.",
        "advice": "Better communication of the corporate strategy. Reorganize to shake up the bureaucracy.",
        "pros": "An stint at Oracle, on your resume, makes getting future jobs easier. You work with some very bright people and that helps you greatly, especially if you are beginning a new career. It pays to work for an industry leader in the Enterprise Software space. Oracle has great benefits in addition to a competitive salary.",
        "summary": "Good for a big company",
        "role": "Consulting Software Engineer",
        "date": "Sep 12, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I asked for too little. seems they can pay more, but anyway, 10k is nothing compared to a good career.",
        "advice": "they are good. i definitely feel they are open minded, smart and eager to do better jobs",
        "pros": "it offers higher position compared to other competitor, such as big 4. I have just jointed, so I will have to make up for the rest. oracle is developing so fast compared to big 4, they are definitely getting a edge over others. the learning experience of oracle financial also sounds cool, for sap does not seem to be as promising as oracle financial in the long run. oracle seems to be more open minded and provides mor… e room for professional growth.",
        "summary": "oracle is a good company to work for",
        "role": "Senior Principal Consultant",
        "date": "Sep 15, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Consulting involves lots of travel and time away from family.",
        "advice": "Dont skimp on training for employees.",
        "pros": "Lot of technologies to play around with. Good people to work with.",
        "summary": "Nice to place to grow. Put in a few years and move on.",
        "role": "Principal Consultant",
        "date": "Sep 16, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- One should always join the current firefight - Oracle has plenty - if one needs management attention. Sound workers should have made the choice to stay on without being noticed or appreciated.- Technology focused, management sees no value of professional degrees, like MBAs, MS etc., once you start working at Oracle. Though most manager will support the partial time-off required to do part-time studies.- Ora… cle does not tap into excellent social networks its employees are exposed to. (this choice is partly due to stricter security standards)- There are plenty of re-orgs and it can get pretty turbulent in some groups due to various acquisitions in past and possibly in future. So, if one is joining now, stay adaptive and embrace the change. You may see multiple managers in coming years.",
        "advice": "- Value your 80% bottom workers, not just top 20%. They are keeping the bottom line cost under control and giving predictable output.- When you distribute award to most visible person who manages to fight off escalation, also give award to a person who keeps things under control.- Create more employee harmony and team events. Due to limited opportunity of growth, there is a lot of internal politics and back-b… iting among mid managers or among people who are management hopefuls.- Due to acquisition based innovation the drive to write white-papers, doing something cool, experimenting is going away. Bring it back. When we are done buying everybody possible, it will be time to find internal ability to innovate.",
        "pros": "- Software powerhouse, opportunity to work with various technologies- Stability, global diversification- Focus towards product and customers- Great sales team- Good employee benefits- Work-life balance (good company to raise family with)- Management is usually supportive of lateral transitions within the groups (e.g. from Manager to individual contributor and vice-versa)- Good gym- Has…  potential for growth",
        "summary": "Demonstrate, adapt, make right friends and be happy.",
        "role": "Software Development Manager",
        "date": "Sep 18, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "HR policies and practices are very dark and secretive...although benefits are solid, salary, bonuses and promotions are not handled properly leaving some disgruntled employees. Those that do not understand how to manage their own careers are often left in the dust as mentor programs are lacking. As with most large corporations, being outside of HQ makes it difficult to really climb the corporate ladder. Communication…  is sporadic with some real gaps as employees are often left in the dark on key initiatives decreasing morale and lack of respect for senior leadership. However, I would have little to complain about if the HR and compensation practices improved.",
        "advice": "Show you value employees through your actions.",
        "pros": "Oracle provides solid benefits. The work schedule is flexible but can be demanding as we work in a global community. They are also very good about allowing employees to work from home or remote locations which is at the top of my list of perks. We have the ability to work with cutting edge technologies and have the resources and economies of scale that come along with working for such a large corporation. There are s… o many career opportunities available at Oracle that your options are endless. Overall, Oracle provides a good working environment, flexible work schedules, and an exciting product and service offering that won't have you snoring.",
        "summary": "Good working environment, flexible work schedules, and an exciting product/service offering that won't have you snoring.",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "They beat the crap out of you. Extremely stressful. The travel is a killer and you cannot get of them. Favoritism and nepotism are rampant. Kissing up the right rear will take you places.",
        "advice": "Better life work balance and raises/promos should be made more equitable",
        "pros": "Challenging and access to all the software and insider tools.",
        "summary": "Great place to work if you can take it",
        "role": "Technical Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Big company. Great place to work... but if economy turns downward, employees suddenly feel like a number, and worry about layoffs, regardless of their previous contributions or longevity.",
        "advice": "Keep employee motivation toward the top of the priority list!",
        "pros": "Oracle is an exciting place to work. Things are constantly changing. Oracle is growing rapidly through acquisitions. This can sometimes be challenging. But it's also been very exciting as all these new employees are brought into the fold. For the most part, it's been an easy integration. And it's gratifying to hear from these people how much they like the Oracle culture and how impressed they are with the quality of … its employees.",
        "summary": "Big Company and Great Employer",
        "role": "Senior Manager",
        "date": "Sep 25, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not very innovative. It can be hard to change the direction of projects and many middleware projects seem doomed to fail or has very little potential for impact. Currently Oracle is hard to beat because it has many existing clients who are too lazy to switch to other products but eventually people will switch to superior products. You cannot simply fight SAP with aggressive salespeople. Too much acquisition can cause…  indigestion. There are many clients frustrated by the lack of integration between Oracle's products.",
        "advice": "Don't be too complacent.",
        "pros": "Established company with a lot of stability, good employee benefits. Oracle is a dominant player in its core areas despite threats from SAP and growing MySQL threat.",
        "summary": "Large, stable corporation not known for innovation",
        "role": "Software Engineer",
        "date": "Oct 2, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's not warm and fuzzy, it's competitive. It runs through cycles of collecting too many management layers looking for something to do (but cleans house by reorganizing annually to help shake them out). There is pressure to travel frequently and there are limited alternatives to excessive travel. It is often a place to learn Oracle technologies well, pay your dues, and depending on available assignments, just move on… .",
        "advice": "As far as I'm concerned, Oracle is on the right track.",
        "pros": "Oracle consistently pushes to keep consultants trained in the latest technology, and provides opportunities to exercise those technologies. Oracle allows consultants to take risks in order to succeed (or fail) based primarily on the individual's own performance. Oracle has no problem booting poor performers out the door. It keeps one pushing to stay on the edge. Benefits and salaries are better than average for the r… egion. A good long-term assignment can make Oracle employment very rewarding.",
        "summary": "Love it or leave it, it is what it is.",
        "role": "Principal Consultant",
        "date": "Oct 3, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company has a very high pressure work atmosphere. Hours can be quite heavy during crunch time for every level and every LOB. Oracle is constantly changing and improving. Many reorgs take place but if you could put with changes, you can learn a lot.",
        "advice": "Take care of your workers. It's not all about your promotion.Motivating by fear only works for short term.",
        "pros": "Fantastic and smart network with the employees that work at Oracle. Good work and reward culture.Sales driven environment. Oracle is a great company to include on any resume. Very Structured. Great Brand Name Recognization, Great Training Program, Very optimistic young atmosphere",
        "summary": "Oracle is a great company to work for.",
        "role": "Senior Account Manager",
        "date": "Oct 5, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Bureaucracy is rampant; decent level of redundancy across different departments leads to power battlesThere is a strong possibility of getting \"Oraclized\" - lack of ability to operate in high stress, 60-70 work week start-up environments",
        "advice": "Spend more time on defining group goals; establish clearly defined success criteria",
        "pros": "Career Opportunities are reasonable; ability to try out different BUs/countries before settling into the one you intend to grow",
        "summary": "Place to grow while maintaining work/life balance",
        "role": "Group Product Manager",
        "date": "Oct 6, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It's a BIG company and there is a good amount of process (documented and undocumented) as well as a fair amount of politics to navigate.",
        "advice": "Spend more time with customers in a meaningful way on a more regular basis.",
        "pros": "Financial stability and product leadership. The results are that in tough times like we're experiencing now, there is more opportunities and safety. For instance, the sales organization has built up a war chest that will prevent any RIF's for a substantial period of time. The products for the most part are leaders in their respective spaces and where there are gaps, the overall strategy to build out an entire integra… ted application and technology suite can trump the \"best of breed\" advantage.",
        "summary": "Oracle's a very steady ship to be on in some very turbulent economic times.",
        "role": "Applications Sales Manager",
        "date": "Oct 10, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Upper management is not employee focused enough. Average salary as compared to peers. Very Political.",
        "advice": "Listen to employees more. The ones at the client site know what they are talking about!",
        "pros": "The work life balance is extremely good at i-flex. Even though you get to work at top notch financial clients, the projects are manageable. You do get very close interaction with senior IT executives at the client site. These contacts are very useful if you ever plan to switch to the client.You will get very good opportunities to learn operations and processes followed in the financial industry.Good brand nam… e in the IT services field. Ths is specially true for the Flexcube product. Of course, now that it has been acquired by Oracle, the future remains to be seen.",
        "summary": "Great colleagues, average salary, below par management",
        "role": "Consultant",
        "date": "Oct 18, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The size of Oracle prohibits a close knit community. It often takes several weeks, or longer, for important decisions to be made. I work for a company that was acquired by Oracle and the communnication has been deficient. There has been very little implementation of strategy, mostly talk of how great things will be. So far the numbers have not backed up the talk.",
        "advice": "Oracle management needs to communicate strategy at a detailed level, not just a Sr. management level.",
        "pros": "In the currnet econmic environment Oracle is one of the few safe havens of stablility. Wth the acquistion of numerous companies the portfolio of applications and products is becoming even more balanced. This leads to a tremendous amount of career opportunity across products. Employees have access to excellent training and the latest software to gain industry knowledge.Oracle continues to support acquired applicat… ions (PeopleSoft, JDE, Siebel etc) while at the same time developing Fusion applications for the next generation of software.",
        "summary": "It's a great company if you take the initiative to forge your own path",
        "role": "Senior Consultant",
        "date": "Nov 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hard to feel fulfilled, feel like you are part of a giant machine. Not a great place for pure marketing career.",
        "advice": "Focus on growing your mid-senior managers into leadership positions",
        "pros": "Stable environment. Smart co-workers. Generally able to balance work & life. Good if you are in an engineering or sales or core product development role.",
        "summary": "Place to be if you are looking for stability",
        "role": "Director of Product Management",
        "date": "Nov 13, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "For me, the main downside of working at Oracle was the lack of cohesiveness within the company. I felt very disconnected from other parts of the company. I was in Development, but felt detached from other product teams that supported our product. I feel that management in general is good, but my department was very secretive. Communication was not the best.",
        "advice": "Communicate better and share information with everyone.",
        "pros": "The best things about working for Oracle was gaining experience from a major software giant and having that experience listed on my resume. Oracle on your resume is very impressive. I also feel that the pay was competitive and the benefits were the best around. Great medical insurance and if you work at HQ--a fantastic campus.",
        "summary": "Great for resume, not the best internal communication",
        "role": "Principal Product Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The communication systems need to be more reliable. It takes a long time to send/receive email. Also, working in a large organization can make you feel like just another number instead of an individual.",
        "advice": "The communication system needs to be more reliable. Its a work in progress that is not there yet.",
        "pros": "It is a tremendous opportunity to learn and grow. The firm really backs learning, and there a many opportunities to increase one's education and to grow as an individual. The projects are challenging, and provide opportunities to learn as well. You will be challenged to use what you know.",
        "summary": "Oracle - a great place to learn and to grow.",
        "role": "Staff Consultant",
        "date": "Nov 19, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle can be a really oppressive and depressing environment for sales people. Oracle has siloed sales teams and no team knows what any other team is doing. Consequently, customers are constantly complaining about the lack of internal communication at Oracle. It's not hard to find an irritated Oracle customer.Inside sales reps only have control of about 50% of their income. The rest of their income is dependent o… n their field reps to make up the rest of their income. You could be 150% of plan and could make less money than someone who was 50% of plan because their field sold a lot and yours didn't. This can make for some extremely disappointing paychecks.",
        "advice": "Make Oracle a less hostile environment for sales people and make it a funner place to work again.",
        "pros": "Oracle is a company where you can learn the ropes of selling to big companies. Oracle has a very rigorous sales process and has sales reps constantly working to better themselves so that they can sell more software. Oracle is a great place to learn the fast paced world of enterprise software.Oracle also has amazing benefits for both individuals and families. If you are looking for a place that has amazing benefit… s, this is the place.Also, if you're looking for a no travel sales job where you can make over $100K, this is a great place to work. Top inside sales reps can make upwards of $150K.",
        "summary": "Oracle, a great place to work as long as you're making them money.",
        "role": "Applications Sales Representative",
        "date": "Nov 25, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Requires self-motivation and self-direction to get things done.",
        "advice": "Continue growth, work to recognize top employees.",
        "pros": "Fast moving with opportunities to get involved in multiple different initiatives.",
        "summary": "Rewarding and Challenging Place to Work",
        "role": "Solution Specialist Manager",
        "date": "Nov 25, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Tough go up the ladder within the oraganization.",
        "advice": "Needs more pragmatic approach.",
        "pros": "Opportunity to work from home. Great training and work experience.",
        "summary": "Great Place to work and learn. Not the best place for salary.",
        "role": "Senior Consultant",
        "date": "Dec 4, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too large a companyToo much inertiaFocussed too much on the bottomlineVery sensitive to Wall StInsatiable urge to buy new companiesA confusing array of products available to offer to customerSort of glass ceiling for individual contributors seem to exist",
        "advice": "Recognize the fast movers before they move out",
        "pros": "Learning latest technologiesWorking with the best talentsIf you are working on Oracle technologies, this is the place to beLot to learn about working on and managing mega projectsLot of scope to learn about global business, impacts and system integrationEasy for everyone to recognize the company you work for - needs no introduction",
        "summary": "One that went away",
        "role": "Principal Consultant",
        "date": "Dec 10, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Large, slow-moving, some groups very political, career growth seems based more on who you know than completence.",
        "advice": "Stay focused on getting products out and not on politics or impractical goals.",
        "pros": "Good place to learn. Supportive of flexible time and telecommuting. Challenging technologies.",
        "summary": "Overall a good place for a working parent, but not a place where you get that fired up or passionate.",
        "role": "Anonymous Employee",
        "date": "Dec 11, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Top management are strong but plenty of examples of poor management lower down the levels. Very political - lot of empire building mentality. Easy to burn out. Salaries not always competitive and bonus payment not reliable",
        "advice": "Clean house! Make sure you have the right middle management/organization leaders to motivate and keep good people working there.",
        "pros": "Exciting place to work - compared to some large companies it is a fast paced work environment. Cool technology. Prestigous brand. Diverse set of products and opportunity to move around within company if you are good at what you do. Great campus and pretty decent overall benefits package",
        "summary": "Challenging place to work sometimes but a great ride regardless!",
        "role": "Senior Director Product Management and Marketing",
        "date": "Dec 19, 2008",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "suit and tie, top management takes care of themselves first. There seem to be a perception that you are only good if you have an MBA (particularly from the ivy leagues) and that MBAs can do anything, even if they have absolutely no aptitude, experience, or interest in the particular part of the job. E.g. QA, UI design, software design.",
        "advice": "look after your employees",
        "pros": "competitive, smart and very competitive bunch of people, on the whole people are easy to work with. Things got a little crazy at the last 12 months of it's existence, but otherwise management generally had good (if sometimes misguided) intentions.",
        "summary": "good bunch of people to work with",
        "role": "Director",
        "date": "Dec 24, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Facilities management team are the most incompetent I have ever seen. Thankfully you don't have to deal with them often.",
        "advice": "Product synchronization madness must stop. There's too many dependencies to synchronize all the products.",
        "pros": "Flexibility and the ability to work independently. Great pay and benefits.",
        "summary": "Good Company To Work For.",
        "role": "Senior Software Engineer",
        "date": "Dec 27, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Oracle is not the most progressive when it comes to salary increases - especially when promotions are involved. One Senior Executive is rumored to have said in response to a complaint from a direct report about not being compensated adequately, \"Your resume is your compensation!\"",
        "advice": "Allow Middle Managers to use raises and bonuses as incentives for performance. Work to improve internal networking capacity and reduce bureaucracy.",
        "pros": "I feel supported at Oracle and like I'm given encouragement (if not incentive) for innovation in my field. The culture of entreprenurialism and innovation can be exciting and it's always nice to be able to say I work for Oracle - people may not know what we do, but that makes a good conversation starter!",
        "summary": "Looking for an opportunity to innovate? Great! But don't expect raises or incentives, unless you are in Sales!",
        "role": "Director of Marketing",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pay raises and bonuses are not always often as I would like it.",
        "advice": "Please remember that the employees are the company's greatest asset. Encourage all the teams and different divisions to cooperate and work together.",
        "pros": "Lots of opportunities to learn and grow; internal training at Oracle is available and convienent.Medical, vision, and detail benefits are very good.",
        "summary": "Oracle provides lots of opportunity to learn and grow your professional skills.",
        "role": "QA Engineer",
        "date": "Dec 31, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The salary may not be as competitive as similar firms. If you do not have much experience you will not be paid your fair market value as inexperience is something you pay a price for (although I believe that is the same at most large companies). Lack of work life balance can be an issue however not if you manage it well. Middle management can be very slow and opaque in communicating big changes but again that is the … same at most companies of a certain size and to an extent is the function of middle management.",
        "advice": "Stay the course",
        "pros": "Oracle has very good reputation and is considered to be one of the best in the industry. All the colleagues are nice and friendly to work with. It provides good on-the-job training to employees.",
        "summary": "Good place to work",
        "role": "Consultant",
        "date": "Dec 31, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As a Oracle consultant, most projects are short terms (3-6 months max). You will be constantly changing projects which is very stressful sometimes. Company culture is different from most other companies. A very competitive place. In Oracle, you need to do more than your assigned projects. You were expected to help develop new business as well, which is a very important fact in your annual review and your promotion. N… ormally they like to give higher title to new hires to attract them. Once you join, it is very difficult to get promoted.",
        "advice": "A more transparent information sharing",
        "pros": "Oracle offered a very comprehensive benefit package and a good salary and bonus. A great place to learn new technology to improve yourself.",
        "summary": "Great place to work for but a different culture from most other companies.",
        "role": "Senior Principal Consultant",
        "date": "Dec 31, 2008",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Incredible pressure to perform NO MATTER WHAT. They are very intolerant of outside circumstances and current market conditions. The numbers have to be met no matter what happens. No excuse is tolerated and that is because the expectations flow upwards. Each manager has heavy expectations on them and each one of their managers has even more on their shoulders.Also, Oracle will reduce staff regularly and withou… t any fanfare in the market place. They will whack chunks of the org chart with no notice. Only producing salespeople are safe.",
        "advice": "Think past the current quarter. Always mortgaging the future for the present.",
        "pros": "Great product line and prestige. Also, the vast majority of Oracle employees are very intelligent and very talented. It was great to work with a group of smart people.",
        "summary": "Oracle: Bring your A game.",
        "role": "Business Development Manager",
        "date": "Jan 5, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Upper-most management is not in touch with everyday work issues of underlings. No MBWA (Management by walking around). I've never had a conversation with my upper management VPs or Execs and I've been there over 14 years. The company is large and projects that involve several hundred employees are typically not well managed. Products are sometimes sloppy and not well designed, product goes out to customers with too m… any bugs/defects.",
        "advice": "Get out of your office and talk to the developers who work on the code day to day, ask questions, learn about internal problems, get out of your ivory tower.",
        "pros": "Flexible work hours, telecommuting, technology leader, very understanding about work/life balance, able to offer time off for emergencies, flex time.",
        "summary": "Oracle is successful despite it's lack of management skills.",
        "role": "Senior Product Manager",
        "date": "Jan 5, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Working for a large company like Oracle, it's sometimes frustrating to be simply a small link is a very large machine. Bureaucracy makes it difficult if not impossible to bnreak out and try innovative approaches since there may be risk associated with these new things. There tends to be a mind set of, let's just tick the box and say we did it, instead of a culture of excellence where not only did we do something but … we did it very well. This acceptance of mediocrity is easy to hide in a large organization and stifles innovation and the ability to create gound breaking messaging.",
        "advice": "Senior management by and large is very supportive of the entire infa structure but is often focused on the long term stratgic planning and over arching goals for the company. While this visionary thinking is needed, it means that the level of day to day feedback is minimal and the only real commentary that is provided typically surrounds a situation where course correctio n is needed.",
        "pros": "Oracle is an industry leader and it has great name recognition so it easily opens doors.The management is very supporive of the Inside Sales function and that makes a better environment as a launchpoint for success. The benefits are very good which is a blessing in todday's environment. As part of the Utilities group marketing into a fairly recession proof sector, job stability seems to be pretty solid. Innovation ar… ound products and the creation of marketing collateral to support the sales efforts is quite high class and allows us to present ourselves as technology anf thought leaders. In all, a pretty good place to land.",
        "summary": "Oracle sets the Pace with Inside Sales",
        "role": "Director of Inside Sales",
        "date": "Jan 31, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Because of the size of the organization, it is easy for an employee to get lost and dehumanized. Even though continuing education is offered, it is almost impossible to get it approved. Salaries and wages are usually minimal to midline of what the current area market is, and once you have accepted a starting wage it increases a maximum of 3%, and often several years pass by with no raise (irregardless of performance.… ) Oracle only matches a small portion of the 401K and that match can exclusively be invested in Oracle stock, an exact quote from the benefits page, 50% of your first 6% in contributions, so Oracle is matching your first 6% at 3%, almost nothing.",
        "advice": "Stress teamwork and create an award system that encourages employee's efforts.",
        "pros": "Oracle is a global corporation offering some employment stability in a dark economic climate. The benefits package is good and offers reasonable options. Oracle encourages team oriented activity and growth. Continuing education is offered and encouraged.",
        "summary": "Oracle, Neither Good Nor Bad",
        "role": "Administrative Assistant II",
        "date": "Feb 10, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I would not recommend it as a place for a first job though. The training and people development is not as good as I have seen it. I used to be a consultant working for the big 5 and at those companies the training is top notch. I'm lucky that I got that training and development before I came to Oracle.",
        "advice": "Senior Management should place more emphasis on the yearly evaluation process and ensure it is a fair process of evaluating employees. Also the raises and bonuses need to be bigger or they need to be more fairly allocated to the people who deserve it.",
        "pros": "Oracle is a great place to settle down in. In general at least in my job, there is a lot of flexibility in the work schedule. This is mainly due to the fact that it is an international business and many of my colleagues are overseas. It doesn't make sense to work 9-5 when you have either early morning calls or late night calls with overseas or people on the other coast.",
        "summary": "Offers opportunity for a work life balance, but don't expect much influence on salary",
        "role": "Senior Manager Product Strategy",
        "date": "Feb 12, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There is an unhealthy influence from management to do whatever is neccesary to \"get the job done\" which prevents a clear distinction between work and personal time. This wouldn't be such a problem if they were more flexible with salespeople working from home. The pressure on the sales staff is average most of the time, however, pressure increases exponentially during the end of fiscal quarters or due to turn-over rel… ated issues.",
        "advice": "My main advice to management at Oracle would be to coordinate communications better so that employees are not bombarded constantly with emails, conference calls, and ad hoc meetings to discuss the same issue or topic which wastes way too much time in today's economy. It would also be helpful if senior management would fully outline the expected hallmarks for career advancement and then stick to them....",
        "pros": "There are plenty of oppritunities to make money at Oracle and those who are sucessful are well rewarded. There are great benefits like in-office gym, frequent catered meals, and extensive training, all free of charge.",
        "summary": "You're only as good as your last fiscal quarter",
        "role": "Account Manager",
        "date": "Feb 12, 2009",
        "is_current": true
    }
]