[
    {
        "rating": 4,
        "cons": "CCA's aren't their strong point. Its critical to my job and to our customers.I have been a one-man show before using Allegro. But, now I have to sit next to someone who can draw cartoons on silkscreen but can't be left alone to move copper without me. I don't have time to do it myself (fight the Mentor DALMS and Boardstation software) and have my Labview code working before the assembled board comes back.… I have spent decades in cubicle farms. Got along pretty well with my neighbors. Still, I was looking forward to having an office with a door on it.Stupid me. Big fat waste O money on Qualcomm's part.Prepare to work odd hours so you can avoid having your spirit crushed by H1Bs sharing their voicemail and number dialing activity with everyone inside a 20 ft radius.No department is immune from this practice, apparently.",
        "advice": "It never ceases to amaze me what I am eventually able to produce. Not even in my wildest dreams.But, it saddens me to realize how much extra time I had to commit from my life to make this happen becase I didn't have the best tools and the best support possible.",
        "pros": "Private offices are available for staff and higher positions, sometimes even with a window and a view. Excellent health benefits including an on-site clinic for San Diego employees. They certainly try to give you private offices based on your title. Unfortunately, it encourages people to rise to the occasion and still distract their neighbors. They give you free sodas.Their IT department is a strong asset and…  their top place to work ranking is largely well deserved.",
        "summary": "Can't think of a better place for silicon engineers and mask layout.",
        "role": "Eng",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Schedules are very aggressive and rarely met, which makes you feel dissatisfied with your job performance.",
        "advice": "Aggressive schedules are okay, but only if projects are well planned. Often, projects with aggressive schedules are started with only high level planning. Once the objectives are communicated down to those who will be working on the project, they rarely have time to complete it with a sufficient level of satisfaction. Aggressiveness without proper planning leads to redundancy and inefficiency.",
        "pros": "Good benefits and satisfactory compensation.",
        "summary": "Qualcomm Review",
        "role": "Senior Engineer",
        "date": "Mar 18, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company, can feel lost sometimes as an intern. I worked in two different groups. I hated the first one but really liked the second one. Your experience depends a LOT on your group (and therefore your manager too). I did not learn much in my first group but learned a lot in my second group in a shorter period of time.",
        "advice": "Really depends... first manager did not care about me. Second manager was awesome.",
        "pros": "The company offers good benefits, and a good compensation. The people are nice and the working atmosphere is pleasant. Qualcomm likes to emphasize on balancing work life and hobbies. There are nice events organized for employees. I think it is a great place to work for when you have a family. Your working hours are also very flexible.",
        "summary": "Qualcomm is an overall good company to work for, just make sure you end up in the right group...",
        "role": "Intern",
        "date": "Mar 25, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There's a cultural tendency towards empire building and slow responsiveness in dealing with nonperforming products and personnel. Seems stricken and hobbled sometimes by competing/conflicting business interests internally. Mediocrity seems tolerated in some areas because of the cash pouring in from licensing royalties. Over-bureaucratized an over-lawyered to a degree that is reflected in the products sometimes.",
        "advice": "Consider 20% time like Google has--you have a lot of smart people who would make good use of it. Try spinning off new ventures at a pace that matches your acquisitions.",
        "pros": "The benefits are very good, and reviews are 360 and regular as clockwork, with raises and bonus usually following. Non-cubicle environments for the most part. Nice facilities and amenities. Wicked smart people in core areas. Truly global in makeup and perspective. Technological leadership and market gorilla status. Relatively flat hierarchy and accessible management.",
        "summary": "Heading into a new corporate life-phase",
        "role": "Engineer",
        "date": "Mar 30, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Politics, low salary, lack of process, fairness",
        "advice": "Improve your recruiting process and less politics.",
        "pros": "Opportunities, technology, travel, learning, people",
        "summary": "leading technology",
        "role": "Director",
        "date": "Apr 8, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Large company politics, lack of problem ownership, lack of cooperation between certain teams, too much middle management (large email output; small productivity), lack of accountability",
        "advice": "Reduce middle management, increase accountability. Use accountability to get work done, not having to escalate to management to get issues resolved.",
        "pros": "Great products, great technology, forward looking roadmap",
        "summary": "Good technology, could use improvement of how people work",
        "role": "Senior Engineer",
        "date": "Apr 22, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As a Temporary employee who has many years of experience I feel that I am not given the level of responsibility to continue my growth. I have been placed at a very low level and many other Engineers are set in there ways and do not want to accomadate change.",
        "advice": "To listen more to there employees and accept change.",
        "pros": "Since my current employment conditions are Temporary I can only say that I know that the benefits are great, but I have not yet seen them.",
        "summary": "Qualcomm as a temp...?",
        "role": "Senior Technical Support Engineer",
        "date": "Apr 27, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "High work and schedule pressureLack of process",
        "advice": "Must enforce process both in engineering and decision making",
        "pros": "Technically very interesting workOpportunities to learn new things",
        "summary": "Qualcomm a great place to work if you can work very hard",
        "role": "Senior Staff Engineer/Manager",
        "date": "May 10, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Qualcomm pushes its employees to meet deadlines and sometimes that means burning the midnight oil to get things done.",
        "advice": "Allow the engineers time to come up with the best solution to a problem, instead of the quickest solution.",
        "pros": "Working at Qualcomm means working on leading edge cellular technologies. The company is located in San Diego, CA which is beautiful. Most of the large buildings have a gym and work out equipment for their employees. Employees are also encouraged to work from home if it better suits their schedule.",
        "summary": "Work on leading edge cellular technology.",
        "role": "Engineering",
        "date": "May 27, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not enough resource. have to work overtime.",
        "advice": "n/a",
        "pros": "good medical benefit. Company pay the premium.",
        "summary": "Qualcomm, good place to work",
        "role": "Senior Engineer",
        "date": "May 27, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Large corporation w/ typical politics/bureaucracy- Some buildings/teams not central and spread across San Diego- Rankings/performance reviews based on upper management deliberation and not end-to-end impact- Reductions in force can go unreported in the media if handled in small numbers...they still happen even though you don't hear that the company is laying off",
        "advice": "Make performance review process consistent across the divisions/company. Continue to reward employees for hard work and extra hours.",
        "pros": "- Great work/life balance- Free drinks at vending machines- Unlimited sick days- Paid medical benefits- Great annual parties/celebrations- Individual offices for most positions- Potential bonus every 6 months",
        "summary": "Qualcomm: A nice place for engineering professionals",
        "role": "Senior Program Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As a large company, sometimes, you feel the career ladder is really long. Promotion is based on the performance but sometimes quick promotion is restricted by the corporate policy. The compensation package is not very competitive in the industry.",
        "advice": "Shrink the chipset quantities and put strong support to expedite the key projects. Snapdragon platform is a good idea but the vendor support is too slow.",
        "pros": "qualcomm CDMA is a market and technology leader. It provides the whole system level solution to the customer. It is a good place to learn the cell phone system knowledge. Knowledge sharing between groups are encouraged.",
        "summary": "good company to start the career with",
        "role": "Senior Engineer",
        "date": "Jun 27, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The hours. The unequal balance of work load and hours required to get the work done. The rewards are generous, but it's a fine line.",
        "advice": "The most detrimental thing that can happen to a group of innovators is micromanagement. Relax the leash and demand higher responsibility from your employees.",
        "pros": "The benefits and performance reviews/rewards are fair. Most colleagues are competent which fosters a culture of wanting to solve problems and do things right.",
        "summary": "Qualcomm career",
        "role": "Anonymous Employee",
        "date": "Jul 1, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The environment is not the same as a Startup company.Takes a long time to get grow up the ladder.",
        "advice": "More effective interactions with the Engineers and Management.",
        "pros": "Stable work environment with cutting-edge technology and great products.Short teams make for a better team work and more efficiency.",
        "summary": "Good place to work. Takes a while to grow within the company.",
        "role": "Software Engineer",
        "date": "Jul 8, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can't say there are whole lot of downsides for working at Qualcomm, but the environment is not typical of a startup company.",
        "advice": "Although Qualcomm's Management is pretty solid, one area of improvement is to have more interaction between the Engineering/Development teams and Marketing teams.",
        "pros": "Good ratio between Manager and Employees.You will be working on latest cutting-edge technologies.Compensation and health benefits are top of the line.",
        "summary": "Good company to work, but takes a while to grow up the ladder.",
        "role": "Software Engineer",
        "date": "Jul 8, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "For engineers, it can be difficult to expand to non-engineering areas, since this is discouraged. Also, Qualcomm will no longer be as dominant in the future as it was with CDMA, but it's diversifying its portfolio.",
        "advice": "Keep up the great vision and benefits. Would be great to give the engineers a break from the crazy pace.",
        "pros": "Great benefits, smart people, industry leader, well-run company. This is a great place if you want to be in an established, efficiently-run company.",
        "summary": "Great company to work for; but limits on personal growth opportunities",
        "role": "Senior Engineer (Hardware)",
        "date": "Jul 20, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-There can be a lot of bureaucracy for a company that prides itself on its start-up roots-Decisions tend to be made slowly and in consensus (instead of mid-level management showing leadership)-For those outside of engineering, there are few others within your job function at the company",
        "advice": "I think executive level management does a good job of communicating strategy and direction for the company, but divisional level management seems to be hit or miss in doing the same. Often what is preached is not practiced.",
        "pros": "-Benefits are above average-Qualcomm is an industry leader in a growing industry-Flexability in work hours-A lot of intelligent collegues",
        "summary": "Good benefits and work culture. Can be bureaucratic at times...",
        "role": "Marketing Manager",
        "date": "Aug 3, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Same as pros. Large work hours. Need to work through bureaucracy to get anywhere",
        "advice": "Great job.. Have to be proactive in figuring customer needs. Very reactive management",
        "pros": "Asking right questions almost always leads you to a good door of opportunity. Using the opportunity and exploring requires a lot of time and home work. Nothing is given in platter though opportunities exists. Have to work really hard to do day to day job and then think about future..",
        "summary": "Technical haven.. End to end visibility for the interested",
        "role": "Anonymous Employee",
        "date": "Sep 1, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As with all companies, there are too many bosses trying to protect their fiefdoms",
        "advice": "none",
        "pros": "Great benefits, interesting work and people",
        "summary": "QCOM Review",
        "role": "Anonymous Employee",
        "date": "Sep 18, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Workload is high.Management should hire more people.",
        "advice": "Reduce workload,hire more people",
        "pros": "Excellent growth opportunitiesGet to work on cutting edge technologyRelatively transparent organisationGreat benefits...as in perquisites.Free dinner,free breakfast on some days and lots of free goodiesFlexible working hours",
        "summary": "Great place to work...Good Benefits",
        "role": "Anonymous Employee",
        "date": "Sep 20, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Cafeteria food is not of a great quality, sadly. The unlimited supply of soda will hurt the health of employees.",
        "advice": "Is FloTV a good business decision?",
        "pros": "It is fair to say that the interns are high class citizens. Regular employees are jealous about the intern activities. San Diego is a nice city.Decent and spacious parking lots.HR cares interns. It's true.",
        "summary": "It is a great place for internship",
        "role": "Interim Engineering Intern",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "* As with most large companies -- limited opportunities for growth",
        "advice": "--",
        "pros": "* Very smart people* Market leader -- get to work on cutting edge technologies",
        "summary": "Good place for a fresh Grad",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very very long work hoursExpect to take work homeHave thick skin because some are highly criticalPay is a bit lower than other companies but benefits compensateVery engineer-centric -- others are expendable",
        "advice": "Promote from withinFocus on the business as much as the engineering. Sometimes the company is too tunneled on technology and not bigger picture future views",
        "pros": "Benefits among the best I have seen and there are ample opportunities for training (technical and management). Employees are bright and generally motivated to help the company win.",
        "summary": "Great benefits, but you work hard",
        "role": "Anonymous Employee",
        "date": "Oct 8, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "politics, some bad HR policies",
        "advice": "They must recognize talent and give them recognition based on performance no matter what the backround or time duration on the title. .",
        "pros": "benefits, overtime pay, flex hours",
        "summary": "EM, RF, Digital design support",
        "role": "Senior Support Engineer",
        "date": "Oct 26, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you want to move up in the company, you will definitely work around the clock.",
        "advice": "Management should provide regular performane feedbacks to his/her reporting chain.",
        "pros": "The products and work culture allows the employee to be prideful of working for the company. The long hours are compensated by exciting company events.",
        "summary": "Great.",
        "role": "Anonymous Employee",
        "date": "Oct 31, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "1. Not too many other companies in San Diego",
        "advice": "1. Great job in keeping everybody informed about the other divisions and projects",
        "pros": "1. Helps in overall career growth2. Lots of learning opportunities3. Easy to move between groups to explore other opportunities",
        "summary": "Great company to work for",
        "role": "Anonymous Employee",
        "date": "Nov 6, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Overly concerned with what other companies may or may not be doing and determining what to purse based on the analysis.",
        "advice": "Good job.",
        "pros": "Qualcomm is an excellent company to work for. It provides opportunities to work on, develop, and propose innovate technologies, but also allows employees to maintain a balanced social/family life.",
        "summary": "Qualcomm Software Engineer",
        "role": "Software Engineer",
        "date": "Nov 6, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Salary compared to higher cost of living in San Diego.Little growth opportunity.Favorism by management.New hires can expect very Long working hours.",
        "advice": "None.",
        "pros": "Very stable company.A lot of learning opportunities.Great co workers.Up front working on cutting edge technology.Opportunities to travel.",
        "summary": "Good place to Start your career.",
        "role": "Staff Engineer",
        "date": "Dec 3, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The major products of Qualcomm are cellphone chips. They seem to put more emphasis on hardware and systems than software. As a software developer you are probably not going to receive as much attention as system designer. Also the company is pretty large with so many talented employees. It's maybe pretty difficult to climb up the ladder in such an organization.",
        "advice": "Put more emphasize on software developers and code quality. Software quality is key to product success and reusable software components can significantly shorten time to market.",
        "pros": "As Qualcomm is a strong technical leader in the industry, you surely can learn a lot by working here. In general Qualcomm employees are very technical and confident. They are also easily accessible and are willing to discuss technical problems with their colleagues. Location-wise San Diego is definitely a great place to live. It was an enjoyable experience as an intern at Qualcomm.",
        "summary": "A technical leader in the industry with abundant resources for learning and talented skillful employees.",
        "role": "Anonymous Employee",
        "date": "Dec 8, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Leadership needs to be more mature in some areas",
        "advice": "Thanks for making this a great place to work",
        "pros": "Working with smart peopleResources are plentifulIt is an employee centric company",
        "summary": "Qualcomm is a great place to work",
        "role": "Anonymous Employee",
        "date": "Jan 13, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Depends on departmentWorkload sometimes heavy",
        "advice": "None",
        "pros": "BenefitsCompanyStabilityLocationHave your own office",
        "summary": "Great benefits",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "slow response to competitors such as mediatek",
        "advice": "none",
        "pros": "stable, good health care package",
        "summary": "good company",
        "role": "Staff Engineer",
        "date": "Jan 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "bonuses are erratic. Stock options are not worth much nowadays. So unless the company gives RSU's the compensation package is not very attractive.attrition rate is very low so there is a glut of managers who dont have enough work to do. this is leading to a politically charged environment",
        "advice": "it is hard to believe that the only person capable of running the company after the founder retired is the founder's son. no matter which way you cut it this reeks of nepotism. the company should have been able to retain Sanjay Jha who was leading QCT. the general impression in the company is that after he got kicked out the company isn't doing as well as it should have been",
        "pros": "Some divisions are better than others. QCT is a good place to work because it generate consistent cash for the company. QIS, MediaFlo and other divisions are not as good because the respective businesses are not doing well.Excellent healthcare plan.Good vacation package.For most part you can expect a stable work environment and surrounded by generally high quality people..Consistent pa… y raises",
        "summary": "Great place to work for entry level engineers but lot a glut in middle management",
        "role": "Senior Staff Engineer/Manager",
        "date": "Feb 1, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "salary is a little bit below average. and working hours is longer than average. rest of things are average.",
        "advice": "no",
        "pros": "they provide all kind of job opportunities, software , firmware, hardware, OS , IT ... you can always find a position you like in this company.",
        "summary": "a lot opportunities here",
        "role": "Anonymous Employee",
        "date": "Feb 3, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pay is low compared to Financial Services or other alternative industries.",
        "advice": "BA's need a more defined, more attractive career path.",
        "pros": "The people make Qualcomm and the benefits.",
        "summary": "Smart People, Good perks",
        "role": "Business Process Analyst",
        "date": "Feb 15, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Compensation could be better- Somtimes work can get stressful and tiring- Unequal distribution of work among different groups",
        "advice": "QC is good at hiring high quality employees but not so good at retaining them. They should reconsider their compensation and promotions to retain high quality employees.",
        "pros": "- Decent benefits package and stock options- Innovative and Challenging work- Flexible timings- Work life balance-",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": "Feb 22, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Working in labs running monotonous tests may not be very interesting.",
        "advice": "Smart people are there in the management.",
        "pros": "Nice Work Environment. Nice People.",
        "summary": "Qualcomm is a good company to work for.",
        "role": "Interim Engineering Intern",
        "date": "Mar 12, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "overloaded, too much work at times.",
        "advice": "complacent",
        "pros": "fun to work here. smart people",
        "summary": "Staff Software Engineer",
        "role": "Staff Software Engineer",
        "date": "Mar 15, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Promotions are slow to occur.",
        "advice": "Reward high performers.",
        "pros": "Qualcomm has good benefits including dental, medical, vision, retirement benefits, and good vacation policy. The environment is generally friendly and challenging.",
        "summary": "qc",
        "role": "Anonymous Employee",
        "date": "Mar 26, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "-Career growth (promotion rate) in the company is slow and hence bit frustrating-Salaries lesser than other companies, eventhough workload is quite heavy- Not very good rewards.Rewards such as Stock options are not very attractive.. cash rewards are less i.e. Less bonuses or Merit raises.-Communication between manager & engineer",
        "advice": "-Better compensation-Faster promotions-Work-life balance.",
        "pros": "Flexible work timings.Good place to work for Electrical engineer especially for telecommunication and wireless technologies which you get to learnReputed company in the marketHealth insurance benefits are good.",
        "summary": "Electricl engineer in Qcom",
        "role": "Electrical Engineer",
        "date": "Apr 7, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "1) redundant process makes working less efficient2) old PCs and slow tools make work less fun - sometimes feel wasting my life",
        "advice": "1) can be more aggressive on management and marketing2) improve product quality without reducing work efficiency3) need breakthrough ideas",
        "pros": "1) well established company. very stable2) well balanced between work and life3) good working environment4) good benefits",
        "summary": "This is a big company",
        "role": "Senior Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of work, difficult to get promoted. Promotion depends mostly on whether your boss likes you or not. More lateral crosschecking would be good",
        "advice": "A more meritocratic system would be nice. Feels like a lot of talent aren't being fully utilized in their current roles doing mundane tasks. Leadership should foster promotional opportunities for people that are capable. Still great place to work.",
        "pros": "Great place to work. Depends on the team but great people to work with. Lots of lateral opportunities and good pay and benefits.",
        "summary": "Good place to work long term",
        "role": "Interim Engineering",
        "date": "Apr 19, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "A good amount of time is wasted in meetings.",
        "advice": "None.",
        "pros": "Cutting edge work.Opportunities to work on new and emerging technologies.Opportunities to Innovate.Client and Server Development opportunities.Free bottled water.",
        "summary": "All in a days work at Qualcomm.",
        "role": "Anonymous Employee",
        "date": "Apr 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The success in the past and established business relation with current partners may limit people's desire to push for new business model and areas.",
        "advice": "To be truly forward-looking, management has to understand market and technology, be able to set vision on new products with persistence, but also be able to acknowledge strategic errors and correct the course when convincing proofs are shown.",
        "pros": "Qualcomm is a very competent technology company in the wireless communication world and a top cell phone chip manufacturer in the world. Like many large technology companies, the company is investing heavily into R&D and trying to find a way forward for new growth areas, while still maintaining the leader position in its strength area.",
        "summary": "very competent company, finding a way forward",
        "role": "Engineer",
        "date": "Apr 27, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "HR tends to take advantage of people and start the asking price low.",
        "advice": "Talk more with people.",
        "pros": "Great Work Environment, Casual Atmosphere. Lots to Learn.",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Apr 28, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Promotions are difficult and salaries are 10-15% below market rate.",
        "advice": "Management is not doing well and so stock price.",
        "pros": "Good company with stable job.",
        "summary": "Good company",
        "role": "Hardware Engineer",
        "date": "May 10, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Hard to get personal and individual treatment.",
        "advice": "Offer up incentives",
        "pros": "great facilities, cafeteria and gym are nice",
        "summary": "IT Support Analyst, Associate",
        "role": "IT Support Analyst, Associate",
        "date": "May 12, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The expected work output for individual contributors ranges somewhere between strenuous and slave labor (poor work-life balance in some groups), occasional disruptive politics in middle management, work can often be unevenly distributed.",
        "advice": "Take a close hard look at the output of Director and VP level management. Make sure that their productivity merits the opportunity cost of otherwise hiring more rank and file employees.",
        "pros": "Technology at Qualcomm is definitely leading edge and always interesting, compensation is fair, intelligence and competence of colleagues is higher than in similar companies, chance to work with top companies in mobile industry, good company perks",
        "summary": "Well worth the hassle IF you love the technology",
        "role": "Product Manager",
        "date": "May 15, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Alot of work and projects often with tight deadlines",
        "advice": "give employees the resources to do the job",
        "pros": "Health benefit for familyFlexible hoursOnsite Gyms and Sports CourtsInteresting projectsClever peopleGood trainingOnsite medical center",
        "summary": "Great place to work if you like to be busy",
        "role": "Anonymous Employee",
        "date": "May 20, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Controlled chaos. Efforts can be duplicated.",
        "advice": "Interfaces between technologies should be better thought out.",
        "pros": "Change the world one line of code at a time. Great benefits and respect for expertise.",
        "summary": "Qualcomm is a place overflowing with expertise - surf the wave of controlled chaos",
        "role": "Staff Engineer/Manager",
        "date": "May 29, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "a lot of people bus to work so providing a bus pass would be great.",
        "advice": "allow more time for individual contributors to collaborate.",
        "pros": "Decent compensation, good atmosphere at Seattle office, wonderful location",
        "summary": "Reasonable place to work",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "tight schedule and tough work-life balance",
        "advice": "Mgmt is quite good as compared to other companies",
        "pros": "good work and great benefits.",
        "summary": "review",
        "role": "Senior Hardware Engineer",
        "date": "Jun 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited resources.Location.Distribution of some key engineering resources.",
        "advice": "Emphasis on strategic growth.",
        "pros": "Quality co-worker performance and knowledge.",
        "summary": "Statisfaction.",
        "role": "Senior Product Manager",
        "date": "Jun 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "work-life imbalance. More work load",
        "advice": "Good mangement. Need to balance work life.",
        "pros": "Good work. Motivate group members",
        "summary": "Review",
        "role": "Senior Hardware Engineer",
        "date": "Jun 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Some politics because of variety of acquired companies",
        "advice": "- No advices, the company is well managed",
        "pros": "- Great facilities- Great Benefits- Good work/personal balance",
        "summary": "Qualcomm Review",
        "role": "Verification Engineer",
        "date": "Jun 26, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "big company environment, grueling hours, lack of variety",
        "advice": "add more variety",
        "pros": "Team Environment, Pay, benefits, big company name, experience",
        "summary": "Entry Level Financial Analyst Position",
        "role": "Financial Analyst",
        "date": "Jul 26, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "not the best salary in the industry. Too much politics to benefit friends and not exactly competent people.",
        "advice": "Do less politics. Listen to customers and sales instead of leave engineering taking the decisions and develop what they want but not what the customers want. Focus is core business not in the service business since Qualcomm doesn't have competence to act in this segment supporting below average management in these divisions and keep loosing money.",
        "pros": "Benefits but not stocks. Still a solid company with lots of money in the bank to survive for the next crisis.",
        "summary": "Still a good place to work",
        "role": "Anonymous Employee",
        "date": "Jul 29, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of regular communication between management and employees regarding changes in priorities and strategy (specifically within a division or business unit).",
        "advice": "Require quarterly or monthly all hands within each division so that all employees understand the current progress on business objectives and next steps.",
        "pros": "Excellent infrastructure (IT helpdesk, Intranet, Wifi, etc.).Excellent benefits (fully paid healthcare, fitness centers, cafeteria, office for most employees).Very good executive management.Strong focus on technology innovation.",
        "summary": "Very solid company with great benefits",
        "role": "Anonymous Employee",
        "date": "Aug 7, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Depending on the team, you can feel isolated",
        "advice": "N/A",
        "pros": "-Interesting work-Mentor is willing to help you out-Opportunity to learn",
        "summary": "Some thoughts as an intern....",
        "role": "Software Engineer Intern",
        "date": "Aug 11, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "for a person who sees the bigger picture - working in Qualcomm might seem very limiting as the scope of your work is very narrow.",
        "advice": "Please work harder in providing the employees a safer and more secure place. Most employees are running a marathon to reach the impossible and aggressive deadlines set here and this makes it impossible for anyone to indulge in the comfort of being creative.",
        "pros": "technically challenging and will help you to gain very good knowledge about communication systems. Gives you a very clear understanding of how different companies involved in mobile space get their stuff integrated into the end product.",
        "summary": "An insider review",
        "role": "Engineer",
        "date": "Aug 11, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Since it is a large company, one's experience may vary across divisions. I'm working in a division that creates software to support chipset sales. Overall I feel that upper management doesn't invest as many resources as it should to produce world class software. And since there is a low turnover rate, it feels like some people are too comfortable with their jobs, so the passion may not be there.",
        "advice": "More attention and resources should be paid to software products that aid in chipset sales. Something also needs to be done to attract more innovative, passionate people.",
        "pros": "Qualcomm is one of the best employers to work for in San Diego. The compensation and benefits are great. Since mobile is a hot area right now, it's an interesting company to work.",
        "summary": "Stable Company, High Employee Retention",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company has become top heavy. Too many Directors and above. Decision making authority resides only in higher management levels. Relentless focus on execution at QCT, know folks who routinely work 12+ hour days.",
        "advice": "Management decisiveness needed. Need to put more resources in QCT which is the cash cow and cut poorly performing BUs and ventures. Company has become too top heavy and current hierarchal structure needs to be revisited. Poor stock performance is also a big de motivator.",
        "pros": "Stable company with strong balance sheet. Benefits are very good with 2 tiers based on your position. Lots on push on innovation by getting into adjacent markets but not yet materialized into revenue streams. QCT and Licensing division are the crown jewels bringing in 90% + of the revenue and profits.",
        "summary": "Stable company with good benefits",
        "role": "Anonymous Employee",
        "date": "Sep 5, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Might feel lost within such a large company. On-campus food options are not very good. Ability to move up within company is unclear.",
        "advice": "Great job with executive speaker series for interns. Gave a good look into the future of the company. Good luck.",
        "pros": "Great experience working on a small team of motivated engineers. Was able to make a meaningful contribution even as a summer intern.",
        "summary": "Summer Intern Review",
        "role": "Interim Engineering Intern",
        "date": "Sep 8, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "engineering centric company, highly focused on churning out products",
        "advice": "continue to innovate, inspire",
        "pros": "great benefits package, mobile computing is hot",
        "summary": "good place to work",
        "role": "Software Engineer",
        "date": "Sep 9, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "average salaryweak managementOK food at cafeteria",
        "advice": "increase the pay and do whatever if required to do that",
        "pros": "Can take time off whenever neededvery stable job ... no lay off fear",
        "summary": "Nice work culture",
        "role": "Software Engineer",
        "date": "Sep 23, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long working hours.cafeteria food is not so good.food services can be improved.",
        "advice": "you guys are great",
        "pros": "Nice office.Nice technology.Good compensation.Good location.Nice gym.Free soda, cofee, etc.friendly people.Smart co-workers.overall very good company.",
        "summary": "qualcomm",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Difficult to get full time",
        "advice": "Please hire more ppl",
        "pros": "Good work environment.Good location ( San Diego)",
        "summary": "Qualcomm Review",
        "role": "Anonymous Employee",
        "date": "Oct 8, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Politics, Politics, PoliticsYou have to reaserch and be very proactive about your trainingYou have to fight hard just to get the compensation you deserve",
        "advice": "Communicate and be clearBuild up your team skillsetBe clear about team responsibilitiesBe more transparent about performance reviews",
        "pros": "Good compensation packageGood work vs personal life balance (at least in the BU I work)You make your own future because you have the flexibility to be creative and build your own body of responsibilitiesCompetitive environment (Good and bad)",
        "summary": "Qualcomm is a good place to work but you have to fight hard to get what you deserve",
        "role": "Product Forecast Analyst",
        "date": "Oct 22, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You have to be very aggressive to stay afloat.",
        "advice": "Hm!!",
        "pros": "Its a big company giving flexibility to shift between opportunities.You make your own career.",
        "summary": "Opportunities",
        "role": "Staff Engineer",
        "date": "Oct 23, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work life balance is not very satisfactory. Sometimes feel a little bit boring in the office. Total compensation is ok, but grow slowly",
        "advice": "overall, the management is good. They care about people, care about your development. They also made right decision in difficult times",
        "pros": "Overall, a good company to work for. work with some bright and talented people. learn a lot from peers and supervisors",
        "summary": "good",
        "role": "Engineer",
        "date": "Oct 24, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very incestuous - best way to get promoted is to be an FOP (friend of Paul, the CEO). Tyranny in the senior HR dept.",
        "advice": "Don't be so overconfident that products invented in the past will carry you forever. Listen to some new voices on the team.",
        "pros": "big investments in people especially in benefits (fully paid healthcare), wants to win awards so are concerned about employee feedback, lots of cool technology and fun co-workers",
        "summary": "Great benefits and special treatment if you are friends with the CEO",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Don't treat their employees very well. The senior mangement consists of idiots who think no end of themselves.",
        "advice": "Management is horrible. They need to replace most of the upper management if they want their company to have a good reputation.",
        "pros": "Good Salary, lots of chances to move upwards",
        "summary": "Kick Ass Company to work for and they pay well",
        "role": "Anonymous Employee",
        "date": "Dec 9, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "average compensation. Qualcomm is is considered and compared with big company like Apple, Google, however when it comes to compensation, it is not comparable. It is rather compare to national average.",
        "advice": null,
        "pros": "Friendly and dynamic environment, working with talented engineers.",
        "summary": "Short vision, major concentration on main business QCT, others are suffering shadow sindrome.",
        "role": "Anonymous Employee",
        "date": "Dec 21, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The work can sometimes get quiet slow and boring, but you just need to keep looking for more interesting work that is around.",
        "advice": "They should allow some type of choice program so that new hires can choose which department they can go into.",
        "pros": "There are really good benefits and a lot of great people to work with. The teams are usually very diverse and there are always good oportunities around.",
        "summary": "It allowed me to get a feel for software engineering in qualcomm.",
        "role": "Software Engineer Intern",
        "date": "Jan 12, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not good at the work-life balance; this doesn't mean that the management are not good. In fact, the management is very considerate. It is just that the schedule is tight.",
        "advice": "Maybe encourage more on the work-life balance; Overall this company is a great company with great potential. I believe it will do very very well.",
        "pros": "benefit is reasonable; salary is OK ; management is good; technical strength; potential is huge; A very good company to stay",
        "summary": "Good company with potential",
        "role": "Anonymous Employee",
        "date": "Jan 23, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long hours, highly competitive, blah",
        "advice": null,
        "pros": "technical work is very challenging",
        "summary": "great!",
        "role": "Anonymous Employee",
        "date": "Jan 25, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "after the first management change, company changed a bit. ceo was new and did not do a great job. however the company did get acquired.",
        "advice": "keep up the good work. its a great place to work at - now qualcomm, and we hope to kick ass",
        "pros": "start up company in a fast pace industry. company was acquired later by qualcomm. technology and silicon valley experience. good time.",
        "summary": "great startup",
        "role": "Anonymous Employee",
        "date": "Jan 29, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I felt that there wasn't enough attention in terms of mentoring given to me as an intern. The pay could've been a bit more when compared with other similarly sized software companies.",
        "advice": "The leadership was good overall. Team lead was very knowledgeable and competent technically. However they could have paid more attention to the intern and given me more feedback and guidance.",
        "pros": "Corporate housing. Relocation is paid for. Very excellent free gym access. Flexible hours depending on your team. Casual work environment.",
        "summary": "Good internship experience.",
        "role": "Software Engineering Intern",
        "date": "Feb 3, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Long work days, sometimes hard to get decisions made due to the number of people that feel they need to be involved",
        "advice": null,
        "pros": "Benefits package, interact with intelligent people",
        "summary": "It is a fast paced environment where you learn to adapt to daily changes",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A select few managers are politicians not passionate technologists or designers tarnishing the dynamic of innovationIts true, you have to struggle hard to earn a promotion or compensationNo academic compensation or professional development compensationCompany spans multiple buildings instead of a consolidated campus making proximity an issue",
        "advice": null,
        "pros": "Passionate environment about the company, strong loyaltyAccess to different technologies to get the job doneCompetitive salariesGood balance of work and playAllow to work from home if need beFree drinksMultiple gym locationsMultiple cafeteriasA libraryA medical clinic onsite with MD, not just nursesInvolved human factors teamFree shuttle serviceStock Grants and bonuses … are pretty darn goodArea is not a crowded as other tech hubs like Silicon ValleyRelatively small company compared to other chip competitors",
        "summary": "Overall, one of the better Fortune 500 technology companies I've worked for.",
        "role": "Systems Analyst",
        "date": "Feb 18, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Huge, market share good, min layoffs",
        "advice": "?",
        "pros": "Benefits, and Company is stable",
        "summary": "Good",
        "role": "Senior Layout Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Atheros policy to moving R&D overseas",
        "advice": "Finding a balance between cost reduction and retaining technology",
        "pros": "Engineering, technology oriented companyGreat leadership and vision from CEO",
        "summary": "great company",
        "role": "Principal Member of Technical Staff, Software",
        "date": "Feb 22, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "promoting from within is a liesome groups are great, others are horrible -growth & opportunity depends highly on how well you get along with your supervisor (or how well you can market yourself) - there's too much \"favoritism\" and not as much real performance based ranking/evaluations/promotions",
        "advice": "let go of those low performers who do nothing but delegate, even if they're your friends / golf buddies. this is a business, not a family get-together. let the real performers get where they deserve.",
        "pros": "work/life balance, \"laid back\" environment (think \"san diego\")benefitspay is good, not great",
        "summary": "satisfaction HIGHLY depends on your immediate group",
        "role": "Manager, Business Operations",
        "date": "Mar 6, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Since it's a large company, sometimes it seems that an individual's contribution does not impact the company much. The managers do try, however, to recognize the contributions, even if it doesn't eventually pan out.",
        "advice": "Keep listening to the employees, and they will continue to pay you back with great work and quality products.",
        "pros": "There's a reason why Qualcomm is often listed in Best Places to Work surveys. Management makes sure to listen to employee concerns, needs, and wants, in order to improve working conditions as well as work-life balance. At times, they are even proactive about introducing new ideas to make working at Qualcomm better.Not only that, working at Qualcomm gave me the opportunity to work with and learn from very smar… t and experienced people in the field of wireless communications. Since many of these people are the pioneers in the field, I was able to get a sneak peek at upcoming technologies--and everybody was open and willing to share with me. People (even some quite senior members) are generally happy to chat, no matter how busy they are.",
        "summary": "Full of smart people who are highly knowledgeable in wireless communications",
        "role": "Intern",
        "date": "Mar 6, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "weekends are usually counted as work days, schedule is based on calendar not working day. if project falls on holiday, then you will have to sacrifice the family time.",
        "advice": "management need to be more focus on people management,",
        "pros": "most of employees are smart and hard-working. compensations and work place are good, especially the office, staff level up got a separate office, it's advantages to work on some innovative ideas at quiet office.",
        "summary": "competitive workplace",
        "role": "Anonymous Employee",
        "date": "Mar 30, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "CompensationLimited growth opportunitiesOperates as an \"old\" company",
        "advice": "Encourage employees to move across business units and improve compensation.",
        "pros": "Work-Life balanceGreat line of productsStable company",
        "summary": "Great company with fantastic work-life balance and great business model.",
        "role": "Senior Programmer Analyst",
        "date": "Apr 8, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I can't think abou this right now.",
        "advice": null,
        "pros": "medical benefit, work environment, good technology.",
        "summary": "great",
        "role": "Staff",
        "date": "Apr 9, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Fewer and fewer opportunities for growthRelatively low salaries",
        "advice": "Allow higher churn in employees (very top heavy), for the future invest in a more focused way in other areas outside of 3G/4G",
        "pros": "Good work/life balanceGreat benefitsSan Diego is a great place to live",
        "summary": "Good work/life balance",
        "role": "Anonymous Employee",
        "date": "Apr 11, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "* Pay tends to be lower than industry average* Product roadmap and strategic planning often puts more pressure on engineers than necessary. This especially applies to canceled products that only serve as a time-waste that could've been better spent* Compute resources aren't as plentiful as it could be and hampers how fast things can get done",
        "advice": "Look into investing in more resources rather than just throwing more hired hands at a problem. Faster simulation can take days off of debug time. Also look at compensating employees better.",
        "pros": "* Work with cutting-edge technology* Very talented and smart people* Little micro-managing* Good perks and environment to work inAll in all, the atmosphere is great. It can sometimes require long hours but it never feels grueling; partly because the projects are interesting.",
        "summary": "Good place to grow in skill but not in salary",
        "role": "Engineer",
        "date": "Apr 21, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "always on. The expectation is that if they are paying your cell bill, you should answer after hours. I can appreciate that and don't mind but some people might. It really depends on the supervisor you have. decision by consensus becomes exhausting. New ideas take a while for people to warm up to, if you're persistant then you should be just fine. like I said above, change. Personally I like but if you like the same s… tructure year after year, this place isn't for you. Agility is key to being happy here. Middle managment (Sr. Dir/ Dir. are usually at the stage in their career where they are in it for themselves and don't look after their employees unless you luck out.) I work in marketing and with it beng a engineering centric company (as it should be) Marketing gets little money and support in general. Sometimes you luck out and get an executive who really believes in the power of it and magically things happen for that marketing group. (more money, higher exposure etc).",
        "advice": "keep up being visible & transparent to your employees. Best to not make decision by committee. Be brave once in a while.",
        "pros": "People. (There are some not so great ones but won't take you long to figure out who they are). Lots of support, IT, Health Center, Learning Opportunities, New Facilities, Offices for almost everyone, farmers markets in the summer, movie screenings in their lecture hall where you can bring your family, etc. they definately take care of their employees for the most part. They try to make the workplace fun. Always chang… ing. Sr. Executives are very approachable. (SVP and up)",
        "summary": "Great place if you like change and great people.",
        "role": "Marketing Manager",
        "date": "May 12, 2011",
        "is_current": true
    }
]