[
    {
        "rating": 1,
        "cons": "lack of management leadership. Failure of communication to keep everyone informed on priorities.",
        "advice": "Listen to your Sr employees about the issues and stop ignoring them. Management treats this as a problem that should go away and will not make the changes necessary to succeed.",
        "pros": "You have the opportunity to work with cutting edge technology",
        "summary": "All groups are not equal, beware of who your working for.",
        "role": "Staff Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Extremely long hours, rude and lousy middle and senior-level management (Dir, VP & Sr. VP level), chaotic, lack of processes, go-with-the-crowd-attitude, do not appreciate out-of-the-box thinking, don't give credit when credit is due, nepotism is in full effect! It doesn't matter if you are completely incompetent, as long as you know a senior-level manager, you will get in and you will have the doers working unde… r you to do the job so that you can take the credit for it.",
        "advice": "Improve your processes so the employees don't have to work 60+ hours to get something done that could be accomplished in 40 hours. Seriously review the knowldege-base and the managemnt skills of your Sr.and VP level management. Put a STOP to the growth in your middle management. They are NOT helping your operational efficiency!! Solicit direct input from your employees on the quality of their work environment. MONEY … IS NOT EVERYTHING!!!",
        "pros": "Leading edge technology and opportunity for acquiring technical knowledge",
        "summary": "QUALCOMM is a ZOO!",
        "role": "Senior Program Manager",
        "date": "Aug 22, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "matrix organization, too many level of managemnt, too many politics, aftects the work and the communications",
        "advice": "To reorganize the middle level of management inclusive VP (who carry with them people that they know not people that perform) and get ride of politics and the vertical structure with matrix organization. This type of organization does not promote innovation, communication and makes very difficult to work within the organization. Basically you work the politics. Especially the QTC organization of program management is…  not based on recognition of the good work but only politics and relationship. The good job is not rewarded but only politics of who you know. I think that QCOM is just lucky to be in the position that it is now based only on the leverage of its chipsets. The middle level management of does no do any action to make people accountable on their failure promotes grapevine and politics and does not reward people that are doing a good job. All it is of how many years did you work with QCOM and who you know. Also has an unfair way of promoting people. In this very vertical and matrix organization there are many weds that are never clear up but just move from one management place to another. Half of the managers barely speak English and have no management training other the in-house training.",
        "pros": "It pays the health insurance and has 15 days of vacation offered from the 1st year.",
        "summary": "Get ride of politics in QCOM management and reward the value not the loosers.",
        "role": "Senior Program Manager",
        "date": "Oct 7, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Middle level management is too wide spread and upper management is too busy to monitor what middle management is doing.",
        "advice": "Must get more involved in what middle management is doing.",
        "pros": "Salary and Benefits. Family life / work balance in some departments is good, some not.",
        "summary": "Middle management has too much power and upper level management looks the other way.",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- > Qualcomm HR is really really bad and they try to take advantage of people thats why they always go and hire people from companies who have recently laid off people because in desperate times people are ready to take up any position and at any salary, they specially do that with international's working here. I have not seen any other similar company do this.-> Qualcomm wants you to work all day and n… ight and then doesn't want to reward you for it, not even a pat on the back.-> they have tons of directors, yes Qualcomm likes to give lofty positions to people and they have so much hierarchy in terms of positions that a person joining at a lower level feels like a useless worm here.-> the so called upper management never cares to talk to employees.-> Promotion system is totally vague and seems highly unjust.",
        "advice": "- > Keep an eye on what your hiring people are doing.-> Reward people based on their work and not if they are friends with you.-> For godssake talk to everyone under you once in a while at least.",
        "pros": "-> You can do a lot of work without getting paid much.",
        "summary": "Highly bureaucratic company, be vary of HR 's when you join Qualcomm.",
        "role": "Engineer",
        "date": "Oct 24, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "no recognition, no promotion if you do work, no promotion if you don't speak language other than english, no promotion if u don't work late even if you come at 5.00 AM, no promotion if you say NO to your lead, no promotion if you stress on quality",
        "advice": "Change the concept of visibility to productivity for evaluating employees. Because many are visible and get goo pie, but how much their contribution?????",
        "pros": "Right now, stable company to work for",
        "summary": "Poor leadership skills engineers promoted not to lead but to push others",
        "role": "Systems Engineer",
        "date": "Oct 24, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Life in my group was horrible.- Incompetent and verbally abusive management.- Back stabbing, mind games, stealing ideas, hiding facts from upper management.",
        "advice": "Make sure you know who you hire. Follow up HR issues, listen more the employees. Some of the people in high positions were probably good engineers, but they are not good managers.",
        "pros": "- Many clubs and activities (assuming you have time to attend)- Decent salary- Good environment- Free drinks",
        "summary": "Worst nightmare ever",
        "role": "Senior Staff Engineer",
        "date": "Jan 10, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "constant panic! Everything is needed now! There's little planning, no documentation, and if it can be hacked to work late at night, do it. I'd seen a dozen gotos in my career of as many years until I got to Qualcomm. If there's a way to do something that is nearly impossible to debug, that's the way it's done here. Really, this place will test your sanity.",
        "advice": "Quit promoting the workaholics, they manage to find the hard ways to do everything. If you do ask people to come in on the weekends, at least get some decent pizza. You wouldn't get Pizza Hut for your family, have a little respect for the poor guys trying to make you look good.",
        "pros": "great weather, really nice people",
        "summary": "worst software practices realized",
        "role": "Staff Engineer",
        "date": "Mar 22, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "1. Bad managers2. Backstabbing project leads3. Backstabbing managers4. Backstabbing Directors5. Too many employees with baggage from their former countries",
        "advice": "Stop giving engineers management titles and responsibilities",
        "pros": "1. Own office with door",
        "summary": "Once economy gets a little better, most employees will leave",
        "role": "Electrical Engineer",
        "date": "May 20, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- No management support . You need to drive/figure out/push around solely by yourself. Management is doing nothing but taking credits. No 1on1 meeting from the direct manager for half a year.- Non-realistic deadlines- Long long hours. 60 hours per week is nothing, and you are not appreciated. You'd better working 24/7.- No life. You are supposed to be a machine, not a human being.- Does not have colla… borative culture.- If your project lead is from another team, you are always the scapegoat for project being behind the schedule even if they were behind far before you joined in.",
        "advice": "Improve the mid-management people skills. Treat your engineers with more respect, and don't act as if you were their master and they were slaves. Let the engineers participate in the deadline decision.",
        "pros": "- Trainings ( but you may not have time for them at all)- Good benefit- Job security- Good start for the fresh graduates",
        "summary": "I am leaving...",
        "role": "Staff Engineer",
        "date": "Aug 27, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "They don't promote employees based on performanceThey never fire incompetent employeesThey hire friends and familyThere is no career opportunity and growth within companyHR is uselessPolitics everywhereThey don't value your work. They only care about numbers.",
        "advice": "Stop hiring friends and familyStop promoting friends and familyListen to your employees and take our feedback more seriouslyStop laying off good employees and start getting rid of incompetent ones",
        "pros": "Good benefit overallGood reputation in San DiegoLaid back atmosphereStable income while your job lasts401K matching grant",
        "summary": "It's all about who you know or friends with",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "too much politicsvery bad low-medium level management",
        "advice": "create some more process, provide more channel to hear the voice from engineers",
        "pros": "job securitygood high level management",
        "summary": "2",
        "role": "Anonymous Employee",
        "date": "Jul 21, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The company is riddled with politics. If you want a promotion, then you need to sucking up. Your achievements and effort does not count at all.",
        "advice": "Fire all the managers and hire more engineers to do the work",
        "pros": "Qualcomm is a stable company, Benefits are great, Salary is decent",
        "summary": "Politics, Politics, Politics",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The company is very heavy with mid-level managers, many who have been there for years and promoted well beyond their skill level. To compensate, the company hires more skilled employees in below them, making the mid-level managers, who these people ultimately report to, feel threatened. Since they are not about to leave--they could never retain their title level and pay elsewhere--there is no place for the newer, mor… e skilled employees to move up. Managers have absolute control, can get away with horrendous verbal abuse, as can any employee who comes under \"special protection\" of a manager. Human Reousrces is horrible--they will back up an out of control manager and destroy anyone who complains in order to protect the company from lawsuits. There is constant reorganization to hide problem managers, but the individual problems never get addressed, and continue to recur. Anyone who speaks up about it is punished.",
        "advice": "You have alot of great, hardworking people at your company. Treat them with respect.",
        "pros": "There are alot of smart, hardworking people at Qualcomm, and comraderie and support among coworkers. The pay and the benefits are great.",
        "summary": "Qualcomm is rife with politics and backstabbing.",
        "role": "Senior Marketing Communications Coordinator",
        "date": "Oct 6, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Highly stressful environment, extremely difficult to be successful.",
        "advice": "Less criticism, more collaboration",
        "pros": "Initial stock options, stock ownership plan, 401k matching, good health insurance.",
        "summary": "Life is too short for this much stress.",
        "role": "Anonymous Employee",
        "date": "Oct 24, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The company's mother ship is in San Diego, they have been buying a lot of startups, the problem is that they don't know how to handle them and pour hard earned cash into some of these non profit divisions which are basically allowed to treat a lot of hard working individuals anyway they want. Too many PHD's with no managerial experience that think they are god doing technician level work. Some are placed in managemen… t positions and they are really terrible at it, some cannot even understand English. HR is only a legal front for the managers, holding the sword.",
        "advice": "Wasting money is not a business model, Company's HR ER needs an overhaul. Too many PHD's with no interpersonal or managerial skills.",
        "pros": "Good benefits, Comparable salary to industry standard",
        "summary": "Terrible HR and Managers, Company wasting cash on non profit divisions with no direction",
        "role": "Anonymous Employee",
        "date": "Feb 11, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "My experience at Qualcomm was extremely negative. The main problem was most of my technical leads were inexperienced and untrained as leads, were not clear on their expectations, were unhelpful technically, and were excessively critical. Several of them were literally the worst leaders imaginable. I was not given time or resources necessary to learn new technologies before being expected to perform on them, and manag… ement was unsympathetic for my attempts to seek help. There was no work life balance. I worked extremely long hours without receiving even a 'thank you' in most cases. While there are some opportunities to work on cutting edge technologies, many if not most positions involve maintaining/porting existing/old poorly documented fragmented code.",
        "advice": null,
        "pros": "Health insurance is very good. Nice facilities including exercise rooms. Internal clubs formed by employees for special interests and hobbies. Cutting edge technogy for some lucky few.",
        "summary": "The worst employer of all time.",
        "role": "Anonymous Employee",
        "date": "Mar 18, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "When you have a medical condition that requires consistent accommodations expect it to be challenged. They will fight you until they are able to terminate you.",
        "advice": null,
        "pros": "They do provide great benefits",
        "summary": "My Experience",
        "role": "Anonymous Employee",
        "date": "Apr 30, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "#1 Arrogance runs through this place.#2 Outdated IT environment makes it difficult to accomplish tasks#3 Seems completely headless when making decisions, nobody is willing to stick their neck out, see #1.#4 HR/Recruiting are clueless and offend people for no real reason, see #1.#5 Entrenched management is checked out, leaving their \"underlings\" to do all the work. It's also impossible to advance in th… is company without having friends at the VP level.",
        "advice": "Too far gone.",
        "pros": "Excellent benefits, especially if you are Sr. Staff and above(that's right their class system applied to not just salaries and bonuses)",
        "summary": "good old boys gang, lower level staff mistreated",
        "role": "Staff Engineer",
        "date": "Jun 12, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Low pay, low growth, no life",
        "advice": "Sr management go drop dead",
        "pros": "Nothing I can be proud of. If you compare to other great companies high high pay then this place sucks ass. Go other places if you can.",
        "summary": "Sr managements put money in their pockets only",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "# No work- life balance.# Most work almost 12 hours everyday. Not the managers maybe, but for a new recruit, that is a minimum for months.# Salary is very less for the extremely demanding work.# Terrible work culture.# Half the work force is Temp employees. That says a lot about how Qualcomm wants to save more and pay the absolute least it can.",
        "advice": "Read the above comments. It's OK to let your employees have a life.",
        "pros": "Some discounts around town for employees.",
        "summary": "A sweatshop in the USA. Long hours are inevitable. If you have a life at all, let it go before you work here.",
        "role": "Systems Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No integrity in IT ManagementNo recognition for new employeesTasks/Projects/Milestones accomplished are not communicated up the management chain, especially in IT. Instead, the manager will take credit for great work and accomplishments and has at least one level below to blame when things don't go as favorably.Very secretive and cowardly promotion and bonus/perk structures.Will actively deny or make … extremely difficult the ability to transfer internally.",
        "advice": "IT Management needs a complete re-haul. Pay the price to get AND KEEP good quality engineers and leaders.",
        "pros": "Qualcomm has a great work-life balance if your manager permits you to take advantage of it.The medical benifits provided are great!",
        "summary": "Mature process, immature IT management - no integrity",
        "role": "IT Staff Engineer",
        "date": "Nov 27, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Long hoursImmature leadershipPolitics rule middle managementQuestionable ethicsPromotions are not based on performanceQualcomm is going after younger hires and does not value experienceNo longer a company that values new ideas",
        "advice": "Audit your staff, to much corruption and pay to play.",
        "pros": "Summer on the LawnBeautiful campusGood benefitsOnce a great company and fun company to work for",
        "summary": "Too many kingdoms, lots of politics, no longer a fun place",
        "role": "Senior Manager",
        "date": "Dec 11, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "After 5 years at Qualcomm my experience was mixed. It depends very much on the specifics of your group and management. If you join as an expert in your field you may find yourself working with inexperienced generalists who do not know what they are doing and rely on your expertise but who are then able to take all the glory. This is compounded by racial cliques in some small teams. From my management I got very mixed…  messages, heaping praise on the one hand then stabbing me in the back when it counted. It sounds nutty but In the end I encountered a pervasive culture of dishonesty from my managers up to and including senior HR that soured me to this company.",
        "advice": "Start giving more than lip service to integrity.",
        "pros": "Interesting engineering work but understaffed.",
        "summary": "Your experience will depend on your group, but their culture of dishonesty let me down.",
        "role": "Senior Software Engineer",
        "date": "Dec 25, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management, good ol boys club, lack of professionalism, lots of managers, no leaders, lack of employee empowerment, system actively weeds out the most intelligent and forward thinking professionals, egregious wastes of money due to lack of basic knowledge in managing people or projects. Personally witnessed millions wasted on tools and custom software that is never used. All of these tools and projects were castrated…  due to personality conflicts or petty politics of who received credit or who was in control. Although this is sometimes the reality in large organizations, QC is particularly unique in my what I have seen over the last 20 years.",
        "advice": "Shake things up, but that will not happen until QC sees a serious market competitor which will force the company to reevaluate its management practices for the purposes of being more efficient.",
        "pros": "Benefits, healthcare, vacation, flexible work hours depending on area of work, stock options (depending on your relationship with the manager), regular raises (also dependent on the manager and personal relationship).",
        "summary": "Poisonous Entrenched IT Management",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "too micro management that kill innovation...",
        "advice": "Competition within the company are not very healthy...",
        "pros": "If you can make a lot of of noise about something even if it is low tech, you can build a reputation of a master and climb the ladder quick if surrounded by your own friend. I can't do that and will never do it.",
        "summary": "Company culture",
        "role": "Anonymous Employee",
        "date": "Feb 27, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Poor management. Empire building. Too much infighting.",
        "advice": "Not sure if Management is open to advice.",
        "pros": "Almost none. You may get a chance to work on some new technologies",
        "summary": "Atheros (QCA)",
        "role": "Anonymous Employee",
        "date": "Mar 5, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "too many meeting, many higher level push to finish work asap( no reason), no work-home balance( weekend work & meeting).",
        "advice": null,
        "pros": "work hard, good stock bonus, good health insurance ( senior level)",
        "summary": "good company,",
        "role": "Anonymous Employee",
        "date": "May 25, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Experience largely depends on the team. On my there were lots of pressure, overtime (even over night) is expected and implied. People are treated like slaves. Morale is very low, many members of the team H1Bs that have no choice but to shut up and work. Management does not seem to care about the work life balance of its employees.",
        "advice": "Treat your employees better.",
        "pros": "Location, facilities, stock going up, free pop",
        "summary": "Low pay, lots of pressure, sweatshop like environment",
        "role": "Software Engineer",
        "date": "Jul 14, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "deceitful and incompetent leadershipleaches, leaches and more leaches. very little talent just a bunch of thieves of talent and bonus.",
        "advice": "get rid of 70% of your managers and focus on the people who actually do any work",
        "pros": "benefits and flextimetechnology if you're in the right group",
        "summary": "Liars and thieves",
        "role": "Staff IT Engineer",
        "date": "Sep 9, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bad work culture. Expected to work long hours and weekends. Management is dominating and takes employee freedom. San diego office is notorious to take away your work and life balance>bad office politics",
        "advice": "Focus on quality than quantity",
        "pros": "Big company, big name. Some technology can be good to work",
        "summary": "Engineer",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Culture: very bad, too many Indian managers trying to compete for minute incremental raisesVertical: not much vertical movement unless the managers like you, too much politics, many times seems unfairHR: or a lack there of! i actually don't know what HR does beside handing out \"Employee Assistance Program\" brochures once the employees are exhausted.Salary: Much less than market and definitely lower than m… any colleagues",
        "advice": "Act like an American company",
        "pros": "Location: nice city, awesome weather (although its the same year round), close proximity to nice places, great beachesFacilities: great gym and showers, up-to-date facilities, good cafeTraffic: not much, many places to go to quicklyHousing: not as expensive as Bay Area, newer communities, younger folks specially near La Jolla area",
        "summary": "Nepotism, Stressful, Lower-than-market in a Beautiful city - not so classy!",
        "role": "Senior Systems Engineer",
        "date": "Oct 23, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very political.Back stabbing.Individuals use you as leverage in order to promote themselves.Fabricated stories, dishonest claims.",
        "advice": "Run away from that place.other divisions refer to QCT as \"The dark Side\".Valid reasons.",
        "pros": "Still searching for a reason why I worked there for such a long time.",
        "summary": "What I think of the CDMA division at Qualcomm",
        "role": "Senior Engineer Staff Manager",
        "date": "Oct 27, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "no career developmentnot taking feedback seriouslylow pay",
        "advice": null,
        "pros": "work life balancenice gymnice swimming pool",
        "summary": "going downhill",
        "role": "Software Engineer",
        "date": "Oct 27, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Due to the heavy workload, typically the employees do not have the time and chances to attend the trainings.",
        "advice": "Should provide the chances for the employers to grow.",
        "pros": "The company provides some general trainings.",
        "summary": "career path",
        "role": "Anonymous Employee",
        "date": "Jan 10, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "boring job and get repetitive soon, too much micro management",
        "advice": null,
        "pros": "Not much work most times so can get free time at work",
        "summary": "Test Engineer",
        "role": "Anonymous Employee",
        "date": "Feb 4, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Loooong hours. Forget about having a life. We are talking 12-14 hour days and weekends. They shamelessly ask and you have to agree.No job security. People are being fired all over.",
        "advice": null,
        "pros": "Free Soda !! Seriously, that's it.",
        "summary": "Systems Engineer",
        "role": "Anonymous Employee",
        "date": "Apr 3, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The only good reason to work for Qualcomm is also gone now. Employee's spouse is not going to be covered under the health care plan changes.",
        "advice": "CEO needs to go.",
        "pros": "Internal mobility is encouraged. A handful are given opportunities to explore different options within the company.",
        "summary": "Revised health plans",
        "role": "Qualcomm",
        "date": "May 13, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Heavy workload, no salary increments, no bonus (where the manager dosen't hesitate to say, its the higher management decision to not to give bonus and salary hikes) even with very good yearly rating.",
        "advice": null,
        "pros": "Nothing positive that I can at least think off.",
        "summary": "Disadvantages of working with Qualcomm",
        "role": "IT Engineer, Senior",
        "date": "May 18, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "RSUs were slashed for underlings to shore up the share price for investors. Healthcare benefits are being gutted for 2016. Suddenly employees are realizing that Qualcomm has lost its advantage to get and retain key talent, the grass is starting to look a lot greener across the way... Is this what you wanted Janus Capital Management?",
        "advice": "Out with MellonKopf, he isn't worth his massive compensation package. Please step down. As for the board, don't cave into pressure from Janus Capital Management, there seems to be a direct correlation from when they starting pressuring the executive team to the reductions in benefits. Shame on them.",
        "pros": "Great folks on my team, pay is decent.",
        "summary": "Qualcomm is muddling along",
        "role": "IT Engineer",
        "date": "May 18, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The Corporate IT department is underpaid and understaffed. The majority of the employees are disgruntled and spend their weeks (and weekends) stuffed in cubicles with frowns on their faces.The management is morally and politically corrupt. Consisting of a cultish group of Qualcomm \"lifers\" (many have been there 15+ years) who really only lookout for their own. Many have no credible management training and no … degree above high school. They were simply just there long enough and eventually pushed into management. To these people, nothing else matters. This group is essentially closed off to outsiders, so forget about being in it. They also enjoy flaunting their money to everyone (BMW cars, $10k watches, Tesla cars etc...) thus lowering the moral of their staff even further.Qualcomm boasts the phrase \"work life balance\", however to management, work is their life so the phrase is all but irrelevant to them, which in turn filters down to the employees. So employees get worked to the bone.Promotions, performance and appreciation (and remaining employed) are honored on a strict \"who you know/blow\" basis. Hence, if you grease the right wheel or know the right people you can get 3 promotions in 3 years, even if you do nothing. But if you aren't a wheel greaser, or you challenge their ancient system, you may get one promotion in a decade, despite busting your butt.",
        "advice": "Hire some younger, more qualifiedmanagement staff from outside the company !! Not tape backup guys and socially awkward computer programmers that have been there since the 90s. Bring in some new ideas, some positive change and most importantly some intelligence. Also, hire somefemale management. It's a sociopathic sausage fest up atop that ladder. Promote Engineers more from within. I knew many hard working, … critically valued guys that hadn't seen a promotion in 7+ years only to be trumped by hiring some guy from outside the company.Your IT department and many of it's employees are in rough shape. Yet you lay off talented people who work hard and are well liked by their piers, in order to promote your own.Though none of this probably matters anyways since Qcom willprobably outsource most of it's IT work out if the US within a few years anyways.",
        "pros": "Can't really think of any. Even their 401k matching isn't that great.",
        "summary": "Worst IT Department around.",
        "role": "Senior IT Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "In the twelve years I've been at the Q, the job and company have gone from great to pretty dismal. When I started, work/life balance was recognized and quality output was the priority. Over the years, the workload and deadlines have gone from normal for the industry to ridiculous. On my team, layoffs and ever-increasing workloads with impossible (if you want to produce quality) deadlines combined with team-wide confu… sion about any and all of the increasingly complicated processes makes it tough to do good work. The stress level has gone from manageable to toxic, all while employees should always have smiling faces - very emperor's new clothes environment.",
        "advice": "Come back Dr. Irwin Jacobs! Those were the great years for Qualcomm.",
        "pros": "Salary remains good for the San Diego area and the benefits are decent, but declining (health plan eroding, 401K fees enacted, etc.). Better than usual vacation benefit. Depending on the team (not department) you are in, management can be responsive and supportive but this is lessening due to employee and cost cutting, and overall company atmosphere.",
        "summary": "From Great to Abysmal",
        "role": "Senior Staff Tech Writer",
        "date": "Jun 12, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Some serious non-sense meetings. I don’t think I have seen as much time wasting and mud slinging meeting as the ones that Qualcomm have. Decisions need to be “socialized” in a “democratic fashion.” I can feel my stomach tighten at these buzzwords. The managers were not big on taking responsibility, so it’s my responsibility to convince all participants. Sounds great in theory, but in practice, this just means you got…  to do the hard work to convince more people, or one week later, you are sitting through another meeting talking about the same thing. I rarely see meetings produce to-do list and action items. Most meeting last 30 mins or an hour, even though they really could be shortened. I’ve seen level 3 engineers’ days being fully booked with meetings, and sometimes double booked, so they better do work during nights and weekends. But really, the worst part of meetings is mud slinging shouting matches that occur when some features break. One time we had frequent crash in a handset; it was traced to a watchdog condition. One of the conditions that might trigger it was a full heap. So we reasonably asked if the responsible parties could check memory leaks. I could swear someone was getting bloody murdered by the loud shouting and responsibility deflecting. Waste of time all around.Stodgy, antiquated, monotonous software strategy! I worked in QIS (Qualcomm Internet Services), a purportedly web services division of the company. But there was much attitude against integrating emerging practices and technology. We even had a meeting back in 2013 from legal telling us not to participate in open source forums (not code contribution, but just Q/A forums), not to sign an 3rd party agreements (which effectively means not to download Android SDK, iOS SDK) without informing the legal department first. Of course, the bigger disappointment is that even when I was leaving, I hardly saw modern practices like continuous delivery, continuous integration, DevOps, continuous testing, etc, etc. Each handset software release takes weeks in straight waterfall (dev -> test -> integration -> release). Even with a lengthy schedule, software often ship with major undiscovered bugs. I used to snigger at the term “feature complete release;” because it might as well mean crash after 5 minutes. I feel senior employees at Qualcomm San Diego can really benefit a lot by taking an externship at lean startups and actually learn something about efficiency and process automation.Duplication of efforts. Where do I begin on this one… There are often multiple internally developed or internally available tools for you to do the same thing, but good luck to you if you need help setting it up. To give you an example, I needed to do some integration testing with some QC partner corporations. One of the tasks is automated dialing and torture testing. Supposedly there were 3 tools available for me to use. One was developed by a separate QC division; and it was obviously meant to do some serious heavy lifting. I couldn’t use it because our liaison couldn’t get the help, and the customization effort to get it to use look into LTE protocol instead of CDMA was high. Another tool was developed by an outside consulting firm; we couldn’t use it because it didn’t have the right driver. Yet another internally developed tool was not used for a reason or another I couldn’t remember. So I had to write a script to do automated dialing. Just to think, 3 separate groups got credit for developing their tools (and got credit), then moved on, and never thought about supporting them again. Apparently my experience was not unique.Slow pace of advancement. As a lot of people have mentioned before, doing hard work for long period of time often don’t get you the advancement. Fixing software bugs and pushing out new releases from 9AM to 9PM day after day will maybe get you to the next level after 5 years. Majority of Qualcomm departments are not growing, so your advancement opportunity is limited. Much of the employees at Qualcomm are pretty young, so advancement through attrition is really not an option. When I was quitting, I was offered advancement to stay. This really doesn’t inspire loyalty.",
        "advice": "Actually instead of advice to management, I will give advice to would-be employees:At Qualcomm, there's an endless amount of work to do. If you are a hard charger, you can fill out a 60-80 work hour week really quickly. At Lunch, you eat at the Qualcomm café; you go to the Qualcomm gym; swim at the large pool at the Jacobs Community Center; if get sick, use the Qualcomm Health Center; every few months, you will s… ee your bosses 4 levels above ride off into retirement in their Tesla/BMW/Lexus. It will be easy to lose yourself in this big Qualcomm \"life\" and think the big QC will take care of you from cradle to the grave. BUT IT'S NOT!It's a slow slog fighting for advancement. Doing the normal work (fixing software bugs, churning out another modem software releases, do another release build) will elevate you very slowly. For a tech company, there really seem to be sense that only your seniority matters in terms of advancement. That, and of course your mastery of manipulating your own political perception.Qualcomm is a business, just like anything else, which means profits above most things. While I get to hear some lovely mantras like “work-life balance” and “open door policy”; it’s almost not used at a practical level. Read all the comments about work life balance, and see if anyone thinks you can balance your life and work in QC. The “open door policy” means you should be able to bring any concerns and issues to managers. The only time I hear people air out dirty laundry is when they are transferring or they are leaving. So go figure.Don’t lose yourself in Qualcomm life, it’s incredibly easy to lose your sense of the outside world in the daily grind. Keep an ear to the outside world, and see what’s interesting. Qualcomm has successfully milked 3G and 4G and related services. But the competitive landscape is also sifting; you have to decide where the puck is going to be, and be there.",
        "pros": "During my time, we used to have individual offices, but I hear that’s changing. Great travel benefits while you travel for work, I heard that’s changing too. Great health benefits, $0 deductible, $10 copay for doctor visits, $10 for medication; I hear that’s changing starting 2016. Pretty good pay, but if you work 60 to 80 hours, it isn’t worth that much. Free gym, that’s still the same, yay!",
        "summary": "Former Senior Engineer",
        "role": "Senior Engineer",
        "date": "Jun 20, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "get exposure to messy way of doing things",
        "advice": null,
        "pros": "no diversity in the work force",
        "summary": "bad working env",
        "role": "Anonymous Employee",
        "date": "Jul 2, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Projects are severely understaffed, resulting in engineers working very long hours.- No work/life balance.- Promotions are slow or nonexistent.- Management is useless and clueless. Will commit engineers to impossible deadlines without consulting the engineers.- Benefits are getting worst due to cost cutting.- Too many unnecessary meetings. Engineers waste their time in these meetings and do not … have enough time to get the real work done.",
        "advice": "Company used to be focused on quality, now all the groups are just focused on meeting deadlines while sacrificing quality since projects are understaffed and deadlines are too aggressive. Need to bring the focus back to quality and add more staff to projects. Also stop cutting benefits.",
        "pros": "- Good Medical, Dental, Vision benefits for now (will be getting worst)- Free on-site gym",
        "summary": "Lost its way",
        "role": "Anonymous Employee",
        "date": "Jul 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I have never worked at a place where management was so lazy, dysfunctional, incompetent. All they want to do is hide in meetings and kill any innovative ideas.",
        "advice": "Leave and give the younger generation a chance.",
        "pros": "Great pay, smart people, good benefits, nice campus, interesting work, growing company for next few years of keep handful of customers.",
        "summary": "Worst politics ever",
        "role": "Staff Engineer",
        "date": "Jul 18, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Backstabbing is the norm, nepotism rules, you may as well join a union when you realize that peoples offices are given to them based 1st on tenure then on position. Management is too worried to make the right decisions and the twice a year review process is a horrific implementation of bashing peoples character with people who have no clue how to write a professional review. Employees are worked 70+ hr weeks and made…  to feel that they are fortunate to have a job there.",
        "advice": "Clear the ranks of your management team, assess your values and actually follow them. You are so far removed from alignment that your profits are obviously suffering.",
        "pros": "Company cafeteria, decent benefits and pay, smart people and most are creative.",
        "summary": "Nepotism Rules",
        "role": "Anonymous Employee",
        "date": "Jul 26, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Don't make me go there.",
        "advice": null,
        "pros": "Excellent pay for most people",
        "summary": "Used to love my job",
        "role": "Anonymous Employee",
        "date": "Aug 3, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "I did not like the lack of growht , i also did not like the change in approach every few months",
        "advice": "stick to one approach and provide a stable environment for employees to work in so that they can focus on what they do",
        "pros": "good technology, business domain, latest cutting edge technology good infrastrcture i loved the view from my office, the building and cafeteria are great",
        "summary": "ok",
        "role": "Anonymous Employee",
        "date": "Sep 21, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "This place is not what it's cracked up to be. Probably the worst experience I've had to endure for the last few years. Bad management (boys club exclusive), no vision for our team, middle mgmt don't care either ( only there for their own agenda). Q needs to clean house and get rid of those middle managers who just do not work or do nothing to motivate their people. Fact: there is no opportunity to review upward... so…  assumption is that all mgrs are doing well. hope the next couple of workforce reduction rounds gets them out - it's a toxic environment.Steer clear - benefits will no longer be premier (high deductible and moving to banking your $$ for medical expenses), annual reviews starting next year (no longer twice yearly bonus, RSUs, raises), unlimited vacation (so they no longer have to pay you if they lay you off), limited sick (no longer allowed to take as many days), etc.Stay away.",
        "advice": "Get rid of those directors and middle managers who just take notes on status of projects. They are not needed. Clean up the mess you've made of spoiled employees.",
        "pros": "Qualcomm has a reputation of being a good employer but the only thing I enjoyed was meeting new friends.",
        "summary": "Grass is definitely not greener there",
        "role": "Anonymous Employee",
        "date": "Sep 22, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "POLITICAL. They have lost sight of the people and the direction for the company. Very sad.",
        "advice": null,
        "pros": "Close to home. Located in San Diego.",
        "summary": "Qualcomm is not what it used to be",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Three pay cuts this year. The first in the form of a benefits cut that took our health benefit from one of the best in the country to one of the worst. The second in the form of the announcement that there are no more bonuses. The third in the form of the rest of the investing world recognizing that our business decisions are really bad and dumping our stock like a load of moldy garbage, causing us to fall nearly 50%…  since the moment the Jana Group bought us out and replaced our board's visionaries with spineless used car salesmen.",
        "advice": "I literally just watched you serve notice for layoffs for engineers with multiple high-value patents on the wall. You sacked an entire floor of extremely skilled coders on the same day the India office announced it was hiring. Our focus on the stock price is killing our ability to produce top-level innovation, and that's going to kill us in the long run. And yet, meanwhile, the layoff axe seems to have missed most of…  the middle and upper management that wouldn't know efficiency or project management if they walked up wearing name tags. If you're looking to cut costs, look to your wildly ineffective project and program management, not the people who are actually making your innovations.",
        "pros": "Free sodas in the break room, an office with a door, lots of vacation time.",
        "summary": "Disintegrating fast.",
        "role": "Senior Staff Engineer",
        "date": "Sep 24, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Retaining all the top management with hefty pays and stocks, while laying off the bottom level engineers, who does the real work, is going to get them nowhere. Multiple mis-steps from management has driven the company to a ditch. The worst part is, the management keeps blaming the customers' competition, the cost of production, and the customer itself for their misgivings. The timing of all these seems impeccable, as…  it all began with the new CEO. The layoff seems to be a dance to the investors' charm. No more care for their employees. Things only happen by stock prices. Some benefits, including health insurance have been re-structured.",
        "advice": "Start by firing one of your useless senior management. That will save billions. Get rid of people, whose only accomplishments so far are commanding the low level engineers and proclaiming the engineers success as theirs. There are a whole lot of them lying around. Bring back the old CEO, who knows how to do things the best way.",
        "pros": "Great minds and innovation oriented company. They reward patents and ideas. Good 401k matching in the industry and great healthcare benefits.",
        "summary": "Need the old CEO back!",
        "role": "Senior Systems Engineer",
        "date": "Sep 27, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The decisions the company is making is having a severely negative impact on their employee base. They are tanking their employee's performance by using outsourced support, or they are laying off people low on the \"totem pole\" to save upper management's bad decisions.",
        "advice": "I had not major issues with my former management. We all have managers that we work well with and not-so-much for others. The upper\\executive management seems to have lost their understanding of their employees. Find someone that can get tuned into the heartbeat of the company to see how unhappy they are and how poor the culture has become.",
        "pros": "The people that Qualcomm hires at least within their IT org, are great people to work with.",
        "summary": "Great Co-workers \\ Faulty Company Decisions",
        "role": "Anonymous Employee",
        "date": "Sep 28, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Tons of infighting and politics within groups. Widespread nepotism and hiring of people known to managers. Docus is purely on execution with insane and unrealistic deadlines.",
        "advice": "Encourage teams to work with one another and not against. There is still a lot of fat that needs to be trimmed ... and quickly.",
        "pros": "You get to work with some very bright engineers. There is still some room for innivation although it is rapidly drying up.",
        "summary": "One of many disgruntled employees",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "crappy place to work all around",
        "advice": null,
        "pros": "No pros, only cons, never step into this environment",
        "summary": "Staff Engineer",
        "role": "Staff Engineer",
        "date": "Oct 5, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Benefits are going downhill.Two major layoffs in last yearMundane work and non transferrable skillsBonuses are shrinkingVery poor work life balance",
        "advice": "Learn from TSLA, focus on products, not on stock.",
        "pros": "Not many anymore, many great people are leaving.",
        "summary": "Very bad work enviornment",
        "role": "Senior Engineer",
        "date": "Oct 9, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Weak CEO and high management; Compensation is not competitive compared to other top tiers; Benefits are cut severely; RSUs will be much less than before and the share price is still crashing; Long hours and poor work-life balance; Too many politics; Office closure, layoffs and/or forced relocation; Company doesn't show respect to employees and many good people are leaving.",
        "advice": "Focus on the company's own technology and longterm objectives, not stock prices.",
        "pros": "Some team and/or people are very talented, diligent and self-motivated. Working with these people will make things much easier.",
        "summary": "Sinking ship",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Not an easy job, Too much work, managers are bad, co workers not very helpful. health insurance is going to change now. No work life balance. You are asked to work on weekends. Layoffs are happening. People from the top are not being cut. Promotions are very few and even they are political. Perks are being reduced.",
        "advice": "Please have a good program for people wanting to be managers. Pay attention to work life balance. This way you can retain employees long time. Please bring back the old health benefits you had.",
        "pros": "Good products, live in San Diego",
        "summary": "Was a good company, Not anymore",
        "role": "Senior Hardware Engineer",
        "date": "Oct 20, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "90% of the San Diego employees are H1B Visa immigrants that refuse to speak English in the elevators and hallways. Company has laid-off most of the older American's because they were deemed too expensive compared to the sponsored Indians and Chinese. The healthcare benefits used to be awesome, now they have offloaded most of the cost on the employees. I am currently and aggressively looking for other opportunities ou… tside of this company. I wouldn't suggest any naturalized American citizen work here, you will hate it...",
        "advice": "Too late for advice, you have already sold out the company to immigrants...",
        "pros": "Decent benefits and nice exercise facilities.",
        "summary": "No Good...",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Old practices, cannot think of out of box strategies, too slow in adopting newer technologies, horrible upper management. Tons of directors, tons of VPs and too heavy executive management. Drop in a stock is common at this company. Key is to sell all your ESPP and RSUs on a the day it is assigned. Otherwise you will get only tears.",
        "advice": "Please retire !!!!!!! Please... please...please...",
        "pros": "Works on a cutting edge technology. Always tries to be number in telecommunication",
        "summary": "Stock Dropping",
        "role": "Staff Hardware Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management only talks and does no work while forcing underlings to do all the hard work without proper rewards and due promotions, yet with all the BS and excuses to deter you from the rewards and promotions low level engineers deserve. Management's sole agenda is to grow themselves at the expense of underlings as much as possible. Management helps out each other and are in a group of their own, and low level enginee… rs in their own group.",
        "advice": "Unfortunately management is not curable anymore.",
        "pros": "Used to be health benefits, not any more",
        "summary": "Management excels and prospers at expense of low level engineers",
        "role": "Anonymous Employee",
        "date": "Nov 29, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Issues with cronyism, out of touch incompetent leaders, only men hold the reins, women treated as second class",
        "advice": "Leave and allow new leaders to be brought in, the culture in San Diego is reminiscent of the 1980s.",
        "pros": "Benefits, used to be compensation",
        "summary": "Going down",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor management that put the company in a tailspin towards bankruptcyEngineers are paid much less than the Silicon Valley competition, execs paid more.H1B program is being abused both to shackle immigrant employees and to depress wages.Eagerness to work and being a solid contributor is taken for granted immediately. Promotion, pay raises based solely on number of years with the company no… t on performance, which drove out a lot of the brightest engineers.Total compensation package is in a constant deterioration since the past few years.Constant risk of being laid off with no potential reward to make up for the risk is something you have to acceptOverall I would suggest accepting a position at Qualcomm only as a last resort if nothing else is an option, this is especially true for software engineers.",
        "advice": "The company is not structured in a pyramid where engineers are the largest portion of employees. There are more managers/directors/Program Managers doing nothing other than attending pointless meetings than there are developer engineers. This needs to be addressed for future profitability.There is a negligible compensation difference between high and low performers which kills the motivation to work hard; mer… it increases are pretty much non-existent. Effectively high performers are being forced to change jobs. Using the San Diego location as an excuse for keeping wages low is not the way to go apparently.CEO, Chairman of the Board and President positions need to be consolidated to a single person which would save on an enormous cost and make the company more profitable and enable agile decision making. Similarly number or Directors and VPs and managers need to be reduced.And the most important point; matrix management only complicates the business life, it has no benefit whatsoever. Another point is people working in one project need to have their offices very close to each other. Having multiple people working in completely different projects sitting in one office is just inefficient.",
        "pros": "Depending on the group work life balance can be overly good.If interested in wireless communications lots of classes, trainings",
        "summary": "Bad management, poor/non-existent future prospects",
        "role": "Engineer",
        "date": "Dec 25, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bad Management, Arrogant technical people, they think they invented everything from fire onwards",
        "advice": "Resign and let new people to take over, When Irvin was at the helm was indeed the growth and opportunity period .. ancient history now.",
        "pros": "Used to have Job stability",
        "summary": "Horrile experience",
        "role": "Engineering Program Manager",
        "date": "Dec 31, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Company side chaos, leadership shuns most advice.Health benefits, bonus, merit increase has been slashed to almost zero.Employees pay 100% of $3000 before insurance covers $0.01",
        "advice": "Where to begin....",
        "pros": "No Pros. CEO has no vision. Morale is all time low since 2008.",
        "summary": "Declining conditions",
        "role": "Senior Engineer",
        "date": "Jan 2, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Rampant nepotism and politics.Outdated tools and processes.Highly specialized job roles that are not good at developing portable skillsManagers are power arrogant, unprofessional with no people skills.",
        "advice": "Promote balanced engineers with both technical and people skills.",
        "pros": "Good benefitsEasy place to hideUnchallenging assignmentsFlexible hours.H1B friendly and job security is high as long as you drink the kool-aid.",
        "summary": "Once a good company, not anymore",
        "role": "Staff Systems Engineer",
        "date": "Jan 4, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "not sure about other teams but for us, no innovation, no scope to learn anything. doesnt add any value to your resume. no proper channel to assign work (work doesnt get assigned by your lead. anyone with an equal or higher title can walk up to your desk and dump work on you and your lead will be totally in the dark). about more than 95% of the work is unnecessary and can be automated. matrix management system is the … worst way to review an engineer. the manager drafting your performance review has no interaction with you on a daily basis. a week before the review, you will be asked to summarize everything you worked on during the last review period. this causes many people to spend 10% of their time working and 90% of their time projecting their work and making sure everyone THINKS he/she works too hard. the perfect recipe for disaster",
        "advice": "you cant change anything. its beyond repair.",
        "pros": "i dont see anything that you wont find elsewhere. only pro i can think of is you have a job and you are getting paid regularly",
        "summary": "not a good place to work",
        "role": "Senior Software Engineer",
        "date": "Jan 18, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Weak management - unwilling to make big/risky moves",
        "advice": "Need to look beyond hardware and embrace the playbook being used by the likes of GOOG/FB/AAPL to stay head (hire the very best; go outside your traditional strengths etc)",
        "pros": "Some real gems in the engineering team",
        "summary": "Need for a shake-up",
        "role": "Anonymous Employee",
        "date": "Jan 28, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lack of Vision , To Heavy Weight, more status collectors than exection",
        "advice": null,
        "pros": "wireless champion, lot of new products",
        "summary": "Too Heavy Weight",
        "role": "Senior Staff Engineer",
        "date": "Jan 29, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Company will bring H1-B or L1-B employees to the USA to fill positions that current US staff are more than qualified to fill...People in leadership roles that have no business holding such a positionLOUSY team culture!! This is a shame as once it was quite a bit different...Limited direction from management as to potential paths to proceed, but the same management is very quick to assign blame when projec… ts go awry.Inability to listen to customer requirements and adequately understand decisive next steps.Too many relatives of senior management are hired with little to no experience",
        "advice": "If you are going to keep your CEO, teach hi to not stammer all over his words when he is not being truthful. Get rid of the activist investment company that you so gleefully crawled into bed with, they are going to choke your company for all it is worth and leave little to nothing when they decide to sell off and leave. Focus on the people that produce the work product...they are the ones who made Qualcomm a great pl… ace to be a part of. Seek out and eliminate useless management...it is pretty easy to spot...you just need to open your eyes a bit wider...",
        "pros": "Flexible schedules that allow for time off for various family commitmentsGreat benefits (this actually died in 2016 when the plan was changed to a Bronze level)There are a lot of really talented and intelligent folks here...you have a great opportunity to learn a lot",
        "summary": "It is a shame that Irwin Jacobs has to watch idiots wreck what he built",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Fear is in the air. Innovation culture is rapidly deteriorating. Lots of smart employees are leaving or planning to leave within the next month. Qualcomm underestimated the number of engineers leaving for other tech companies and the bureaucrat senior level directors who survived are simply followers versus leaders. Right now, its not an attractive place for new, young technically savvy employees who would rather fin… d a company that has a strong future vision.",
        "advice": "Stop taking a short-term view with all the cost cutting measures to save the stock price and provide more transparency to your employees.",
        "pros": "You may still find pockets of good teams who can still provide some good experience and learning opportunities.",
        "summary": "Going Downhill Fast",
        "role": "Senior Staff Engineer/Manager",
        "date": "Feb 9, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "It's a hardware company so beware. If you're a software guy there is no future/career track. If you can't design a chip you'll be second class. Period. Every other type of engineer gets shafted to 2nd-class status in the company. As a result the vast majority of mgr's are politics driven and you see this every day and sucks the life out of the employees. There are also lots of dead weight because of this as well.",
        "advice": "Fire all the bozos. Seriously. Find the real value creators and promote them.",
        "pros": "Qualcomm has the best benefits in San Diego out of any company in the area and this alone makes it attract to work there. That's pretty much it.",
        "summary": "Good benefits, too top-heavy, cheap bonuses, LOTS of politics",
        "role": "Senior Engineer",
        "date": "Feb 23, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "there is disaster to work for this company.",
        "advice": "must be replace with new one",
        "pros": "there is no beneficial to work for this company.the company is totally off market.",
        "summary": "Senior Engineer",
        "role": "Senior RF Design Engineer",
        "date": "Feb 29, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Steve, Paul and entire Management team has poor vision. They don't know they are not up to mark. They cannot visualize the future of technology. They are OUT of ideas and so now they have resorted to copying.- As the company looses market, they are cutting costs everywhere and punishing employees.- Due to a Poor Brand Image and lack of vision the products in a few years are going to suck more.- The crea… m (best of the best engineer/other staff) are gone/leaving. What is left is un-qualified people who are highly political.- Racism is high and each team is polarized with people from the same race.- Beware if you are an engineer/senior/staff : Managers will use you and dump you after they get promoted.- Poor Work Life Balance and Un-ethical colleagues.- No bonus/RSU and promotions for 2016.- Software Engineers can learn nothing at Qualcomm.- Work Quality Standards are lowering each day: Jobs are moving to China/India.",
        "advice": "- Respect your engineers.- You had the best talent and you are loosing them with your decisions.- Deliver 2 High Quality chips rather than 200 average ones.- Average chips will not sell as mobile industry is highly competitive.- The best of the best companies are innovating and hunting talent and cutting perks is helping engineers move.- Partner with Smart next gen companies (not just companies wh… o are your stupid friends).- Many acquisitions are made because they are friends of Qualcomm execs and they are not good almost each time. The acquired company is full of stupid managers/directors who cannot manage smart engineers.- Cut out Racism in hiring.",
        "pros": "- HQ is located in a good City.- Modem R&D Technology hub- 401k matching is the only benefit left.- Best Medical Plan (gone from 2016)- Competitive Cell Phone MarketObservation: Glassdoor has listed conflicting pros and cons for Qualcomm: pros 'good work life balance' and con 'bad work life balance'. It could be due to fake reviews from Qualcomm officials who are desp… erate to cover up. Speak to an actual employee working at Qualcomm before accepting an offer. Also each team is different.",
        "summary": "Management cuts costs and loses the Cream",
        "role": "Senior Hardware Engineer",
        "date": "Mar 5, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Promotion is hard, no work life balance",
        "advice": null,
        "pros": "Health benefits are good. Environment is open.",
        "summary": "Senior Engineer",
        "role": "Senior Engineer",
        "date": "Mar 13, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Benefits slipping, department processes unravelling, management over department non-existent, and knowledgeable forward-thinking leadership at senior and middle management level absent. Company is in survival mode and cutting expenses everywhere, moving jobs overseas to India and China, often with little understanding of the functions being eliminated. Morale awful after 45% department layoff. Favoritism, nepotism bi… g players in layoff.",
        "advice": "Take leadership classes, learn from companies like Google what management means, how it can make a supreme difference in productivity and creativity. Step up to this century. Care about your department and its people beyond your own skin. Stop worrying about the glorification of your own career at the expense of department success. Make a difference. Do something.",
        "pros": "Compensation excellent. Some hard working people still trying to make a difference, despite leadership decisions that have led many to the exits, both voluntarily and from layoff.",
        "summary": "Technical writer",
        "role": "Anonymous Employee",
        "date": "Mar 13, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Too many office politics not enough strategic business thinking and problem solving. Hours are spent on colorful presentations for management that are meaningless and useless. No project management process, practice, or appreciation for what real project management is.",
        "advice": "If you need colorful cartoon like presentations to help you understand your business maybe you don't belong in the business. At some point these dumbed down presentations you all crave so much just become dumb.",
        "pros": "Nice office environment, buildings are nice and well kept. There are some really gifted and talented people at Qualcomm who are very generous with their knowledge and time.",
        "summary": "Terrible no work life balance although they profess to care about people they don't.",
        "role": "Senior Program Manager",
        "date": "Mar 21, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "This company has a dis-functional HR. HR invests in writing ethic policies but without enforcement of those. They'll periodically send you forms requiring you to electronically sign that you must comply, so they are covered.Employees are leaving the company at a much higher pace now as the stock in lower. The reason is dis-trust in the company's values and such deployment of those. Previously they stayed for the … money, and they are voting now against the company with their legs. Employees resignation rate is significantly higher than the market average rate.Management further exhaust those who stayed behind with even worse unrealistic milestones and pressure to fulfill those. Very low volume of opportunities to move in the company.",
        "advice": "Respect your employees. Stop calling them 'bodies'. There are no replacements for everyone. Old school management worked for you when the stock was up, now go learn modern team management.",
        "pros": "The pros is a work place if you want to live in San Diego, as other companies has been moving offices out of town.",
        "summary": "Design verification manager",
        "role": "Staff Design Engineer",
        "date": "Mar 31, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No longer the best place to workStock grants under Director levelManagementI.T. support",
        "advice": "There are many people in the position to \"manage\" others who are ridiculously underqualified and can better use their \"skills\" to look after their kids instead of being given authority to direct or manager a group of professionals. Instead of worrying about the stock price and the millions of dollars you are making from it, maybe try to do your job and fill your company with quality people by doing a better job scree… ning outsiders. Instead, you'd rather worry about which sports car to drive to work today. The company has been infiltrated with poor managers the last 10 years, and that is why your company and business are collapsing from the inside out.",
        "pros": "Profitable companyCan take 2 hour lunches and nobody will notice401k match",
        "summary": "Best days are behind it",
        "role": "Anonymous Employee",
        "date": "Apr 9, 2016",
        "is_current": false
    }
]