[
    {
        "rating": 5,
        "cons": "There's a lack of process and structure in a lot of areas. We've grown very rapidly, and a lot of practices that worked well when we had fewer people don't work as well now. Be prepared for uncertainty and last minute changes on any project you work on. Also be prepared for some last minute scrambles to meet deadlines.Since our IPO, there's been a certain amount of focus on cost-cutting and other measures to … keep our stock price up, which could become troubling if carried too far.",
        "advice": "Don't do silly things just to keep the stock price up.",
        "pros": "Working at VMware, you get to make fantastic products and work with lots of smart, competent, helpful, and fun people. I've had lots of opportunities to expand my skills, and I think that VMware will be a good place for my career growth for quite some time to come.",
        "summary": "A great place to work if you don't need too much structure...",
        "role": "Senior Technical Writer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not much I can think of ... But company size has grown too fast in last 2 years and some times hiring has not been up to so mark. The people hired before Q1 2006 are much more competitive (not always of course). Company is cutting down expenses on free lunches and dinners but rightly so as dinners were misused most of the time. Some times decisions are taken too fast in opposite directions and have kept developers on…  feet always to come up with new rapid strategies. Much more emphasize on competition in 2007 onwards so have to get best solution in minimal time and some times there is too much stress due to work but over all it is not that bad because management is cooperative so they give you time off if you have worked some week end.",
        "advice": "Don't cut our lunches please ....",
        "pros": "Fun Environment , Best People , Awesome Management , Opportunities to learn , Easy to switch roles , managers are really competent and not some from 90's . So many genius people around that some times you feel you are not worth of your life. The new campus makes you awww. HR is very cooperative. Efficient departments , not much red tapes , provides developers the bets of the best machines on a day notice , no money i… ssue for such things ,some people has got 200$ key boards and 200$ head phones in past. Management tries consciously to keep developers happy. Flexible hours of work , can work remotely ...",
        "summary": "Proud to be part of this VMware",
        "role": "Member of Technical Staff",
        "date": "Jul 1, 2008",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Seems to be getting too big. A lot of positions arent really needed and could be scaled back. Well see what happens if there is any kind of reorg.",
        "advice": "Be aggressive towards the competition. We have the best technologies and we need to make sure everyone knows that.",
        "pros": "People at vmware are some of the brightest employees ive ever had the opportunity to work with. Most are passionate about the products they create and are dedicated to producing high quality results. Pretty good benefits...pretty standard. The campus is nice and there's supposed to be an indoor gym coming next year. Well see how that affects work productivity. Free snacks and drinks in each building. Besides all the … perks, i would have to say the best reason to work for vmware is the technology we have created and the new technologies that you will see in the near future.",
        "summary": "Anonymous employee",
        "role": "Anonymous Employee",
        "date": "Sep 4, 2008",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes, people make a mess in the kitchen. That gets kind of annoying. Other than that, I can not really think of much that's bad about working at VMware.",
        "advice": "I would recommend senior management make more effort at expanding their leadership development program. There is a lot of potential currently being wasted because of a lack of a more structured leadership training program.",
        "pros": "The passion and dedication shared by all the VMware employees make this company a great place to work. Everyone shares a similar work ethic, and the company is open to people expressing new ideas. The company is good at recognizing potential and promotes that potential. This makes Vmware a great place for new and upcoming professionals hoping to jumpstart their career.",
        "summary": "VMware is a great place to work. No doubt about it.",
        "role": "Manager",
        "date": "Dec 2, 2008",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There's a lot of leftover dead wood from when the company was an acquired backwater. Diane Green kept around a lot of people who were in over their heads (in PR, in field marketing, etc.) and unfortunately, those folks ended up hiring a lot of other folks like them. They are still around. This is changing, slowly, with incompetents being tossed out under the new Maritz regime. However, it's the poor hires that impact…  company performance at this point, and who frustrate, and block stars from actually getting things done.",
        "advice": "Devolve power. Get out of the way. Focus on unwinding the mistakes that were made on the go-to-market org under Diane Greene. Make the marketing / business side of the house as strong as engineering talent, and this company will be unstoppable.",
        "pros": "Amazing products. Sharp engineers. Some sharp business folk, product marketing, product management, etc. Great location. Chance to really, really impact how computing is done in the future. VMware is the most important company you've never heard of, on its way to sitting at the table with Intel, Google, and Microsoft.",
        "summary": "VMware's getting there...slowly. Still has a ways to go.",
        "role": "Senior Product Marketing Manager",
        "date": "Dec 20, 2008",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Communication - VMware is not good at communicating internally. There have been a few occasions when sales learned of product releases from customers. Processes - The broken internal processes are often a sales inhibitor.",
        "advice": "Don't let Finance run Sales. The renewal process is still broken, fix it. Facilitate more communication between engineering, sales & marketing. Not just at the high level, but at the mid & low level, too.",
        "pros": "In sales you get to work with a fantastic product that people want. My peers make coming to work fun. We help each other learn and overcome obstacles. We're able to strive for over-achievement while maintaining a positive, light & fun work environment. Entry level management is supportive and positive.",
        "summary": "Great Product, Great People, Frustrating Processes",
        "role": "Inside Sales Representative",
        "date": "Oct 8, 2009",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The only downer so far this year is that the office is shutting down the weeks of Thanksgiving and Christmas and we are required to take vacation.",
        "advice": "Keep focused on technology. I've been at other similarly sized companies that milked their patented technology and lost a lot of innovative engineers and managers.",
        "pros": "Despite its size VMWare is still an engineering-centric company. Even though they have a lion's share of the virtualization market they are not resting on their laurels but committed to promoting R&D. They also have a great work environment: brand new buildings with lots of light in the offices, kitchens stocked with healthy food, organic fruit delivered multiple times a week and a subsidized on-compus fitness ce… nter that includes weight machines, a squash court, several basketball courts, aerobic exercise machines and a soccer field. They also have an expansive cafeteria with a sushi bar, Indian food, Mexican food, a grill and much more.",
        "summary": "Still Innovative",
        "role": "Member of Technical Staff",
        "date": "Nov 3, 2009",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Company has grown so fast, yet is still immature in many ways. Leadership team is working on the issues, but with all of the change happening, it's taking a while.",
        "advice": "Invest in people as much as you invest in ideas and technology. Be clearer about the specific direction and objectives of the company so the rest of us can make sure we're tackling the right issues.",
        "pros": "There is still a premium placed on innovation in the company. The company and products truly have and are changing the industry, and it's good to be a part of that.",
        "summary": "Great company, great people, still immature",
        "role": "Anonymous Employee",
        "date": "Nov 4, 2009",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- VMware has become a huge company. Importance of personal contribution is not valued as much.- Switching between teams is not a easy task.",
        "advice": "Keep up the great work on the vision for the future. It is important that execute on it. In order for the execution to go right, it is important that the best folks are retained.",
        "pros": "- VMware has an incredible vision and growth story- Great colleagues- The best always get an opportunity to grow.",
        "summary": "Great Story! Great Company!",
        "role": "Senior Member of Technical Staff",
        "date": "Jan 17, 2010",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Company is growing fast (even during the recession they added engineers). This leads to some problems in scaling processes. They will figure it out, i am sure.",
        "advice": "Keep inspiring your employees!",
        "pros": "Bright people, challenging work and lots of scope to grow your career if you are self motivated",
        "summary": "Awesome place to work",
        "role": "Anonymous Employee",
        "date": "May 12, 2010",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Reorgs causing confusions.would like the managers to be more transparent with new projects.also would like to see more money invested on research",
        "advice": "keep up with the quality of work and you wont face any problems..keep recruiting intelligent students from universities.. invest more and try to improve the micro kitchen..how about offering free food? :P",
        "pros": "Growing big.Lots of intelligent people aroundGreat perksvery flexible with your work timingvery good for people who are interested in systems..esp studentsNice food",
        "summary": "Amazing technology to work for",
        "role": "R&D Cloud",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Gaining 15lbs in the first couple of months.",
        "advice": "Keep in touch with the employees.",
        "pros": "The company is making adjustments to clean up a lot of the prior problems. For a recent IPO and shift in senior management team VMware is providing a great opportunity to work with not a lot of hand holding.",
        "summary": "Thumbs up",
        "role": "Recruiter",
        "date": "Jul 14, 2010",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Growing very fast means that there are a lot of new people that you do not know.",
        "advice": "Keep doing what you are doing. I love working here!",
        "pros": "Great Atmosphere. Fringe benefits are amazing; Soda, snacks, lunch on Fridays, breakfast on Wednesday. Great place to work!",
        "summary": "Love it",
        "role": "Technical Support Engineer",
        "date": "Jan 3, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The biggest con is how difficult it is to move up in the ranks beyond SR MTS. The company is also an adolescent company and has its share of growing pains",
        "advice": null,
        "pros": "VMware is a company that actually supports and encourages its employees to be innovative. Upper management actually listens to the R&D staff.",
        "summary": "Innovation strongly supported",
        "role": "Staff Engineer",
        "date": "Jun 13, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Internal IT tools not up to par as other companies, this definitely needs improvement",
        "advice": "Continue to invest in the employees and their developmentReview pay to make sure employee's pay are up to par with industry - VMware is doing well",
        "pros": "Decent pay in comparison to industryGreat stock performanceExtremely supportive senior management teamGreat benefits, free expresso, free breakfast, free fruits and bagelsGreat coworkers",
        "summary": "Great place to work, enjoying the ride!",
        "role": "Senior Product Manager",
        "date": "Jul 2, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The job can be intense, no matter what position you work as.",
        "advice": "Keep the vision alive and well for the next 20 years.",
        "pros": "Work/life balance. Beautiful Palo Alto campus. High salaries. Great leadership. Products that will change the world.",
        "summary": "A new-age company that can and will become the next big global tech giant.",
        "role": "Anonymous Employee",
        "date": "Sep 2, 2011",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Some team has some politics.",
        "advice": "System thinking",
        "pros": "Nice office space, friendly people",
        "summary": "Best Employee I've been worked with",
        "role": "Anonymous Employee",
        "date": "Oct 3, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Due to rapid growth, VMware is undergoing some noticeable growing pains, however I am confident that these will be resolved.",
        "advice": null,
        "pros": "- Interesting projects- Excellent compensation- Great opportunity for growth- Smart people- Modern development techniques and use of best practices- Company is rapidly expanding",
        "summary": "Excellent",
        "role": "Software Development Intern",
        "date": "Nov 28, 2011",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I work from 10 - 7 PM - would like more classic hours. It has not always been clear regarding what needs to be done to move up the career ladder here. We are busy!",
        "advice": null,
        "pros": "Work life balance is excellent. When my day is over no one expects me to answer a phone call or reply to an email. VMware GSS hires mainly by cultureand as such we have a great team of people to work with. Compensation is fair and the benefits are great.",
        "summary": "Enjoyable people and fun work.",
        "role": "Senior Technical Support Engineer",
        "date": "Dec 8, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Difficultly communicating between departments. A lot of groups are very secretive about their internal knowledge.A big company that doesn't have a lot of established protocols, sometimes getting data or processing paperwork can be very cumbersome.",
        "advice": "Promote more openness and communication between departments",
        "pros": "Good work life balance, good people, AMAZING food.",
        "summary": "Good Work Life Balance, amazing food.",
        "role": "Anonymous Employee",
        "date": "Jan 1, 2012",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "might be hard to get quickly promoted",
        "advice": "Just because they have a near perfect GPA does not mean they are good team players. Hire someone based off their personality not just their transcript... it's only an internship",
        "pros": "1) salary. I was making more than any of my classmates2) Environment... almost everything was free3) As an intern, the intern leaders were extremely helpful and supportive and responsive of feedback",
        "summary": "Best internship ever....?",
        "role": "Member of Technical Staff Intern",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Lot of churn in upper management creates uncertaintyCompany is growing big really fast; need to be careful to hire the right talent",
        "advice": "Make sure compensation is fair with relation to industry standardsContinue culture of innovationContinue building talent from within company",
        "pros": "Flexible working environment - flexibility hours and the ability to work remotely; management is extremely supportive of thisExtremely talented staff; some of the smartest engineers in the industryGreat support from upper management",
        "summary": "Great company! Lots of talented and smart people. Great work life balance",
        "role": "Senior Product Manager",
        "date": "Jan 19, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Salary could be higherRate of QA Engineers to developers is 1:2, so Developers have to take more efforts to maintain quality.",
        "advice": null,
        "pros": "Edge technologies that you can involve toPerfect campus without too much extrasNo pressure on employeesSupport of self development",
        "summary": "Various tasks in convenient environment",
        "role": "QA Engineer",
        "date": "Mar 20, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "A lot waste of hardware while every year employee get claim new hardware but the old hardware just sit there consuming energy. but probably same with all other companies.",
        "advice": null,
        "pros": "state of art technology, the company agility follow innovations. great work culture and smart people to work with. Good at retain employee.",
        "summary": "A great company to work with",
        "role": "Performance Engineer",
        "date": "Apr 6, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Finding your niche takes some time, so look around once you get in and find that spot where you will be most happy.",
        "advice": "Encouraging professional growth through changing positions within the company is on the surface an excellent initiative. However, internal transfers are more problematic than you may think. Suggest you interview people who have done it, or tried to do it, and perfect the process.",
        "pros": "Freedom to do the best job I can without time-consuming administrative tasksSome excellent managers within this large company--if you get one, you are blessed!Telecommuting is usually supported for some number of days per week",
        "summary": "I am surprised to find that I like being at VMware this much--working at VMware is rewarding on many levels.",
        "role": "Anonymous Employee",
        "date": "May 19, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "\"Legacy\" salesreps are getting lazyTraining is not as good as we'd like",
        "advice": "Plan for new-hires. The current onboarding plan is meh. We need to spend more time getting the new people up to where they need to be to contribute. Also - don't lose the \"startup\" freebies like free food, drinks, etc. Those are the reasons why people tell their friends they should work here.",
        "pros": "Salary is high compared to other companies in AustinBeer, Taco, and Wing FridaysPeople work here because they want to - not because they have to",
        "summary": "Solid place to work - I feel good coming in every day",
        "role": "Anonymous Employee",
        "date": "Jul 3, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing that I know of",
        "advice": "Nothing. Just keep up the great job",
        "pros": "Excellent opportunities which are wide open to all the employees. The company encourages internal movement between teams.",
        "summary": "A great company to work for",
        "role": "Senior Business Analyst",
        "date": "Jul 12, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "long drive to work and no telecommuting",
        "advice": "ALlow employees to work remotely",
        "pros": "Awesome, nice benefits, nice people wonderful work environment",
        "summary": "Senior VP",
        "role": "Vice President",
        "date": "Jul 12, 2012",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Growing fast so at times infrastructure falls behind. At time you loose time dealing with the issues associated with lack of internal systems to support day to day tasks.",
        "advice": "Keep thinking out of the box!",
        "pros": "A great product with a real ROI for customers. Leadership has heart and true vision. Leadership truly cares for the team. I have worked for many companies but VMware just keeps on getting better",
        "summary": "Sales",
        "role": "Sales Representative",
        "date": "Jul 14, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes outrageously aggressive deadlines and competing projects all landing at one time. More administrative headaches for managers that typical",
        "advice": null,
        "pros": "Cutting edge technology, creating a new future for IT, nice Palo Alto campus",
        "summary": "Intense but exciting",
        "role": "Senior Manager",
        "date": "Aug 10, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No Cons that I can think of",
        "advice": null,
        "pros": "Cutting edge technology and good compensation",
        "summary": "Excellent company to work for",
        "role": "Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I do not have any cons",
        "advice": null,
        "pros": "The PeopleHot MarketMarket LeaderWork/Life Balance",
        "summary": "VMware is the best company I have ever worked for.",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None that I can think of",
        "advice": null,
        "pros": "- Smart people all around- Lots of learning opportunities- Had an awesome manager- Always in the middle of innovation",
        "summary": "One of the best companies I have worked at",
        "role": "Project Manager",
        "date": "Sep 11, 2012",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "- the fast pace might not be for everyone- start to see some early signs of corporate politics/bureaucracy. Not necessarily VMware's culture, this seems to come with people who're hired from much bigger companies",
        "advice": null,
        "pros": "- very fast pace- lots of opportunities to make things happen- have awesome manager- leader in marketplace- so much opportunities to move around and leadership encourages",
        "summary": "One of the best companies in my career",
        "role": "Senior Manager",
        "date": "Sep 13, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The pace if very fast and learning the products and all related subjects needed to do your day to day job is like drinking from a fire hose.",
        "advice": null,
        "pros": "Healthy support structure for personal and technical issues. Very responsive logistics and HR staff that typically resolve questions or issues within hours.Very reasonable health care and related. Very competitive pay. Food is often served for local vendors and the kitchens are stocked with snacks and drinks.",
        "summary": "Fantastic appreciation of their employees",
        "role": "Technical Support Engineer",
        "date": "Oct 5, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Growing too fast now, processes are not in place, it's up to individual contributor's QOS.",
        "advice": "Keep the vision and execution",
        "pros": "Fantastic technologies and productsLots of smart peopleExcellent work environment and free foodsYou are not paid less because you have not asked for more or you were under-paid before in other company, as long as you can do it",
        "summary": "Great company to work for",
        "role": "Senior Member of Technical Staff",
        "date": "Oct 5, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "its in the hills of palo alto",
        "advice": "keep up good job",
        "pros": "1. Great minds to work with2. Great pay3. Best work place of year 20124. great culture",
        "summary": "Great place to work",
        "role": "Member of Technical Staff III",
        "date": "Oct 30, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There are no cons. Loved the people, locations, free food. Club Trips were great. This is a no brainer of a place to work and build a life long career.",
        "advice": null,
        "pros": "A great place with great people in a great town. Great! Great! What more can be said. If I ever choose another company, this would be it.",
        "summary": "Great Place",
        "role": "Executive",
        "date": "Dec 3, 2012",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Hire too many people in management roles outside of the company instead of promoting from within. Limited travel budget so I meet with my team in person only once a year. The rest of the time is via webex",
        "advice": null,
        "pros": "Fabulous work life balance. Little to no work on weekends. Great culture. Continues to grow in size so a lot of opportunity to try different jobs. Moves very fast so you are never bored. Great direction from senior leadership. Everyone I work with is top notch and over achieves therefore you do not have to pick up the slack for someone else",
        "summary": "Great for people who life a fast paced environment.",
        "role": "Anonymous Employee",
        "date": "Dec 29, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Cannot really think of any Cons",
        "advice": null,
        "pros": "Excellent Place to work, Great Company",
        "summary": "VMware Review",
        "role": "Senior Software Engineer",
        "date": "Jan 21, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Sometimes confusing upper management messages/decesions",
        "advice": null,
        "pros": "work on challenging projects, interact with different stake holders in eco system",
        "summary": "Fun place to work at!",
        "role": "Member of Technical Staff",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "They hired a lot of people over the last 2-3 years and lot of politics has creeped into the system. I hope they change and fix it soon.",
        "advice": null,
        "pros": "It is a great place to work. People are extremely smart and technical. Great pay masters. Great work/life balance.",
        "summary": "VMware is a great place to work",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not a lot of career advancement, need to shed managers from old VMware days.",
        "advice": "Time to change!",
        "pros": "Technology is rock solid and engineering cranks out innovation.",
        "summary": "Great place to work with innovative technology, not a lot of career advancement.",
        "role": "Senior Systems Engineer",
        "date": "Feb 18, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Weak release management. Need more transparency with respect to decision making.",
        "advice": "Stop doing periodic re-orgs, stop acquiring \"cloud\" start-ups and concentrate on core virtualization.",
        "pros": "Compensation + Benefits. Nice campus. Smart + helpful people.I work in the Networking & Security business unit and it has got pretty good work culture. You have a freedom of choosing projects that you want to work on.",
        "summary": "Good company to start your career",
        "role": "Member of Technical Staff II",
        "date": "Feb 21, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "1. Must be focused. No one is responsible for your career. You can stop learning and get lay off someday and can't find new job if you just keep complaining and do/learn nothing.2. Do what you have to do and LEARN. Don't be a brown nose and tried to cater to boss but learn nothing.3. Need more drive force to innovation. Don't talk but DO.",
        "advice": null,
        "pros": "1. Good culture so far2. Balanced life3. Nice pay4. Great place to sharp your skills and give back to the products5. People are nice",
        "summary": "MTS",
        "role": "Member of Technical Staff",
        "date": "Mar 28, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not many cons here. The training wasn't top notch right in the beginning but now there are endless amounts of training available.",
        "advice": null,
        "pros": "Best work environmentManagers invest in personal and career developmentClear goals are set and advancement within VMware is highly encouragedOpen to new ideas to promote a more efficient workforceThe product is well received. People want to receive calls from VMwareThere is always a new challenge - products are always improving and there is always something new to bring up in customer discussions",
        "summary": "Exceptional work environment - rewards hard work with advancement opportunities",
        "role": "Anonymous Employee",
        "date": "Apr 18, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Salaries can be underwhelming depending on your job responsibility.",
        "advice": null,
        "pros": "Market leader in virtualization space.",
        "summary": "Fantastic company",
        "role": "Anonymous Employee",
        "date": "Apr 25, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Still a relatively young company so not everything is set in stone yet, if you like process this is probably not your place. If you don't have a voice then this not your place.",
        "advice": "Remember your still growing our market.",
        "pros": "The people are very easy to work with, the technology is cool. great hardware to work with and we are well supported by management.",
        "summary": "Awesome Place to Work",
        "role": "Senior Consultant",
        "date": "Apr 29, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Need more time to form judgement",
        "advice": null,
        "pros": "Excellent Team,Great atmosphere to ask questions and learn from others,",
        "summary": "This is \"THE\" company for me~",
        "role": "Software Engineer",
        "date": "May 12, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "All of your friends will constantly harass you about getting them jobs!",
        "advice": "Continue to reinforce the cultural atmosphere. It is what gets top talent to come to you!",
        "pros": "The culture is amazing. They want their employees to feel nurtured and appreciated. Look forward to a thorough training process and plenty of chance for internal growth. They stress community involvement and giving and support that mission. This company \"walks the walk\".",
        "summary": "Progressive company, great culture and opportunities!",
        "role": "Human Resources Source Representative",
        "date": "May 24, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "parking is terrible, they are growing faster than their physical space.",
        "advice": "don't low ball new hires.",
        "pros": "friendly place to work, lots of interesting people",
        "summary": "excellennt",
        "role": "Escalation",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Need to staff up faster and not push new products out the door without enough QA.",
        "advice": "Hire more people",
        "pros": "Great benefits, lots of training, positions to grow into",
        "summary": "Great environment with tons of opportunities.",
        "role": "Senior Technical Support Engineer",
        "date": "Jun 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Teams work in silos, not as collaborative as some might like, no free breakfast/lunch",
        "advice": null,
        "pros": "Smart people, great pay, benefits, paid training, paid commute, opportunities for advancement",
        "summary": "Smart people, great pay, opportunities for advancement",
        "role": "Web Developer",
        "date": "Jun 13, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "none !! however living expenses are high",
        "advice": ".",
        "pros": "Excellent place to work. Work life balance is superb",
        "summary": ".",
        "role": "Anonymous Employee",
        "date": "Jun 14, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Engineers can be stubborn and think they should own user experience design.",
        "advice": "Keep doing what you are doing. The shareholders love it.",
        "pros": "I loved worked on amazing products with amazing people and having the opportunity to build out a team there.",
        "summary": "VMware is a great company!",
        "role": "Manager, User Experience",
        "date": "Jun 20, 2013",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Long wait for your first paycheck. Make sure you know when yours is coming!",
        "advice": null,
        "pros": "8 week, comprehensive on-boarding program. On-going technical training. Fun, collaborative environment. Technically challenging.",
        "summary": "New here, but feel like I won the job lottery!",
        "role": "Technical Support Engineer",
        "date": "Jun 20, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "lunch is not free as some other companies",
        "advice": null,
        "pros": "very good people and very nice environment",
        "summary": "Very cool",
        "role": "Anonymous Employee",
        "date": "Jul 22, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The downsides of VMware really have not caused a huge issue as there is constant work to resolve those issues. Like any company, it's not perfect.",
        "advice": "Keep breaking down the silos, it is helping",
        "pros": "TrustObjective Based workFlexibleManagement listensOpportunity to grow and move up the chainThis is a great working environment to create something amazing, then do it again.If you are driven, you can succeed here",
        "summary": "I would do this again",
        "role": "Anonymous Employee",
        "date": "Aug 9, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Aggressive timelines and too much to do.",
        "advice": "Be proactive.",
        "pros": "Best talent in the industry, innovation focused, lots of opportunity and interesting work to do.",
        "summary": "Great place to work!",
        "role": "Manager",
        "date": "Aug 10, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Some of the organizations and their leaders are overly political and put personal ambition above team success and respect for people. The vast majority of the Engineering teams are still run like a startup, but that does not scale given the current number of employees, the majority of whom now reside outside of Palo Alto.",
        "advice": "Pay attention to the employee surveys and take action to ensure that the BU leaders share the same values as the executive team. Focus on Execution over flashy Vision that has yet to be delivered.",
        "pros": "Fantastic pay and benefits - probably one of the best overall compensation packages you can find. The executives also genuinely encourage the employees to give back to their community.",
        "summary": "Great company to work for, but some organizations are better than others.",
        "role": "Manager",
        "date": "Aug 22, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Middle management personnel who make commitments to get performance and then do not come through on their commitments.",
        "advice": "Keep up the great work ! the new strategies are necessary and working.",
        "pros": "Simply one of the best software companies on the planet today. Great technology, great global customers and great global business partners.",
        "summary": "World Class Software Company and Innovator",
        "role": "Director",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "- Politics and senselessness rampant throughout engineering leadership- engineers cannot regularly work from home.- New executive team is more focused on stock price than innovation- Segmentation of products - product teams are too silo'd from eachother.- Currently, in the midst of an exodus of great talent from Steve Harrod, Bogamil, as well as middle management. The smartest leaders are leaving...bu… t it doesn't stop there. VMware is losing the most talented engineers to start-ups and other corperations (IMO) because innovation has dried up. Engineers are tired of integrating software and want to get back to building fresh ideas.",
        "advice": "Focus on innovation and stop copy-catting. VMware has fallen behind the innovation train and it's using its bank account to acquire IP to catch up. Then, burning engineering time integrating acquisitions into the product portfolio. VMware needs to get back in the leadership role of the industry. They've been doing this for a long time, but it's become the norm",
        "pros": "Brilliant EngineersOpportunities to learn - tons of resourceful people you can learn fromBenefits - great health plans, great 401k options, and great perks, MSDN accts for each engineer, Safari Books account for each engineer",
        "summary": "Great company, great benefits. In period of stagnation",
        "role": "Senior Quality Engineer",
        "date": "Sep 23, 2013",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Being a relatively new company, systems are not where they should be but getting there.",
        "advice": "Keep the start up energy, but embrace some more mature policies around talent acquisition.",
        "pros": "The people are smart, fun and making things happen. The pace is fast, the environment is electric and individuals are given ownership to make decisions. I'm very happy about my decision to join VMWare.",
        "summary": "Hit the ground running and love it!",
        "role": "Senior Manager, Human Resources",
        "date": "Oct 4, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "call stats are very annoying",
        "advice": "keep it up",
        "pros": "Staff, management, flexible schedule, great pay, all about career development",
        "summary": "Great organization, all about internal growth",
        "role": "Anonymous Employee",
        "date": "Oct 15, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work load is heavy. Communication is often lacking. But they are working on communication improvements.",
        "advice": null,
        "pros": "GREAT Benefits, It seems that every time I turn around, they improve benefits and add something else. Flexible work schedule, and working from home is great.",
        "summary": "Awesome",
        "role": "Technical Consultant",
        "date": "Oct 21, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Internal IT can be a little challenging, however the people more than make up for it. Being remote and figuring out all the ways that people communicate and systems that need to be connected to can be a little tough, but given time and helpful co-workers it works.",
        "advice": "Keep doing what you're doing.",
        "pros": "Great people, great products and great vision. VMware is full of amazingly talented and motivated people who are focused on making things happen. VMware's products are awesome and market leading and the vision of the SDDC is very real.",
        "summary": "Dream come true - wanted to work here for 7+ years and it's lived up to expectations",
        "role": "Senior Technical Marketing Manager",
        "date": "Nov 7, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Very high speed environment, poor work-life balance",
        "advice": null,
        "pros": "Great people, great technology, Many new opportunities within the company. There are some very good things happening at VMware today!",
        "summary": "Systems Engineer",
        "role": "Systems Engineer",
        "date": "Nov 9, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "As with many exciting, high energy jobs, you need to manage your work life balance and there can be tough times. So far, VMware has been great in this regard, but I think that's always a watchpoint when you're in a high adrenaline, high performing place.The other challenge is that VMware can be chaotic, so you need to have a good ability to navigate and figure things out on your own and teach yourself how to … fish. We are in the middle of streamlining and simplifying our strategy and internal tools and processes, but things can still be pretty casual and not necessarily that well defined.",
        "advice": "Keep intact the critical things that make VMware great (Heart of a startup, awesome groundbreaking products, smart people, casual & can do environment, freedom to crank out work without a ton of bureaucracy getting in the way).At the same time, continue the work you are doing to streamline and simplify our tools, systems, and strategy. Given 13 years as the worlds fastest growing software company, there a… re redundant tools, systems, and information. Getting that consolidated onto a common, simple enterprise set of tools, processes and capabilities without alienating customers, partners, or employees seems critical to enable the next phase of growth.",
        "pros": "Awesome people. Great collaboration with a minimal amount of bureaucracy. You can really dive in, roll up your sleeves and get things done quickly. I feel like I can be about 3X more productive at VMware than other places because theres' less politics. Having worked at a wide variety (15 or so) companies outside of Silicon Valley, I find that I LOVE working in high tech at VMware. I feel like I'm getting smarter and … learning from my colleagues every day, rather than getting stuck in a morass of politics and 'wait and see' like at many other places.I like the company's admirable green practices and charitable program (5 days of paid volunteer work annually, very good and flexible match program, etc.).The campus is beautiful (larger than disneyland, riddled with fountains and orchards, buildings are designed by some famous green architect and they are kind of hyrbrid indoor/outdoor), there are multiple delicious cafeterias and coffee shops around campus, good free snacks program if you're based in Palo Alto, restaurant-grade espresso machines in every breakroom so I'm fueled up on about 2-3 lattes a day, etc.The head people person in our roll-on iday said it well when she said that VMware works hard to keep the 'heart of a startup'. As a 4.5 billion $$ company, of course it's a lot bigger than a start up, but I think there's a really good opportunity to build tools, structure and process to enable the next stage of growth from 4 B - 8 B and I'm psyched to be a part of it.These impressions are based on having been a consultant at VMware for 18 months and now a full time employee for 3 weeks.",
        "summary": "My favorite company in 12 years of consulting-- delighted to have joined full time.",
        "role": "Senior Manager Change Management",
        "date": "Nov 22, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Too many meetings, just let us get the work done",
        "advice": null,
        "pros": "Everyone is friendly and everyone wants to hear your ideas",
        "summary": "Fantastic company to work at",
        "role": "Intern",
        "date": "Nov 27, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Some Overtime required, sometimes management takes very long to decide.",
        "advice": null,
        "pros": "Hi Energy, Innovative, friendly, respectful, transparent",
        "summary": "Good Place to Work",
        "role": "Anonymous Employee",
        "date": "Dec 14, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "So far I have not been able to find anything to complain about.",
        "advice": "Good job!",
        "pros": "Friendly co workersLots of free foodAmazing benefits",
        "summary": "Very laid back and comfortable place to work.",
        "role": "Member of Technical Staff",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Management vision a little bit confusing. Restructuring has apparently happened a few too many times. Coworkers generally older - mean age somewhere in the 30s if I had to guess. As a younger guy, this is a little awkward.Socially, people tend to stick with their teams and not branch out. People focused on work, so don't expect lunchtime conversation to go in another direction.",
        "advice": "Hire younger if possible. Try to keep things steadier and define vision in a clearer way rather than keep talking around it - it sounds like you haven't defined it yet and are just shotgunning words at a page.",
        "pros": "Good managers, good access to resources and learning opportunities. Smart, accessible coworkers that are willing to help you learn the industry/tools. Pay is good. Work life balance very good, in my case. Might change from team to team.",
        "summary": "Program Manager",
        "role": "Program Manager",
        "date": "Dec 19, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "> Virtual office can be challenging for those who are not disciplined and motivated.> Due to rapid expansion, there are still some processes and structure that is being developed on the fly.> Not a con, but if you don't like change and dynamic atmosphere... don't apply here.",
        "advice": "Keep up the good work! It is clear you care, and that is the most important aspect of motivating your employees.",
        "pros": "> Senior Management is top notch, sincere and accessible (pretty impressive for a multi billion dollar company)> Pay is competitive> Direct management is supportive and truly cares> I do not take their medical benefits, but they are amazing and cost effective> All \"A\" players, at least the ones I work with. Everyone is self-motivated and super intelligent",
        "summary": "Outstanding",
        "role": "Systems Engineer",
        "date": "Dec 22, 2013",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "-Gets very busy at times, but you do leave your work at the door",
        "advice": "Continue to listen to the grass roots needs and make changes accordingly.",
        "pros": "-Hire for culture first, technical ability second-Great place to learn-Free food and drink everyday, with big free meal on Fridays-Management cares about employees-Once you leave, you are not on call",
        "summary": "Learned all I know about IT from VMware.",
        "role": "Technical Support Engineer",
        "date": "Jan 2, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "You work hard, and some times a lot of hours at times, which can be tough on work-life balance. Despite being 15 years old, it feels like a startup sometimes.",
        "advice": "Don't wait until folks are giving notice as the first opportunity to fix the issues they bring you.",
        "pros": "Friendly smart people to work with. Emphasis on philanthropy and collaboration. Flexible schedule, Unlimited vacation time. They feed you!",
        "summary": "Great Culture; No drama!",
        "role": "Program Manager",
        "date": "Jan 9, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Pressure, stress, lack of training, staff attrition, onboarding poor",
        "advice": "Ensure staff go home on time",
        "pros": "Atmosphere, Pace, opportunities to develop, career opportunities, products, skills",
        "summary": "Awesome, love it!",
        "role": "Escalation Manager",
        "date": "Jan 14, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Many management layersbecoming a large company",
        "advice": "more investment of VMware software for internal consumptionflatten the layers as there are too many management layers",
        "pros": "challenging and engaging opportunitiespassionate co-workersstart up mentality",
        "summary": "VMware is an awesome place to work!",
        "role": "Director",
        "date": "Jan 17, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I cannot think of any.",
        "advice": null,
        "pros": "Top talent, great location and perks. They treat employees very well and there are opportunities for growth.",
        "summary": "Innovative company that always strives to be at the top of the industry.",
        "role": "Inside Sales Representative",
        "date": "Feb 2, 2014",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "There has never been any down sides at VMware.",
        "advice": "I would love to go back to work at VMware and take care of Vice Presidents and Customers",
        "pros": "VMware is a fantastic Company and all customers love their products.",
        "summary": "I always loved working for VMware and taking care of many Vice Presidents and their team members and very many customers",
        "role": "Executive Assistant",
        "date": "Feb 3, 2014",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "We are not as \"sexy\" a company as some of our competitors (Google, Amazon, and even Microsoft). As with most enterprise software companies, very long product cycles. Dependencies on the platform and/or other products.",
        "advice": "Figure out a way to decouple products from one another while ensuring tight integration between them",
        "pros": "Technology driven yet strategically focused. Large company but still retains a startup vibe/culture. The best campus in the valley, hands down. VMware promotes from within.",
        "summary": "Cutting edge technology that is transforming IT",
        "role": "Product Line Manager",
        "date": "Feb 10, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The environment will make you loss your enthusiastic.",
        "advice": null,
        "pros": "culture is good, and the salary. No stress",
        "summary": "Culture is good",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "some time work can be repetetive, sometime dev cycle can be slow also.",
        "advice": "be more careful while hiring",
        "pros": "nice place to work, great company, amazing campus, cool technology, good people",
        "summary": "MTS",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Large growth adds pain when trying to navigate the organization. Enough of the people in the organization are new that there are times that you don't get answers just because the person doesn't know who to ask. Fortunately, everybody is bright and there are no problems that can't be overcome.",
        "advice": "Add further structure to the customer support and problem resolution paths for internal employees to help streamline processes for customers where warranted. I've heard often that there was no resolution on a problem. To be fair, I haven't seen it first hand but it comes up enough from customers in conversation that it should be mentioned.",
        "pros": "People. VMware consistently hires sharp people. The company and the product are easy to represent.",
        "summary": "Great group of people to work with!",
        "role": "Technical Account Manager",
        "date": "Feb 27, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "I have not experienced any yet.",
        "advice": null,
        "pros": "I know everyone says it but the people make the place. People are there to help you out and it is a fun place to work. On top of that the company is growing with great products.",
        "summary": "Great culture, company and team",
        "role": "Human Resource",
        "date": "Mar 4, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "getting quiet big that sometime information can get lost",
        "advice": null,
        "pros": "the company has a very good management team, focused and result oriented",
        "summary": "Enriching",
        "role": "QE Manager",
        "date": "Mar 5, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No regrets about this company",
        "advice": null,
        "pros": "Great company to work for",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Mar 7, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There are no cons to date...",
        "advice": null,
        "pros": "Great people, work processes, products",
        "summary": "Exciting place to work",
        "role": "Anonymous Employee",
        "date": "Mar 11, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Bad bring up procedure! Not enough trainings",
        "advice": null,
        "pros": "great salary, benefits and challenging work",
        "summary": "Challenging, dynamic, rewarding!",
        "role": "Member of Technical Staff",
        "date": "Mar 14, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Big corporate feel means career advancement can be slow.",
        "advice": null,
        "pros": "Great work-life balance, great benefits and love the people I work with.",
        "summary": "Great benefits, work-life balance and people but big company means less opportunities to advance",
        "role": "Anonymous Employee",
        "date": "Mar 16, 2014",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None There is nothing bad about VMware, Overall a great place to work",
        "advice": null,
        "pros": "BenefitsWorking with smart engineersLeadershipTrainingRemote work",
        "summary": "VMware experience",
        "role": "Candidate Development Recruiter",
        "date": "Mar 21, 2014",
        "is_current": true
    }
]