[
    {
        "rating": 1,
        "cons": "Bloated bureaucracy. Arrogant middle management and senior engineers. Lack of career growth opportunities for QA engineers (absolutely no chance of switching from QA to Dev., no matter how competent). Protracted and stifling SW development process. Antagonistic relationship between QA and Dev. Poorly managed growth from EMC buyout onwards. Group-think.",
        "advice": "Don't hire any engineer who has a pulse. Promote middle managers from within. Work on improving the relationship between QA and Dev.",
        "pros": "Coolest technology I've ever worked with. Some very smart people. Very successful company. Relatively pleasant social environment. Well development test methodology/framework. Great resume builder. Easy to find people to go out to lunch with and have a great conversation.",
        "summary": "Cool technology but wish it were still a startup",
        "role": "Senior QA Engineer",
        "date": "Jun 12, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Don't be fooled by the importance of a female CEO. Women do not fair better here than anywhere else. HR is a joke. The company appears shiny on the outside but rotten on the inside. Don't be fooled by stock or paid for \"greatest places to work\" postings. This is the most poorly managed company that i have ever worked.",
        "advice": "You have a boys club in place and do not even recognize it. Marketing management from the top down needs an overall. I would purge executive marketing and sales and director level management and start over in many areas. Training might help but nepotism prevails and unqualified people are put in positions managing large groups of people. Take a look at your numbers - women are leaving in droves. Once their gone they … are not coming back.",
        "pros": "The snacks and the cafeteria",
        "summary": "Look Elsewhere their are better companies to work for out there",
        "role": "Sales Representative",
        "date": "Jun 24, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Oh there are so many downsides, how can I list all of them?If you are part of the \"working force\" (i.e. not an engineer, sales-person, or marketing tech) you are NOBODY. No matter how many times you confront HR or your supervisor/manager, you never feel a sense of worth. Loyalty is not taken into consideration, dedication is not a factor. You can be with the company for years, and never see appreciation in any ta… ngible form.",
        "advice": "Listen. Act.You have no idea the impact you actually have on the personal lives and well-being of your employees. Their worklife greatly impacts overall morale and sense of self-accomplishment. If they bring up an issue, it should be recognized, validated and a resolution should be pursued. Do not sweep the problems under the rug; if your employees are crying and not sleeping at night, there is a problem.",
        "pros": "I supppose the best reasons for working at VMware would be for the benefits; the stock options, a really cool, new \"Green\" campus, the buzz of working for a semi-public start-up software company, interesting people, medical, dental and life insurance...etc.",
        "summary": "While it boasts a friendly work-environment, VMware ignores individual accomplishments, rewarding only mass success.",
        "role": "Support Staff",
        "date": "Jul 7, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Ad hoc managementCulture of fear - no one in upper management reports any issues upwards and they just delegate downwardsOne trick pony - engineering driven even while in a mature technology market segment",
        "advice": "None",
        "pros": "There is no good reason to work at VMware",
        "summary": "If you want to build a good career in this industry, get out as soon as possible",
        "role": "Senior Product Manager",
        "date": "Oct 7, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Inept, disorganized senior management. Business logic often lacking. Some really awful senior management-- political, flaky, unfocused. Diane G's departure was a huge step forward but many more are needed. Engineers rule the roost; business folks suffer.",
        "advice": "Cash out and leave. Let experienced, big-company pros come in and take this company out of startup mode and to the next level. Get people who understand how to manage a billion dollar company with scalable processes to come in and transform the operations and go to market strategy.",
        "pros": "Brilliant engineers and product people; cool products. Super smart people. Startup ambience. Some rising stars in product marketing but much dead wood at top.",
        "summary": "Engineers super. Business leaders, not so much.",
        "role": "Senior Manager",
        "date": "Dec 23, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Really poor senior management (before Maritz, who is very strong). Huge egos and unwillingness to listen to those at the 'coalface'. Culture of fear esp in EMEA.",
        "advice": "Root out the unstrategic, bring-nothing egomaniacs currently in PR/AR/Communication.As bad are the regional marketing leads and especially EMEA Marketing team, needs to learn that VMworld EMEA is a tactic NOT a strategy.Overall a ridiculous over-promotion of those who cannot spell STRATEGIC has gone on for years under Diana Greene and has carried on because it 'Keeps its enemies closer'. This is not h… ow a company thrives.",
        "pros": "Cool technology and a shot at fame",
        "summary": "VMware an opportunity lost by Marketing without strategy?",
        "role": "Marketing Manager",
        "date": "Mar 26, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The worst work environment you can imagine, you will experience every possible error a company can make in business and personnel management. When the Indian employees complain about the work hours then you know it's bad! There is such a revolving door at VMWare that we used to joke about having a shuttle pull up twice a day to pick the employees exiting and dropping off the new hires.",
        "advice": "Sell the company to someone that can run it in a professional, responsible manner. It sounds like a cliche but you really need to have some minimal concern for you employees or at least make some effort to fake it. It is astonishing how flagrant the management is about furthering their careers at the expense of those around them.",
        "pros": "You will appreciate the good firms you work at after being at VMWare - the campus and cafeteria are outstanding in design and layout since completed in 2008.",
        "summary": "VMWare brings back the dark ages... Indentured servitude, cronyism, draconian management",
        "role": "Senior IT Administrator",
        "date": "Apr 26, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Everyone of my managers, from first line, to CEO (with one exception) has changed over the last year. The new management team is too focused IMO on schedule at the expense of quality. Another consequence is that people are being pushed really hard these days. A co-worker recently called VMware a \"sweat shop\". I couldn't disagree.",
        "advice": "People are leaving. That's going to accelerate when the economy improves. You ought to find out why,",
        "pros": "VMware has a history of having a great product. The technology is complex and works well.",
        "summary": "Where did the quality go?",
        "role": "Senior Member of Technical Staff",
        "date": "Jun 28, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Green middle management is poor at resource management resulting in few opportunities for professional growth and knowledge sharing. Poor coordination of resources and internal posturing stints ability for leveraging experiences to provide best solutions to clients.Lack of project management experience further complicates things. Increasing focus on completing Milestone Completion forms removes focus from acc… omplishing what the client wants. SMB/Commercial focus hinders ability to credibly discuss solutions with enterprise providers. Engagements with an excess of two individuals over 5 weeks tax the abilities of the engagement management, when in reality this is when EMs should be used.Environment of upwards management breeds questionable ethics by individuals working to move up the chain as well as poor collaboration or delegation due to the need to impress.Upper Management seems fine, but there message is completely lost on the multiple levels of relative incompetence between them and the clients.",
        "advice": "Overall, VMW PSO and VMW in general could be a much better place to work if their was more acknowledgment and leveraging of the skill sets that they have at their disposal. Inexperienced managers have difficulty in delegating important tasks to people more qualified to complete them, Basic \"management skills\" are required as well as more experienced middle management. Its a young company with many of a young companie… s issues with few mentors to guide them through the process.A restructured HR team may prevent the inevitable lawsuits caused by such environments.excessive management mistakes, as the current team is not responsive and is slow on follow up to complaints or their resolution.",
        "pros": "The technology is great and works, clients are excited to work with you, workload is manageable when compared to other software companies consultancies. Market dominance overwhelms institutional incompetence.With as much churn as experienced over the last year and a half as well as new management; there is a lot of potential for improvement.",
        "summary": "Green Middle Management and Lack of Clear Vision",
        "role": "Professional Services Consulting Architect",
        "date": "Sep 1, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No trust in the nevironmentVery Poor senior managementVery critical culltureNothing is ever appreciated and never good enoughhHR has no credibikityVery arbitary judgemental decisions are made that hurt people's lives",
        "advice": "Get way more in touch with what is going on before you loose any more good people",
        "pros": "Products are greatMarket is amamzingPeople are very bright and talentedSo much potential",
        "summary": "Products are great , environment is sad",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Mid level Management is not good,Every day a new story is cooked, Employee's are never recognized,6 CIO's got change since i joined.Every CIO brings his own people and perform very poor",
        "advice": "Nothing can be done about management in VMware unless management settles down.",
        "pros": "Technology, innovatio, Perks, Stock Options, campus",
        "summary": "A Very bad company to work for.",
        "role": "Engineer",
        "date": "Nov 7, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Internal processes non-existent - company grew too rapidly in last 3 years for its own good.Too many top management changes in last few months - as an ex: 6 CIOs in ~ 3 years.Too much arbitrary decision making, lack of transparency, mutual back scratching at the highest levels.Lack of focus on key non-product areas like customer satisfaction, internal business processes, IT applications.Poor flow of i… nformation - downwards or upwards - for a company of this size. Amazing focus on empire building rather than organization building (again gven the size of the company, it is dis-proportionately large).Lack of accountability ramapnt in the whole organization - senior 'powerful' people have lot of visibility and power but it seems they are not held accountable when things go wrong - again and again.",
        "advice": "Pretty much management 101 stuff really (in my humble opinion)o Drive Accountability - throughout the companyo Clearer lines of command rather than an over reliance on magic mantra of matrix management.o Proper focus not only on keeping an edge in the product but also in serving the customers, shareholders and internal employees - in terms of not wasting millions on contractors (especially in IT), not was… ting millions on redesigning and re-implementing basic business enhancing applications (again primarily in IT), making sure internal processes are strong and robust and most importantly Efficient.I guess the bottomline is that everything is so INefficient because of lack of focus on proper issues and lack of accountability - senior people operating without any clear mandate and getting things done willy-nilly as per their personal wishes and then stepping aside when things go bad does not seem like the right way to run a 2Bn $ company. Let us just remember we are not too big to fail :-)",
        "pros": "Hot technology - or at least it was till ~ 2 years back. Big players seem to be moving in the market now and it is not clear whether VMW has managed to keep lead.Buzz in the area.",
        "summary": "Look under the hood",
        "role": "Senior Manager",
        "date": "Dec 23, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Must be part of the \"in\" crowd to get promotionsManagement is scatterbrained -- no clear understanding of what it takes to implementOperationally challenged",
        "advice": "Be more honest in communicationsStop being so political",
        "pros": "Nice campusGreat brand recognitionCustomers like the products",
        "summary": "Good place, only if you're \"in\"",
        "role": "Anonymous Employee",
        "date": "Mar 7, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The middle management is terrible. There is rampant favoritism. They routinely eliminate people that voice their opinions. They encourage and reward absolute conformance, boot licking.",
        "advice": "Senior management vision is great. It does not percolate down to the individual contributors. Middle management is terrible. Routinely eliminating employee's jobs, not basing them on performance and favoring some that are coasting along demoralizes the ones that do the real work. Hence the recent exodus in Product Marketing.",
        "pros": "The company has a great vision and the technology is good. The executive management is great. The industry has a very bright future and VMware is the leader in Virtualization.",
        "summary": "Recent VMware employee feedback...",
        "role": "Anonymous Employee",
        "date": "Mar 29, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I've been gone almost 2 years, but I have seen an exodus of highly qualified, valuable employees leaving since that time. Some were voluntary, but many were shown the door in an unofficial reorg that seemed to create jobs for the friends of newer management. Reorg/layoff, from what I hear, was completely illegal in that it was not announced publicly. People still employed there seem to be at the lowest point, morale-… wise. So sad, it used to be a promising place to work.",
        "advice": "I don't think I have current enough details to offer management anything specific, but it seems that a lot of great people have been shown the door in the past year, and there is talk that it was done in an unethical manner. You know as soon as they can, more good people are just itching to leave. Your staffing team will have their work cut out for them once the economy fully rebounds.",
        "pros": "Nice offices, nice landscaping, cafeteria, green environment.",
        "summary": "Used to be a promising place to work.",
        "role": "Anonymous Employee",
        "date": "Apr 5, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The meritocracy is an absolute joke. But a very un-funny joke.Promotions are very scarce and given for great ass-kissing and power-point skils, not for results.VMware is not a company driven by data and facts. A typical management response to data is to kill the messenger.VMware is still hiring at a fast clip and new people (plus the possy they drag in with them) are given impressive director and VP title… s. The people who have been around and built this successful company are not promoted, not rewarded, and seriously underpaid.",
        "advice": "It's pointless to include any advice for VMware's management here. I spend my life giving well-researched and fact-based advice to these people and it falls on deaf ears. VMware management makes decisions based on what they \"learn\" having lunch with each other, not by listening to their employees.",
        "pros": "Great products loved by customers and partners.Lots of very skilled and accomplished co-workers.If you've been around since the IPO, the options are nice and still vesting.The physical environment is great, beautiful campus in a good location in Palo Alto.Decent flexibility to tele-commute.",
        "summary": "No meritocracy at VMware.",
        "role": "Anonymous Employee",
        "date": "Apr 10, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Paul Maritz is a visionary and very decent guy, but he installed cronies who installed other cronies who echoed each other and insulated themselves from the reality on the ground. The disconnect is incredible!The new breed of executives brought into the company during the past two years are seriously wrecking the place. They strutted into the place with the attitude that they are the ones with the experience … to take the company to the next level, and completely trampled on all the engineers and managers who actually built the business in the first place. The environment is so political now that meritocracy is out the windows, and if you say something they don't like or agree with, you're ignored, or side-lined.Did I say meritocracy is dead? At the upper management level, it's all about who likes who, who aligns with who, and who licks boots the best. Execs are hiring their buddies into the company as other execs, but define the promotion bar so high that internal people can't possibly qualify any more.Company seems to treat people like commodity now.Stock price is currently the only thing still holding the place together, attrition is picking up, but no one who can do something about this seems to know or care.",
        "advice": "Wake up and smell the coffee before it's way too late. Walk the halls, talk to the engineers and middle managers directly. Don't just listen to your cronies because they are not telling you anything you don't want to hear.",
        "pros": "Very smart and capable people (who are still sticking around)Great products that deliver significant value to customersNice campus",
        "summary": "Company on a verge of implosion but exec management is oblivious",
        "role": "Anonymous Employee",
        "date": "Apr 17, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management has changed over the past two years. As a start-up and as a small company, VMware fostered an environment of growth, exchange of ideas and innovation. This, along with an able and technologically sound leadership, had driven VMware to grow from a small start-up to a technologically rich company.The current management has, over time, engendered an opaque management system, devoid of transparency and…  is \"process oriented\". This unfortunately is hindering engineering-driven technological innovation and growth and implementation of new ideas, which in the past, have propelled VMware to success. The current management is resting on the laurels of past success without giving due credit to past management systems and the culture of openness of thought between employees and management.Other points: * increasing politics in middle management * increasing \"process oriented\" management * no formal promotion and career growth policies * dwindling morale amongst employees * loss of faith in management",
        "advice": "Take some time to learn of those who made VMware what it is today.",
        "pros": "VMware still employs some of the best brains in the computer industry. Many have left over the last one year. Of the ones who remain, their company makes VMware a worthwhile place to stay back and learn.",
        "summary": "Times have changed at VMware.",
        "role": "Anonymous Employee",
        "date": "Apr 21, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "notorious in-crowd culture--either you're in, or you're out. rampant POLITICS throughout the company which seem to be driven mostly by middle management who prefers to place their employees in silos as a way to sever communication and collaborative efforts amongst teams. daily gossips and back-stabbing is not uncommon.",
        "advice": "senior management has to grow some backbone and admit that they have a serious cultural work issue under the ladder that's deteriorating moral, teamwork, and overall productivity.",
        "pros": "salary and benefits on par with industry. very knowledgeable and capable core employees (most might have already left as of now).",
        "summary": "A Place to Avoid",
        "role": "Marketing",
        "date": "May 3, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Employees as commodities, no regard for skill or moraleSqueezing employees for money for acquisitionsKeeping inconsequential rewards, like beer bash and withholding promotions and raisesContributing to the bad economy by laying off local people to hire in cheaper (foreign) locations; its bad for AmericaLip service only to valuing employees",
        "advice": "Quit letting the bean counters make your personnel decisions. Until you can get robots to do your engineering, you need people. Lip service to valuing employees is transparent and breeds contempt of management. People are beginning to vote with their feet.",
        "pros": "Great products - great to be in the leading edge of technologyGood co-workers - Many fine people working hard",
        "summary": "People don't count",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Low standardsTwo very different culturesUnhappy and unmotivated employees",
        "advice": "Get in touch with employees and focus on bringing in A players",
        "pros": "Solid productsHappy customersA great base to build from",
        "summary": "A Different Company",
        "role": "Marketing",
        "date": "Jul 9, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very bad at information sharingVery emotional managementBad at reviews and promotions",
        "advice": "Take an objective look at what is going on and who is doing what.",
        "pros": "Great minds around youGreat TechnologyOpen culture among engineers",
        "summary": "Good Technology, Brilliant Engineers, Bad Attitude, Clueless Management",
        "role": "QA Engineer",
        "date": "Jul 14, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you're not an engineer, you're a second class citizenCompany politics are getting out of controlAdvancement policy makes it difficult to grow -- no promotions outside of your groupCroney-ism is gotten much worse in the last year with senior management all bringing their buddies inThere is no work life balance -- routine workdays are 12 hours long",
        "advice": "Stop starving the non-engineering ranks.Overhaul the HR policies -- make communication transparent, stop trying to \"spin\" everythingAllow out of the department promotions to allow growth",
        "pros": "The company revolves around engineering talentCurrent stock price makes it hard to leaveGrowth rate of the company provides a bit of reassurance",
        "summary": "Not an engineer? Welcome to second class citizenship",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very political, hostile work environment. Most people are promoted based on personal friendships, not merit. The long term engineers (8 years and longer) are paid about 40% above the local market and spend most of their time on personal projects or reading, and very little on shippable product. More recent hires (about 4 years and less) are usually assigned to grunt work until they burn out and leave.",
        "advice": "Replace all of the engineering management in the CS location, perform salary and performance reviews of all of the remaining people with an eye towards removing at least 1/3 of the engineers. The long release schedules are due to mismanagement, not headcount.",
        "pros": "The compensation is about fifteen percent higher than many technical companies in the Colorado Springs area. The benefits are decent.",
        "summary": "Avoid VMWare in Colorado Springs",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very little, if any, paid hands-on product training for the sales team. Most of it is flash content delivered in a browser, and you are required to watch it on your own time. Management has made the poor decision to - for the most part - turn a successful channel driven business into a direct sales model like Dell, but w/out the resources to do so successfully, mostly becuase they are becoming heavily laden w/ex dell…  micro management. Upper level management seems disconnected from reality when it comes to SMB, insisting that sales needs to pitch a \"your cloud\" message to customers that dont yet fully undstand the basics of consolidation, and the manement procuts are priced more for enterprise customers than for SMB.",
        "advice": "The ESX hyper-visor is still so far ahead of it's competitors that they seem not to understand that most of the changes they are driving dont negatively impact the run-rate business.. and they continue to celebrate trying anything BUT focusing on consolidation. In short, no matter how incompetent mid-level management is, customers still see value in a VMware virtual infrastructure and management basks in glory, think… ing their changes are the reason for success. VMware also needs to enforce it's patents for live migration (not too mention others) to hold off competitors in blatant infringement of VMware's core technology patents.",
        "pros": "The center of the IT world, we are the tip of the spear.",
        "summary": "How did they manage to screw this up?",
        "role": "Territory Sales",
        "date": "Mar 1, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Top leadership team is not cohesive and they have each brought in their own cronies from past companies- Top leaders are not held accountable -- if there is bad news, they scapegoat someone and don't take any responsibility for their own actions- Too many acquisitions that employees do not understand and that are not well integrated into the main company- Employees are not allowed to make decisions-…  There is a premium on moving fast and executing, but no time is spent on planning so people move in different directions and decisions change daily- There is a lot of backstabbing and power grabs, especially by withholding information- There is generally a lot of mistrust between teams, groups and orgs",
        "advice": "You need a solid top leadership team that truly complements each other and holds each other accountable. You also need leaders who can scale as quickly as VMware is growing.",
        "pros": "+ Nice headquarters campus with free snacks/beverages+ Still some very smart people trying to battle it out+ Exciting vision, building upon a winning flagship product",
        "summary": "Incompetent leadership whipping employees around with constantly changing, whimsical decisions",
        "role": "Anonymous Employee",
        "date": "Jul 14, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Upper level management scrambling to make an impression on superiors. Everyone \"managing up\" and trying to impress the boss. Customers and developing good software is lost in this process. HR at the low end of competence. Politics high in Palo Alto.",
        "advice": "Focus on customers and getting great products out. Trying to get promoted and impressing your superiors at VMware will not help the company and eventually there will be problems. Retain your good talent. Treat employees like the intelligent people that they are.",
        "pros": "Some very good people and some good teamwork. Nice gym. Modern green buildings. Interesting products to work on. Global sites function better than head office.",
        "summary": "Political, stressful environment top heavy with VPs who are totally out of touch.",
        "role": "Senior Manager",
        "date": "Sep 6, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Political, zero integrity of some senior leaders, lack of trustworthiness, low employee morale, mass exodus of outstanding talent. It's just not worth it.",
        "advice": "Weed out the bad apples at the top - still there and they're bringing you down, rotting morale, your reputation and your ability to maintain successful, sustainable growth.",
        "pros": "Current industry leader - hot sectorBrand recognition within technology",
        "summary": "HR is a joke - a sickening one.",
        "role": "Human Resources",
        "date": "Dec 15, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Company ignores employee feedbackIncompetent directors and senior directorsUnethical conducts from some of the directorsInternal transfers are difficult that limits the opportunity for growthNo work and life balanceNo recognition, no employee empowermentMorale is very lowInefficient internal tools and systems that reduces employee productivityManagement has favorites and demonstrates f… avoritismMicro ManagingNo personal development planToo much politicsBroken processes",
        "advice": "Listen to employee feedbackImprove the director layer, weed out those who have no soft skills, those who threaten employees and manage by fearMake internal transfers easier",
        "pros": "Great technologyTalented people (although many are leaving)Beautiful campus",
        "summary": "Bad Management",
        "role": "Senior Program Manager",
        "date": "Jan 2, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Loaded with barely competent front-line staff. You know the type... All \"CYA\" and no real effort.Many incompetents promoted to mid-level management. You know how... Connections.Upper management that pits team against team. You know the type... Ballmer acolytes.Too many folks too scared of keeping their cushy position to be genuine.",
        "advice": "Cash out and go home.",
        "pros": "Interesting technology.A decent cafeteria (and nice cafe staff)",
        "summary": "A pit of politics, preferential treatment, poor management, and out-of-control egos",
        "role": "Senior Technical Writer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Poor leadership. A lot of smart, unrecognized people led by not-so-capable leadership. There seems to be a huge gap between who general employees recognize as great and who leadership recognizes as great. Those that are good at managing up wins.",
        "advice": "Don't be fooled by employees that are good at managing up. Take time to get to know, listen and recognize the employees that are looked up to by their peers.",
        "pros": "Great campus, customers and products. People are passionate about the the technology.",
        "summary": "Marketing and Product Need Better Leadership",
        "role": "Marketing",
        "date": "Jul 30, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor sales leadership in Federal. No plan, no structure, no communication. AVP and VP are disconnected from the business and are smothered in greed.",
        "advice": "Create an open and honest environment by simply communicating. Diversify new employee hires. Establish trust amongst employees, partners and ecosystem.",
        "pros": "Terrific products. Company continues to improve flag ship products and are willing to enter new markets by making aquisitions.",
        "summary": "Great product! Terrible Sales Management",
        "role": "Sales Representative",
        "date": "Aug 13, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "See below under advice to management.",
        "advice": "VMware grew their headcount from 6,000 to 10,000 with the acquisition of over 20 companies from 2010 through 2012. These new acquisitions are put under the control of the Emerging Products Division and a VMware Business Unit Manager is assigned to each company. Over the next year to 18 months, your company’s solutions are prepared for full integration (incubation as it’s called internally) into the total overall solu… tions that the Core VMware Sales Team can offer their clients. VMware believes they have a toe hold in 85% of the entities out there and your company’s solution is just another way to expand that foot print down the road. Once your solution is fully integrated into the Core, you’re career at VMware will come to an end. You will find that many of the superstars at your company will have already left by then because they saw the writing on the wall from the beginning. Their work will have been tossed onto your plate with every departure. So, by the time your job comes to an end it might be a relief because you'll be burned out anyway. Sadly, today's VMware is a labor camp - policy and procedure has replaced creativity and innovation.If your company is acquired by VMware, enjoy the moment. Put it boldly on your resume and use that brand name to start opening doors at potential employers elsewhere. Most employers outside of VMware can’t distinguish between the Core and Emerging Products Division and only care about you having big name experience.Advice to Management: Your tactics of “managing by fear” will come to haunt you later on. If you search the social sites, VMware’s reputation has already been harmed by the thousands of ex-employees you’ve alienated and lost through your acquisition policy. All of this will come back to bite your talent pool in the butt when the economy improves.",
        "pros": "VMware does look good on a resume.",
        "summary": "Emerging Products Division isn’t always the door into the Core",
        "role": "Sales Representative",
        "date": "Oct 9, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Micromanagement. Projects and decision making move slower than mud.",
        "advice": null,
        "pros": "VMware provides great benefits/perks, but then again most companies do?",
        "summary": "Micromanaged to oblivion.",
        "role": "Inside Sales Representative",
        "date": "Dec 31, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very poor (across the board) IT senior management team. The most political environment anywhere. Long hours are the norm. It's a sweatshop. Everything is an emergency, complete lack of planning and structure. IT culture is poor, everyone is afraid to speak up. Without a doubt, staff would leave if not for RSUs. Would rank at less than one star if the option was there.",
        "advice": "Stabilize the IT environment. Hire a real CIO and support him/her. It's too much of a revolving door. A lot of good people have been fired for purely political reasons.",
        "pros": "Nice campus, stock is stable, products are well known",
        "summary": "Worst IT shop anywhere",
        "role": "Senior Manager",
        "date": "Jan 8, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Too many managers especially in CPD Palo Alto. Some managers have 2 or 3 employees. Consider CPD view team that has had historically few employees per manager. Same is also true for vCloud team. Some managers have absolutely no technical skill.",
        "advice": "Consolidate the managers who have too few employees. Also CPD is really not core team and they dont produce much. Eliminate customer support in Palo Alto as it does not have much ROI.",
        "pros": "None really. Campus looks good is perhaps the only PRO",
        "summary": "Managerial overhead",
        "role": "Member of Technical Staff",
        "date": "Jan 28, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Dysfunctional teams; Lack of support from Sr. Management; Wasted time spent having to justify your actions instead of focusing on the real work; Exceeding expectations is not always recognized or rewarded",
        "advice": null,
        "pros": "Nice campus; healthy snacks; good benefits",
        "summary": "If you enjoy working in a highly political working environment then you will enjoy working at VMware",
        "role": "Anonymous Employee",
        "date": "Mar 9, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "-CPD BU Leader's main priority is to develop/promote Beijing Team leaving rest of the Teams (Paloalto, Bangalore, Sophia) to Hell!-No employee retention-Engineers are treated like Pigs (Extremely sorry to compare with Pigs) No value to personal life.-No work life balance, even after working during weekends, Managers expect engineers not take any comp off for the weekends spent on work.-Too much of Pol… itics.-In-order to promote their level in hierarchy, Sr. Manager(s) hire another manager.-Managers can do anything to elevate their position. Best example-One of the engineer(Sr. MTS) who resignes the company after 1+yr of work in CPD as Lead, gets call back to CPD as Manager.",
        "advice": "Clean all the slack, specially Managers and Directors.",
        "pros": "-Few exceptional Engineers & Manager(s) (but rest are pathetic & selfish )-Exciting Technology & competition-Competitive Pay",
        "summary": "Do not join CPD!",
        "role": "Staff Engineer",
        "date": "Mar 20, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No growth opportunities.Pathetic middle managers who are technically inept, political and interested in advancing their own careers.Senior management doesn't seem interested in making any real improvements.Top talent has left already.",
        "advice": "They are beyond any advice. Busy milking the cash cow.",
        "pros": "Company name still have value in the valley.Products are high-tech, innovative.Easy 9 to 5 work. Can get away by doing no work and just responding to emails all day.Beautiful office and facilities.",
        "summary": "Just another big corporation",
        "role": "Member of Technical Staff",
        "date": "Apr 23, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Company is completely disorganized and only responds to crisis and then responds poorly at that. The crisis is usually of their own making. The Professional Services organization is mismanaged from top to bottom with no ability to enforce project scope or properly set customer expectations. Company has grown by acquisition and the overwhelming majority of the acquired products were just rebranded with little to no in… novation or improvement. Product gaps galore and a sell-first mentality made this one of the most depressing jobs I ever had.",
        "advice": "When you buy a company, analyze what you actually purchased instead of pushing it out the door ASAP. Stop the marketing hype which is drowning out everything else.",
        "pros": "Excellent benefits, above average salary, still a respected name on the market.",
        "summary": "Disorganized and depressing",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The reason they pay higher then market rate, is because this is not a good place to work.The amount of politics at this job is outrageous. It is at least 3 times worst then anything you have ever experienced at previous jobs.Management does not support their teams, and will throw any team member under the bus if that is what it takes for the manager to not lose respect.",
        "advice": "Bring in professional managers and train them in the art respecting coworkers and working as a team.",
        "pros": "They pay higher then market rate.",
        "summary": "Don't work here",
        "role": "Staff Engineer",
        "date": "Sep 13, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "-Hostile work environment-CPD is junk work starring at log files and dealing with H1B's esp from China.-Political and toxic workplace.-Managers that are useless but suck upper management's rears are promoted.",
        "advice": "Trash the entire CPD in Palo Alto. They are useless.",
        "pros": "None that I can think of.",
        "summary": "Hostile work environment",
        "role": "Member of Technical Staff",
        "date": "Mar 8, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "EUC marketing management is a disaster. There is a huge pressure for quantity of material, without much emphasis on quality. Very few opportunities for advancement.",
        "advice": "Reduce the politics and focus on measuring the results of tactics and strategies. Hold managers accountable for their decisions.",
        "pros": "The technical people are sharp, the compensation is competitive, and HR tries hard to make it a fun place to work. Lunch is very good. Top-level executives seem in-tune with market needs and business requirements.",
        "summary": "End User Computing Product Marketing",
        "role": "Anonymous Employee",
        "date": "Apr 14, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- delivery doesn't matter- promotions from within are rare- performance review doesn't matter- poor diversity, many Palo Alto groups have more than 70 % South Asians, I wish I knew hindu- from career prospective, not recommended to join on your own. Rule of thumb:10 years of experience + PhD == Senior Member of Technical Staff, when joining on your own.fresh graduate == Staff Engineer, when co… ming through acquisition.- Rumor / urban legend goes that some groups used to put their junior members in turtle's pond, as part of some initiation process. It was swept under the carpet by HR. Once again, it's rumor, but why somebody will make up such rumors?- management / leadership rotate all the time, coming close to non-existing. I had 5 direct managers in 2.5 years.",
        "advice": "Make no mistake, this company is 80% EMC owned.Beside talking about past break-throughs and zero-product conferences, products are barely built in-house.Lately, in addition to funny acquisitions, hiring management from Cisco / Juniper. Can look like Cisco half a year later.There is some attention to ethics / values, most likely ignored since C-level execs appear to ignore it themselves.",
        "pros": "- compensation is usually good- depends on the group, work/life balance can be good- the campus is nice, pond, waterfall, turtles- engineers-driven company",
        "summary": "it's not what you think",
        "role": "Staff Engineer",
        "date": "Jun 2, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Micro-management at its finest. It is and will drive all talent to other options. The inside sales organization has been transformed from a demand generating business unit into nothing more than a call center. Austin management team is clueless and clearly in a self preservation mode to justify their existence. Sales is pulled in so many different directions even the best and smartest are failing. This no longer for … true sales people. It may be a great job for people that enjoy spinning 100s of plates and herding 100s of cats...",
        "advice": "Hire middle management that have actually held a sales role. The ability to email spread sheets and metrics is not working",
        "pros": "Incredible software solution that can and will transform the IT industry. And Palo Alto apparently. The culture in Austin is bad.",
        "summary": "What a shame",
        "role": "Inside Account Manager",
        "date": "Jun 9, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Politics, Not enough challenging work, good people have long gone, inept middle management, clueless senior management. You will get into the habit of slacking.",
        "advice": "Resign",
        "pros": "Pay, benefits, swanky office, great cafeteria, work-life balance.",
        "summary": "Place for slackers and politicans",
        "role": "Member of Technical Staff",
        "date": "Jul 14, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "working in technical support does not provide a good view of this company, its policies, culture, or values. I have read wonderful things about VMware as a company, I have not experienced any wonderful things. I can attest to the fact that working in technical support would be tantamount to working in a completely different company - they do not share the same vision, values, culture and I am guessing management. I w… ork for technical support but it is run like a call center at Comcast.",
        "advice": "You need to value people and not view them as bodies who fill seats. You cannot provide premiere technical support with engineers who have 30+ tickets on any given day with no lab environment for customer recreates or learning. You need to find out why so many good and knowledgeable people leave; likewise, you need to look toward your policy of retention. If you do not value the contribution of those bodies and rathe… r view them as easily replaced people who answer a phone and put meaningless updates into tickets in order to meet a customer response contract, this cycle of attrition will continue and your numbers will eventually reflect you are no better than Microsoft in providing support.",
        "pros": "There are very few PROs to working here. Maybe the biggest is ESPP? Not sure if this is worth the price of admission though :) You need to make enough money to afford to have money taken out of your paycheck in order to set it aside for 6 months so you can buy company stock at a 15% discount.",
        "summary": "Technical Support at VMW, not a shining example of how to do technical support",
        "role": "Technical Support Engineer",
        "date": "Aug 2, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "very political all over the place, no where to hide. bad mid management, upper management all just have been shuffled, the CXOs all are about one year on the job. they are well aware of the saturation of VM market, the threat from Docker...Open Compute...etc. The PTO is gone, you are suppose to have \"unlimited\" time off, most end up getting less time off.",
        "advice": null,
        "pros": "still a few smart co-workers left, getting fewer by the week...good training programs still intact, although in the process of scaling down...",
        "summary": "over the hill tech wash-up trying to grip the next big thing...",
        "role": "Engineer",
        "date": "Sep 25, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "My whole team including me were laid off without any prior intimation. Some folks had just joined a few months back and they were also laid off. The reason given was that it is a management reason. Why would they need to hire if they need to lay us off? The company does not care about its employees. No internal transfer or other opportunities were provided.",
        "advice": "Give a thought before hiring new folks and try to retain good talent. Don't lay them off just because you feel you suddenly don't need them.",
        "pros": "Learning and lots of people to guide you",
        "summary": "Do not join this place if you care about being in job for more than 6 months",
        "role": "Anonymous Employee",
        "date": "Oct 25, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "visicious culture and middle management",
        "advice": null,
        "pros": "overall company prospects and perks",
        "summary": "Never work for Indian manager",
        "role": "Member of Technical Staff",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Poor management and shortsighted leadership. They manage quarter to quarter with little forecast.",
        "advice": "quit",
        "pros": "If you like dot.com mentalities and easy work from home",
        "summary": "Has little concept of consulting practices and uses products to sell services.",
        "role": "Anonymous Employee",
        "date": "Jan 2, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Politics. Horrendously clueless upper management. Rewards for politics, layoffs for hard work. Rare promotions for qualified contributors, regular promotions for rear-kissers. Hopeless levels of recognition. Terrible disrespect for work-life balance and employees' time in general.",
        "advice": "Be honest. Realize your only asset is your engineering staff in Palo Alto. Admit your core products are dead and you want to be a services company. Delist from the stock market. Call Diane Greene and apologize.",
        "pros": "A few talented people, generally flexible hours, pretty campus, generous ESPP and 401k matching.",
        "summary": "Behind the times",
        "role": "Anonymous Employee",
        "date": "Jan 21, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Promotions are not merit-based - whoever is most politically savvy, manages up the best, saves the day or is a workaholic will get promoted. The folks in the trenches that actually do real work have to sit by the sidelines and expect more work to land on their laps. Management pays lip service to the work-life balance issue. The unlimited PTO policy is poorly implemented and very inconsistent across the board. Some p… eople are able to take a lot of time off and completely disconnect while others are expected to check their email and be reachable while on PTO. That's not PTO. The place is now very large and weighed down by bureaucracy and processes made up on the fly. Many people are too overworked to dedicate any time to professional development. This is not a \"mother of school aged kids\" friendly place. Meetings are scheduled early morning (anyone ever heard of school drop-off?) and it's difficult to take time off during the summer because of VMworld in August.",
        "advice": "Promote good people managers. Managers who are actually interested in the professional growth and well-being of their employees and understand that their group will perform well if its people are taken care of. The staff in supporting functions is overworked and undervalued - instead of doing so many things that have everyone run around in a panic, focus on doing a much better job on fewer things. Upper management sh… ould take a step back and stop being in denial that everything is fine. Compensation is adequate but raises, bonuses and RSU grants have gotten worse over the years. People are leaving in search of better pastures which does not help overall employee morale.",
        "pros": "People are generally friendly, smart, professional and helpful. If they cannot help, it's only because they are overworked. Having worked here perhaps gives your resume an edge. Some groups are ok with working remotely which helps as commuting to that part of Palo Alto is difficult.",
        "summary": "Not a great place for professional growth or work-life balance. I would not recommend to any of my friends.",
        "role": "Product Manager",
        "date": "Feb 11, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "There is no career progression in the new Vmware, one you take a job they will never let you move up, Or into another organization. Professional growth is a joke.",
        "advice": null,
        "pros": "The older Vmware was a great place to work with strong benefits and career development but now the organization has become political, stale, and brittle.",
        "summary": "Headed in the wrong direction.",
        "role": "Senior Technical Program Manager",
        "date": "May 22, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "CFO manages the business via lay-offs and re-hiring versus building a sustainable business model #sadwaytomanage.",
        "advice": "get a new CFO before you roll up to EMC.",
        "pros": "beautiful campus set in Palo Alto, and nice cafeteria.",
        "summary": "Senior Engagement Manager",
        "role": "Anonymous Employee",
        "date": "Jul 23, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "If you think my Pros were Cons, wait till you hear the Cons. In summary, the leadership of the vCloud Air team specifically has somehow become convinced that they actually know what they are doing. No longer is there a sense of experimentation and risk taking, which attracted some of the brightest minds from across the company and the industry to sign up for the journey, but instead in their place are arrogance, igno… rance, and politics. Arrogance is bread from the top down, with the \"leaders\" making arbitrary and damaging decisions while ignoring the informed counsel of the people WHO ACTUALLY DO THE JOB EVERYDAY. This leads to embarrassing displays of ignorance by the \"leaders\" in all hands presentations and customer meetings when false and/or falsified information is shared as the truth. And the politics of the place make it impossible for any of the smart folks who clearly know the information is untrue to call it out with their \"leaders\" for fear of retaliation in the form of public humiliation or firing. And they have good reason to be scared - retaliation is the new blood sport at VMware. Once there was a time when people could wake up and feel good about the challenges they faced everyday...now they wake up and dread every minute.",
        "advice": "As if management will listen to, much less take to heart, any of this. I can hear them now, discrediting these words and view point with misplaced self deception - \"just a disgruntled employee, no one will take this seriously\" \"our people are too afraid to speak out against us, what do we have to be worried about?\" - instead of actually looking into their own hearts and minds to find the truth. And that truth is you … have lost your way VMware, and it begins from the top down. Your people are miserable, scared, tired of being lied to, and feeling powerless to do anything about it. They will leave, or you will fire them for \"failure to play the game\" (often called \"failing to build the 'right' relationships with the 'right' people\"), and then you'll have nothing left but a shell of what was once a great company. And you, \"leadership\", are to blame.",
        "pros": "I would have said being surrounded by smart people with a purpose, lead by people with integrity, at a forward thinking company with a bright future - but I can't. Not anymore. That's what VMware used to be. Even the newest, most innovative group to come along in a long time - vCloud Air - has devolved into a political, back-stabbing mess populated with weak leadership that either already has or will soon drive off e… verybody with any talent and brains. And it seems this nightmare of a management team will even fire those that question any of this. Where are your EPIC values when they actually need to be tested VMware? In the trash, with all the other good things you ever did.",
        "summary": "VMware has lost its way",
        "role": "Anonymous Employee",
        "date": "Aug 26, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The company is mismanaged at all levels, the management is afraid to take risks and repeatedly makes poor decisions.",
        "advice": null,
        "pros": "The technology and products are interesting and challenging to work on.",
        "summary": "Struggling to stay relevant",
        "role": "R&D Director",
        "date": "Aug 30, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not healthy atmosphere where management allows to scream at employees in front of others. No politeness, no tolerance. The methods to achieve results: long working hours, pushing, telling that \"you will be fired if you won't do this\", non healthy life-work balance. Unhappy faces are very common. Stress and rude attitude from management.",
        "advice": "Read \"cons\" above and try to change something as it looks bad.",
        "pros": "Many experienced and strong professionals.",
        "summary": "Software Engineer",
        "role": "Anonymous Employee",
        "date": "Sep 29, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "VMware's compensation structure shifted from a base salary + bonus to a commission based payout. There are significant risks associated to the newly formed commission payout structure and they are worth considering: 1) High Revenue Target, 2) The Annual Revenue Target is a \"moving\" target and can be changed at mid year depending on the group accomplishments, and 3) Lack of Control on when deals are closed. From a hol… istic view, this is a Win-Lose outcome at the expense of the Employees.Moreover, career growth, rewards & incentives are limited! One can expect to stay within the same role for 4-5 years before being considered for promotion with minimal salary adjustment.",
        "advice": "Listen to the Voice of VMware. After all, it was a survey completed by the collective group.",
        "pros": "Great Campus that is environmentally friendly.",
        "summary": "Engagement Manager",
        "role": "Engagement Manager",
        "date": "Oct 12, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Where to start...no career development, no leadership from management, no opportunity to progress career, company would rather higher outside than bring experienced internal employees into roles. Management is awful under qualified and non existent. Have own agenda and do not care about development",
        "advice": "get qualified and focus on employee growth and progression",
        "pros": "Great name on a resume",
        "summary": "Disaster",
        "role": "Sales Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "•Horrible upper Mgmt•They bring in people they know to fill management roles in stead of hiring within and promoting hard-working employees•Management is clueless•They claim you have endless PTO but if you miss one day you're so buried in work you regret even taking a day off•They underpay employees",
        "advice": "Get it together! Promote within. Let us enjoy our PTO without making us feel guilty when we take a day off. And stop under paying your employees.",
        "pros": "•Great Campus•Nice Kitchens•Turtles are nice as well",
        "summary": "Only good thing about VMware is the campus and kitchen",
        "role": "Executive",
        "date": "Jan 26, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The most political place on earth, seriously. How many messed up Cisco laid off losers can one company hire and promote into the highest ranks? Seriously. This is a company where what you DO is meaningless, only what people are in your corner matters and there is so much back-biting that you just never know. I accomplished some huge things there and it counted for nothing.",
        "advice": "Anybody that used to work at Cisco should be fired tomorrow, seriously. It amazes me that they continue to go with the same management team as the stock goes into the tank. Thankfully I am out of the stock, sold all of it at $90, I will not be surprised if that stock goes to $20 and the company stays with the same strategy.",
        "pros": "Great campus, excellent gym, snacks and drinks, unlimited vacation time. Overall good innovation and there are many smart people, some who have been there a really long time and add value.",
        "summary": "Toxic Waste outside of some product team positions",
        "role": "Director",
        "date": "Feb 13, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Stopped innovating, and started re bundling.",
        "advice": "Build better products instead of hitting bonus-tied release dates.",
        "pros": "A good work-life balance if you know how you work the system.",
        "summary": "Mgmt Need to have a clear vision",
        "role": "Senior Member of Technical Staff",
        "date": "Feb 17, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Services sending jobs overseas. Poor leadership in support division. No opportunities for growth or lateral moves. Won't allow you to apply outside of services. Laid off complete site with no plan to cover the work. Low morale. People expected to work through lunch and work overtime. Customers very unhappy. Many customer escalations.",
        "advice": null,
        "pros": "Great company, great benefits, good top level leadership",
        "summary": "Technical Support",
        "role": "Technical Support",
        "date": "Mar 12, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Management thinks of you as daily-wage labor/slaves who don't have any knowledge- if your Work life balance is maintained, you are probably going to get laid off, so make sure your life is a mess and you should always be working for your master- they may pay you good in the beginning, but you'll only get promotions if you know someone up high in the management.- the technologies and products are getting…  obsolete and the company is busy fighting internal battles.- new technologies, like Dockers & containers are considered a threat but there are no actions to innovate- top and middle management have close to none technical experiences, they are coming from times of early 1990's when they wrote code in VB and knowing Java and .NET was a specialization they just know about, hence do not understand the pains of Engineering staff- all the development decision are even made by the old time architects/Sr Staff Engineers who too are on their high horses and too proud to be given such responsibility that a Staff Engineer, Sr. MTS or MTS-3 or MTS-2 are all considered stupid to make any decisions and the worst part, management supports such behavior- its a toxic workplace, colleagues are made to compete with each other based on number of bugs you can fix or number of tests you can write or number of lines of code you are writing, ergo, if you fix 2 major bugs and someone fixed 10 minor bugs, you are an idiot who can fix only 2 bugs in given time when your colleague is fixing 10 bugs in the same time. Major and Minor doesn't matter in management's head to an extent there are monetary prizes and globally recognized honor to fix more bugs hence \"highly motivating\" the employees to fix MORE bugs doesn't matter how important.- People manager also titled R&D Managers who last wrote code when Clinton was president or I should say, when John Howard was the prime minister, are highly inexperienced, impatient, ruthless and have low regard for your skills or career or your life. Their aim is to just please their bosses even if it means destroying your life.",
        "advice": "Quit!Let other people live and join the old age homes near where you liveorgo to school and compete with us millennials head on. Old age doesn't make you any wiser to make better decisions, instead it makes you the one insane Uncle Henry or Aunt Klaire who doesn't know any better.If you think you got the message, do something about it. May be your confidants are your real enemies.",
        "pros": "- adds Brand value to your resume for future employment- if you are good at office politics or have powerful friends till higher up, you don't need to work or even come to work and you'll get promotions",
        "summary": "Sr. MTS",
        "role": "Senior Member of Technical Staff",
        "date": "Mar 22, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "100% Sales lead. Anything to make a sale while those that have to implement what was sold are often left in a very difficult position",
        "advice": "Equalize the balance of power between Sales and Delivery",
        "pros": "Salary is in line with the market",
        "summary": "Interesting times",
        "role": "Senior Manager",
        "date": "Apr 14, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Emperor's new clothes: It is an incredibly political place where people are no longer comfortable with speaking up about issues (product, people, strategy...). And there are certain executives who terrorize and belittle their people with no recourse. They missed the boat on public cloud in a big way - hampered their product teams by mandating that they support vCloud Air, at the expense of avoiding Amazon, Microsoft … and Google. The public cloud offering is sub-par - does NOTHING to streamline the experience for hybrid cloud, which was supposed to be the POINT. Why would a customer manage workloads one way with private cloud and a completely different way for 'public'. This is what happens when you let a handful of egomaniacs drive product strategy.Walking Dead: The result is a campus full of zombies. There is no life there anymore. It's a sad, sad ending to what used to be a great company. And you can't blame the current state entirely on the Dell/EMC acquisition. We were on life support before that all came about.",
        "advice": "CLEAN HOUSE. Stop the cronyism. Get feedback from the people who actually talk to customers and care about customer satisfaction - not their pet product or feature. STOP drinking your own Kool Aid. Start w/ the problem, the customer THEN worry about your kingdoms and technologies. Enough with tail wagging the dog. Be market-driven for goodness sake.And your diversity initiatives are way behind. A handful of f… olks make an effort but it's all lip service when you look at the statistics, the frustration felt by underrepresented minorities..it's really sad in this day and age.",
        "pros": "The beautiful campus, fresh fruit, gym, beer bashes, celebrity entertainment, and the turtles.",
        "summary": "Walking dead...Emperor's New Clothes",
        "role": "Anonymous Employee",
        "date": "Apr 27, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Upper management has made some bad software decisions. Why spend millions on a system and then lay off hundreds?Not to mention unrest and uneasy folks waiting for the Dell shoe to drop.",
        "advice": "Cut out some middle managers that are just clogging up the real workers. Stop recognizing those types for taking credit of their direct reports!",
        "pros": "Snacks are great. Food is good.Parking has gotten better. Lots of charging stations!Co-workers are nice.Going Green and recycling is highly encouraged.",
        "summary": "Turmoil. Spending money on unnecessary software while laying people off.",
        "role": "Engineer",
        "date": "Jun 2, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Every quarter my job responsibilities changed. And I don't mean from \"ABC\" to \"XYZ\". I mean responsibilities for \"XYZ\" were added to \"ABC\". I was hired to be a specialist on \"ABC\" and after three years I was expected to be a specialist on so many different products there's not enough letters in the alphabet to represent how much my specialist responsibilities increased. Makes me wonder if the company even understands…  what specializing means.",
        "advice": "When you recruit people to be specialists, give them a job where they specialize. If your spouse had a heart condition, you wouldn't want them seeing a heart specialist today that is also a podiatrist tomorrow, a dentist the following day, a chiropractor next week, a psychologist the week after and a plumber every other month would you? Why then do you do that to your customers?",
        "pros": "Decent pay. Good benefits. Corporate campus is really nice if you get a job at corporate. Lots of nice people work here.",
        "summary": "Responsibilities constantly increase quarter after quarter.",
        "role": "Senior Sales Engineer",
        "date": "Jun 8, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "sales org structure is/was major fail; terrible health benefits,",
        "advice": "fix sales org structure and support, improve sales leadership team, make it better for sellers to sell; improve health benefits",
        "pros": "great brand recognition and reputation; true work life balance w flexible work hours & telecommuting, culture of getting work done where & when you need, vacation, promote from within",
        "summary": "There's good and bad here",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Really bad management - the worst that I have ever seen in my 20 year career. RDs do not care about you, the customer, the obstacles faced.All that they care about is the roll up of a number. They be-rate you, and bully you into committing to a number with zero assistance with the sales motion. My team was subjected to horrendous verbal abuse on a daily basis, but yet my boss was non existent in the field.",
        "advice": "Get rid of the RDs and specialist RDs. Allow the AEs to roll the number up to the Sales VPs directly -as that is the ONLY function of an RD anyway. Hopefully Dell will bring their leadership in to take over. Get rid of the \"Good Ole Boy Club\".",
        "pros": "Beautiful Campus. vSphere is a market leader.",
        "summary": "Client Executive",
        "role": "Client Executive",
        "date": "Aug 22, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "no organization at all, crazy people with no organization or skills. No training",
        "advice": "organize and communicate, don't just ignore problems",
        "pros": "free snacks, crazy people with no direction",
        "summary": "Technology on the bloody edge",
        "role": "Senior Systems Engineer",
        "date": "Sep 25, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "no working from home - manager thinks Yahoo is the ideal place to work because no one can work from homeno equipment - no budget in the department for a new computer, not even for a new hire. ridiculous amount of time spent looking for a used machine because there was no budget for a new oneno management oversite - manager continuously refuses to clarify tasks/goals, manager has no idea what is going on, hyst… erical management style, passive aggressivelack of HR support - HR admits there is nothing they can do about poor management at vmware",
        "advice": "allow people to get at least one new computer for their workallow people to work at home as needed if work and deliverables are beings metplease give your management some training on how to be PEOPLE managers NOT dictatorsplease allow HR to step in and handle bad managers",
        "pros": "beautiful campus and wonderful turtle pond",
        "summary": "management is clueless",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "As VMware is expanding in India, it appears the US staff is getting nervous and more defensive and competitive. Teams no longer collaborate and staff is backstabbing and stepping on corpses to climb the narrower corporate ladder.",
        "advice": "Stop playing favorites, spread the wealth and help the staff grow both personally and professionally.",
        "pros": "There are benefits of working in the head quarter in Palo Alto such as free bagels on Wednesdays and beer-bashes every other Friday.",
        "summary": "Bleek future",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lots of illegal H1bs who dont know anything. They are hired because they are cheap labor",
        "advice": "Fire H1bs",
        "pros": "No pros at all. Deport all the h1bs",
        "summary": "Illegal H1bs",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bangalore is an offshore center.Vmware just want some robots (some keyboard junkiees ) to execute job in bangalore.They don't have an global mindset.Horrible Management.No Research focus.Communication from the senior management is patheticZero Research and Development.",
        "advice": "Develop the global mindset.",
        "pros": "Great product to work .Engineers are absolutely innovativeGreat engineers/developers to work with",
        "summary": "Bangalore is an execution center (not a research center )for vmware.",
        "role": "Senior Software Engineer",
        "date": "Sep 29, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "you are not allowed to use your brain,if you use then you will be branded as \"Attitude problem\" person.Seniors will threaten you when you express your views against them.Here they recruit managers and give Engineer Jobs to them like test case execution and automation script execution.",
        "advice": "Recruit managers who have courage to express their views.Suppress favoritism,I have seen teams here where the majority of the people in hierarchy from top to bottom belongs to one region and community.",
        "pros": "They have good technology.Virtualization is a good domain to be in.",
        "summary": "Managers here try to impress their Managers,nothing more.Worst planing and management ever seen.",
        "role": "QA Engineer II",
        "date": "Oct 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Ad-hoc work style - lack of planning, always in firefighting mode - actually take pride in number of unread emails and late night email replies, manage up and don't care about others, forget work-life balance, most mid-management got promoted that way and lack real technology or field experience",
        "advice": "The new leadership should take a hard look at the old timers - taking things for granted, and just got their titles because they got in early",
        "pros": "Virtualization is the growth industry in this economy, VMware has most mature product and most customers, has technology lead",
        "summary": "Not as great as it seems from outside",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "New Sales and Marketing leadership belong to the \"big boys\" school of managementYou work endless hoursInternal systems and tools are horrificThey can't figure out what type of sales organization they want to have",
        "advice": "Get rid of the majority of your VPs and hierarchy -- managing too much by committeeYour internal systems and processes are the worst, and you keep getting a bunch of bogus reports that everything is working when it is absolutely note",
        "pros": "There is talent in the companyCustomers love VMware, product almost sells itself",
        "summary": "We want the old VMware back",
        "role": "Marketing Manager",
        "date": "Nov 6, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very bad management. To many who don't care about there direct reports.Kiss ass to upper management",
        "advice": "Hire more US citizens who care about a product.Don't hire H1 Visas for they don't care they just want to work in the USA.",
        "pros": "Great TechnologyMaybe they can compete with ZEN??",
        "summary": "middle management",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All the junk and waste fellows from It are here as Managers.Smart people are on there way!!!",
        "advice": "If you really want to build a good R&D center at Bangalore instead of Execution center Give chance to the people who think for company interests . Not to the people who are personal interests.",
        "pros": "Great products and technology. smart people",
        "summary": "If you want to work here, Switch off your brain",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Multiple layers of useless management.No opportunity for growth with team or outside department.Arrogance when it comes to traction/leverage within the industry.",
        "advice": "How about offering career paths? It seems to get people to stay. I want to get in a time machine and tell VMware to value your talent and not let roaming corporate hacks in and pillage your offices via demotions and ignorance of existing talent. If there is anytime to turn it back around, that time is now. The terrible economy is on your side. You could re-create spectacular Sales teams/department. But I would be ver… y surprised.",
        "pros": "excellent reputation but that is dwindling fast.cool history.cool technology.once upon a time attracted some top notch executives.excellent products. that's about it",
        "summary": "Spinning Wheels",
        "role": "Sales Representative",
        "date": "Jan 27, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "* Managers and some senior staffs are arrogant* Promotion and rating process is a black box to engineers, process is not open and clear* information does not flow well among team members, little collaboration and team work* No long-term career growth opportunity* In-efficiency in project planning",
        "advice": "* Better efficiency* Give long-term growth opportunity to team members* Build a fun working environment",
        "pros": "Opportunities to learn new technology and work with smart people",
        "summary": "The company growed too fast from a start up to a big public company",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No respect for employees. Very poor senior leadership.Terrible middle management. No opportunities to advance. Most political place where expertise is not valued just whether you are 'in' or not.",
        "advice": "Pay more attention to departments where mutiple talented senior people have left and ask where the problem lies. Start trying to create a better workforce before there is noone useful left. Get a retention plan in place becasue whent the recovery truly comes, the place will empty.",
        "pros": "Lovely campus, Good products, many customersAmbitous plans",
        "summary": "Terrible place to work",
        "role": "Anonymous Employee",
        "date": "Apr 2, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "worst managementno management reviewmanagement bullyingpoorly managed company",
        "advice": "take an interest in what managers are doing to their employees because there is a lot of unfairness, favoritism, and bullying that you cannot challenge. IT companies time and time again have gone under due to poor management. If VMware continues the trend they are on it wont be long before they are next.",
        "pros": "good benefitssalary is okayclose to home",
        "summary": "poorly managed company",
        "role": "Anonymous Employee",
        "date": "May 12, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "There is tremendous tension and mistrust among most groups. A lot of senior managers have come in over the last two years from failing software companies and have brought their people with them, in some cases entire departments at the cost of some long time dedicated VMware people. Silos exist everywhere and there is no accountability for internal programs or projects. HR can never get anything done. Just completed a… nnual reviews and many people never got a meeting with their managers. Annual pay increases were late, arrived today and many many people received nothing. This will be two years for alot of people who did not get pay increases.",
        "advice": "Great talent exists in the company and people should be promoted to senior leadership who have actually accomplished something. Take a serious look at the VP and Director levels among those groups who brought in from other companies.",
        "pros": "People in R&D are really terrific. The overall engineering team is filled with talent and energy, sincerity, and passion. Many front line and middle managers are trying really hard to do the right thing. Campus is awesome, reallly earth friendly, terrific environment from that regards.",
        "summary": "Time have changed",
        "role": "Anonymous Employee",
        "date": "May 14, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- If working in a field office, don't expect to receive the same treatment and benefits as those in Palo Alto.- Very political, they tend to promote their friends and not who is competent.- Managers lack emotional intelligence with dealing with staff- Not much chance for growth & development in field offices- No work/life balance, field offices are understaff and overworked. Request for vacation h… as been denied for 2 years in a row due to staff shortage.- Low salary compared to similiar roles in other companies(40% less), was told this is due to budget restrictions in field offices.- High staff turnovers.",
        "advice": "- Train those in managerial positions on Emotional Intelligence and/or areas where they can lead well.- Review salary on all staff and revise salaries to reflect market rate.- Hire more staff in field offices that requires it. So that we can actually start taking our vacation.- Offer training courses to staff",
        "pros": "1. Health Insurance2. Internet allowance",
        "summary": "Field office review",
        "role": "Anonymous Employee",
        "date": "Sep 5, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lack of communication (top down).Very political environment.Managers are reluctant to back employees and very quick to judge prior to getting the facts.Management guidance tends to change overnight with no communication to employee.",
        "advice": "Listen to your employees and address the questionable integrity of front line managers. Employees should feel their management team will go to bat for them rather than succumb to political pressure.",
        "pros": "Looks good on resume.Good products.Free coffee, sodas and snacks.",
        "summary": "Run...fast!",
        "role": "Anonymous Employee",
        "date": "Nov 27, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "1. Culture sucks2. Manager sucks3. suffocating env",
        "advice": "Treat employees well and listen their problem.They need to cut down their arrogant attitude.",
        "pros": "To earn money.To learn technology",
        "summary": "It is a junk company.Just earn money and get away",
        "role": "Senior Member of Technical Staff",
        "date": "Dec 2, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Worst management (rude, unfair, unprofessional).",
        "advice": "Don't let your manager do whatever they like to people under their supervision.",
        "pros": "VMware is the leader in its market.",
        "summary": "worst working environment in the silicon valley",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The senior management team is the most dysfunctional I've seen yet. Constant gossip and in-fighting among the VPs. It's a toxic environment. CEO has no clue what's going on within the company. He seems to have good external focus, but poor internal leadership. And current COO doesn't unify the executive team.",
        "advice": null,
        "pros": "Looks like a good opportunity on paper. Nice building, free food, nice facilities overall.",
        "summary": "Good from far, far from good",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The company is trying to grow into new businesses before the core business goes away, and they have no idea how to do so. Middle management is incompetent, and the company is divided into a number of warring feifdoms.",
        "advice": "Upper management needs to direct the company. Middle management is incompetent.",
        "pros": "The core business is has some very smart and capable people.",
        "summary": "Company has some great cash cows, but it unsuccessfully trying to branch out.",
        "role": "Anonymous Employee",
        "date": "Feb 27, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No recognition process. no Reward & recognition unlike companies.No Internal job postings. Promotions are decided by Sr. Managers and directors with no transparency.Though technology is good but the Management has no clue about running operations.",
        "advice": "Hire a strong leader who knows how to run operations and service delivery. VMware customers are enterprise customers so the service delivery should be operated as other Enterprise support & not like a customer care.",
        "pros": "Great technology, but products full of bugs.Good stocks and good office location.You can get better jobs after working in vmware for sometime.",
        "summary": "Good company but hopeless management",
        "role": "Technical Support Engineer",
        "date": "May 27, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Salary used to be good but the company does not provide share options anymore. The salary has also been cut in some positions lately.A lot of management issues:- The job presented during the interview is far away from the reality- This is partly due to constant reorganizations of the teams and jobs- No training in place except of a computer based training, do not expect any help from colleagues an… d even less from managers. Most of them don’t have a clue.- Some sales managers have very little knowledge of the company structure.- No team spirit (1 team meeting in the last 6 months)- Employees are totally out of the decision making process. Improvement suggestions are not welcomed.- No employee empowerment, no personal development path- In order to grow up the ladder, you need to know the right person; unfortunately the intelligence or hard working behaviours are no success factor there.- Incredible turnover (e.g.: 75% of a middle-sized team resigned in not even 1 year)- Despite this high turnover, no corrective action is taken so employees are just trying to cope on a daily basis but their overall career is negatively affected- No exit interview. Does that mean that the company does not want to improve itself?- In overall the management is done only by controlling (metrics, KPI monitoring and call control) and threatening. No long term strategy.No work flexibility, 2 weeks of imposed holiday",
        "advice": "That would be good to listen to your employee’s feedback. Such turnovers are not normal in a company with such technology and corrective actions should be taken in particular on the managers. Some talents have been wasted and are still wasted because of this bad management.",
        "pros": "Interesting technologiesNice office and environment",
        "summary": "Great Technology but incompetent management",
        "role": "Sales",
        "date": "Dec 9, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "VMware is almost entirely reliant on legacy products which are losing their niche fast. Competitors are catching up and VMware needs somewhere to go to differentiate. They have bought several promising technologies (Zimbra, Socialcast, SlideRocket, Horizon App Manager, Horizon Mobile) but they are not investing enough to keep them abreast of the competition. Management is entirely, 100% focused on revenue and becomin… g a $4B company - and the cuts show. Raises are next to nonexistent (even for internal promotions, which are rare.) Employees who used to have their cell phones taken care of by the company now have to \"Bring Your Own Mobile\" (this was billed as a great benefit to employees, but in reality we now have to purchase our own phones and pay for our own plans, with an entirely-to-small cap on what we can expense for monthly costs.) Rumor is they will be doing the same with laptops in the future, without giving employees any money towards purchasing their own computer. Within the next year, they play to eliminate vacation and sick leave (rather than earning leave, you will just \"work it out with your manager\" - I can only imagine this will cut back on the amount of vacation you can take.)Upper management has a decent vision but it is crippled by the all-encompassing focus on revenue. The company has a whole slew of useless VPs (many brought in and given lofty titles due to acquisitions.) Middle management is largely incompetent yes-men who are focused on managing upwards - a lot of them have been with the company for a long time or were part of acquisitions, so they are just \"resting and vesting.\" Until a lot of them are sidelined or fired, I don't foresee much improvement. The market has started to realize that the company is all glitter but no gold, and the stock price is being adjusted to reflect this.",
        "advice": "This company has a BILLION AND A HALF DOLLARS in the bank. Spend it to enhance products that need it so they can compete in the market, and put a little towards improving employee morale (which is in the gutter.)",
        "pros": "- Still has some good technology (vSphere is still on top, but perhaps not for long)- Might look good on a resume- Pay is OK.",
        "summary": "Tanking fast",
        "role": "Engineer",
        "date": "Dec 20, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Poor planning on important decisions- no accountability for dismal decisions- virtually no communication regarding pertinant job related issues- middle management is often just cronies of upper management from previous jobs. Others have posted this and it absolutely true.- logic is completly absentexample of lack of logic: we require NET30 payment terms, obviously we would not accept Net45 o… r NET 60. The disconnect is we do not accept NET15!!!!!!!!!!! That is 15 days sooner than you require!!. NETzero is not accepted either!!! No lie, it seems unbelievable doesn't it.They require FOB Origin for all PO's for revenue recognition purposes even though this is foreign to their customers, industry standard is FOB Destination. If you purchase anything from VMware you should definitely use a partner.",
        "advice": "Attain input from the worker bees they have a better handle on what is really going on. Middle management should not be hired based on who they know but rather their ability to manage and motivate.Make it easy for the customer to purchase. Accept Credit cards and be more flexible on purchasing requirements.APPLY LOGIC, just becuase you are a large company doesn't mean you can't do what makes sense eve… n if it isn't your policy. Make exceptions without 6 layers of approvals.",
        "pros": "-Good Benefits package-snacks and beverages-looks good on a resumeThey have great technology and have seen continued success but you have to wonder how long it will take for imcompetence to topple the giant",
        "summary": "Act then think at VMware, never think then act",
        "role": "Anonymous Employee",
        "date": "May 25, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Unfairness; Work performance not recognized, even when working in average 14-16 hours/day; Nepotism; Extreme high work load. Actually no real career opportunities if one speaks other languages than English as well.",
        "advice": "Look up the words honesty, integrity, and fairness, and apply it to yourself. Recognize work performance independently from nationality, friendships, or relations - simply by facts. Implement a proper recruitment process, especially for the multilingual team.",
        "pros": "Very good learning opportunity; Access to almost every documentation, even source code; Free canteen; Great colleagues: friendly, knowledgeable, helpful; Collaborative environment; Own laptop: permission to install as one likes.",
        "summary": "Very disappointing, because of to much injustice.",
        "role": "Technical Support Engineer II/III",
        "date": "Dec 5, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- worst call centre experience ever, after a startup mood and empowering in the past things have changed towards metrics only. Visions and ideas are suppressed and not followed upon you report into a black hole and get no feedback unless you ping a VP or senior director directly.- wording to be used dictated, no freedom of speech, no adoption to customer needs, improvement suggestions land in a back hole.… - the Vision and spirit in this company is gone- workers are currently approaching unions about conditions- It still pays of get intimate with leaders, in order to progress in ones career",
        "advice": "empower employees, give timely feedback on improvement ideas and general feedback. Get rid of medium class middle managers. Do not allow them with their average thinking and compromising culture to make VMware drown in the long term. I have seen loads of high quality employees leaving in the last weeks, because of the change in culture.",
        "pros": "VMware still is the market leader for virtualization - but that's about it.",
        "summary": "A massive change towards discouraging, limiting possibilities, caused by non-visionaire average managers.",
        "role": "Senior Customer Service Representative",
        "date": "Dec 17, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "abusive managers ; favoritism ; expectations are you work till you drop. Days without lunch as forced to be in phone que 8 hours for days while what normally would be called TEAMLEAD takes over 1 hour lunch or more and is unapproachable for help.managers dont seem to get if you have 30 back log tickets you need to be able to do research and work them to get rid of them. Most of the people at the burlington office…  are afriad of being dragged into a room and walked out. Company has way to many products for current support model it will hurt them. Oh wait it has they layed off AOT of people .. VMwares moto \" more with less\" good luck people your the less more = more hours in the que more assigned tickets",
        "advice": "grow up and communicate. Grow up and realize that your buddy shouldn't be hired as a manager when he has no manager skills. Sickening work place.Communication issues where certain manager abused support engineers then upper managers FINALLY realize years later that specific manager is good with escalations but the people hes abused have been walked out. ANd he was made manaager due to sucking up to Senior man… ager .. he had no manager training and AT ALL learn as you go ..",
        "pros": "free training get your VCP and GET OUTfree foodi dont work there any longer the place was keeping me up at night",
        "summary": "VMWARE burington environment - managers abusive ; environment hostile toxic",
        "role": "Phone Support",
        "date": "Feb 9, 2013",
        "is_current": false
    }
]