[
    {
        "rating": 4,
        "cons": "Over the past few years, the Cisco culture has crept into VMware and has altered the vibe from that of an energetic start up to a predictable, contractor abusing, hiring freeze having, slave-to-the-shareholder kind of company.Additionally, VMW doesn't do a great job of cultivating their talent. Instead, they have begun to hire more outside talent, rather than developing and promoting existing folks.",
        "advice": "Don't let the desire for shareholder profits completely ruin what was an exciting and energetic company culture that has driven some of the most exciting innovations in software over the past 15 years.",
        "pros": "Competitive salaryGreat benefit packageEncourages employees to give back to their communityOften flexible with working from home",
        "summary": "A Changing Corporate Vibe",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There was a time when I wasn't receiving the feedback I was hoping to improve. But this was not a short coming of management. It was a time of growth and we didn't have anyone leading our team at the time. Upper management was taking the proper lengths to make sure we got the right guy to lead our team",
        "advice": "I can't say I've had any complaints. Keep giving the outstanding feedback so we can continue to perform. But aside from that I love the attention you give to the types of people you choose to lead our teams.",
        "pros": "Almost 2 years into my employment at Glassdoor and I've decided the excitement of working here isn't a phase. I love the management, they encourage employees to grow and learn with the company. And as fast as I've seen things go I've learned just as much if not more. There is no micromanaging in my department, but rather a trust we are all working together to meet our goals.",
        "summary": "my experience with VMware",
        "role": "Anonymous Employee",
        "date": "Oct 13, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Need strong decision makers in senior management",
        "advice": null,
        "pros": "Get Atmosphere. Smart people.",
        "summary": "Working at VMWare",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You must be selling to the right type of company. West coast companies now are moving towards SaaS and Public Cloud, this is hurting VMware",
        "advice": null,
        "pros": "The sales culture is excellent. We have attainable goals and a manageable forecasting process.",
        "summary": "Specialist",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Job Security is the main concern. Every else is good about VMware.",
        "advice": null,
        "pros": "Excellent Work atmosphere, benefits, employee satisfaction.",
        "summary": "Good",
        "role": "NOC Monitoring Engineer",
        "date": "Oct 21, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor acquisition transition left my team feeling disjointed and neglected.",
        "advice": null,
        "pros": "Great resources to further your career.",
        "summary": "Inside Sales Representative",
        "role": "Anonymous Employee",
        "date": "Oct 22, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Revenue growth over the long term",
        "advice": null,
        "pros": "Culture, people and management are top notch.",
        "summary": "Manager",
        "role": "Manager",
        "date": "Oct 22, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I would like to see more aggressive salary adjustments for existing employees that do a better job of keeping pace with what the market is paying. Other companies may offer a more competitive salary but the opportunities for professional development may be less, so it depends on what motivates you.",
        "advice": "Implement aggressive strategies to retain your talent in all areas. Reward your top performers and provide more recognition for those who are willing to go above and beyond. We all get calls and emails from recruiters and I have seen some great talent exit the company because they were offered significantly more salary for their skills.",
        "pros": "VMware has an amazing culture. Expectations for performance are high but there is a tremendous amount of passion in this company so if you are up for it, you will excel. I love the innovation and collaboration that I see every day. I have worked for companies that \"talk\" culture but VMware lives it. Everything moves very quickly...and change is constant. This type of environment is not for everybody but if you thrive…  on being challenged and look forward to making an impact vs. just having a job then you will love VMware. The benefits are strong. I have been impressed with the executive level leadership and have had several great direct managers since I have been here. I have also been impressed with the transparency of communication throughout the company and love the organizational commitment to give back to the community.",
        "summary": "A great place to work and thrive!",
        "role": "Anonymous Employee",
        "date": "Oct 27, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "We can get a little silo-ed across business units at times. Leadership needs to proactively work across BU boundaries for a seamless customer experience (messaging, products etc).",
        "advice": "Navigate through the market transition fearlessly. Keep up the good communications with employees, customers and bring up the stock price!",
        "pros": "Smart people, collaborative culture, generally fast moving for a company this size, amazing campus, perks (gyms with towel service, nice well stocked break-rooms, fruit service, nice cafeterias, beer bashes, parties), extremely environmentally conscious company! Great ecosystem, solid products, strong leadership.",
        "summary": "Sr. Manager, Business Operations",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of or limited resources to assist sales, esp post sales services. CPQ needs major overhaul.",
        "advice": "Stay the course with product development, while continuing to stay several steps ahead of competition. Need to do a better job of leveraging internal tools and data as a business advantage, esp via mobility.",
        "pros": "IT industry disrupter. Great products/solutions. Solid executive leadership starting with CEO, Pat Gelsinger. Spot on solutions focus on data center security (NSX), EUC/mobility and Hybrid Cloud.",
        "summary": "Enterprise Account Executive",
        "role": "Enterprise Account Executive",
        "date": "Oct 28, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There are no cons that i can thunk of",
        "advice": null,
        "pros": "Wonderful Company to work for.",
        "summary": "Great Plave",
        "role": "Professional Services QA Lead",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Given my job role, work could either be extremely boring, or incredibly rigorous.",
        "advice": "Less micro management",
        "pros": "Laid back culture, flexible work hours, really good work life balance, great name recognition. Beautiful Palo Alto campus",
        "summary": "Decent but boring",
        "role": "Member of Technical Staff II",
        "date": "Nov 3, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Cronyism, Politicking, Innovation Declining, Acquisitions all the Time",
        "advice": "Get into the minutiae with the Hoi Polloi",
        "pros": "Great People, Culture, Benefits, Work Life Balance",
        "summary": "Everything You Could Ever Want In A Company",
        "role": "Recruiter",
        "date": "Nov 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "not much of a pay hike for existing employees",
        "advice": null,
        "pros": "Cutting edge technology, highly motivated people to work with and a wonderful culture.",
        "summary": "Great place to work",
        "role": "Senior Member of Technical Staff",
        "date": "Nov 5, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Will share later the details, though not much that can be found.",
        "advice": null,
        "pros": "Dynamic and innovative work culture.",
        "summary": "Project Coordinator",
        "role": "Project Coordinator",
        "date": "Nov 5, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Sometimes the pressure to use company owned systems is pretty high when those systems aren't the best fit for your particular need. Working with corporate IT to get things accomplished is very difficult.",
        "advice": "Listen to employees when management isn't suiting their needs. Spend more time and effort on getting the IT department up to snuff.",
        "pros": "Lots of smart energetic people to work with, no limit to the amount of things that you are able to dig into. A lot of great perks like being able to use all of VMware's software for projects with no red tape. Great overall compensation package and benefits.",
        "summary": "Operations Engineer",
        "role": "Anonymous Employee",
        "date": "Nov 6, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Long hours, work life balance can get unbalanced if you don't press back.",
        "advice": null,
        "pros": "Good opportunities for advancement, good managers, and lots of hard working, dedicated coworkers.",
        "summary": "Great Opportunities",
        "role": "Consulting Architect",
        "date": "Nov 11, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Contracting company that services VMware (Kelly Services) does NOT handle their business well. Was laid off with a phone call, no notice, on the day they were terminating contract when previously we had been in discussions to extend. The contracting company was the source of frequent confusion throughout our team and at upper levels. They do not understand that turning over an entire team every year is not good for a… n HR department.",
        "advice": "Get a new contracting company.",
        "pros": "Great team, relaxed and open work environment. Generous pay for lower level HR work, good perks and nice workspace.",
        "summary": "Great workplace for FTE",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "In some cases strategy and purpose did not get communicated down the management chain. Those of us at the mid-level were often left to guess the strategy.",
        "advice": "Clearly communicate plans, objectives and purpose. Provide full feedback, even when not pleasant.",
        "pros": "VMware treat employees well, respectfully. The company has a strong sense of community and obligation to it. VMware has a lot of really smart people.",
        "summary": "R&D Director",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "long hours, hard work to life balance.",
        "advice": null,
        "pros": "Great company with name recognition",
        "summary": "Program Manager",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Frequent transitions in some teams",
        "advice": null,
        "pros": "Open and innovative work environment. Nice campus in Palo Alto, CA.",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Nothing that comes to mind",
        "advice": null,
        "pros": "Culture, Internal Opportunities, Rewards and Recognition",
        "summary": "Staffing",
        "role": "Staffing",
        "date": "Nov 23, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of change and uncertainty with the Dell/EMC deal. Stock taking a hit as a result. Strategy will take time to execute.",
        "advice": "Adjust RSUs",
        "pros": "Smart, talented people, great products, great staregy.",
        "summary": "Great but challenging!",
        "role": "Director",
        "date": "Nov 23, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor processes, back office support limited, confusing systems",
        "advice": "clean up and link all sales systems. Clearly define roles",
        "pros": "Great technology, \"start-up\" atmosphere, friendly coworkers, supportive environment",
        "summary": "VMware sales",
        "role": "Anonymous Employee",
        "date": "Nov 24, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Don't know any at this time could have nicer working environment but like I said all around not bad very gamily like",
        "advice": "Smile more",
        "pros": "Looks after you what you put in is why you get back truth and trust also ask to io understand if you don't understand the job",
        "summary": "Family atmosphere",
        "role": "Worker",
        "date": "Nov 28, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Working outside of the main campus is detrimental to your career (at least in my group).",
        "advice": "Would like to see more focus vs. trying to hop on every new trend to see \"what sticks\".",
        "pros": "VMware cares about their employees and the communities in which they work.",
        "summary": "Great corporate culture",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Corporate politics can get in the way. Frequent promotion of ineffective people to higher levels of management. Leadership is fading, no clear and concise message to teams about actual business goals and priorities.",
        "advice": "Promote managers based on effectiveness as determined through anonymous polling of reports and not based on tenure or solely upper management perception of individuals.",
        "pros": "Encourages independent work. Allows for full time telecommuting depending on role. Great career growth opportunities. Great PTO plan allowing you to maintain work/life balance.",
        "summary": "Great place to wokr",
        "role": "Senior Cloud Architect",
        "date": "Dec 3, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "They grew so big so fast and they did not grow their back office operations with them. Management is very slow to make decisions and often changes their mind, which causes tons of back and forth and extra work for their teams below them.",
        "advice": "Invest in optimizing operations and delineating clear R&R's across orgs and BU's.",
        "pros": "Great benefits, salary, and alot of smart people.",
        "summary": "Great company overall, but experiencing pains of growing so quickly",
        "role": "Project Manager",
        "date": "Dec 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Promoting from within the organization is limited",
        "advice": "Promote people from within instead of external hiring",
        "pros": "Very energetic environment. Great talented team to work.",
        "summary": "Sr Manager",
        "role": "Lead Business Analyst/Senior Manager",
        "date": "Dec 4, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management keeps changing. Lack of a clear direction for future.",
        "advice": null,
        "pros": "Work with smart people. Learn a lot quickly.",
        "summary": "So many Talented people",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- passive aggressive corporate culture where things are agreed to in meetings and people do not execute accordingly- weaker leadership culture based more on seniority than knowledge or leadership ability",
        "advice": "If you treat your people like children, they will act like kids. Engage employees in a direct and clear way",
        "pros": "- Nice benefits and a generally welcoming and open environment- global company with lots of change to gain work experiance working with people in India, Ireland, Pacific, and Costa Rica just to name a few",
        "summary": "Change can be a bad thing",
        "role": "Senior Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Salaries are not on par with the market. It is too structured and there is over analysis in the sales process leading to micromanagement.",
        "advice": null,
        "pros": "Great atmosphere, culture, and people. There is a opportunity for advancement once you find a career path and pursue it.",
        "summary": "Inside Sales Representative",
        "role": "Inside Sales Representative",
        "date": "Dec 9, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you are remote then you will miss out on a lot of the great culture",
        "advice": "Continue to innovate",
        "pros": "Great company culture.Customer focused.InnovativeLots of opportunity for personal and professional growth",
        "summary": "Sr Consultant",
        "role": "Senior Consultant",
        "date": "Dec 12, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The sales quotas are a challenge.",
        "advice": null,
        "pros": "It has very good culture.",
        "summary": "VMware",
        "role": "Anonymous Employee",
        "date": "Dec 13, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company is starting to go down. A lot of projects are getting cancelled or suspended.UX management has no idea what it wants to achieve, so the team is all over the place.",
        "advice": null,
        "pros": "Work-life balance is great.Compensation and benefits is pretty good as well.Company matches 401k contributions 100% up to $1500 per month.",
        "summary": "Good place to retire",
        "role": "Senior Interaction Designer",
        "date": "Dec 13, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Being an EMC company gives out a \"non-independent\" feel with competitiors especially in the Hardware space. SW competitors use this as a ground for unsuspecting customers.",
        "advice": "Keep up the Flexible work timings, leaders are very accessible so you really get to influence your expectations and its impact on the overall business. Listening Management team,",
        "pros": "Great Culture! Flexible work timings, leaders are very accessible so you really get to influence your expectations and its impact on the overall business. Listening Management team,",
        "summary": "Really EPIC!",
        "role": "Anonymous Employee",
        "date": "Dec 13, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Slow moving. Currently VMware seems to be losing out on some good talent.",
        "advice": null,
        "pros": "Get to work with some really talented people. Some products are really well thought and executed. Good employee benefits and culture.",
        "summary": "Good company with some really cool products",
        "role": "Member of Technical Staff",
        "date": "Dec 15, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "IT on shore and off shore to India model doesn't well. There are too many meetings to resolve minor issues because of this model",
        "advice": "Ask the Vendor like HCL and TCS to increase the salaries of the contractors working through them in VMW. These enginers are always complaining about low wages and giving VMW bad reputation.",
        "pros": "I loved working for vmware. when i joined in 2010 vmw was on the rise and everyone was happy and super helpful. Over time company went through couple of round of lay offs. This did not change the basic culture people are still nice and helpful.",
        "summary": "Vmware the good the bad and the ugly",
        "role": "Project Manager",
        "date": "Dec 16, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Management not always going in the best directionRemote work force does not promote best collaboration on projects",
        "advice": null,
        "pros": "Work was challengingAbility to develop new skillsGood payUnlimited PTO",
        "summary": "Solid place to work",
        "role": "Data Steward",
        "date": "Dec 20, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Management direction cold be better defined",
        "advice": "Communicate with clear objectives",
        "pros": "Great technology for the enterprise",
        "summary": "Sales",
        "role": "Senior Sales Executive",
        "date": "Dec 21, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of accountability, no clear strategy from the top, not a design-focussed company.",
        "advice": "Have a higher standard for quality of work and work to develop a clear and consistent company strategy.",
        "pros": "External learning/training is encouraged and paid for, very high pay, autonomy, unlimited vacation, work from home anytime",
        "summary": "Great place to work",
        "role": "Interaction Designer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Nothing to dislike if you like programming",
        "advice": null,
        "pros": "Great Place to Work in California",
        "summary": "Approximate Salary of VMware Interns",
        "role": "Anonymous Employee",
        "date": "Dec 30, 2015",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "work life balancegrowth depends upon your networking skills",
        "advice": null,
        "pros": "Great exposure to business linesFast pacedvisibility",
        "summary": "Senior Project Manager",
        "role": "Anonymous Employee",
        "date": "Jan 5, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Internal processes are still slow to navigate and there are many disparate applications that give you the same information. There needs tobe an overhaul of internal KB and service catalog to find information quickly and easily.",
        "advice": "Keep it up. Improve the Servicenow Experience.",
        "pros": "Great Company. Still Growing and room for upward mobility. Management does a great job of staying engaged. Culture is collaborative and still excited.",
        "summary": "Enterprise Account Executive",
        "role": "Enterprise Account Executive",
        "date": "Jan 7, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "As we approach 80-90% market penetration with virtualization, the company is struggling to figure out how it will transform itself into the future. With the stock in a big slump, many are feeling the pinch. The stock strategy to retain talent is no longer working and the bleeding of talent has already begun.",
        "advice": "Pick a single strategy, communicate it clearly and stick to it. Once the whole company is aligned to a strategy, we can all march to the same tune and deliver in spades to the market.",
        "pros": "VMWare has great corporate responsibility, they care how we fit in the community and give back generously around the world. Products are solid and the employees care about what they deliver.",
        "summary": "Slowing growth",
        "role": "Engineer",
        "date": "Jan 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management decisions not firm at times.",
        "advice": null,
        "pros": "Great place to work. Your idea and suggestions are valued. Your contributions are recognized.",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Jan 12, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Have to manage multiple priorities, and pivot rapidlyThere are uncertainties due to the dell/emc buyout.VMware has great technology, but faces serious competition.",
        "advice": "Focus. Don't try to do too many things",
        "pros": "Good cafeteria, fitness centerSuperior salary and benefits.Good work culture.Company is very generous with philanthropy and matching gifts to nonprofits",
        "summary": "Exciting and productive environment with great people",
        "role": "Anonymous Employee",
        "date": "Jan 13, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management did not take care of good people and they left company.",
        "advice": null,
        "pros": "VMware Education and Certification team great group of people to work with.",
        "summary": "Web Producer",
        "role": "Anonymous Employee",
        "date": "Jan 20, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Company is growing so becoming very competitiveHas become more of a \"Dell\" like culture Know what you want to do coming into it and get to be known with management",
        "advice": "Understand the lack of control reps have in an indirect sales model",
        "pros": "Great LeadershipUnlimited VacationOpportunity to move up",
        "summary": "Great Work/Life Balance",
        "role": "Anonymous Employee",
        "date": "Jan 21, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No Cons, had a pleasant time here.",
        "advice": null,
        "pros": "Has a good environment and great time working with people.",
        "summary": "VMWare",
        "role": "Project Coordinator",
        "date": "Jan 22, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "I spent nearly 8 years of my career life at VMware and I made many friends and poured my heart and soul into the company. For the first few years it was the epicenter of innovation, but soon too many laid off employees from Cisco came over and changed the culture. It evolved into a place where everyone was jockeying for a promotion and the team environment soon dissipated. Sadly, some managers purposefully make it a … mystery how to progress in one's career. I loved VMware and was sad to leave, but leaving and going to my current company was one of the best decisions I've ever made.",
        "advice": "The politics of the company are what is weighing it down. Drop your own egos, mingle with the minions, and lead by example.",
        "pros": "There are some great leaders at the VP and exec level (especially Betsy Sutter, Ryan Knauss, Brandon Sweeney, etc.), but many of the execs are not that approachable and keep themselves on a pedestal. There's an excellent gym on the main campus and it's a truly beautiful place to work. The delicious cafes and snacks available all the time are a huge perk as well. The company does it's best to keep employees feeling li… ke they are part of a larger community with interesting industry speakers, musicians, and large company events. Every employee was an A-player when I was there in the early days , but as it got bigger, it got very political. I worked there from 2007 - 2015, and it was a wonderful and stable place to be during the uncertain times of a major recession.",
        "summary": "Senior Manager, Partner Strategy & Operations",
        "role": "Senior Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "1. heavily rely on their inner tools",
        "advice": null,
        "pros": "1. Beautiful Campus2. Friendly teamworks",
        "summary": "Summer Intern",
        "role": "Anonymous Employee",
        "date": "Jan 23, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Hard for promotions, the career ladder is slow for new graduates",
        "advice": null,
        "pros": "Very flexible working shifts. Colleagues are very nice and helpful. Not too much pressure at work",
        "summary": "Nice company to work for",
        "role": "Anonymous Employee",
        "date": "Jan 24, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The group is dominated by certain group so sometime feel isolation",
        "advice": "Be fair and give others a chance because not only the \"lead\" knows everything",
        "pros": "Nice perks. The work is interesting",
        "summary": "QA",
        "role": "Software QA Engineer",
        "date": "Jan 25, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Performance driven culture focused on quarterly results is the challenge, although they are transforming to have more of a long term engagement model with customers.",
        "advice": "Continue path of transforming to have more of a long term engagement model with customers. Invest in improving the ease of doing business.",
        "pros": "Large suite of products to sell; loyal customer legacy customer base to sell to. Performance driven culture focused on quarterly results.",
        "summary": "Sales",
        "role": "Anonymous Employee",
        "date": "Jan 26, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Tough times with vCloud Air and DELL EMC deal in the wings still linger ahead.",
        "advice": null,
        "pros": "There are some great people and the company culture is strong.",
        "summary": "Surprising for a large company",
        "role": "Anonymous Employee",
        "date": "Jan 26, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Declining culture, mediocre pay, frequent layoffs.",
        "advice": null,
        "pros": "Great People, Great Location, Great Team, Amazing Health benefits.",
        "summary": "Started out great...",
        "role": "Anonymous Employee",
        "date": "Jan 27, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "VMware is going through a lot of change and growing pains. Leadership seems to be having a difficult time navigating the marketplace and it feels like the ship is starting to sink. I think they'll eventually figure it out, but it's definitely been increasingly challenging. Career advancement has been much more difficult the past 9 months.",
        "advice": "Executive leadership needs to get a better vision. Stop making bureaucratic decisions that lack common sense. Give your front line managers autonomy and trust them to make decisions.",
        "pros": "Great work life balance. Managers are excellent. The training BDRs receive is phenomenal. Pay is competitive. Historically career advancement has been easy.",
        "summary": "Business Development",
        "role": "Business Development Representative",
        "date": "Jan 28, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Dell acquisition has disrupted VMware's independence from EMC",
        "advice": null,
        "pros": "Great company Great work atmosphere.",
        "summary": "Good company",
        "role": "Sales Engineer",
        "date": "Feb 2, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not the right place if job stability is critical for you. Blind layoffs will surprise everyone occasionally no matter how important, critical, loyal or clever you are.",
        "advice": null,
        "pros": "very very flexible working hours (despite my moral conscience making me work 12h/day on busy periods like releases and other important dates), \"unlimited\" time off within common sense.You'll love it if you are in the right team/project.Very exciting technology.Great people to work with.",
        "summary": "Very good... while it lasts :)",
        "role": "Staff Engineer",
        "date": "Feb 3, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Innovation is an uphill battle against management at all levels: you gotta be a true believer not to give up. Money is the new Deity in town.",
        "advice": "\"we're not Google\" is NOT a battle cry, it's a lame self-deprecating call to inaction. Just stop using that as an excuse.",
        "pros": "The tech is awesome, so are the people producing it. Pretty good perks, and a gorgeous campus that really feels like home.",
        "summary": "Not as good as it could, and used to, be",
        "role": "Staff Engineer II",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Can be difficult to effectively work remotely, or to influence and interact if not based in Palo Alto.Lots of questions about EMC/Dell deal.Inter-team and inter-BU collaboration needs work.",
        "advice": "Start making middle management (directors, etc) accountable for missed deliveries, incorrect focus, etc.Mandate a single methodology (e.g. SAFE) and ensure they are actually adopted and used.",
        "pros": "Good community awareness and support.A lot of high caliber people.Well-recognized company.Good access to internal lab and development resources and technology for design and test work.",
        "summary": "PM at VMware",
        "role": "Anonymous Employee",
        "date": "Feb 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Middle level managers are not very efficient.",
        "advice": null,
        "pros": "Has some really good products and with company growing there are multiple opportunities for learning.",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Feb 7, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Internal politics. Need to go back to the basics of what has made the company great.",
        "advice": "The employees are what makes this company great - remember that.",
        "pros": "Great people, great products, excellent benefits and facilities in Palo Alto. Some of the most interesting projects I have ever worked on.",
        "summary": "Senior Manager",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of change going on with the planned Dell buy-out of EMC. Casts shadow over the organization. Lots of uncertainty.",
        "advice": "Look after teams as company continues to change.",
        "pros": "Great place to work, great people, innovative dynamic culture.",
        "summary": "Good Company but it is an transition",
        "role": "Anonymous Employee",
        "date": "Feb 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Managers tend to replace current employee to bring their own team from outside",
        "advice": "continue to develop and maintain your employee",
        "pros": "Great company to work for when you have the support of your Managers",
        "summary": "Senior Field & Partner Development Manager",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Outsourced all of there client support to india for there vCloud Air department. Got rid of employee cost to make the DELL/EMC purchase more attractive. Management was poorly hired.",
        "advice": "Hire managers and senior management to match the culture you are wanting to grow. You turned a great inviting, collaborative environment into a call center.",
        "pros": "Great employees and stocked kitchens. Plenty of places to get away within the building to decompress and have fun.",
        "summary": "Client Success Specialist",
        "role": "Anonymous Employee",
        "date": "Feb 12, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company as a whole seems too convinced of their own wonderfulness, which may cause them to under-estimate risks and over-estimate their own strength. They pride themselves on being entrepreneurial, but that seems to translate into a lack of clear focus at the middle levels. Corporate vision on the leadership level doesn't seem to translate to consistent strategic & tactical behaviours.",
        "advice": "Work harder at connecting the dots between overall strategy, individual technology plays and the tactics in play at the day-to-day action levels. Look more honestly at the risks and challenges facing the organization.",
        "pros": "People seem to believe in the company, particularly the long-timers. Campus in Palo Alto has all the amenities you might want. Good benefits and pay scale. People care about what they are doing and try to do their best.",
        "summary": "Devoted Staff, Fuzzy Mission",
        "role": "Anonymous Employee",
        "date": "Feb 15, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Move not fast enough anymore. Sometimes you have to be self-driven. Need more cool and innovative projects. Break the current tires. Management should be more aggressive.",
        "advice": null,
        "pros": "Very flexible and free culture. Provide competitive packages. Good work-life balance and benefits. Employee has choices on things they like to work on.",
        "summary": "VMware",
        "role": "Senior Member of Technical Staff",
        "date": "Feb 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Business growth has slowed, facing competition in cloud services. Pressure from investors and parent company EMC for growth.",
        "advice": "Listen to engineering leadership, trust them, involve them more.",
        "pros": "Leader in virtualization, smart people, lot of opportunity to learn and grow. Open culture, flexible work environment.",
        "summary": "Staff Engineer",
        "role": "Staff Engineer",
        "date": "Feb 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Currently lacking the ability to articulate position in the market",
        "advice": null,
        "pros": "Great Technology and Passionate people",
        "summary": "Staff Technical Account Manager",
        "role": "Staff Technical Account Manager (TAM) and Team Lead",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pace is extremely fast, which can sometimes create confusion and pit groups against one another.",
        "advice": null,
        "pros": "Great people -- creative, collaborative, willing to jump in. If you have a good idea, you're usually given the opportunity to implement it.",
        "summary": "Great people",
        "role": "Senior Manager",
        "date": "Feb 20, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No cons for working at VMware. There aren't too many things to not like about VMware. If I had to not pick it would be the 401K match is capped each quarter.",
        "advice": "Keep driving the VMware for growth through being an innovation leader. Define the next generation of data center and IT technologies.",
        "pros": "Good work atmosphere. Benefits and perks are really good. I will highly recommend to work in this company. Best in class technology and products. Everyone is treated fair and with respect. Health benefits are much better than other companies",
        "summary": "Great place to work",
        "role": "Software Engineer",
        "date": "Feb 20, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The impending Dell acquisition of VMware's parent company, EMC, means it's now time to begin cutting costs, as many of us expected. The risk is this will play out over many months, undermining confidence that projects and jobs are safe. All negative ratings below are based on the uncertainty created by this deal.",
        "advice": "1. Don't ask us to be proud of participating in this enormous business deal that so far has been all down-side for employees, while clearly a few key executives and the attorneys stand to make millions. We're not blind or stupid.2. Quickly finalize all pre-acquisition layoffs and all project changes or deferments, and definitively establish a new normal. Do not slow-roll this. People need to know the dust has rea… lly settled, so we can decide if this is where we want to be.3. Compensate everyone a little and key people a lot—so everyone gets a little something for the beating our stock has taken, and to show people their is upside in this deal for them too.",
        "pros": "Interesting challenging work on leading edge technology. Great, flexible working environment and middle managers. Terrific people, pay and benefits. Day to day, VMware is a really good place to work.",
        "summary": "When Elephants Dance",
        "role": "Business Analyst",
        "date": "Feb 20, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management provided limited or no awareness of up and coming activites",
        "advice": "provide more insight to the up and coming activites",
        "pros": "I liked working with my colleagues.",
        "summary": "Work Culture",
        "role": "Anonymous Employee",
        "date": "Feb 20, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Still needs to scale processes and infrastructure in line with its growth",
        "advice": "Be agile but also plan for the future and not just live quarter to quarter",
        "pros": "Great technology which is cutting edge and leader in the market",
        "summary": "Great technology",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The new leadership team has caused a departure for many of the top people and they no longer dream big. There is new instability caused by the proposed acquisition of the company by Dell.",
        "advice": null,
        "pros": "VMware is a very important company in the enterprise software market. There are many amazing opportunities to work with great people and to make an impact on a global company.",
        "summary": "Trending in the wrong direction",
        "role": "Vice President of Product Management",
        "date": "Feb 24, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Sometimes there was downtime and could be slow",
        "advice": null,
        "pros": "Fantastic company to work for, cater to the employees, flexible work environment",
        "summary": "Technology Analyst",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "VMware is stuck in some very old ways of doing things internally. They're trying but not it's difficult to move a 10,000 pound gorilla.",
        "advice": null,
        "pros": "It's an ok place to work. Innovative and fast paced. Lots of healthy snacks in the break room. Amazing people.",
        "summary": "It's ok",
        "role": "Anonymous Employee",
        "date": "Feb 28, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Organizations and groups more than often working in silos.",
        "advice": "Make sure all organizations and groups are aligned and working together.",
        "pros": "Great company with great culture and values, fantastic campus, good work/life balance.",
        "summary": "Product Line Marketing Manager",
        "role": "Anonymous Employee",
        "date": "Mar 4, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not enough resources to do the job in 40 hours",
        "advice": "Need to provide more budget to hire additional resources",
        "pros": "The culture at VMware is terrific",
        "summary": "Program Manager",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Equity has taken a dump due to Dell EMC merger- In silicon valley, equity growth is a must aspect of any job",
        "advice": "Think of employee retention and share holder valuesNeed to figure out a way to bring back the stock to pre-merger level",
        "pros": "Competitive payGreat technology and IP valueWorking on cutting edge, relatively newer tech",
        "summary": "Competitive pay, Great technology and IP value, Equity growth is a concern",
        "role": "Anonymous Employee",
        "date": "Mar 8, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Similar challenges to any large enterprise: slow response to business needs, some bureaucracy.",
        "advice": null,
        "pros": "Great company, great benefits, wonderful people",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Mar 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Growth of company has introduced layers of management that can be cumbersome to work through.",
        "advice": null,
        "pros": "Forefront of technology and well established market leader.",
        "summary": "Sr. MTS",
        "role": "Senior Member of Technical Staff",
        "date": "Mar 10, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Steadily increasing EMC mentality. Company is slipping into the me first, no one else second attitude internally. Too many good executives and good people have been leaving or pushed out over the last eighteen month as they prepare for the Dell/EMC merger",
        "advice": "There are so few executives and management level people left who have any history with the company that the field has little trust in them - they have shown little understanding about the VMware values the last 18 months that many good employees are actively looking to leave VMware. That hasn't happened previously.",
        "pros": "Great people to work with. Excellent internal technical partners. Good compensation and benefits. Ability to switch roles over time and grow. Good work life balance.",
        "summary": "Not the company it was two years ago (or ten years ago)",
        "role": "Anonymous Employee",
        "date": "Mar 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You have to bargain well at the joining for getting good salary. Else, not much growth yearly.",
        "advice": "Has a room for improvement. Different teams use different tools for the same purpose within the company. There should be good governance and control.",
        "pros": "Good work-life balance. Good food. Good growth opportunities (depends on how supportive your manager is)",
        "summary": "Vmware Review",
        "role": "Anonymous Employee",
        "date": "Mar 13, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Like any Fortune 500 companies, as a company gets larger, efficiency starts to decline. There are many many divisions in departments which lead to too much red tape. Finding your way to the correct person for access or answer takes much longer than it should.",
        "advice": null,
        "pros": "-Usually pays at top of market value-401K matching, Stock purchase plan-Many perks through Beneplace-Global company allows flexibility to move international-Free Employee training on all VMW products-Free employee access to VMW products for lab use",
        "summary": "Great company and culture",
        "role": "Anonymous Employee",
        "date": "Mar 14, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extremely political cultureOveremphasize of Branding of oneself",
        "advice": null,
        "pros": "Great Work Life BalanceGreat BenefitsNice coworkersGood compensation",
        "summary": "Good Company",
        "role": "Anonymous Employee",
        "date": "Mar 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Starting to show signs of an old school tech company that is getting slowed down in the paperwork and has too many people making too many processes to make processes.",
        "advice": "Stay focused on what is really important - stop trying to find validation for your job.",
        "pros": "Great technology, great people... fun to be a part of something that is growing so rapidly and so well known in the industry. Rapid pace and lots to do. Great focus on personal growth and development.",
        "summary": "Mixed Emotions",
        "role": "Senior Marketing Manager",
        "date": "Mar 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Culture is not what it used to be",
        "advice": null,
        "pros": "Great benefits, work with smart people",
        "summary": "Systems Engineer at VMware",
        "role": "Systems Engineer",
        "date": "Mar 17, 2016",
        "is_current": true
    }
]