[
    {
        "rating": 3,
        "cons": "Poor communication and training from sales enablement and company marketing.Executive Management believes marketing is not necessary to sell solutions.Employees are not treated with respect from management",
        "advice": "Put more emphasis on team building activities, sales enablement and better compensation plans through the reseller channel.",
        "pros": "Cutting edge technology with market leader owned by EMC.Good compensation plans if you over achieve sales plans",
        "summary": "Fast paced environment with great technology but poor management and operations.",
        "role": "Strategic Account Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Poor quality of management- Nepotism (VPs/GMs hire their own friends)- Good people are leaving as they are being overlooked",
        "advice": "- Promote good management talent from within- Hire new talent from top companies and schools- Please discourage nepotism",
        "pros": "- Company making money through cash cow virtualization platform- Stock has been growing- Company riding cloud wave, vision set by CEO- Several new products are being introduced",
        "summary": "Stay for stability, Leave for promotions",
        "role": "Anonymous Employee",
        "date": "Jul 10, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "New company acquisition integration plans need to be developed, Sales and Consulting organization having difficulty in migrating to solutions sales with the wider portfolio of products. The corporate culture is in disarray with all the new blood especially as you move away from Palo Alto. The management layer is too heavy in the middle and outside of engineering teams, meritocracy is being replaced by yes men.",
        "advice": "As the company has grown, there is too much middle management. This layer is often lacking leadership skills which is hurting morale. The recent departures of personnel, while expected with the vesting of the IPO options, has resulted in a good level of brain drain. Many of the wrong people are leaving due to stunted opportunities. Open dialog with the ability to challenge ideas is decreasing.",
        "pros": "Tremendous technological thought leadership, the VMware brand awareness and reputation is very good even with customers complaining about price. The core products are very solid in their capabilities. Many smart and passionate co-workers who really enjoy what they do. Executive management has done a great job of navigating the company into the cloud space.",
        "summary": "Great while it was a little smaller (<6000 employees), too many personal agendas ruining culture.",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Often challenging to increase salary once on-board. One review cycle annually. Out of cycle promotions do happen - they are the exception, not the rule.",
        "advice": null,
        "pros": "Industry leader. Fast pace. Lots of opportunity.",
        "summary": "VMware",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too many management internal changes",
        "advice": "Work more closely with engineers and non management professionals",
        "pros": "New Industry to learn and gain experience",
        "summary": "A good company to learn and grow your career",
        "role": "Senior Member of Technical Staff",
        "date": "Nov 4, 2011",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Scaling issues galore. Company is growing but the back office process are lacking. Lots of silos between groups and departments. Very management heavy.",
        "advice": "Spend some time cleaning up process and putting in systems to help scalability. Throwing $$$ at problem will not fix things that just need to be addressed with fundamental changes at how we approach problems.",
        "pros": "Company is doing well in the market and hence revenue numbers have been great. Bonuses and hiring have reflected that. The company tries to do a good job of trying to build community with beer bashes and company events but at 9000+ employees there are some scaling problems.",
        "summary": "Not all the cylinders are firing at the same time",
        "role": "Anonymous Employee",
        "date": "Nov 9, 2011",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "If you want a posted job, it is better to be on the outside. Otherwise, you have to fight for a position and be paid a lot less.",
        "advice": "Be more aware of the employees.",
        "pros": "Good work and life balance.",
        "summary": "Uneventful",
        "role": "Sales Representative",
        "date": "Jan 13, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "there appears to be a considerable number of managers from the same company and background which reduces any diversity of thought",
        "advice": null,
        "pros": "the technology vmware delivers is world class and will continue to be valid in customer environments for years to come",
        "summary": "I would recommend it",
        "role": "Anonymous Employee",
        "date": "Jan 25, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Quite a number of good folks left company recently. New comers bring in different work culture. Inconsistent and unclear direction from above causes confusion and inefficiency.",
        "advice": null,
        "pros": "Dynamic, cutting edge technology. Some of the old folks are very smart and have very bright ideas. Main campus is nice and modern with a great gym",
        "summary": "Pleasant experience, get the good chance to work with some bright and engertic individuals.",
        "role": "Anonymous Employee",
        "date": "Feb 2, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "- Company going through growing pains",
        "advice": "- They are trying quite hard",
        "pros": "The company and the people work on exciting technologies",
        "summary": "Good",
        "role": "Member of Technical Staff",
        "date": "Feb 23, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management is not that really great",
        "advice": "Better Management Skills",
        "pros": "TECHNOLOGY is the best at VMware",
        "summary": "Good",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Becoming a big company. Rewards depend on the team you work with. Fast growth has led to some waste. Growing fast means processes and standards have fallen behind and there's still some chaos.",
        "advice": null,
        "pros": "Great technology that is used everywhere. Company has lots of potential and their are many market growth opportunities. Growth opportunities within the company too.",
        "summary": "Great technology, lots of potential, big company",
        "role": "Senior Program Manager",
        "date": "Jun 6, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "not very good pay, management struggling with growth",
        "advice": "recgonize that engineers are not pawns that you can move around and stick in any slot and get great performance.",
        "pros": "Amazing technology, great people to work with, good culture",
        "summary": "Great People, but headed in the wrong direction",
        "role": "Technical Support Engineer II",
        "date": "Jun 8, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Management likes those who talk more than those who work. No opportunity to grow (might be my personal experience, but still).",
        "advice": "No advice here.",
        "pros": "Good work/life balance, flexible hours and possibility to work from home, might work on interesting stuff (but this greatly depends on which group you're in).",
        "summary": "Sr MTS",
        "role": "Senior Member of Technical Staff",
        "date": "Jun 29, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too much bad process, not enough good",
        "advice": "Continue to help mentor your people so they may grow.",
        "pros": "Decent pay and benefits. Regular raises and bonus depending on how good a job you do.",
        "summary": "My experience at vmware has been ok.",
        "role": "QA Engineer",
        "date": "Jul 6, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "This is a really big group of developers and it's hard not to feel overwhelmed by the bureaucracy and complexity of the products and organizations.Be prepared to be re-organized about every 6 months. VMware has some significant growing pains and isn't always effective at using all the talent they've hired.Much of the work is re-active and not pro-active.",
        "advice": "I think the software development groups need to be more autonomous. It seemed like the various products where all intertwined with a huge cumbersome build process. It had moved beyond manageable. I ended up working in a group that spent all its time reacting to problems and fixing them. The root cause of the problems was not fixed though.",
        "pros": "Great campus and benefits.There are a lot of really smart people here.Pay was more than adequate.There are a lot of different projects so you can move around to new things.",
        "summary": "VMware is a huge software development company where it can be hard not to feel like a cog in the machine.",
        "role": "Senior Member of Technical Staff",
        "date": "Jul 9, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Lot of workNot much focus on career developmentMore repetitive and less creative workNo process results in lot of wastage of productive time",
        "advice": "Be more open to ideasShow better responsibility to concerned shared by employees",
        "pros": "BrandNameNo real competitorNicely palced in the technology areaLot of work",
        "summary": "It has been very topsy turvy",
        "role": "Senior Applications Developer",
        "date": "Jul 22, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Constant changes of direction from upper management. Can't decide between having a vision and regressing into business as usual. Anything vaguely resembling vision vanishes quickly as it trickles down the management stack.",
        "advice": "Buy into your own visions. Give development a chance to work on crazy ideas again. Allow newly acquired companies/people to mingle with the culture-rich parts of the company. Knock down the silos, and look at how acquired tech can fit into more than just one area, instead of forcing people to keep reinventing the wheel you just bought",
        "pros": "Great products, solid foundation to build upon, lots of opportunity for changing jobs",
        "summary": "Hectic, disorganized, full time wolf-cry chasing",
        "role": "Senior Consultant",
        "date": "Jul 31, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor leadership in Small to Midsize Business division with very \"green\" inside managers with no or limited experience in managing a team or true understanding of how to motivate their sales professionals",
        "advice": "Hire Inside Managers with proven leadership skills that have been demonstrated by previous experience",
        "pros": "Leader in virtualization industry; professional growth opportunities; culture, people and executive leadership team; fast paced environment",
        "summary": "While attempting to build a motivating environment, this division is measuring its employees to metrics vs attainment",
        "role": "Inside Sales Representative",
        "date": "Sep 5, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Focused more on selling, than on the folks that work behind the scenes. Outsourcing personnel to cut costs, at the expense of internal people.",
        "advice": "Remember what VMware was like pre-IPO. So many people loved working there; now, those who have left are glad they did...",
        "pros": "Great teams that contribute tirelessly to the company goal. Good salaries and benefits.",
        "summary": "A forward looking company that strives to be the best and outwit the competition.",
        "role": "Anonymous Employee",
        "date": "Sep 10, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Incoherent vision, confused employeesWild wild west inside. Too much worship of rockstars at the cost of product adoptionNo great benefits for employees who joined after 2010",
        "advice": "Get the vision stitched well togetherOver communicate to empower the employeesStomp down on rockstars and make them collaborate.",
        "pros": "Great products. Amazing gravitas from customersSmart team and go-gettersCompany with the right ingredients to effect an IT transformation",
        "summary": "Epicenter of cloud computing with incoherent vision",
        "role": "Senior Product Marketing Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Over aggressive project time lines",
        "advice": null,
        "pros": "High pace, high growth environment. Very ethical.",
        "summary": "Great place to work but takes a toll",
        "role": "Lead Applications Developer",
        "date": "Sep 17, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work life balanceChurn in upper management",
        "advice": null,
        "pros": "Great learning in several departmentsLeading edge from a product perspectiveInnovative",
        "summary": "Very competitive environment",
        "role": "Programmer",
        "date": "Nov 2, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-About to get first hand knowledge of a competitive market-Sales model is changing. Not sure if senior leadership has the skill set to foster the change-It's all about the numbers",
        "advice": "-Listen to your people in the field. That's where the customer is spending most of their time-Look inside for some of your brightest talent.",
        "pros": "-Knowledgeable people-Good product set-Financial performance has been good up to now-Good benefits and pay",
        "summary": "A good place to start your career...",
        "role": "Director",
        "date": "Nov 19, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Upper Management is still learning how to keep things under control.Most of the original people have left, and the ones remaining behind have a bad attitude.",
        "advice": "Make hard decisions, and stick to them. Make people accountable and responsible for their mistakes.",
        "pros": "Continues to be at the bleeding edge in some technology areasYou work with smart people if you get into the right team",
        "summary": "Great Company to work in... if in the right group",
        "role": "Senior Manager",
        "date": "Dec 5, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "prefer not saying, but quite a few.",
        "advice": "help the growth of employee's career path, instead of the growth of workload.",
        "pros": "no comment for this company.",
        "summary": "hang in there",
        "role": "Software Engineer",
        "date": "Dec 12, 2012",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "never a break as there are always many things on your plate",
        "advice": "evaluate volume of work and value your employees' personal lives.",
        "pros": "Get to work with dedicated and smart people",
        "summary": "Good product but demanding of employees",
        "role": "Senior Customer Service Representative",
        "date": "Dec 26, 2012",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "challenges in sales middle management in terms of realizing the market and direction",
        "advice": "Provide more communication and plans for personal and professional development.",
        "pros": "people and technology are great",
        "summary": "It is a great technology company",
        "role": "Senior Systems Engineer",
        "date": "Jan 4, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- incompetent and corrupted QA higher management- poor company culture- hypocritical - promote professional growth, but wont allow to actually grow. Example, HR will send plans for employees to improve their skills like taking additional classes, but manager wont ever approve siting project timelines",
        "advice": "Hire professional QA managementStart really care about employee professional growthBuild teams",
        "pros": "- cutting edge technologies- valuable experience- great campus, cafe, beer bashes- free food and drinks in the kitchen- gym-",
        "summary": "Thrilling at the beginning and disaster in the end",
        "role": "Senior QA Engineer",
        "date": "Jan 16, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Slow paced company. Some teams does not have enough time to train/mentor new hires, that means you should be a good self-learner.",
        "advice": "Focus on training and mentoring of new hires. Try to make this company more agile.",
        "pros": "Great challenges, smart engineers, cutting edge technology company focused in give more value to its customers in every release.",
        "summary": "Member of Technical Staff",
        "role": "Member of Technical Staff",
        "date": "Jan 20, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Company has grown fast and IT processes are sometimes medieval. Sometimes, things get done only by working around the established processes.",
        "advice": "Invest in IT. It's ridiculous that a company this size has to postpone simple fixes to systems used manage Channel Programs, Customer Support, and other key functions.",
        "pros": "VMware is full of nice, smart people. The average age is not too young, which means people give importance to having a balanced life. The VMware Foundation shows that the company cares about more than just making money. Employees are given five days per year to use volunteering at non-profit organizations.",
        "summary": "Company has grown fast and infrastructure needs to catch up. Lots of smart people.",
        "role": "Senior Program Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Large size adds lots of process and may stifle innovation. Is focused on core areas now, so wide range of possibilities explored in the past are available less. Engineering and marketing can collaborate better than they do. Has hired many people recently from other large companies and they brought their own habits and practices, and VMware lost a bit of its own culture.",
        "advice": "Provide more autonomy for innovation",
        "pros": "Emphasizes engineering driven development and new ideas were often innovative in the past. Good modern facility in Palo Alto",
        "summary": "Is a large company",
        "role": "Senior Product Manager",
        "date": "Feb 4, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- executives lack ability Inability to make tough decision; they allow competing projects to go on too long undermining eachother leading to a no-win situations.- hyper-visor / platform team have too much say / power: VMware claim they want to move \"up the stack\" into management software and new domains but efforts have been obstructed by senior, core teams who only have experience building operating systems and … command line tools.- promises of technical career progression don't seem too promising: Sr Staff and above seem dominated by old-timers and acquirees; little potential for organic promotion- recent \"re-focussing\" and spinning-off of the \"Pivotal Initiative\" seems to be an admission the company is incapable of moving into new areas which is disheartening.",
        "advice": "Be decisive and put an end to the Darwinian product development: choose to invest in something and get everybody behind it.",
        "pros": "- culture of excellence, quality- a lot of smart people- genuine commitment to innovation",
        "summary": "Good engineers, indecisive management",
        "role": "Staff Engineer",
        "date": "Feb 5, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-Toxic environment at times- lack of accountability",
        "advice": null,
        "pros": "- Great technology- Great people- New CEO steering the ship towards greater accountability and execution",
        "summary": "Going through change - for the better, but painful",
        "role": "Director",
        "date": "Feb 21, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Completely disorganized company with very little process in place and a pace that can be very challenging. Since 2013, no PTO anymore...",
        "advice": "Stop managing the company as if it was a start-up",
        "pros": "Great Products and a fabulous growth. Former CEO had an incredible vision for the company and was so humble. I dont know yet about the new CEO",
        "summary": "Great company to work for, as generous as demanding to its employees",
        "role": "Senior Marketing Manager",
        "date": "Feb 28, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "trying to reinvent themselves as something other than a virtualization company",
        "advice": "Stick to core competencies and build on w/ adjacencies versus things like slide rocket, zimbra, etc",
        "pros": "Interesting technology and customers are big fans",
        "summary": "Love the company, but it is quickly changing, 7 managers in 3 yrs and new priorities daily.",
        "role": "Senior Manager",
        "date": "Mar 2, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "1. Moves slowly. Heavily weighed down by processes to make a predictable release. Consequently, innovation is limited to only some pockets within the company2. Attrition effects the morale of employees",
        "advice": null,
        "pros": "1. Great people2. Great technology3. Good perks4. Some interesting programs in place to motivate people to take risks.",
        "summary": "Great to average",
        "role": "Staff Engineer",
        "date": "Mar 3, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Career advancement limited. Near impossible to move into other organizations.",
        "advice": "360 degree reviews would help get a better view of Manager's performance.",
        "pros": "Great technology for virtualization and cloud.",
        "summary": "Good Overall",
        "role": "Product Manager",
        "date": "Mar 6, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Founders were forced out and much of their original team (who still had awesome ideas) has cashed out and left.\"Must have a 4.0 GPA from a top 5 School\" mentality - Many groups want to limit themselves to people like themselves and even in Management there is a lot of bias against some school.Too Much Politics - I was personally threatened by a SVP for providing review feedback on a Development Manage… r which was unflattering (she had zero compassion for the QA team and wanted them to work 60 hr weeks for more then a month keep the original unrealistic date that she had given). Who is friend is outside of work >= what you do",
        "advice": "Return to your roots and the culture of innovation ... don't worry about beating MS ... use your capital to come up with the next big thing (not just doing more stuff with VMs) and get more parking ! They had 2 parking places for every 3 offices, so if you don't come early there isn't anywhere to park.",
        "pros": "Great Culture - if this is your first job out of school, you will be spolied. Many employees get to go to VMWorld, Beer bashes on Fridays, awesome campus and great culture of continued growthGreat Senior Developer - people who not only wrote the book on this stuff but also taught the classes the book was based on and we're part of the teams that did the original work which is covered.Smart people acro… ss the board - this can be a shock for many and in some ways it's like being a pro football player - most of these people were the smartest kids in their high school, then went on to be one of the smartest people in a top five school, and when they get to VMWare, they are considered average (or maybe slightly above average) because EVERYONE is so smart.Sexy products and huge brand name - looks awesome on your resume",
        "summary": "Not the company I joined any more ... explosive growth and new Management caused major issues",
        "role": "QA Manager",
        "date": "Mar 13, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "not great management,very clicky and not sure if I would want to work there again. Pay rise are a joke and do not even keep up with inflation",
        "advice": null,
        "pros": "good career opportunities if you can get your manager behind you but not so great if they want to make life hard for you.",
        "summary": "wo rk life at vm ware",
        "role": "Licensing",
        "date": "Mar 20, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too much process, or not enough process, unrealistic expectations for delivery, sometimes not good work/life balance.",
        "advice": "Grow up. Be transparent. Make more rational decisions and keep an open dialogue with employees.",
        "pros": "Nice people, lovely campus, decent bennies, competitive salaries.",
        "summary": "That Huge Start Up",
        "role": "Senior Technical Writer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lack of product vision and clear owners in EUC.",
        "advice": "We need a vision in EUC everyone can rally behind.",
        "pros": "Great compensation and benefits. Location works well for me (short commute).",
        "summary": "Solid in the data center; struggling to reach outside of that",
        "role": "Staff Engineer",
        "date": "Mar 29, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "management culture is very different than typical bay area",
        "advice": null,
        "pros": "Great technology and great people",
        "summary": "testing this",
        "role": "Anonymous Employee",
        "date": "Apr 3, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Cons – Intern housing changes every year and may or may not involve a long commute.Projects are very independent and you get as much experience and guidance out of them as you want and ask for.Intern hack-a-thon lasted two weeks and did not provide a lot of motivation for participants to finish -overall could have been run better.",
        "advice": "Advice to Senior Management – It would be nice to have some more training on current technologies such as prototyping techniques and javascript libraries.",
        "pros": "Projects provide opportunity to make a real impactStrong team bondingExcellent payStrong intern programFree intern housingTransportation passFree shuttle to work",
        "summary": "Work on advanced technologies....",
        "role": "Member of Technical Staff",
        "date": "Apr 4, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Wide range of performers on different teams.",
        "advice": null,
        "pros": "Casual company, working on cool things.",
        "summary": "Casual company, it's what you make it.",
        "role": "Anonymous Employee",
        "date": "Apr 11, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "VMWare was full of great talent and collaboration but they have pushed most of the great talent out of the company. The few great people they have left are underpaid and under appreciated.",
        "advice": "The problems that persist are not new and throwing additional headcount to fix the issues will not solve the core problems existing within the company. Be Accountable!",
        "pros": "Innovative technologyFast Pacedone of the leaders in it's space",
        "summary": "Diluted to the point of ineffective",
        "role": "Territory Sales Manager",
        "date": "May 3, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "VMware's vision of continuing their start-up culture is lost once you begin to feel like yet another number, high turn-over rate",
        "advice": "Listen to the \"little people\".",
        "pros": "Stocked kitchen, great benefits, paid volunteer hours",
        "summary": "Resume builder",
        "role": "Anonymous Employee",
        "date": "May 9, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Organization is very siloed. Large organization mentality is setting in. Room for growth is non-existant, feedback from management is also zero. As an organization VMware has lost its agility as it has grown (almost to a debilitating point) and at the same time not reinvested in its systems and framework for a growing organization. This creates a poor environment to actually get anything done. Annual review process i… s very lengthy and cumbersome as the mgmt. has been working on reviews (and everything that goes with them) for 6 months.",
        "advice": "time to flatten the organization structure a little bit. empower remaining management and hold them accountable. Provide some incentive for veteran/long term employees to stay vs being recruited by everyone else trying to get in the cloud space",
        "pros": "Excellent campus and work amenities. Interaction within teams is very good and for the most part there is a lot of bright and talented individual contributors. VMware also does a lot for the community and in the spirit of Paul Maritz believes in \"giving back more than you take\". VMware is attempting to get back to a lean and mean state but it might be to little to late as the competition is becoming fierce in the Clo… ud and Software Defined Data Center arena. The current CEO was brought in to help right and repoint the ship, the outcome of that is still unfolding.",
        "summary": "Trying very hard to pull itself out of a steep decline.....prognosis still undecided",
        "role": "Project Manager",
        "date": "May 22, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "If you are not a star working on the core product, you do not feel valued. Several groups internally are working on competing technologies. Marketing team has little idea how the actual products work. Very old-school management philosophies, set deadline and work harder. Lots of late nights in Palo Alto.",
        "advice": "Invest in process improvements, get lean. Middle management and marketing are wasteful, causing mass confusion and less productive R&D teams.",
        "pros": "Big company perks. Pays well.",
        "summary": "VMware is confusing, complex, and eroding",
        "role": "Staff Engineer",
        "date": "May 23, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "vision is gonepenny pinching has set inone hour of discussions required per minute of actual work accomplishedrules by Excel spreadsheets that govern each fiefdomno reward for loyalty - the longer you stay the more likely you'll wind up on the purge listno training unless its on your own time",
        "advice": "Try to stick with a plan longer than it took to come up with it.Leading the industry only works as long as the industry actually follows.Try taking a survey after an \"all hands\" meeting and see how many attendees actually understood what you were trying to convey.",
        "pros": "flexible hoursaverage payaverage benefitssome ability to move between groups - assuming you can network the move ahead of timestill looks good on a resume",
        "summary": "Lots of cliques and infighting. All the liabilities of a start up and an established company.",
        "role": "Global Support Services",
        "date": "Jun 3, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Ability to earn is becoming more and more challenging with the significant increases in targetsRapid growth in the size of the middle management layer - TOO MANYI know there is politics in every org but VMware managers take it to another level",
        "advice": null,
        "pros": "Great people in the field on license sales, services sales, and delivery teams. Higher than usual positive feedback on Support response to customers.Lots of innovation on the product side and willingness to balance organic growth of products with acquisitions.",
        "summary": "No Life Balance and Very Weak Middle Management",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Challenging environment to work .. You need to be not only competent in your role but also be aware of the political landscape to get ahead..",
        "advice": "Go back to your roots of people first",
        "pros": "VMware is a firm with Good benefits and they do pay very well for a software company. The technology is still very relevant and very much in demand",
        "summary": "Started out as a great firm, slowly has lost sight of its culture",
        "role": "Consultant",
        "date": "Jun 7, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Most of products are still at very early stages have stayed there and going towards maturity",
        "advice": "Working on great technologies is great. But, also their has to be clear goal on where the product has to go. Changing directions every now and then is not good for the morale of the employees",
        "pros": "You'l be able to learn lot of new technologies and you can drive new process and technologies",
        "summary": "Lots of learning but products are not being released",
        "role": "Software QA Engineer",
        "date": "Jun 7, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-The company is transitioning from being a rising star to being the next Oracle or Microsoft. As management has changed to Pat Gelsinger's team, the company has come to resemble EMC even more and is more execution driven than vision driven. Because we are typecast as \"just\" a hypervisor company, it is very difficult to sell what VMware now does to customers who are less than progressively minded from an IT perspectiv… e. When people think, \"Oh, VMware must be easy to sell\" they do not realize that the hypervisor and core platform is commoditized and the only way to make any significant sales is to have a customer that understands the cloud computing journey VMware is evangelizing and buys the adjacent products, etc.-Quotas are completely out of control. The norm the entire time I have been there is missing your quota. As long as you are clearly doing your job, etc, this doesn't seem to result in imminent firing your life as a sales rep will always be behind the 8 ball or subject to the 6 month quota cycle.-VMware has been in an \"awkward adolescence\" period for as long as I can remember. Systems, procedures, etc don't always make sense, and the certain key processes that matter to customers are completely broken. These will hurt your sales efforts.This last piece is not necessarily a con, but many of the experienced team members are moving out of individual contributor roles to management or more interesting roles or leaving. This is more a sign that the company is in a state of transition and existing players are moving up or moving out. If you enjoy working for a large, strategic player a la HP, Oracle, Microsoft, then you may like this transition. If you are looking for a large company that still has that fresh startup positivity then you may find yourself out of place here.",
        "advice": "Spend more time on ensuring our vision works as seamlessly in reality as it does in powerpoint. When your peers and you are at 60-80% attainment and the company rocks its numbers, it makes you feel taken advantage of.",
        "pros": "-Your customers absolutely love your core product-Headquarters and satellite locations are very nice, although I was field based-The technology side is almost unparalleled. You will get few chances in your career to sell a product this solid-The vision is amazing and inspiring. If you need to be inspired by a company's strategy, this is a good opportunity. The execution is still catching up to the vision … but it is truly impressive.-Positive culture. Healthy lifestyle is encouraged here, as is work-life balance and I really do believe that it is not just lip service. They will pay your gym membership.",
        "summary": "Company in transition from up-and-comer to industry blue chip",
        "role": "Enterprise Account Executive",
        "date": "Jun 29, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Non-engineering talent is mostly mediocre, middle management is mostly weak",
        "advice": "Hire stronger / more talented managers. Empower middle management to make decisions",
        "pros": "Work/life balance, friendly people (could be said for any tech company), strong engineering talent, respectful culture where all employees are free to share opinions",
        "summary": "Frustrating company experiencing growing pains",
        "role": "Anonymous Employee",
        "date": "Jul 2, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Gradual dilution and mediocrity creeping in as the company has grown and undergone major leadership change.",
        "advice": "Re-ignite the passion and focus on the core of our company's reason for existence: x86 (and other architectures) virtualization, supporting all workloads. Clearly articulate the vision in a way that relates to the troops.",
        "pros": "Learn from your peers who created the field of x86 virtualization. Work on the cutting edge of the field.",
        "summary": "Great company with great history going mediocre",
        "role": "Senior Software Engineer",
        "date": "Jul 3, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Other people, very demanding during quarter ends, little room for advancement unless you know someone that know someone",
        "advice": "Look at all employees for advancements, not just one favorite person.",
        "pros": "People, work balance, benefits, culture",
        "summary": "A lot of Corporate Politics",
        "role": "Logistics Coordinator",
        "date": "Jul 9, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The growth causes constant change and is hard to keep up with, very very fast pass and hard to predict.",
        "advice": "Try to keep the growth and tech focused culture from the early years.",
        "pros": "I learned a ton in 4-5 years, lots of great technology and good growth.",
        "summary": "Great learning experiance",
        "role": "Anonymous Employee",
        "date": "Jul 10, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The company is going through a lot of transformation and trying to simplify and clarify it's vision statement. Revenues from the core platform are slowing and the company is aggressively looking for way to shore up revenues leading to a lot of churn in the organization.",
        "advice": null,
        "pros": "The company owns the x86 virtualization market and has a number of very bright people working there. If your based at corporate HQ, the campus is a great place to work out of with phenomenal amenities.",
        "summary": "$4B company trying to transform its self....",
        "role": "Anonymous Employee",
        "date": "Jul 11, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Sales job was more of an administrative job.",
        "advice": "On boarding was less than adequate. Managers should be more accessible to new employees,",
        "pros": "Awesome product, beautiful environment, taco and happy hour Fridays, ping pong table",
        "summary": "I was an Inside Sales Representative for the K-12 Sector",
        "role": "Anonymous Employee",
        "date": "Jul 11, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bureaucracy, no clear responsibility, too many managers and directors",
        "advice": "Execution efficiency is terrible",
        "pros": "Stable, Campus is good, Talent People,",
        "summary": "Good Company",
        "role": "Senior Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "politics, tons of title inflation, political climbers",
        "advice": null,
        "pros": "great technology, strong engineering culsture",
        "summary": "Fast Growth, Politics",
        "role": "Product Marketing Manager",
        "date": "Jul 22, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Pat lacks the vision needed to drive the company forward. He may be good at focusing the companies efforts but what is he focusing them on? This company needs some one with both vision and the ability to focus our efforts. Who cars about focusing efforts if it is in the wrong direction. All of the people that made VMware grate have gone and now there is no one with any history or vision, its great to bring in new peo… ple but it was dumb to let all of the key people get away. The company is now run by people that have no clue.Ned to do better cross BU communication, cut out the kingdom building BS",
        "advice": "Get rid of Pat and make Carl Eschenbach CEO. Even though Carl is a sales guy I think he has a clue of What VMware needs. VMware is not Intel or EMC, we where in better hands with the oracle or microsoft crew at least they understood software.Promote people based on performance not based on cost. this is not high school stop this grading on a curve.",
        "pros": "while not what it once was it is still an OK place to work. I don't hate coming to work, but I don't love it as I once did. I love the campus and the work is fun and exciting.Work life balance is still good.",
        "summary": "the future is uncertain, try again",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Make sure you work on one of the company's core products. The mood in End User Computing is very different from the rest of the company. There's less confidence about being able to build products that are useful to VMware customers.",
        "advice": "Focus on what the company does best.",
        "pros": "Generous salary, good benefits. Employees are generally happy to work at VMware and optimistic about the future of the company. Beautiful campus, pleasant work environment.",
        "summary": "Good place to work, as long as you're on the right team",
        "role": "Software Engineer",
        "date": "Aug 8, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "VMware does not seem to value US-Based non-technical people. Most of this work has been sent offshore. While there are talented people there, it devalues similarly talented people in the US",
        "advice": "Hire based on talent, not cost. VMware has plenty of cash.",
        "pros": "Solid company, values technically skilled individuals. VMware is stable and growing with a strong outlook. The company has great benefits and a great casual campus in Palo Alto. Generally the people are talented and kind. The work can be very rewarding.",
        "summary": "Good Company, Great People",
        "role": "Project Coordinator",
        "date": "Aug 9, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Being a remote business unit, we had lack of direction, didn't know where we fitted. No standard tools and directions. Didn't have clear road map and eventually the business unit was dissolved for no reason.",
        "advice": "Get your team to follow a clear standards if no company defined standards are set for specific tool. Get a clear road map and directions for your team.",
        "pros": "Great benefits, lots of resources for self improvement and health. Company paid volunteering activities.",
        "summary": "Member of Technical Staff",
        "role": "Member of Technical Staff",
        "date": "Aug 15, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not much career growth in Palo Alto",
        "advice": null,
        "pros": "Beautiful campus, pleasant work environment.",
        "summary": "MTS",
        "role": "Anonymous Employee",
        "date": "Aug 19, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Politics are rampant, the policies are enforced based on your relationships with upper management. Lies and more lies, it seems the higher you get in the organization, the more people become untruthful. Good luck getting a VMworld pass..lol, you need to either present, work in lab or be on the floor in a booth.",
        "advice": "Get rid of 2/3 of your management. It's funny that the supposed brain trust from Stanford and this is what you get - backstabbing employees.",
        "pros": "Good technology all round. Sales kick off is good.",
        "summary": "Good technology, poor upper managment",
        "role": "Senior Sales Engineer",
        "date": "Aug 31, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Constant change, Management treats employees like children",
        "advice": "Treat employees like peers not students",
        "pros": "You have the ability to run your own territory and have the ability to make good money. Good benefits as well",
        "summary": "Decent Salary",
        "role": "Inside Sales Representative",
        "date": "Oct 4, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The culture is changing. Feeling more like corporate america. Performance is no longer being managed by outcomes but instead by who you know. Work life balance and management's lack of knowledge or understanding of resource needs.",
        "advice": "Pay attention and value management's assessments of what it is really like to work there. Focus on the outcomes. Leadership by escalation is not true leadership.",
        "pros": "the Vision of the technology",
        "summary": "Need to find a place that realizes my value",
        "role": "Operations Manager",
        "date": "Oct 7, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "When management changed. Too much micro managing",
        "advice": null,
        "pros": "My co-workers and the environment within our team",
        "summary": "My experience was just okay.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Becoming a lot like Dell with regards to managing people based off of spreadsheets.",
        "advice": "Worry more about the customer and the industry they are in.",
        "pros": "Good benefits and great solutions",
        "summary": "Inside Sales role",
        "role": "Inside Sales Representative",
        "date": "Oct 17, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-Questionable management-Too many management layers with little strategy and direction (especially with career growth)-Very little trust in employees, management seems more concerned about politics and less about leading a team.-Bosses, not leaders",
        "advice": "Stop acting as a boss and start acting as a leader. We understand you brought in old colleagues, but they may not be the best and brightest employees. Start to innovate, think outside the box and don't be afraid of failure.",
        "pros": "-Beautiful campus with an amazing workout facility-Early opportunities to grow-Salaries are very competitive",
        "summary": "Early growth opportunity stalled by new management",
        "role": "Marketing Manager",
        "date": "Oct 25, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The growing size has made the atmosphere is very political. There is too much middle management that are not good managers. Valuable contributors are getting overlookedThere is excessive bureaucracy that hinders productivity.",
        "advice": "Need to keep focused on customer satisfaction and employee satisfaction.",
        "pros": "The main campus is wonderful with great facilities and lots of perks. There are great employee benefits including a nice 401K match and also \"matching gifts\" for charity. Many organized functions and events for employee participation.",
        "summary": "Nice benefits, but too much bureaucracy",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "While I was there there was an immense hiring boom and money was thrown around recklessly. Unfortunately, part of them fixing this problem was laying off 900 people. I didn't get the feeling that the upper management did what it took to get strategy messages to the people doing the work. All the managing that was done was bottom to top.",
        "advice": "Pay more attention to the lower-level employees who actually do the work.",
        "pros": "Reasonable amount of autonomy, Good salary and work environment, Some very smart co-workers (and some not so smart).",
        "summary": "Growing to Death",
        "role": "Senior Consultant",
        "date": "Oct 28, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "ability to advance is difficult, frequent re-orgs",
        "advice": "hire from within.",
        "pros": "work life balance, competitive compensation",
        "summary": "Great work life balance",
        "role": "Program Manager",
        "date": "Oct 29, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "lots of politics. some people dont do any work at all.",
        "advice": null,
        "pros": "It is an ok place to work.",
        "summary": "Okay place to work",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Company has been showing growing pains for some time and is having trouble retaining talent. They're in desperate need of strong, experienced leaders to ensure execution and success.",
        "advice": "Focus on hiring, retaining and developing top talent.",
        "pros": "Exciting technology at the forefront of datacenter evolution",
        "summary": "Great technology and a lot of potential if they can keep it together and execute.",
        "role": "Marketing Manager",
        "date": "Nov 25, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Lots of talk and attention to culture and values but not always followed thru with real effective change.- Revolving door of executive and business unit management- Product strategy and focus changed too frequently- Long development cycles",
        "advice": null,
        "pros": "- Challenging work and new business opportunities- Excellent opportunities to interact with customers, partners, field, etc.- Agile development- Strength of relationship with immediate manager is critical",
        "summary": "Overall; a rollercoaster ride but OK for now",
        "role": "Product Manager",
        "date": "Dec 5, 2013",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Miserably unable to assess talent and promote from within. Very political, lots of maneuvering. Way too many meetings. Not set up for virtual teams and the location makes it difficult for many to get there (worldwide as well as in the Bay Area). Still a bit self-important and riding on coattails of past success.",
        "advice": "Company needs to genuinely manage down instead of massive manage up focus. Also, what's up with the lack of women in management, sr. mgmt. and on the board?",
        "pros": "A lot of great people who really want to do a good job. They take good care of you and the environment is very pretty. It was a great place to learn an area of tech that was new and groundbreaking.",
        "summary": "Good to be there, good to leave.",
        "role": "Product Marketing Manager",
        "date": "Dec 11, 2013",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "-Frequent management changes or restructuring-No real career planning for level-Certain times no communication-Work hard (but rewards don't go with the hard work)- Benefits not to Industry standards for tenured employees-Very slow promotion process, easier to get promoted by leaving. also very minimal pay increase year over year- Groupism at Management layer",
        "advice": "-Senior management not accessible much, only on certain occasions.-the number one things I'm unhappy with is the lack of opportunity to try a different role or to move up in the company. growth is so hard to find here.- Build an employee career plan that keeps existing employee close to the level of benefits they would receive if they just joined based on market condition and qualifications. if you won't do t… hat, someone else will.",
        "pros": "- Good place to learn- Emphasis on giving back to society- Good facilities and campus",
        "summary": "Good and Bad+++ increasing",
        "role": "Supervisor",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Career development is not clear, and no real way to voice your opinions,",
        "advice": null,
        "pros": "Growing company with a lot more potential to make an impact in the industry. Great looking campus and still building out more.",
        "summary": "Overall a good place to work but has its ups and downs.",
        "role": "Anonymous Employee",
        "date": "Jan 10, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Gobbles up and spits out acquisitions",
        "advice": "Please think about your acquisition strategy before bringing on loads of people you don't intend to keep around. Companies are more than just a technology, they're full of people whose livelihoods depend on those jobs.",
        "pros": "Great benefits, great growth potential, innovative.",
        "summary": "Great Employer, Bad at Acquisitions",
        "role": "Anonymous Employee",
        "date": "Feb 16, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Upward moves within finance are difficult. The work load burns many analysts out within the first year thus leading to high turnover.Operations is not very supportive of finance and rarely invites them to a seat at the table.",
        "advice": "Work to ease the workload on your analyst so they want to stay and grow with the company",
        "pros": "Small teamsGood benefitsDecent payCFO who seems genuinely interested in implementing a rotation programManagers who try to support a work life balance",
        "summary": "Smart energetic finance people",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "management is satisfied with what they have and is lack of vision",
        "advice": "process is over emphasized in some management and it makes everything becomes a political issue.",
        "pros": "technicality and innovation are centric in the engineering side.",
        "summary": "full of talented people",
        "role": "Senior Software Engineer",
        "date": "Feb 22, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor upper management and QA is all driven by Development",
        "advice": null,
        "pros": "Good working environment and good technology",
        "summary": "VMware",
        "role": "QA Manager",
        "date": "Feb 27, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Politics, chaotic (given company size). vmware is an amalgamate of acquisitions with lots of way to integrate them in. Company is too inert to effectively learn from past mistakes.",
        "advice": "Holding on to incumbent non performing upper management staff poisons troop morale. Put result based metrics in place to help separate the wheat from the chaff.",
        "pros": "Beautiful campus, at least the old part, Good benefits, Job security.",
        "summary": "All depends in which team you land.",
        "role": "Senior R&D Manager",
        "date": "Feb 27, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Has become a bit of a 'good old boys' club and middle management has become a breeding ground for sycophants. Upper management is comprised of many FOC's(friend of Carl's[Eschenbach]) who are were good when VMW was a start-up but who are now out of their depth . The company has lost its way a little as it has grown and this has killed off its wonderful culture.",
        "advice": "Do not suppress talent. Re-engage with the channel and build a senior management team that can do this. Employ the best and most qualified to promote NSX and not FOC's and sycophants. Without success in this area you will become a one trick pony.",
        "pros": "Great working environment. Smart people. Excellent products. Admirable reputation",
        "summary": "One trick pony!!!",
        "role": "Sales Manager",
        "date": "Mar 6, 2014",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Can be reactive environment, short-sighted management and strategies (quarter to quarter or end of quarter), lots of starts and stops, slow to promote people. Hard for women to move high in the ranks. Very 'deliverables' focused environment -- sometimes more about producing 'something' versus the RIGHT thing.",
        "advice": "The company has had record profits but budgets are continually cut or frozen so teams are being asked to do even more with less and it's happening at the expense of your people and the customers and partners we serve. Give us what we need to be successful and you will have more loyalty all around. Also stop being so reactive and allow us to focus on more than one thing at a time - we can do that.",
        "pros": "Smart people, great benefits, challenging work, general work/life balance and opportunity (for some)",
        "summary": "Good company, a lot of growing pains",
        "role": "Anonymous Employee",
        "date": "Mar 21, 2014",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Layoffs have become routine every Jan.- Constant changes with sales alignment.",
        "advice": "More consistency!",
        "pros": "- Benefits- Work life balance- Growing technology",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "Mar 24, 2014",
        "is_current": true
    }
]