[
    {
        "rating": 1,
        "cons": "Too many pissing matches at levels above you keeping any progress from occurring.For instance HRC why? If there is an budget why the micromanaging?Platforms? Platforms do not work. Why does it takes months to release features - platforms. If properties were able to build innovative products without having the restrictive nature of platforms then yahoo would be more interesting place to work. As it is now it i… s like crawling vs the pace it used to conduct run. May it run like a 1000 small BUs and yahoo will innovate and lead again. Sure that seems hard but how well are you doing now?",
        "advice": "Stop hiring and promoting only sycophants. Being given input by those who benefit from only good news is the down turn of that place.",
        "pros": "It used to be a great place to work",
        "summary": "Yahoo! Past performance does not ensure current success. Too may hires of folks who have never nor could.",
        "role": "Systems Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Horrible culture. A lot of incompetent people that rose quickly in the early days hold management positions and keep making bad decisions. Business units are too siloed. Serious inability to cooperate between business units and/or functions with a unit. Yahoo! Hotjobs is the absolute worst business unit. All management there are buddies & they are all incompetent.",
        "advice": "Clean house (which I think they are doing). Listen to customers. i know deal with Yahoo everyday and there isn't a single person in the media industry that will tell you that Yahoo is easy to deal with. They are horrendous. Make customer service and sytems designed for customers the focus.",
        "pros": "The pay and benefits are great. And Yahoo is a great name to have on your resume.",
        "summary": "They were once a great place. If you go there, go in eyes open and be careful who you trust.",
        "role": "Product Marketing Manager",
        "date": "Apr 23, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The management is completing incompentent, racist, sexist, anything you can name I have never seen such bad behaviour. It's a sad state of affairs over there and they are cutting back in fear and hope that is will raise the stock price. They buy up companies and then don't integrate them properly knowing nothing of culture or inspiration. They've lost the plot completely.",
        "advice": "Sell the company now, you don't know what the hell you are doing.",
        "pros": "It used to look good on your resume and maybe you can get a good exit package.",
        "summary": "Yahoo= Hell",
        "role": "Senior Director, Music",
        "date": "May 11, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bottom line: This company sucks! Don't come!",
        "advice": "Resign!",
        "pros": "None. This is the worst place to work. You will work with dinosaur technology, inane management, bottom of the barrel pay.",
        "summary": "This is a sinking ship",
        "role": "Software Engineer",
        "date": "Jun 11, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Because of the special attention given to employees, they have unfortunately turned into a bunch of spoiled brats. Senior management is absolutely incompetent. Jerry Yang has ruined the company with his incompetence. He should never have become CEO. There are reorgs every 3 months and no one knows what to do or which group they belong to. A lot of properties are paralyzed by the Microsoft bid. Even devel-random is si… lent whenever something negative is brought up because no one can defend the company any more. Key employees are leaving and it really feels like a sinking ship.",
        "advice": "Senior management needs to be culled, by about 66%. There are far too many managers, directors, and VPs. Sue Decker, Jerry Yang need to be held accountable for their failures as leaders of this company and for turning it into the laughing stock that it is now, and they should resign. Enough corporatespeak and just admit that Yahoo is declining and try to rally the employees into working hard.",
        "pros": "They spoil their employees, and you really feel good about how they treat you. Bar none, they really go out of their way to treat their employees well.",
        "summary": "Yahoo has passed its peak, DO NOT MAKE THE MISTAKE OF JOINING YAHOO",
        "role": "Technical Yahoo",
        "date": "Jun 17, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Yahoo! is a big company that grew too fast and management isn't able to handle the changes and responsibilities that entails. It hasn't developed the infrastructure necessary; all internal systems and tools are poorly designed and buggy. Communication among groups is poor, with many \"silos\" within product groups. Management is good at giving the big picture -- what the big 3 goals are -- but is short on details, like…  how you meet those goals and how you measure success.At Yahoo!, who you know is definitely more important that what you know and what you do and how well you do it. Success is built on relationships and sometimes building and retaining relationships takes precedence over quality and business.Management definitely does NOT want feedback if it is at all negative or anything less than enthusiastic optimism. Even the most tactfully worded feedback that might suggest that a plan is maybe, perhaps, perchance lacking in details or merit is treated as treasonous. It's \"get onboard or get out.\" No one in management wants to be told that the bus is heading in the wrong direction.",
        "advice": "Get rid of the upper and middle management. Anyone above the level of Manager should consider his/her job at risk. Get rid of the long-time management -- those folks who have been with Yahoo! for 10 or more years and have retired on the job.",
        "pros": "The company perks and benefits are OK -- better than average for the Valley. For tech-types, there's lots of internal training available. For others, there's very little.",
        "summary": "A once-great employer is now directionless",
        "role": "Managing Editor",
        "date": "Jun 21, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Only hire contractors and then fire people AT WILL with absolutely no notice. Yahoo! also propagates \"dress down\". What they dont tell you is that they will hire you (only as a contractor), say how great you are, then replace you with outsourcing, then fire you without notice. They also let you work from home. Very catty atmosphere. Not conducive to growth. Realistically, dress down does not matter. What does matter … if they were upfront about replacing people with outsourcing. It would be nice to have at least 1-2 weeks notice. At will sucks. And so does YAHOO!",
        "advice": "Quit and let someone intelligent do the job.",
        "pros": "If you really hate yourself, and all other companies, then definitely work for Yahoo!",
        "summary": "Does YAHOO! really suck? Yes.",
        "role": "Service Desk Tech",
        "date": "Jul 8, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Product based company but lack in the process impelementation.",
        "advice": "Please leave the company to bring young and good talent to change the shape of yahoo in the market or society.",
        "pros": "Branding, casual, fun, good, exciting.",
        "summary": "cool company to work but not a place for learning....",
        "role": "Technical Yahoo",
        "date": "Aug 24, 2008",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management is clueless. There are way too many employees in Yahoo! now that are interested solely in bettering their resumes. There is no interest whatsoever in company profitability or advancement of existing strengths. You will find a great example of this in two failed products both launched simultaneously because two groups of employees thought they can to do it better. I am talking about mash.yahoo.com and 360.y… ahoo.com both competing with many other \"Web 2.0\" products. Take Panama: Some fathead employees convinced management that they should waste >1000 Man Years to rewrite an already existing product. Instead of bettering pieces that did not work well they let the existing system painfully burn to the ground, letting millions of $ or revenue go. They are doing the same with Apex. No wonder they are losing the old timers like mice from a sinking ship.",
        "advice": "Play your strengths.",
        "pros": "Free gourmet coffee. Great Gym.",
        "summary": "Ask not what you can do for Yahoo ask what Yahoo can do for your.",
        "role": "Senior Software Engineer",
        "date": "Sep 23, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Risk is not rewarded. Culture is one of the \"Peter Principle.\" I've never been part of another company where mediocrity was so well rewarded. If you are predisposed towards honesty, hard work and a challenge, this company's culture will actively try to extinguish you.Yahoo takes the matrix structure to almost comical extremes. You can literally have an organization with 100s of bodies in it, but be unable to … fire any of them.",
        "advice": "New CEO and new top layer of management. Redo the entire compensation scheme to reward the following behaviors: (1) risk taking (2) cross company cooperation (3) efficiency of resource utilization.",
        "pros": "Great brand. The Yahoo! platform gives one the ability to have their work affect hundreds of millions of users. If you make a go of it here, it can be a great place to experience lots of different businesses.",
        "summary": "Culture is aligned to destroy all of the brand's potential",
        "role": "Vice President",
        "date": "Dec 11, 2008",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "At Yahoo, we work very hard. There are few lulls in the action. It is hard to get time off. Most people are overloaded, and in this economy, we are unfortunately not hiring. There is a constant stream of action items coming in every day of the week. While this can be good, as it is not boring, the stress level is high. In addition, recently some of the \"perks\" were taken away, things that made working at Yahoo fun li… ke snacks and drinks. Plus, they ended 401K matching and suspended raises. Since I was already earning less at Yahoo than I was at my previous job, this doesn't make me terribly happy.",
        "advice": "Bring back the perks. Be more flexible about giving time off. Reward employees, even in this economy, so we'll stick around instead of burn out and move on when the economy recovers.",
        "pros": "Yahoo provides a lot of challenging work. There is variety in the tasks we do and projects we work on. The people I work with are, for the most part, very professional and reliable. Management in my area is responsive and very supportive when it comes to helping us navigate the wider organization. The campus has a lot to offer and is a pleasant place to be. Our management is very progressive about using the latest to… ols, gives us training regularly, and provides us with support services that many companies no longer offer.",
        "summary": "It's OK",
        "role": "Software Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management is utterly incompetent. It's not about your skill or abilities, but who you know and who you're friends with. Horribly cliquey environment.",
        "advice": "Leave Yahoo now. You are singlehandedly ruining this company",
        "pros": "Smart people and really interesting cutting edge products",
        "summary": "Yahoo. Once a great place to work, but no more.",
        "role": "Senior Product Manager",
        "date": "May 5, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Come on. This is yahoo. It would take too long to list everything.In short1) Company lacks focus. Too many people trying to do too many things at the same time2) More product managers than engineers3) More development managers than engineers4) Lots of people who have worked for a very long time and feel entitled to not doing any work5) Company that repeatedly threw retention cash bonus… es at people to get them to stay, even though they didn't do any work6) Infrastructure a total disaster. Yahoo's core infrastructure is a hacked up BSD release that only old timer Yahoo's know how things are slapped together.",
        "advice": "Quit or fire yourself.",
        "pros": "You get paid the same whether you work or not. And if you're an engineer you're virtually immuned to getting laid off",
        "summary": "Come work for Yahoo if you just need a way to pay your bills.",
        "role": "Senior Technical Yahoo and Chief Troublemaker",
        "date": "May 6, 2009",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "its political CEO is not that great and she is determined to make sure that the company suffers in the long run",
        "advice": "yahoo leadership should start focussing on the work in hand and not to do some random things like what they are doing now",
        "pros": "Yahoo is a decent place to work .. not the best place but manageable. I think there should improve further for ppl to grow.",
        "summary": "None",
        "role": "Tech Lead",
        "date": "Jun 17, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "* Clueless management* Inexperienced people* Most skills learnt on an engineering job are not transferable. Platforms, tools, methodologies are home grown.",
        "advice": "Get professional management. Stop promoting project managers, engineers without experience to management positions. Stop passing the buck around. Try to get things done.",
        "pros": "* Salary is comparably good* Good parties* Ok cafetaria* Diverse work force* easily accesible work location in CA",
        "summary": "Software Engineer Job (technical yahoo)",
        "role": "Anonymous Employee",
        "date": "Jun 18, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The company is like a rudderless ship, lost in the ocean. It almost feels like senior management decides strategy on a trial and error basis. Re-orgs are constant. I myself had 4 different managers in one year. Some people had up to 7 different managers that same year. Politics and bureaucracy dominates everything.",
        "advice": "Get a clue.",
        "pros": "You can get away with not doing anything all day if you play your cards right.",
        "summary": "Yahoo sucks the life out of you.",
        "role": "Senior Program Manager",
        "date": "Jun 30, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management isn't focused, lacks a current vision, passes up compelling and innovative products within the company that could bring it success and instead puts money and headcount behind keeping up with Google and Facebook. It's an embarrassing place to work.",
        "advice": "Remove yourself from senior management, jettison the board and regroup with people who are knowledgeable and passionate about this field. The employees and stock-holders have no faith. We're all looking for better jobs and selling our already undervalued shares.",
        "pros": "There are very few pros to to working at Yahoo. We have free coffee, work with smart (but under-valued) people, and have some really great technologies (that will likely never see the light of day and/or continue to be under-funded to the point of giving up.)",
        "summary": "Get it together or give up.",
        "role": "Senior Director, Product Management",
        "date": "Dec 12, 2009",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No career growth, too big a company, no vision or roadmap for future, too slow and bulky, insanely low morale",
        "advice": "Get out",
        "pros": "Lots of data to work on, interesting problems to work on, some great colleagues, well known brand, lots of users, not bad perks at all",
        "summary": "Analytics, Statistical Modeling",
        "role": "Research Engineer",
        "date": "Feb 5, 2010",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Chaotic and hectic place. Lower level and middle managers are promoted only by tenure and not necessarily by knowledge or management skill. Majority of managers seen have zero management skill. Thus, the place is very chaotic and lack of discipline and process. They can improve by hire professional managers to be managers, instead of some technie as the lesson learned at the healm, Jerry Yang. He was a good Techny gu… y, but not good in management the company. Leave that to the pro, Carol Bartz. The same should be true for lower level managers and directors. We need professionally trained managers in those position to make it a better place to work.Too many buddy-buddy groupies. If you are an outsider, good luck trying to break the inner circle, as it is pretty well molded and can interfere with real decision making and making the right choice for the good of the company, instead of covering up for the buddies.",
        "advice": "Hire professional managers for respective area, not just promote bunch of technies, who have no management skill, experience and personal skill in dealing with problems and personel.More communication from top down, especially within same department.Need to improve process and hire qualified personnel, rather than hire unqualified buddies of buddies, just to prevent them from getting sent back..",
        "pros": "Salary and if you need a job, and maybe learn a few things about Internet Technology.",
        "summary": "Yahoo!, A terrible place to work.",
        "role": "Senior SQA Engineer",
        "date": "Mar 7, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management hires with the intention of firing within 3months. Some type of \"management goal\" that yahoo has. Then, they immediately outsource to India! Go Figure.Also, 75% of all their infrastructure PCs have viruses. They have very old MACs to work with.",
        "advice": "Get a life. Dont hire locally if you intend to fire in three months. No matter, where you come from , that policy sucks. Seems to be a trend in NYC.",
        "pros": "Total casual dress own attireVery friendly coworkersSome coworkers were extremely knowledgeableThey use PCs, MACs and Linux",
        "summary": "Yahoo, Inc, NY, NY Truly and honestly sucks",
        "role": "Ser",
        "date": "Apr 12, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lack of vision and strategy from the Exec mgmtTerrible internal tools and processes",
        "advice": "Don't always focus on the current quarter, look out to the longer time horizon and make your decisions based on that.",
        "pros": "Good benefits and office space",
        "summary": "Struggling company",
        "role": "Senior Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "* clueless management* they come with a new \"identity\" every 6 months",
        "advice": "* every engineer in the company knew \"It's you!\" is a DOA - the sr. management had to spend 500 million to realize it.",
        "pros": "* lots of bright and talented engineers",
        "summary": "identity crisis",
        "role": "Anonymous Employee",
        "date": "Jun 29, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Negative for career development due to silly projects.",
        "advice": "Improve the products rather than speak to wall street.",
        "pros": "They give the restrict stock.",
        "summary": "There is no valuable task / project for a real engineer",
        "role": "Tech Yahoo",
        "date": "Jan 8, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Poor executive leadership.No executive metrics or accountabilityExecutives are in a walled garden, and don't listen (internal or external) resulting in:   Top down management   Poor business acumen (emperor has no clothes)   Failure to launch   Politics, politics, politicsB's hire C's etc. mentality. (how many executives from grow… th companies vs. decline are hired?)In 3 years: 4+ layoffs, 3 CEOs, 3 CTOs, every SVP and most VP/Directors have churned.Terrible HR (every year focal had different processes, metrics and schedules with no comm)No focus on leadership or the right people (leadership succession is a mess)New implicit mission is to grow the bottom line by cutting costs, while posturing for top line growth without a real plan or execution metrics.",
        "advice": "Get back to basics. Focus on great people in the right seats and empower them on a mission that everyone can get behind. Measure your executives and be honest and transparent about your failures even more so than your successes because they're better case studies to learn from. Remember what made the business great (old mission) and focus on that as your flywheel.Make hard decisions to axe personalities that … don't fit the above instead of arbitrary layoffs.Also invest in your personnel (especially your leaders)-- they will make or break Yahoo!All of Jim Collins' books (especially the last one) apply. \"Good to Great\", \"Built to Last\" and \"How the Mighty Fall\"",
        "pros": "Friendly PeopleFree Coffee & SodaHuge Audience (for work that's shipped)Early on it was fun, and empowering for engineering.   Old mission @ Y!: Build top notch communication & sharing experiences on the net.",
        "summary": "Failure to Launch",
        "role": "Anonymous Employee",
        "date": "Jan 14, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Weak leadership management. Company tends to languish- lacks effective direction.",
        "advice": "No, Yahoo! is a company of talented people, not a Marine Corps.",
        "pros": "Had the opportunity to work with very talented peers.",
        "summary": "Hard work & dedication to customer service delivery is not appreciated, Xmas RIF's still the norm",
        "role": "Anonymous Employee",
        "date": "Feb 3, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "lack of mentoring, job insecurity, and work not being recognized",
        "advice": "stop trashing the hard work of engineer and let the world see what they do at Yahoo",
        "pros": "Great location, package, perks, severance, learning",
        "summary": "Not too good",
        "role": "Technical Yahoo",
        "date": "Feb 16, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Too much politics, no collaboration, no job rotation, bosses play politics ,Promotions criteria- suck up to your boss",
        "advice": "Wake up and don't destroy a great company, be open have meetings at all level, ask them to vent out their ideas instead of shoving your failed ideas on them. Latest failure moving accounting jobs to Omaha, Nebraska.",
        "pros": "Great company with great brand recognition and pride to work for. Good compensation, great food, good incentives, and flexible timings.",
        "summary": "Yahoo Accounts moving to Omaha, Nebraska",
        "role": "Anonymous Employee",
        "date": "Apr 7, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Mid-management only focused on keeping their jobs. Constant re-orgs based on same.Too many managers and absurd levels of micro-management.Up to 6 meetings a day, to give the appearance of accomplishing something.No job security.Seniority, loyalty and hard work mean nothing.Cannot complain to anyone about anything, including HR. The walls have ears.Favoritism and retaliation rules.Raises an… d promotions denied for years on end, unless you're a suckup.Painful all-hands meetings full of happy talk and not-so-happy remarks about employee effort.Morale worse than ever - fear and depression walk the halls, hidden behind smile-masks.Other than that, it's a cool place to work.",
        "advice": "Instead of laying off people who work their hearts out, please trim the many hundreds of bureaucrats.",
        "pros": "Some nice people.Coffee.Reasonable compensation, after waiting 5 years for them to adjust to market.",
        "summary": "If You're on the Right Team, You Might Be Okay, But Only Temporarily",
        "role": "Account Manager",
        "date": "Apr 14, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Unfairness in term of work load sharing, people not rewarded base on their performance",
        "advice": "Management need to care more of their work and try to be communicative",
        "pros": "Relaxed, and the benefit is good",
        "summary": "not a professional environment to work in",
        "role": "Senior QA Engineer",
        "date": "Apr 24, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "pathetic managementall powers in the hand of manager and he can screw you any way he can.absolute monopoly from management with no clear communication of strategiesManager might screw you personally as he has lot of powersnot only ruined my career but also troubled my personal life.",
        "advice": "Please give up politics, you have any way wasted the time of talented people in past couple of years by misleading directions, and firing well deserving working on stupid management ideas.",
        "pros": "communication is open to any one in the company for suggestion and learninglot of open source technology for self learningclasses on open source technologies (superficial but good at the start of career)Worked with most reputed team in sciences lead by Neumeyer.",
        "summary": "pathetic management (immediate and upper) in terms of employee care, colleagues are good",
        "role": "Technical Yahoo",
        "date": "May 17, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- Lack of strategy and focus- Number of resources on projects are inversely proportional to their value and importance- Strange ways of promoting innovation and pasting fight posters all over the place- Recent executives (from up north) are absolutely pathetic and have brought groups to a standstill throwing a whole bunch of paperwork on middle management.",
        "advice": "- Find another way to make your easy money and this company will start growing again- Don't kill people's enthusiasm by throwing all kinds of undefined processes",
        "pros": "- Good co-workers (at lower levels)- Good pay- Good work/life balance (better than it should be)",
        "summary": "Once a great company, not anymore",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Highly political environment where the managers' main goals are to protect themselves rather than produce good work and do what is good for the company. Managers have little to no knowledge about their own industry believing Yahoo is different than the rest of the world. Product decisions leave me wondering if senior mgmt even use the internet! A few workplace bullies make life miserable for all. It was common to be … thrown under the bus for doing good work.",
        "advice": "Look at the 360 reviews for your managers! I know some of them get terrible reviews from their teams and are promoted. Value talented employees instead of looking for bargains overseas. Start using technology. You guys are about 3 years behind everyone else.",
        "pros": "Fast pace, cool industry, lots of potential, some great co-workers with tons of potential.",
        "summary": "Management is Horrendous",
        "role": "Customer Care",
        "date": "Jun 24, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Top management do not share common visionTeams spend too much time on politics and deciding who does what instead of deciding what to do in order to winPassive aggressive culture prevailsLack of numbers driven decision making, lack of customer focus. Top leadership denies the world changed so we are still pursuing the portal business when the world rapidly changes to mobile, apps, social networks and loca… tion based personal solutions",
        "advice": "Focus on products, focus on winning in USA whw we actually have critical mass and are still a top 5 property in most categories and leverage on that asset to invent something on mobile and apps that actually ships on time and that wows customers. Email and homepage are tired businesses... Europe is promising but it is a rounding error and distracts execution... Asia is really a fragmented operation with no common lev… erage point...",
        "pros": "Flex timeCompensation and benefitsMost people work 9 to 4 so one can have a family. Look at parking lot at 5 pm! It is empty",
        "summary": "Peanut butter approach needs change",
        "role": "Product Manager",
        "date": "Jul 2, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "everything -- the company is a mess, the leadership sucks, the CEO is horrid.",
        "advice": "go away already!",
        "pros": "none that I could think of, other than great medical insurance. oh and they do have a bauer shuttle from SF, if you care to find out everything that is going on with your colleagues while you ride.",
        "summary": "Reorg galore!",
        "role": "Web Analytics Manager",
        "date": "Aug 12, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "no way for junior engineers to provide feedback to either the product, or engineering efforts. you get treated like a robot who's sole responsibility is to translate a spec to code.",
        "advice": "stop moving furniture in the house and start building new, useful things.",
        "pros": "no stress, work/life balance is good. gym is nice, i miss the free towel service there. oh, and bean tree drinks are awesome too",
        "summary": "it's bad, pretty bad...",
        "role": "Technical Yahoo",
        "date": "Sep 2, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No salary increases for years, no promotions for years, they have you work like a dog nights/days/weekends with no thanks. All of management will tell you that they have no budget for anything (which are lies). This is by far the worst tech company I have every worked at. If you are unemployed and desperate for a job... you really should think hard before you accept an offer here (sometimes unemployment is better the… n this place).",
        "advice": "Yahoo needs a re-boot, it's time to let go of everyone between manager level and Tim Morse. Yahoo could save so much money and probably turn a profit from the cost savings. Time to remove everyone from the board of directors, they have all failed the company. Any person off the street could take this 15B company and turn it around to be 150B, the problem is... you are going back to the same group of fools to get dire… ction.",
        "pros": "Free internet access from your desktop computer, unlimited filtered water... so drink up! Fridge is stocked with free milk. Fresh wood chips for coffee. Fancy Soda vending machines which charge you 0.50 cents or more. Free pinball and fooseball tables, if you are found using it... then your manager will lay you off or give you zero's for your review.",
        "summary": "Cringe as you wake up every morning to come to work at Yahoo",
        "role": "Software QA Engineer",
        "date": "Sep 24, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "bored, highly paid people who dont do much",
        "advice": null,
        "pros": "paynothing to dolax attitudecoffee and soda bars in all bldgs.",
        "summary": "Chaos, incompent and highly overpaid",
        "role": "Senior Director",
        "date": "Oct 19, 2011",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Senior Management is now more clueless than ever. The state of uncertainty has been the only constant at Yahoo for the past couple of years. This continues to demoralize a lot of employees and one can feel it at the cafeteria. Asking folks to keep at it because that is the best thing to do is so lame.Chief Product Officer Blake may have some vision, but it is more theoretical than actionable. Many people talk…  about innovation, but an overall strategy is missing. Piecemeal solutions for iPad and other social efforts are not tied to an overall strategy. Even these efforts have stumbled at best. If Blake really means taking bold steps to reach 10-10-10 goals, then the senior leadership needs to take some bold steps and not just talk about them. To execute on such a vision, Yahoo needs leaders - not just managers - who first have the capability to speak the truth and face it.A lot of what is wrong at Yahoo has to do with two main reasons:1. There are a lot of people in positions where they should not be. There are senior managers in technical positions and they lack the knowledge to lead and drive teams. This blocks everyone and diminishes group performance. These managers continue to exist for a very long time because of their capability to play politics, spread gossips and build their own pyramids. Many managers and their superiors play the \"I scratch your back and you scratch mine\" during yearly reviews and continue to advance. Yearly reviews are mostly positive because the culture at Yahoo has gone soft and people are generally scared or just don't care to provide negative reviews or as these are better known as \"constructive feedback\". Either way the reviews continue to be fit people into curves so that compensation can be spread around. This leads to percolating only positive news upstream so that all looks good at least for a while. When things break, as they do there is a subtle finger pointing campaign to wash themselves fo the responsibility.2. Lack of or broken new product and innovation strategy. Yahoo continues to make money with what it already has. Nothing new has made money for Yahoo for a very long time. Internally, at the lowest level there are a lot of innovative ideas, but no clear way to get them out there. At the highest levels there is a clear lack of product strategy. Blake has talked about some big goals, but they lack an execution strategy.HR depart ment at Yahoo is very detached. There is no concept of employee development and training. Perhaps Yahoo has decided that it will be able to attract top talent for new initiative without having to invest in internal training initiatives.",
        "advice": "Review all managers who are not technical and determine whether they are in the right positions. Either let them go or reassign to positions that fit their \"competencies\".Dare yourself to not fit employees in the curve. Some groups and teams have more than 10% of employees who perform at the highest levels.Re-Task HR Depart to be actively engaged in talent identification and development. Actively enco… urage shuffling people into different groups. This will also help break the stranglehold of incompetent managers.Jerry Yang continues to be Chief Yahoo and his role has always been dubious. It appears that Jerry wants to have the cake and eat it too. It is time that senior leadership develops some spine to tell Jerry that it is time for him to let go.",
        "pros": "Yahoo is still a strong brand, if that is a valid reason to work here. There is still a good amount of talent, so it is good to work with some competent individual contributors. One can get to learn a lot if you are in the right place.",
        "summary": "A lot of technically incompetent managers exist who do not know how to drive hard, but know how to build empires.",
        "role": "Anonymous Employee",
        "date": "Nov 13, 2011",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No communication or warning from management.",
        "advice": "Temp work sucks. Stop using temp workers.",
        "pros": "Fun place to work with other poor saps.",
        "summary": "Laid off without being given any reason",
        "role": "Customer Service",
        "date": "Feb 2, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very chaotic. No direction. Lack of good business hygiene. Finger pointing. Fear of failure. Revolving door of leadership leads to continual changes in direction and inability to complete anything.",
        "advice": "Stop changing. Provide vision, strategy and leadership. Get rid of people who have gotten too comfortable and don't want change, (or at least move them around)",
        "pros": "Loyal Yahoos have an amazing pride and faith in their company.",
        "summary": "herding cats",
        "role": "Senior Director",
        "date": "Feb 29, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "No Standardizations or documentations in place some people who are here from a long time are the knowledge hoarders and have a very snotty attitude.No communication horizontally or vertically is promoted within the teams.When i joined new here I was not even guided on how to get a security badge or login password for the system..but this is team specific attitude.Overall the processes in place are very la… me with no heading or goals.Managers are not leading by example. It's jut to lame and cold enviornment here.",
        "advice": "Yahoo has only one vendor who can allot contractors kind of shady thinking such a big organization will plan for contingencies but they have not :)",
        "pros": "It's Quater1 of 2012 when writing this review so a new CEO has just joined inCasual dressinggood Cafeteria, good food",
        "summary": "Stagnant, immature and mismanaged enviornment in the corp apps(oracle) support group",
        "role": "Senior Business Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Continuous layoffs was always a problem and would never help concentrate on the real work, constant re-orgs affected team spirit.",
        "advice": "Leaderships was terrible.",
        "pros": "good team and talented people, but not very friendly .",
        "summary": "average",
        "role": "Software Engineer",
        "date": "Apr 15, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "An organization that was designed to perpetuate conflict. Incredibly hierarchical: flatten, flatten, flatten!\"The perfect is the enemy of the good... so let's prevent people from doing merely good things.\" AARGH!Still convinced that they are so different (big, differentiated) that they have nothing to learn from others.",
        "advice": "Junk the fixation on Microsoft; pattern yourself on an agile risk-taking organization like Amazon or LinkedIn.Get serious about measuring stuff. If you can't measure it (honestly!!), you can't manage it.",
        "pros": "Lots of creative people (still!).One of a handful of companies actually trying to do things at global scale.Commitment to contribute to open source and community activity.",
        "summary": "For every person supporting you, there are two trying to get in your way",
        "role": "Systems Architect",
        "date": "Apr 30, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No idea how to develop the talent they have",
        "advice": "When acquiring a company, talk to the employees before integrating them. Not so hard...",
        "pros": "Massive scale, good pay at high levels",
        "summary": "Drives talent away",
        "role": "Senior Marketing Manager",
        "date": "Jul 12, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Poor business model and very political management.",
        "advice": null,
        "pros": "Great brand and technology, with great benefits",
        "summary": "A great company that has fallen down",
        "role": "Vice President",
        "date": "Sep 11, 2012",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Difficult to change teams. Some teams have pathetic infrastructure setup to work on and test in production with very old legacy code. You get stuck in such a team, it'll be difficult to change to a better team.",
        "advice": "When assigning NCGs to teams ask for their interest and match their skills before assigning them to random teams.",
        "pros": "Free food, good work life balance, good benefits and compensation",
        "summary": "Depends on the team you get into",
        "role": "Software Developer",
        "date": "Sep 18, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Nobody knows what is going to happen next day. Products are not good. You do not feel proud while working at Yahoo!",
        "advice": "Please Sell this company",
        "pros": "Compensation is OK. Good free coffee. I",
        "summary": "It was not a good experience at all",
        "role": "Anonymous Employee",
        "date": "Feb 23, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Watch out for the CEO",
        "advice": null,
        "pros": "The Technical staff is fantastic",
        "summary": "Solution looking for a problem",
        "role": "Anonymous Employee",
        "date": "Feb 27, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Was laid off after Yahoo failed to enter into an advantageous business relationship with Microsoft. Our entire class was hired in September 2009 and laid off three months later in December 2009.",
        "advice": "Manage projections wisely.",
        "pros": "Initially, there were opportunities for growth in the Small Business Unit ....",
        "summary": "Small Business Bad Business",
        "role": "Anonymous Employee",
        "date": "Mar 25, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The management has been very weak for a long time so people are used to being unsupervised and going in their own direction.",
        "advice": "Get out of the computer business.",
        "pros": "They have free food and snacks. The yahoo brand name still carries a lot of weight and their sites gets lots of eyeballs. You get to work with some really smart people.",
        "summary": "Join the spiral around the drain",
        "role": "Production Engineer",
        "date": "Mar 26, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Provide zero support while suffering from morning sickness.You have to be married to your job first over family.You have to put in a good and solid 12 hour work day.Zero work-life balance",
        "advice": "To provide more support while an employee is severely sick.",
        "pros": "Wish I could think of one.",
        "summary": "If you are pregnant or have a family--this company is not for you!",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Employees rated on a curve.... 20% must be below average, even if they actually are not. This is new since Marissa joined.",
        "advice": "Fix the quarterly and annual review process, so good employees aren't lost.",
        "pros": "Good benefits; adequate pay. Building and buying better products.",
        "summary": "Horrible review process -- ratings on a curve",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Feudal system feel to the company, the VPs were like dukes and the CEO the Queen. All were unapproachable. The company wasn't doing well and I watched several rounds of layoffs. The commute was long and tedious and the job I had was very unsatisfying. I've moved on from the experience and the culture has probably improved. But when I was there it was a difficult place to work.",
        "advice": null,
        "pros": "I was very unhappy, so I cannot say I had any positive experiences. I was placed in an odd team, this could have contributed to it.",
        "summary": "Was a difficult place to work 2009-10",
        "role": "Designer",
        "date": "Oct 3, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "There has been so much change and leadership swapping that the mid-level managers who are still there are often the ones that are the least qualified (if they had anything on the ball, they would have gone somewhere else) and the most unethical.",
        "advice": "It isn't hard to find them. Look for the ones who have very high turnover and have negative reviews from their teams. I don't know how they talk their way out of it because the data is there.",
        "pros": "Great product, a lot of people on the lower rungs who honestly want to do a great job and think about the customer.",
        "summary": "Customer Care fosters a culture of bullying and unethical practices",
        "role": "Customer Care Training",
        "date": "Oct 24, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I was misled about the position during the recruiting and interview process. The job description was completely inaccurate. Yahoo blatantly lied and lied by omission during the recruitment and interview process.I was informed the hours of operation were M-F 6am-6pm and that I would have a set schedule. During the recruiting/interview process Yahoo informed me the job would entail lots of detailed analyzing an… d helping clients to the full extent. I was informed that they would like me to learn some of the technical aspects of the job to start but with my background I will be promoted extremely fast. The recruiter even asked me to stop looking for employment after the interview. She said Yahoo really wanted me to join their team and asked me not to accept any other offers weeks prior to actually extending me the actual offer.Now fast forward to week 2 of training. My entire training class gets bamboozled with the information that the hours of operation are actually 7 days per week 6am to 9pm and we would be required to work every holiday.Next, the duties of this position were not Customer Service duties. I was resetting passwords all day. Management focused on how fast and how many calls you were taking rather than the content and quality of the calls. There were no details or analyzing. Not to mention they didn’t want us helping customers to the full extent. Example, one day I had an elderly lady crying to me on the phone because she had a sick family member oversees and she didn’t know how to respond to the email. Management wouldn’t let me help her? I had to tell her to go to the help pages and figure it out herself.So as time goes by I discussed my concerns with management. I ask about future plans and maybe posting out or being promoted. I'm told, “We’re learning as we grow & we don’t really know what opportunities will be available in the future.” Management clearly developed favorites and placed these favorite employees on special projects. The individuals who spoke up about their concerns were clearly held back and treated unfairly. Management made up the \"rules\" and policies as they went. To me, this place and especially it's management team are unorganized and extremely unprofessional. You'd be taking a gamble to accept a job as a Customer Service Agent. If you're lucky enough to be one of management's favorites, you might be okay. If not, you will be completely miserable.",
        "advice": "Stop running the department like a telemarketing firm. Learn to be transparent and focus on the customer's experience rather than call volume. Take some ethics courses.",
        "pros": "The maternity benefit was decent. Benefits and salary paid. Up to sixteen weeks for women and eight weeks for men.",
        "summary": "Bait and Switch",
        "role": "Customer Service Agent",
        "date": "Dec 1, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- All those free perks mean less salary when you sign on or no raise.- Expect to be on-call and working 24/7/365.- Little to no room for advancement.- Cumbersome, ineffective quarterly performance reviews.- Constant negative press is distracting.- Not sure what all those acquisitions mean for the company.",
        "advice": "Management should know what to do since they've been at some of the top companies in Silicon Valley, so what I share wouldn't make a difference.Prospective employees: Read up on Yahoo before you decide to work here because the news stories out there are pretty accurate.",
        "pros": "- Free food in cafeterias and kitchens.- Free music, food and booze around key holidays.- More free booze every Friday after work.- Free smartphone and new laptops.- Free commute bus for certain locations, one even has an employee run bar!- Many high profile, expensive acquisitions to keep the company in the news.",
        "summary": "Smoking Mirrors.",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Work is slow and not that great. Hadoop and Cloud technologies are well advertized but a closer look will tell you that most engineers are fixing bugs.Pros are the biggest con. I ruined quite a few years of my career working for managers and especially the directors at Champaign site. Managers have no real control over their teams, all is dictated by the Directors. Some other reviews also mention this and is … true that these Directors are technically incompetent and use their political influence to keep themselves at the top. Somehow it has worked for quite a few years. The decision makers in HQ do not want to change them to keep a smooth sailing impression. These Directors have ruined quite a few careers by initially hiring people who were not a good fit for the job, but hiring them allowed to meet their hiring quota. Then they fired some of these people on account of poor performance - of course a bad fit will not perform well. So on both occasions Directors come on top, first by meeting their hiring quota and then when the company was looking to trim, they got rid of the same people. Ironically and ridiculously, some of the same people were hired yet again as part of site growth agenda.There are three distinct groups of Champaign Yahoos. First with the ones that came in bulk from Motorola. They are the older people. They stick together and take care of each other. Some are good. Difficult to break into this group. Second group is in Champaign because their spouses are in the area for employment. These people are the most political ones and will do anything to hang on to their dear jobs. Group three is made up of independent Yahoos who think they can make a career and living in Champaign.",
        "advice": "Some other reviews suggested to fire the directors. Right-on. You do not need them. New technical managers can handle the site well.",
        "pros": "Salary, bonus, easy life. Being in Champaign one is not expected to be producing out of the world results. Low expectations that are easily met. Work is okay, good enough to beef up my resume.",
        "summary": "Bug Fixes != Cool Technology",
        "role": "Technical Yahoo",
        "date": "Dec 14, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Human Resources and Executive Leadership",
        "advice": "Stop ranking and yanking. It is VERY demoralizing, even for top performers.",
        "pros": "The rank and file people are awesome.",
        "summary": "Rankings Suck.. even for top performers. Pay sucks.",
        "role": "Customer Care Supervisor",
        "date": "Dec 26, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Everything else. A bunch of dummies. New CEO every 6 months is kind of funny.",
        "advice": "Bottom of the barrel silicon valley management... it's kind of hopeless.",
        "pros": "The snacks were always good. Very often there would be bottomless laffy taffy.",
        "summary": "Painful.",
        "role": "Manager",
        "date": "Jan 7, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Absolute Burn-Out: Requirements and mandates keep piling on pre-established role. Constant ReOrgs and sudden meshing of completely separate departments/platforms into one single entity. More work, less resources, longer hours, no pay increase.99% Employees = frustrated/demoralized......while 1% (yes, that 1%) of C-Level Execs, SVP's, VP's and Board Directors are Laughing and Singing all the way to the…  Bank \"Mo' Money, Mo' Money! $$$!\"",
        "advice": "Do away with the Gestapo techniques, it's crumby for morale company-wide; meaning, nix the tracking of every single task/update/meeting/phone call/sale/up-sell/etc. You've created a time-suck unlike anything I've ever experienced before as each worker-bee is now, for all intents and purposes, engaging in an everlasting exercise in redundancy by updating an internal system for something already completed so that some … team can check their box off and say, \"Yep, it's redundant. And time consuming. But they can be tracked now!\"Also, the incessant, passive-aggressive messaging from emails sent by, example, our newest (*Insert 3-letter Acronym) of Global Ops to all of Yahoo on the Friday prior to Christmas at 10pm EST: \"Our employees are our most treasured asset. Your sacrifices do not go unnoticed. But our employees can Always do better, and we will all need to do so throughout 2014, oftentimes with more work and less resources.\" Focus more on employee satisfaction and their work / life balance to maintain an established set of intelligent, experienced, and happy workers vs. the burn and churn. People leave, no added head-count is addressed or implemented, you push the unaligned work on to another employee who is likely already struggling to keep pace and gasping for air; this behavior is all too commonplace these days and is a real shame. There is no longer a Yahoo culture of yesteryear - there is only pressure to do more with less time / less resources for the same pay. No one enjoys it and it is voiced in many circles. But we cannot openly discuss at this stage unless you'd like your very job on the line.",
        "pros": "The comprehensive Medical and Misc. Benefits Package. Also have the chance to work with some very smart, funny, and downright cool co-workers.",
        "summary": "Instill job environment where cornerstone's based on distrust, pile-on, competition amongst peers & broken model of QPR",
        "role": "Account Manager",
        "date": "Jan 9, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Worst management in the Omaha office! They treat their employees terribly! They are verbally abusive and they lie. They offer you a severence package when they find out you are looking for a new job so youll leave right away and then they revoke it as soon as you walk out the door! Do not trust this company!!!",
        "advice": null,
        "pros": "Free food, cell phone expense",
        "summary": "Worst job I ever had!",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Dishonest management in the Omaha office. The whole company is so disorganized and the higher ups have no idea how bad it is (or just don't care). They get rid of new employees who work extremely hard and bring fresh perspectives to the company, while virtually all managers and directors who have been there since the declines began are unquestioned. No way the company will return to its \"glory days\".",
        "advice": null,
        "pros": "casual dress. free food (although it really comes out of your salary...)",
        "summary": "Not recommended",
        "role": "Anonymous Employee",
        "date": "Jan 30, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Engineering is a mess. Officially supported software was super outdated (Apache 1.3? FreeBSD 4.x?), teams frequently duplicated effort, official standards (No more FreeBSD!) conflicted with reality (Work in mail? Write your code on FreeBSD). Want to get a small change pushed out live? Hope you like meetings and overhead. The team I was on was \"Agile\" which meant we sat through 4 hours a week of sprint-related meeting… s. I was hired to rebuild an existing system only to find out after I started that I wasn't allowed to change said system because too many people depended on it being exactly the way it was (said system came originally from another company Yahoo acquired in the late 90's - think DHTML and Java applets for scrolling text on the screen and you're in the ballpark). So after two months I had nothing to do other than use the gym and hunt for jobs.",
        "advice": "You should seriously nuke most engineering projects from orbit. This isn't an attempt at sarcasm or humor - you'd have an easier time rebuilding entire teams, products, and organizations from scratch than you will trying to improve things by changing a piece here or there. Think hard about why you're buying up all of the startups that you are - how have <10 person teams managed to come up with technology that blow… s away anything your product team has come up with in the last decade? It's because they're not carrying around all of your luggage.",
        "pros": "The gym is open all day, the cafeteria food is better than average (and apparently free now) and the coffee is free.",
        "summary": "As bad as you've heard, and then some.",
        "role": "Senior Software Engineer",
        "date": "Feb 13, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Working environment is stale. People are afraid to speak-up as they might be layed-off - leadership creates a hunger games environment. Infrastructure does not support growth. Products are from 1998. Sunnyvale makes your soul wither away.",
        "advice": "Start over.",
        "pros": "Great cafeteria! I met some really great people.",
        "summary": "Your soul will die",
        "role": "Manager",
        "date": "Mar 12, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Terrible place to work. Toxic environment. Total pressure cooker. The harder you work, the more they dump on you. Many employees slide under the radar. Only saving grace was that most of the work horses survived the frequent and MASSIVE layoffs.",
        "advice": null,
        "pros": "Some of the people I worked with were amazing. The rest were there to take up space and collect a paycheck.",
        "summary": "Toxic experience",
        "role": "Software Engineering Manager",
        "date": "Apr 2, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The process is all over the place",
        "advice": null,
        "pros": "The food in the kitchen is free",
        "summary": "Yahoo",
        "role": "Sales Manager",
        "date": "Apr 6, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Executive team is not aligned. Open and constant bickering leads to a volatile environment. Limited to no communication. Inconsistent direction given be each executive. Limited accountability with mush blame being pushed to lower management. Extremely political with tons of micro-management.",
        "advice": "None. They don't listen.",
        "pros": "Good benefits, perks, most people are nice.",
        "summary": "Great if you're an Engineer or Developer - Otherwise, beware.",
        "role": "Anonymous Employee",
        "date": "May 2, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- the managers, worst of the kind I have ever seen. they do not care about quality of the product they deliver. the code looks like it is being done as part of high school/college project. all these managers do is to ask for updates from one meeting to the other. they add zero value to any product.- no real focus on any specific idea or product. focus keeps shifting resulting in half baked products and junk code … that never gets cleaned up- absolutely insane timelinesI believe all the \"good\" reviews here are given by new joinees. anyone who has worked for atleast half a year know things are going downhill.",
        "advice": null,
        "pros": "Looks good on your resume as one of the pioneers of internet technology",
        "summary": "Yahoo has a grim future",
        "role": "Anonymous Employee",
        "date": "May 28, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "House assiciation acts like they are the gustapo, do not buy a house there.",
        "advice": null,
        "pros": "Clean area some security at times",
        "summary": "Anderson Creek Club",
        "role": "Anonymous Employee",
        "date": "Jul 2, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Yahoo has become a malicious place to work for. Every Quarter, they get rid of significant number of people just to create continuous anxiety and pressure among employees. Marisa operates with a lot of ego and arrogance. No one likes her although no one is dare enough to admit it. Managers operate with poor ethics and integrity. I advice engineers to stay away from this company. I'm a former Engineer.",
        "advice": "See above.",
        "pros": "Nice perks, good compensation,",
        "summary": "Bad place to work",
        "role": "Anonymous Employee",
        "date": "Jul 4, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Years ago, we had a hard card of \"Our Core Values\" that we added to our badges. One of the core values was communication. Well, hope springs eternal. Too often the right had didn't know what the left hand was doing. Departments were siloed and had vested a vested interest in protecting their turf. The idea of \"One Yahoo!\" was floated for over a decade and will never come to fruition. Back in the day, we were a search…  company and our competition was Google. Then we became a media company, and our competition was Sony, EMI, and newspapers/magazines. Then we became a social media company and our competition was Facebook, for crying out loud. When I was forced out, we'd decided that we were no longer a media company but we weren't told what sort of company we were. I'd lived through 5 CEOs, including the resurrection of Jerry Yang, and wow, was THAT a worthless choice. There's a general consensus that Marissa didn't tell the Board that she was pregnant before they hired her. She hired her BFF out of Portugal (before he had the legal right to work in the US, of course, cuz the laws don't apply to Marissa and her senior staff), and very publicly threw him under the bus when she could no longer deny that he was out of his league. She's made some lame hiring decisions, and she's made some really horrible hiring decisions. EVERY offer passes through at least one hiring committee, and then is scrutinized by Marissa. If she doesn't like the comp (and she often doesn't), she will reduce it to what she thinks is fitting and there is no appeal. She talks about hiring the best and the brightest but neither the best nor the brightest will surrender their right to negotiate their compensation. Anyone who does so cannot, by definition, be either the best or the brightest. Free food goes only so far. Oh, and cutting work from home while claiming that it only affected 100 people, most of whom, according to you, rarely logged into the network to actually work seems a little like overkill. Friday 430 pm all-hands meetings is also a nice touch, especially when if you show up at 4:31pm, security will not unlock the doors to let you in.The employee population have also gone from reasonably nice/decent to an unattractive assortment of narcissists and ego maniacs who seem to take out their frustration of having no work-life balance and being constantly under the gun and under threat of getting a poor quarterly review that they can take it out on their co-workers. We used to have fun at Yahoo!. We'd work our tails off but we'd have fun. Now it is just a miserable, hateful place.",
        "advice": "Perp walk Marissa and the rest of her senior staff. Figure out what you want the company to be in its old age. Cut loose with a few of the superfluous layers of management. Stop lying. Value your employees and quit trying to pit them one against the other.",
        "pros": "The benefits package is pretty great.",
        "summary": "This used to be a great company, then it lost its way, forgot what it was, and chose sucky management",
        "role": "Something In Human Resources",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Extremely sluggish recruitment process, very much disappointing.",
        "advice": "Be promising while interviewing.",
        "pros": "Genuine technical foundation. Excellent working environment. Unlimited working infrastructure.",
        "summary": "Service Engineer",
        "role": "Service Engineer",
        "date": "Aug 18, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Crummy management overall, inconsistent and downright bizarre (at times) staff editors, poor site maintenance, but they shutdown the site instead of correcting the problems.",
        "advice": "Relaunch the site with better management, staff, and pay on a better platform.",
        "pros": "Work from home, assignments offered upfront pay plus residuals based on page views, provided excellent \"writing for the web\" online training for newbies and professional writers.",
        "summary": "Big Potential, Bad Management for Freelance Writers",
        "role": "Freelance Writer",
        "date": "Aug 28, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Bizarrely layered structure for the simplest of tasksMultiple people holding similar job titles so it's impossible to figure out who's in charge of whatTruly awful people in the Santa Monica office - everyone seemed to hate their job",
        "advice": "I worked there a few years ago so under Marissa Mayer things may now be different. I hope so.",
        "pros": "Salary and benefitsLocationFree food(I truly can't come up with anything else!)",
        "summary": "Byzantine, multi-layered structure that kills innovation",
        "role": "Editor",
        "date": "Sep 4, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The leadership is very smart but inexperienced and it shows in a number of poor decisions. The CEO has lots of product smarts but lacks experience running a company and has made poor hiring decisions including the costly selection of a COO. HR leadership appointment was made to someone with no HR experience which led to very poor HR policies and programs including discontinuation of work from home option... and quart… erly forced ranking performance reviews. Marketing leadership, though bright, is out of touch and not inclined to listen to employees. This has led to poor, myopic decisions such as taking a classic, dynamic, and unique logo and turning into something quite bland.",
        "advice": "Allow employees to speak more freely without any recourse and listen to them. We've lost a lot of talent to other Silicon Valley firms but there are still employees with good ideas and sound judgment. Hire more leaders who have good people skills and show compassion for their employees.",
        "pros": "Work-life balance is good and pay/benefits are very good. I don't think the compensation will be sustainable, though, as the ratio of revenue to employee is poor relative to competitors and revenue has been flatlining.",
        "summary": "Leadership lacking leadership",
        "role": "Director",
        "date": "Sep 4, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Everything is based on politics; those who get chummy with the people at the top get promoted while those at the bottom never see the light",
        "advice": "There needs to be more restructuring within the company in terms of who is leading each team; VPs should really think about growing the business from the bottom up instead of hiring their friends.",
        "pros": "Free food, free drinks, good exposure",
        "summary": "Politics are heavy",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Long Standing Issues:* Meetingitis - ICs for hours a week, managers all the time. Meetings to prepare for meetings about meetings.* Too many middle managers, and the ones that \"kiss up and kick down\" get promoted.* Silos, no incentive to work with other groups or have fresh ideas. People who do get screwed in the reviews.* Top down, one size fits all \"Agile\" process imposed, whether it makes sense or … not. Lots of \"Cargo Cult Agile\" used as a micromanagement tool (\"Why haven't you done what you committed to?\" - every sprint a death march.)* Below market wages - by around $20K* Loaded with H1(b) indentured workers, who get treated like slaves because they can't quit without being shipped home. This pressures wages for everyone below market. Slow green card process, too - because once people get their green card, they will leave.* NIH syndrome - long standing habit of not wanting anything in their stack not invented or at least pissed in by in-house engineers. Only dribs and drabs given back to the open source community.* HR sides with management, even when management does something so egregiously bad that multiple people report it.Current CEO added:* QPR - quarterly stack ranking, employees compete against each other to not get voted off the island. You're gauged on how visible what you do is, not on how well you do it. People are paranoid and demoralized.* Open plan, no partitions, small desks, no privacy, noisy - symbolizes utter contempt for employees and their need for personal space.* No WFH - to address a problem with incompetent management not realizing that some employees weren't doing any work, the whole company was forced to come in to the (now nasty and crowded) office. Swatting a fly with a sledgehammer, and a nasty letter from HR to kick it off.* Beware changing groups, your previous manager will give you a bad QPR, and if you had one before you're out the door.* Mimicking Google, trying to draw in RCGs, shoving older workers (and their domain knowledge) out the door.* People let go in QPR are asked to sign an absolution letter saying there was no discrimination or retaliation at Yahoo in order to get their severance. [I didn't sign - it would have been a lie.] Letter also demanded the existence of the letter be kept secret for some reason... but only if you agreed to it.* C-level micromanagement, and when people point out user dissatisfaction or problems, just dismisses the users as \"whiners\" or \"change averse\".",
        "advice": "I bled purple. I tried to tell people when they were being short sighted. The product offerings kept being \"redesigned\" in worse and worse ways, by people who didn't understand or care about their hard core users, power users, and other heavily invested users. Lowest common denominator became king, and more app development was shipped overseas. The main page became even more tabloid.Madam CEO, you need to:… >A) Scrap your nasty little QPR scheme, it's destroying the company just like annual stack ranking destroyed Microsoft.B) Fire half of HR. HR is not trustworthy. Teach the rest how to communicate without insulting people's intelligence.C) Don't treat your people like 50's factory floor peons. The rows of desks crammed together suck.D) Stop micromanaging, you aren't that smart a technologist. You handle the schmoozing, let the technical folks handle the products.Seriously, barely six months after I left I sold my stock.",
        "pros": "* Free Food (but greasy)* Cell phone* ICs are usually smart* Some managers are awesome",
        "summary": "Current CEO is the Death Rattle",
        "role": "Service Engineer",
        "date": "Oct 21, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- Wow so many fake reviews on glassdoor. I love how there are reviews for Nov 11th, 12, 13th...one after another. And all four stars. Marissa is this your handy work?- Cut throat work environment- No direction- Who uses Yahoo? No one..Marissa has just done a great job of getting herself in the news to keep things interesting.- Trying to make Yahoo like Google- No appreciation for its employees.… >- No work life balance.",
        "advice": null,
        "pros": "I use to think the free food was a pro. But when you have to wait in line for 20-30 minutes to get lunch I think it's fair to say that's no longer a pro.",
        "summary": "Fake Reviews For Yahoo",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Very bad, unprofessional management that only play politics to survive;Quarterly performance review (QPR) system gives unlimited power to management to do whatever they want with engineers;Unrealistic QPR goals that impossible to achieve gives management full freedom to put any QPR score based on manager personal decision;Up to 5% hidden layoffs by performance due to QPR score every quarter without severa… nce package;Lots of great engineers have been fired by “performance” just because of managers wanted to get rid of inconvenient people;Due to bell curve inside team (low 5% should go every quarter) there is no team work at all. Nobody shares any knowledge and help;No work/life balance;Culture is good for new college grads and interns but very bad for senior engineers with knowledge and experience;So if you are senior engineer please stay away from this company. You will not be appreciated and rewarded;",
        "advice": "Yahoo used to be great company with good culture and excellent engineers. Unfortunately, it is getting much worse now. It has all potentials to be successful company: good engineering team, money from Alibaba, brand, customers, products, etc. The only problem is – management. Please reorganize management team if you want to move forward.",
        "pros": "good compensation and benefitsfree food",
        "summary": "getting much worse",
        "role": "Senior Technical Yahoo",
        "date": "Dec 13, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Very politicalBureaucratic, micromanaged workNo work-life balance",
        "advice": null,
        "pros": "Great foodGreat compensationGeneral sense of excitement",
        "summary": "Disorganized, Hope It's Better Now",
        "role": "Anonymous Employee",
        "date": "Jan 7, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Managers are jerks. The head of mobile doesn't have any brain . The dumbest idea come out of his mouth.",
        "advice": "Listen to your employees they are ones doing the work not you. Working in open office has to be the worst idea ever. Boy is is so hard to work when you have just a 2x4 desk and no space to yourself",
        "pros": "There are no pro to work here",
        "summary": "Do not work here",
        "role": "Mobile Build Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Extreme hours with terrible performance review process that encourages individuality and discourages teamwork in many ways. The senior management is constantly changing the target and the bar. Prepare for early burnout. Plus with the \"Quarterly Performance Review\" (QPR) you never know if/when you're going to be fired over something stupid.",
        "advice": "Get rid of the QPR system. Its pitting team members against each other just to save their own jobs.",
        "pros": "This place looks pretty good on your resume and you will learn a lot about working at global scale that is unbelievable on a daily basis.",
        "summary": "Poor direction and senior management",
        "role": "Senior Service Engineer",
        "date": "Feb 18, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Quarterly review process puts lot of stress. Plus layoffs happen very frequently.",
        "advice": "If doing layoffs - adopt a better strategy. Rather than bring secretive take a hard call of laying off and then not touching the work force strength for a long time.",
        "pros": "Free food and campus location",
        "summary": "Too much of stress in terms of layoffs",
        "role": "Senior Software Engineer",
        "date": "Mar 6, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "politicsbad managementbad cultureconstant layoffsdecreasing revenueincompetent CEOno future",
        "advice": "replace management including CEO",
        "pros": "free foodcompensation, brand name, location",
        "summary": "complete disaster",
        "role": "Senior Technical Yahoo",
        "date": "Mar 10, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "The amount of administration and bureaucracy will drive you crazy. Quarterly performance assessments always require \"raising the bar\" except that you spend most of your work life trying to get purchase orders approved, making sure invoices get paid, trying to hire someone before your req gets closed... A very punitive work environment with not a lot of incentives to try hard.",
        "advice": "Stop micromanaging. High-quality employees who can add a lot of value to the organization end up spending too much time on work that doesn't add a lot of value.",
        "pros": "Good benefits and perks, lots of opportunity for growth and career development, good relationships with co-workers.",
        "summary": "Brutal work environment",
        "role": "Anonymous Employee",
        "date": "Mar 21, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Low salaryI can only checkin 30 lines code. And many many nonsense code review. Not a place for grow.",
        "advice": "Some of the managers are just a*. What u expect for a 'political' company?",
        "pros": "perk, really good food. Nothing else...",
        "summary": "The only is star is for food and perk. Yes, they have almost the best perk in Bay Area.",
        "role": "Anonymous Employee",
        "date": "Mar 22, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Yahoo stack ranks its employees every 90 days, which turns everybody into a number. That's by design, because it avoids the negative publicity associated with constant layoffs (which would happen if managers weren't always blaming employees for poor performance). Managers simply give anyone they don't like a negative rating, and the company evades California's WARN Act.",
        "advice": "Management by fear is inhumane and should be illegal in the United States.",
        "pros": "Free food. Plus, you get to see a young, blonde female incarnation of Josef Stalin in action.",
        "summary": "Office politics at its worst!",
        "role": "Editorial Director",
        "date": "Apr 22, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No automation, micro management, extremely unorganized",
        "advice": null,
        "pros": "Flexible Hours and that's about it",
        "summary": "Unorganized",
        "role": "Anonymous Employee",
        "date": "May 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Quarterly Performance Reviews (QPRs): They are as awful as you've heard. Every quarter you go through a full-on review cycle. That means having to spend a lot of time justifying the work you've done, a lot of time filling out peer reviews for your coworkers, and a lot of time generally worrying about your status there. Yahoo! uses a stack-ranking system where everyone is ranked from first to worst. Everyone is put in… to a bell curve and all slots in that curve must be filled. That means that if you're on a high performing team you may wind up in the lower quartiles even if you do good work. When I worked there if you wound up one standard deviation to the right for two consecutive quarters you were put on a PIP. I've heard from friends who still work there that now if you wind up in a lower quartile on *one* QPR you're not put on a PIP, you're simply fired. That's right folks, one bad quarter and you're out. They pretend that the reviews are objective, but they're not. How can they be? It's a nasty political system. If you're not into that, stay away.The company has been sputtering along for 8 years now. Despite many many changes in top leadership and lots of big talk, nothing has really changed. Yahoo! is always a takeover target. There is always a threat of layoffs, although now with the harsh QPR system there's a constant stealth layoff going on.Also as I was leaving I noticed that a new harsher, nastier engineering culture was taking hold there. Engineers talked gleefully of \"getting rid of the dead weight\" (translation: mass firings). If you weren't absolutely stellar you were crap.If you're anything less than a top-tier engineer, stay away. Your life there won't be pleasant. If you are a top-tier engineer, stay away, there are *much* better companies in the valley where you can really shine.If you need a job out of college, it's probably a fine place to go. Yahoo! still looks good on the resume. Just don't plan to stay there too long.",
        "advice": "They don't listen, so why bother?",
        "pros": "Lots of really smart engineersLots of really huge scale systemsPlenty of opportunitiesCasual cultureThe usual free food, free snacks, onsite gym kind of Silicon Valley perks",
        "summary": "Once great, now not so much",
        "role": "Technical Yahoo!",
        "date": "May 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Work life balance! Under Marissa leadership has started to demand insane work hours on the theory that Yahoo is fighting for its life. Also, as a former manager at yahoo, I can say that QPR (stack ranking) is completely arbitrary. Managers give their rankings and VPs can override them on a whim in calibration. The only way to get high ratings is to be \"visible\" to senior management. Which means self promotion is more…  valuable than your actual contribution.",
        "advice": "QPR is destroying the culture, work life balance helps you retain people.",
        "pros": "Smart people, difficult problems. Excellent compensation and benefits.",
        "summary": "Work life balance is dead at yahoo",
        "role": "Frontend Engineer",
        "date": "May 12, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Lack of support from management",
        "advice": "Provide more support to employees",
        "pros": "Great benefits. Great work/life balance",
        "summary": "Yahoo Benefits",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1. Too many reorgs. Shuffling resources every three months. I had 3 managers during 8 months there.2. Too many layoffs. People just disappear for no reason.3. Managers suck! They are the ones who should be let go of!! They make terrible decision and all they do is to push you and make Yahoo a sweatshop.4. Products suck. Who the heck is still using Yahoo? The CEO tries to sugar coat bad things and brain wa… sh the employees as much as possible.",
        "advice": "Let go of all the managers. If you are not looking for another opportunity while working at Yahoo, you are screwing yourself up. No kidding!! You never know what will happen when you walk in the office next day. Be prepared hombres!!",
        "pros": "1. Pay is decent, but there is no annual increase unless you get a promotion.2. Most engineers are knowledge and approachable.3. Free food, but you have to line up for 30 mins at least to get food.",
        "summary": "Try to avoid if you have another offer.",
        "role": "Technical Yahoo",
        "date": "May 24, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The owner is a tyrant and the employees are hateful to each other. Do yourself a favor and look for work elsewhere.",
        "advice": "Your turnover is probably extremely high for a reason, perhaps you should care about that a little more.",
        "pros": "There are no pros to this place.",
        "summary": "Don",
        "role": "Sales",
        "date": "May 26, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1) I was told my green card process will get started after 3 months of employment. But PERM filing took about 9 months, even that happened after fighting with HR. HR blocked Green card processing for almost 4 months by saying Yahoo does the processing in batch mode. Don't trust the HR people words on Green card. By giving little money they want you to get hold of you for atleast 3 years. Also I140 stage processing th… rough premium is not allowed.(even if you pay out of your pocket.)2) Poor architectural design, never cares about building right components. Hires C players.",
        "advice": null,
        "pros": "1) Free food.2) Relaxed work environment.",
        "summary": "Company tries to hold you by delaying Green card process",
        "role": "Software Engineer",
        "date": "May 27, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "- A bright future....in the rearview mirror. Yahoo has spent a decade squandering its future, and is now close to checkmate. Platitudes like 'mobile first' and 'delighting our customers' don't really address the systemic issues at this company. The recent foray into online gambling shows how desperate this company is to shore up its sagging revenue - the primary value of Yahoo is its stake in Alibaba and its Asian as… sets.- Corporate ineptitude at its finest. The leadership is non-existent, and C-level leadership mixes incompetence with arrogance and lies. The CEO will tell you she doesn't force her leadership teams to stack rank employees, but ask any front-line manager, and you'll see this is a lie.- QPRs...employees are evaluated on a quarterly basis. Sounds good, right? Not when the evaluations are stack ranked, and there's a forced distribution of achieves vs. misses. So if you're on a team of idiots, you're as good as gold...if you work on a team of smart achievers, you might draw the short straw. And make no mistake - that short straw will result in your termination at some point, or at the very least, you'll have to wait over a year for a raise or promotion. Since forced distribution is a zero sum game, it encourages employees to sabotage each other in an effort to avoid the ax.- Ya-who? Not only is Yahoo somewhat of a joke in most of society, they are going through a painful, existential identity crisis. Of the last four CEOs, none has been able to coherently articulate an answer to \"What does Yahoo do?\".- Layoffs. Yahoo has yet to improve its revenue, so the only other road to profitability is to cut expenses. That means cutting people. For a while in Q1, there were weekly layoffs - management doesn't have the guts to make a large cut, so they cut 20 here, 30 there and hope nobody notices. Everyone noticed.- Lack of communication and transparency. Weekly 'FYI' meetings are supposed to allow employees a chance to ask questions of management - while great in theory, this is just a waste of an hour when the answers are glib coporatisms from the PR department, or complete avoidance of the actual question being asked. Q: 'What are you going to do about QPRs? They're destroying morale at Yahoo'. A: 'I fundamentally disagree, I think morale is great'. It sure is great if you're bringing in the millions in the C-suite! For the drones, maybe not as much.- Terrible products. Try using Yahoo mail alongside Gmail. 'nuff said. Fantasy football is the one bright spot, but even that will probably crash just as you're about to draft your QB.",
        "advice": "Resign. Now. Publicly. You're cool, Ken Goldman - you can stay. The rest of the C-suite should be ashamed of calling themselves leaders.Maybe too harsh. Here are some real pieces of advice:- Eliminate stack ranking and subsequent firings. It didn't work at GE or Microsoft. Doesn't seem to be working at Yahoo either.- Stop buying companies that you won't actually monetize to their full potentia… l. Brightroll? Sounds like a good acquisition. Tumblr? Try actually making some money off it!- Roll back the regressive work at home policies. This is 2015, and you're (supposedly) an internet company. Webex works fine, and let's face it - the real impediment to collaboration is the toxic work culture, not people working from their homes.- Develop a coherent and specific statement about what Yahoo is, and what it's going to do in the future. Want to be an internet company? Great. Want to be a media company? Awesome. Pick one and stick to it. And dump the 'mobile first' thing - that's the equivalent of saying 'as a company, we want to be relevant and make money'. No need to pay millions of dollars for leadership to say something so vague.",
        "pros": "- Talented, friendly and considerate colleagues. I will always treasure the personal and professional friendships I made here.- Good benefits: not as good as some of the competition, but generally good. Matching 401k, good vacation, maternity/paternity leave, free food and espresso bars (in some offices).",
        "summary": "Danger! Avoid! Stay away!",
        "role": "Advertising",
        "date": "Jul 14, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "But you cannot have Free time, Freedom of thought, Free advice, or anything that will help you grow and develop.The company is on borrowed time and borrowed dollars",
        "advice": "Stop trying to be cool; It's too late. Stop trying to innovate; it's too late.Stop trying to be the search King; It's too late.Be a conduit for other companies to deliver content.Or just get acquired and call it a day.",
        "pros": "You can have some Free food, You can have some free gym, You can have some free parking, You can have some free coffee.",
        "summary": "If you like constant change and lack of direction - this is the place for you",
        "role": "Anonymous Employee",
        "date": "Jul 21, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Fired me with no warning when I had a 100% quality average. Constantly trying to make the impossible happen by setting unrealistic goals for average handle time. Did not care about their employees. People were swearing at customers and not doing their jobs, but they didn't get fired. There is a lot of favoritism.",
        "advice": null,
        "pros": "Good Pay (if you know what you are worth) and great benefits - health, time off, etc... They also like to give you gifts on special occasions.",
        "summary": "No Job Security",
        "role": "Customer Care Associate I",
        "date": "Jul 23, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- no innovation- hires only people from India or other countries and says - \"working late hours should be contagious\"- no life/work balance",
        "advice": "Let people innovate and don't ask them to work more than 40 hours if they don't want to.",
        "pros": "Decent pay with stock options",
        "summary": "Horrible when it comes innovation",
        "role": "Anonymous Employee",
        "date": "Aug 11, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Politics, QPR, hidden layoffs, unprofessional management",
        "advice": "to replace management",
        "pros": "free food, compensation, good engineers",
        "summary": "Principal Software Engineer",
        "role": "Principal Software Engineer",
        "date": "Sep 23, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Yahoo used to be a good company with great culture, but now they are only hiring and promoting sycophants, if you believe you are one of them, then just come! Managers in this company do not care how talented you are, how dedicated you are, all they ever wanted is you to be sycophants, and you will get promoted someday. .",
        "advice": "sucks!",
        "pros": "great food, great coffee, great snacks",
        "summary": "This company has no structure!",
        "role": "Anonymous Employee",
        "date": "Oct 1, 2015",
        "is_current": true
    }
]