[
    {
        "rating": 3,
        "cons": "Lower level Management that are incompetent and lazy.",
        "advice": null,
        "pros": "Benefits, Culture, and relaxed work environment",
        "summary": "Aos",
        "role": "Ad Operations Specialist",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Contributors don't really have the opportunity to pitch many story ideas on the site's Associated Content section.",
        "advice": "Consider taking more pitches from contributors.",
        "pros": "Have the opportunity to get experience in multiple areas, including sports, finance and politics.",
        "summary": "Contributing Writer for Associated Content",
        "role": "Contributing Writer",
        "date": "Jun 11, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Constantly changing managers, lacks vision.",
        "advice": null,
        "pros": "Even though the company has serious leadership problems, the one consistent positive is the people. I've worked with some of the best minds in the business: really talented, motivated and personable.",
        "summary": "Great people but lacks leadership",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too PoliticalMicro ManagementLow Base PayStress Level and WorkloadRaises and Promotions not commonToo Many Management Levels",
        "advice": null,
        "pros": "Great CoworkersAmazing Benefits & PerksKnowledge Gain/Training",
        "summary": "Creative Strategist",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Quarterly ranking and rating is a big distraction to productivity for individuals and management. It also keeps the stress level too high.",
        "advice": "Upper management should get rid of the quarterly ranking and rating and also not foist seating arrangements (like workbench style vs. more private cubicles) on employees. There should be a choice.",
        "pros": "Benefits are good for healthcare, paid time off, and the free food is also very good. The CEO, Marissa, is a great communicator and strategist. After so many CEOs in the past, it is nice to have her navigating the ship. Free access to Lynda.com and an electronic book site are also helpful in expanding skills.",
        "summary": "Too much stress",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not as nice to their engineers as the other big tech companiesSome Managers are horribleLots of dropped projectsFuture always seems uncertain.A lot of drama around company and CEO",
        "advice": "Try to organize a theme around how you want your business to run and how you want your employees to behave. Stability is the primary thing missing from this company. Having purple chairs in the conference room is cute but not strong enough to unify a company.",
        "pros": "Nice to engineersSome Managers are amazingLots of training classes available.Good work-life balance",
        "summary": "Software Engineer",
        "role": "Software Engineer",
        "date": "Jun 22, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Challenging to grow in a company that reorgs so often",
        "advice": "Promote a positive company culture and make people feel appreciated. Lose the quarterly review process.",
        "pros": "Great people to work with.",
        "summary": "Great People",
        "role": "Account Manager",
        "date": "Jun 30, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Direction, career growth, motivation, QPR - quarterly reviews, constantly channging priorities, inexperienced management. I really dislike the time and effort the QPR dance required.",
        "advice": "I was there for 8+ years.Overall I had a fulfilling time there, although the ups and downs were trying.I miss yahoo because of the friends i no longer see, but most of them left anyway.Biggest con that comes to mind is the qpr process; honestly, it is quarterly and often, and then yearly. And each time it is a week long process.I see it as short sighted; it measures and quantifies. It sepa… rates and it divides. It does what it does, but it does not motivate people. To some, it does the opposite.Translation - the QPR system at Yahoo tries to identify top performers for possible rewards. It does, and sometimes the right people get rewarded, although engineers are super hard on each other compared to other functions. Why is that?The QPR system at Yahoo does not motivate employees as a whole. It possibly does the opposite.Define a singular mission. Teach others. Motivate the employees to perform, then measure their performance, then feed them. Do it in that order.",
        "pros": "Perks like free food, coffee, phone, etc. Flex sched, nice campus and facilities, smart ppl. Clean, bright environment, shuttles, parking, smoothies, mobile services (dental, health, haircuts, etc)",
        "summary": "What is happening (or happened)?",
        "role": "Senior Technical Yahoo",
        "date": "Jul 2, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Current senior management have no real plan for long term growth. As a result, employees are generally tasked with working on products and doing deals with no sense about how their work fits into the overall direction of the company. This sense of frustration can be found at nearly every level and explains why there has been such an exodus of talent in the last two and a half years.",
        "advice": "Identify and share your plan for the direction of the company. FYI is appreciated, but often comes across as lip service and avoids the big question that everyone wants answered. Finally make Yahoo Mail a best-in-class product and you can build momentum around that. No excuse for Mail to still have so many issues - it should be priority #1.",
        "pros": "At many levels (excluding E-staff), Yahoo hires exceptional people. It's filled with folks with a high business and emotional IQ. The pay is solid as are the benefits.",
        "summary": "Great people, no real direction",
        "role": "Senior Manager",
        "date": "Jul 14, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "management is unpredictable, job security is uncertain, seems that few people are considered for long term employment while others are tossed in to a talent tasting pool",
        "advice": null,
        "pros": "free food, decent work environment, decent pay",
        "summary": "gsd",
        "role": "GSD Analyst",
        "date": "Jul 17, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "There is still high turnover. There is a tendency toward hiring youth and work life balance was starting to disappear. Performance is stack ranked and struck many as unfair.",
        "advice": "Take a shot at an inspiring new product. Keep investing in your people, and keep beefing up your engineering talent in SF.",
        "pros": "The people are intelligent, driven, and humble. The strategy is clear, but it probably won't move the needle much given the size of the company and the shifts in the advertising industry. The company is unlikely to build or buy a breakthrough product in the next few years, but it's a pleasant enough place to work.",
        "summary": "Great People, Still Struggling to Find Vision",
        "role": "Senior Product Manager",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High pace & stressful - growth opportunities are slow",
        "advice": "be more transparent",
        "pros": "energetic culture, great perks, flexible",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Jul 28, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "low bonusesstrategy keeps changingfrequent layoffs",
        "advice": null,
        "pros": "Great cultureFast pacedLots of perks",
        "summary": "Research Scientist",
        "role": "Research Scientist",
        "date": "Jul 29, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too many silos, hard to do business",
        "advice": "rotate staff",
        "pros": "fun people work here, lot of knowledge",
        "summary": "right level",
        "role": "Senior Directory, Customer Support",
        "date": "Aug 7, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No so well established reward system. Quarterly performance review",
        "advice": "Value and reward resources appropriately.",
        "pros": "Fairly good work life balance. Maternity/paternity leave like any other companies. Free-food.",
        "summary": "Good company to work for in general",
        "role": "User Experience Designer",
        "date": "Aug 12, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "poor work life balance ..nothing much",
        "advice": "n/a",
        "pros": "good place to learn stuff. great food",
        "summary": "Tech Yahoo,Sr",
        "role": "Tech Yahoo Software Dev Engineer Senior",
        "date": "Aug 13, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Non-competitive salary and disorganized upper management.",
        "advice": null,
        "pros": "The people - some of the coolest and most talented folks in the industry.",
        "summary": "Project Manager",
        "role": "Anonymous Employee",
        "date": "Aug 14, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Senior management in the location has no clue how to run the support business unit in Hillsboro and continuously makes uneducated decisions. Morale is at an all time low and most of the talent has already left the company seeking new opportunities and career advancement.When job opening come up they are almost always filled from the external sources since backfilling positions is close to impossible. The hiri… ng process needs to be completely revamped or internal growth will continue to be a scarce commodity.",
        "advice": "Proper management training as well as adding experience to the team would improve life dramatically.",
        "pros": "Free food and beverages. Newer management additions are bringing intelligent ideas and change for the better.",
        "summary": "Senior management needs a change",
        "role": "Anonymous Employee",
        "date": "Aug 17, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Jr management lack of experience, low salaries, favoritism, HS type cliques",
        "advice": null,
        "pros": "Benefits, job location, professional experience acquired, many of the colleagues. Other than these, I cannot think of further pros.",
        "summary": "Content Programming",
        "role": "Anonymous Employee",
        "date": "Aug 19, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Could have immersed Hotjobs better",
        "advice": "More attention to new employees",
        "pros": "Good environment to collaborate and work together",
        "summary": "Ok",
        "role": "Anonymous Employee",
        "date": "Aug 21, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not as high as google facebook",
        "advice": null,
        "pros": "High pay good work life balance",
        "summary": "Positive",
        "role": "Software",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "uncertain future in terms of market share, management and competition.",
        "advice": "Keep doing good work.",
        "pros": "great work environment, great benefits.",
        "summary": "Technical Yahoo Service Eng Sr.",
        "role": "Technical Yahoo Service Eng Senior",
        "date": "Aug 24, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Bad management. Everyone is behind quarterly goal and nobody looks at the long term goals.",
        "advice": null,
        "pros": "Good work. Great benefits. Free food",
        "summary": "Good Company",
        "role": "Anonymous Employee",
        "date": "Aug 24, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too many processes..constant changes which affects the morale..",
        "advice": null,
        "pros": "good work culture ...very good perks..can work on latest and greatest technologies",
        "summary": "work",
        "role": "Anonymous Employee",
        "date": "Aug 25, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Too many status updates and too much politics. Best people are leaving yahoo or have left a while ago. Hard to hire smart motivated folks. If you happened to be one - you might make an impact... Or not.",
        "advice": "Question people's motivations. Hire well - find motivated talent",
        "pros": "Great for life work balance. Great benefits. Nice and generally collaborative people in teams. Great food. Shuttles in Bay Area.",
        "summary": "Too busy fighting internal problems",
        "role": "Product Management Director",
        "date": "Aug 27, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Overall feeling of being second rate. Everyone uses Google products, even if Yahoo equivalent exists. Yahoo ads often market scams/malware, but nobody I talked to seemed to mind.",
        "advice": null,
        "pros": "Some great people working there. Great food. Fun atmosphere.",
        "summary": "Fun if a bit frustrating",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Poor technology and many impediments to productivity. Lots of attrition and talent drain.",
        "advice": "Do everything possible to make this an enjoyable place for engineers to work.",
        "pros": "Good culture and casual workplace. Lots of potential to make a big impact with a large user base.",
        "summary": "Senior Engineering Manager",
        "role": "Anonymous Employee",
        "date": "Sep 2, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no business direction, too many mid level managers don't know what to do.",
        "advice": null,
        "pros": "friendly people, good food",
        "summary": "Great Company",
        "role": "Software Engineer",
        "date": "Sep 2, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "there is not much innovation happening here.",
        "advice": null,
        "pros": "free food, phones, gym, and talented co-workers.",
        "summary": "Good work place",
        "role": "Anonymous Employee",
        "date": "Sep 4, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Performance reviews too frequent, and are not good gauge of company talent.",
        "advice": null,
        "pros": "Management could work on being more in tune with employees.",
        "summary": "Average",
        "role": "Anonymous Employee",
        "date": "Sep 7, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "While some are great, others are .. kinda cocky.",
        "advice": null,
        "pros": "Labs has some of the smartest folks out there",
        "summary": "Labs is good",
        "role": "Intern",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The executive staff is a joke. it's a good ol'e boys club run by a women. A women who is there as a token to run it to the ground for a profit.It's also hard to transfer internally because despite what is being told to employee's they really do care about where you went to school.",
        "advice": "why bother.",
        "pros": "The people who actually care about the business are great. And the benefits are on par for what most internet companies provide.",
        "summary": "Great people and benefits",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Very disorganized and very low morale. There were huge layoffs while I was there, and one of the founders left. It was a rough time for Yahoo! Also, although they embrace open source, a lot of tools that are critical were forks of open source things that were poorly maintained or quickly abandoned. Some of the more mature forks developed into basically proprietary tools, with little, or poor documentation. There was … a lot of out for number 1 and teamwork was lacking. Many teams did basically the same thing and didn't even know their counterpart teams existed (including mine).",
        "advice": "Give people more time, less meetings. Embrace new ideas, and don't kill projects in the name of pleasing shareholders. So many changes in direction was wasteful, and Yahoo! paid a high price for that. It seems like things are much better now, under Mayer, but while I was there, there were to many bosses, not enough workers, and too much power struggle and politics. It really overshadowed the reasons I wanted to be th… ere.",
        "pros": "They had some great perks and you get a chance to solve problems on a very large scale. I got some exposure to exciting open source projects.",
        "summary": "Very disorganized, low morale when I was there (2011)",
        "role": "Senior Systems Engineer",
        "date": "Sep 16, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Departments in silos. Products rolled out quickly without quality.",
        "advice": "ensure that products that are rolled out quickly are still done in an organized fashion",
        "pros": "The people are the best thing about yahoo. Everyone is willing to help, to work together.",
        "summary": "Disorganized",
        "role": "Anonymous Employee",
        "date": "Sep 17, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lack of a clear vision that will turn the company around. Market perception remains negative unless company can find a way to grow revenues and profits.",
        "advice": "Drive more decision making power down to the teams. Let teams have the autonomy to conceive and bring to market their ideas.",
        "pros": "Yahoo has been a remains a great environment to work with some of the smartest talent. There was great team cooperation and willingness to go the extra mile for your colleagues.",
        "summary": "Senior Program Manager",
        "role": "Anonymous Employee",
        "date": "Sep 23, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Everything is politically charged & favorites are sometimes played.The QPR process has wreaked havoc on the culture and on morale.The hiring process is painful for those hiring & those being hired.",
        "advice": "Spend some time looking at the middle management and focus on developing them into strong leaders.",
        "pros": "Outside of Sunnyvale, there are a lot of wonderful, smart, hard working people.The benefits package is fantastic.Obviously the free food & other perks are a draw as well.",
        "summary": "Yahoo review",
        "role": "Director",
        "date": "Oct 6, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "unclear company vision, review rating by quarter",
        "advice": null,
        "pros": "get good experience to learn big data",
        "summary": "principal software engineer",
        "role": "Anonymous Employee",
        "date": "Oct 17, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Amazing engineering talent, unfortunately all scattered about, working on multiple competing projects, sitting on a stack of 15 year old legacy code. Change requires almost direct line up to Filo, with teams projects often getting scuttled for no reason, or timelines that are just incredibly long winded and surrounded by layers of management",
        "advice": "Let the innovation flags fly, and tell management to get out of the way.",
        "pros": "Great perks, offices, and good people. Technical solid. Great innovation exists in those walls.",
        "summary": "Tons of Talent, Buried under Piles of Risk Averse Management",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Constant management refocus, unclear priorities",
        "advice": null,
        "pros": "Good people, genuinely care about the company",
        "summary": "Good people",
        "role": "Senior Director Marketing",
        "date": "Oct 19, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "1. Vision is not clear2. Fails at attracting new users",
        "advice": null,
        "pros": "1. Awesome work place2. Great benefits3. Smart and talented work force",
        "summary": "No clear vision",
        "role": "Tech Yahoo Software Dev Engineer",
        "date": "Oct 27, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "-Shortsighted in marketing strategies.-The creative ceiling has a limit...creative strategies can get stagnate.-get ready to lose your social life, as it mainly resides on their campus.-The Silicon Valley as a location to live is a bit depressing as well as the cost of housing...rentals or owned.-Quick turnover of employees.",
        "advice": "Listen to the creative geniuses you hire and try implementing their new ideas.",
        "pros": "-Work alongside some of the brightest talents out there.-The benefits are great.-The pay is competitive.-The experience offers exciting challenges.-The corporate exposure to other competitors.",
        "summary": "Working at Yahoo (Sunnyvale) as a creative designer",
        "role": "Environmental Designer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Almost too much change, hard to be strategic",
        "advice": "I hope you are successful! Love the brand, great people",
        "pros": "Always changing, dynamic, learned a ton",
        "summary": "Human Resources",
        "role": "Anonymous Employee",
        "date": "Oct 28, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "bureaucratic hurdles from size & sprawl of different divisions; challenging performance review process; quickly shifting priorities; way way waaaaayyyyy too many directors, Sr. directors, and VPs clogging up the upper middle of the org structure and making operations difficult.In those below executive level, there is Widespread lack of trust in the top execs, with the exception of CEO.",
        "advice": "Try being like \"undercover boss\" for a couple days and find out how your divisions are being run at the lower levels! Many of your goals are mistranslated as they filter down to middle managers - leads to a lot of confusion and wasted work time.",
        "pros": "Health insurance & benefits; free food; free iPhones; nice new laptops; nice offices; excellent benefits for LGBTQ employees; maternity leave & adoption leave policies; relatively transparent top execs; flexible scheduling; lots of vacation hours that roll over at end of year.",
        "summary": "Some good, some less good",
        "role": "Network Traffic Quality Manager",
        "date": "Oct 29, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "no good product, sales drops, bad managements and headship, some politics, too many layers in management structure. company needs to layout employees.",
        "advice": "Find good CEO to turn company",
        "pros": "Company treats employee well, offer free food, have good summer picnic and holiday party, free medical plan when I joined in 2004.",
        "summary": "Good company to work, but no good product",
        "role": "Senior Software Engineer",
        "date": "Nov 6, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bureaucracy, inefficiency, slow-moving, decent, all right",
        "advice": "Get various departments on the same page. Easier said than done.",
        "pros": "Wonderful people, enjoyable work, good environment, room to develop, transparent",
        "summary": "Reporter",
        "role": "News Reporter",
        "date": "Nov 6, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Quarterly performance goals & reviews, hiring process takes long time, no ESPP",
        "advice": null,
        "pros": "Free food, events for employees and families",
        "summary": "It really depends on the team..",
        "role": "Senior Technical Yahoo",
        "date": "Nov 7, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unfortunately management took it down the drain.",
        "advice": "Clear direction and more collaboration",
        "pros": "I really had a good time working for yahoo. Folks were talented.",
        "summary": "Good company bad management",
        "role": "Anonymous Employee",
        "date": "Nov 8, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too many leaders in senior roles that shouldn't be. Yahoo has all these Directors who are basically just front-line managers (no manager reports). Trying to retain by giving inflated titles is a sign of desperation..",
        "advice": "Make the company's focus on Tumblr. At least the kids use that product (thanks to all the porn). The brand of Yahoo is ignored by anyone younger than 40.",
        "pros": "Lots of new and improved products. Good energy and nice perks (free food). A feeling that we're working on something important (even though the rest of the world disagrees)",
        "summary": "Product improving, but outlook isn't",
        "role": "Senior Program Manager",
        "date": "Nov 10, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Too much work and very frequent changes makes it hard to keep work and life balance. Quarterly review adds more mental pressure.",
        "advice": null,
        "pros": "Good tech learning environment. Company is trying hard to succeed.",
        "summary": "In transition",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "bad managements, bad product planning",
        "advice": null,
        "pros": "life balance is good, good place to train engineers",
        "summary": "Technical Yahoo",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Quarterly performance reviews, hiring is a huge churn and time suck. Executive leadership changes often directions change often",
        "advice": "get ride of QPR",
        "pros": "Good people free food great work environment work life balance",
        "summary": "Meh....",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Low pay and lots of paperwork. A lot of cheerleading sessions. A lot of indoctrination and company rah rah brainwashing. Narrow minded managers who've never worked at a better or differently managed company, many of whom have never worked at any other company period, so honestly probably just don't know any better. Too much time by just about everyone on self promotion, often based on inaccurate or outright false dat… a. Desperate managers so afraid to leave their cozy nest that they generate ridiculous efforts just to toot their own horn, with little or no regards for the actual financial or humane value. Lack of work life balance except for those either skilled in deception or too workaholic to need an outside life. Coworkers so eager to please they'll go along with any harebrained management request at the drop of a hat.",
        "advice": "Not everyone believes the spin. Have the respect to be honest with those seasoned and savvy enough to see through the smoke screen. You may be able to fool the naive, but don't think everyone is clueless enough to buy into the propaganda. Don't force them to pretend. Grow some humility. It's a nice company but it's hardly Utopia. Remember you are a human being first, and a Yahoo employee second, as are your employees… , clients and colleagues.",
        "pros": "Hard to beat health benefits and 401k, casual dress, free food. Great training for new college grads who need to learn skills and build a resume. Travel opportunities.",
        "summary": "Fun but Fake",
        "role": "Anonymous Employee",
        "date": "Nov 19, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "limited photo uploads, some interface are hard to get hands on, out of business for few years.",
        "advice": null,
        "pros": "It was a popular social networking web site , has photo album, blogging, customization personal space",
        "summary": "shame",
        "role": "Anonymous Employee",
        "date": "Nov 23, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Continuous change in the various products w/o an eye to long term strategy.",
        "advice": "Stop messing with the product and figure out what you can deliver to your core audience instead of trying to be all things to all people",
        "pros": "Smart people who work hard. Company has enough clout to buy needed technology instead of wait to develop themselves. Pays well and lots of benefits.",
        "summary": "Change is the only constant",
        "role": "Partner Manager",
        "date": "Nov 23, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The company was large and difficult to find position advancements",
        "advice": null,
        "pros": "I had some good experience and learned a lot from the industry",
        "summary": "Positive experience",
        "role": "Technical Yahoo",
        "date": "Dec 1, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "PC based business can be tough as things move to mobile. typical corporate politics play a role in responsibilities and roles",
        "advice": "figure out strategy and go for it",
        "pros": "good smart people to learn internet industry and develop career. need to find opportunities but can add value to businesses",
        "summary": "Learn the business",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unfortunately Yahoo's advertising business is utterly directionless. VP's have very little influence in decision making by Sunnyvale. A lot of managing by fear, coupled with little strategic vision. Constant state of uncertainty around the future of the business. Difficult to maintain healthy morale.",
        "advice": "Sell the tech",
        "pros": "Generous compensation, benefits, opportunity to work with incredibly talented people and connections to Yahoo technology and business partners - most of which will cross paths in some capacity down the road.",
        "summary": "Platform Account Management",
        "role": "Anonymous Employee",
        "date": "Dec 7, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Low pay for expertise and not great at work life balance.",
        "advice": "Pay employees closer to market pay. Quite a few tech companies have landed in Omaha and are paying employees more.",
        "pros": "Good benefits, free meals and snacks, gym membership reimbursement.",
        "summary": "Yahoo Review for Creative Strategist",
        "role": "Creative Strategist",
        "date": "Dec 9, 2015",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "not much impact you can make",
        "advice": "to be honest, it a nice stopping place to the next stop in your career. best to move fast",
        "pros": "it was a decent campus",
        "summary": "okay company",
        "role": "Operations",
        "date": "Dec 10, 2015",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Training was not as good as it should have been.",
        "advice": "Listen to new ideas and don't be afraid to embrace them. Ever wonder why Google took off and Yahoo didn't? There ya go!",
        "pros": "I worked for Yahoo years ago.... Years... On their Help Desk. I liked the people I worked with, but it was third shift which put me going home about 1am.",
        "summary": "Glassdoor needs better development",
        "role": "Anonymous Employee",
        "date": "Jan 3, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Constant external news cycle about where the company should go, whether the CEO should stay/go, whether the Board should stay/go, are all distractions for people who would like to get heads down and get some work done.",
        "advice": "Honestly communicate what is going on instead of canned answers about the issues the company is facing. There is no shame in calling out the difficult issues the company is facing so management can rally troops to fight for a cause.",
        "pros": "Inside the company, there are a lot of interesting technologies being used. For engineers who are interested in solving problems at scale, Yahoo is one of a handful of places who offer the opportunity to work on Internet scale.",
        "summary": "Manager",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "too many strategy changes and low employee morale. quarterly ratings not given effectively. few managers give predetermined ratings not dependent on your work. lot of workarounds for qprs and all which the ceo isnt aware of.",
        "advice": "Marissa Mayers vision is not implemented in the right way by middle layer management. lots of veteran directors, vp's who are nothing but dead weight.",
        "pros": "Lots of smart people and you will learn a lot there. Great benefits. Free food. Awesome perks overall. Lot of visibility, ownership and responsibility.",
        "summary": "Lots of hope from Marissa Mayer but no success",
        "role": "Anonymous Employee",
        "date": "Jan 11, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "-slowly losing perks-people don't think for theirselves-management lacks vision",
        "advice": "-do a better job at innovating-take risks and don't kill new acquisitions so quickly before realizing their true potential",
        "pros": "-great campus-great perks-lots of potential",
        "summary": "Great company but it greatly depends on your team",
        "role": "Anonymous Employee",
        "date": "Jan 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Bureaucracy, lack of company vision, constant upping of goals and pitting team members against one another.",
        "advice": "Less is more. Let people do their jobs and stop adding so many things to their plate.",
        "pros": "Great pay, benefits, amazing perks and people",
        "summary": "Constant Highs and Lows",
        "role": "Anonymous Employee",
        "date": "Jan 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Disorganized, not solving any new problems",
        "advice": null,
        "pros": "Great people, fun projects at times",
        "summary": "Review",
        "role": "Experience Designer",
        "date": "Jan 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "There are some bad things (I'm afraid to identify myself because I want to keep the good things!)",
        "advice": null,
        "pros": "Some things are good! There must be at least five words for this review!",
        "summary": "Ambiguous Title is Ambiguous",
        "role": "Operations Center Engineer",
        "date": "Jan 19, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Executive team turnover is shocking, leads to regular directional shifts that prevent basic tasks from getting done. Marissa Mayer seems to not understand the needs of the company—an enormous salary goes to her which, if reduced, would save the company tremendously and reduce the need for sweeping layoffs, rumored to take place in early 2016.",
        "advice": "Replace Marissa Mayer, stop purchasing companies, focus on core products",
        "pros": "Creature comforts, great health benefits if you're single",
        "summary": "Poorly managed at the highest level",
        "role": "Brand Associate",
        "date": "Jan 25, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "If you can't deliver a product in 1 quarter, it probably won't get funded. The HR team is notoriously bad at following up with candidates.",
        "advice": "Marissa is not Steve Jobs. We have a lot of excellent PMs and Sr. Product Managers. Let them do their jobs.",
        "pros": "Benefits are solid, 15 vacation days a year for new hires, all the free food, coffee and snacks you could wish for, nice gym facility. Rarely need to work late nights and weekends.",
        "summary": "Good perks, if you can get in",
        "role": "Anonymous Employee",
        "date": "Jan 25, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "constant layoffs, not very bright company future.Good technology stack, great benefits, very large user base",
        "advice": null,
        "pros": "Good technology stack, great benefits, very large user base.constant layoffs, not very bright company future.",
        "summary": "Software Engineer",
        "role": "Software Development Engineer",
        "date": "Jan 26, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "A surplus of managers leads to a too many cooks mentality. Also the constant drone of QPR rhetoric can stifle actual work getting done",
        "advice": null,
        "pros": "Work with some incredible people at a global scale. Culture is great, and work/life is pretty accommodating. Great mix of people from all walks gives a depth of diversity.",
        "summary": "Amazing Culture",
        "role": "Anonymous Employee",
        "date": "Jan 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Office politics, the QPR system, and the sudden but not transparent cap on position salary. Wall Street undervalues the company and as a result we continue to play the shareholder games.",
        "advice": null,
        "pros": "When working for the right people within the company the experience is great. Produce and stay employed. The free food is nice on the Sunnyvale campus. Plus the work that Yahoo does is very under appreciated.",
        "summary": "It has been a rollercoaster which has ultimately provided great experiences.",
        "role": "Service Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Always worried about layoffs. Management changes directions quite a bit.",
        "advice": "Pick a strategy and stick to it.",
        "pros": "Some really good, dedicated people. Ability to invest significant resources if you are in the right group. Nice facilities and gym. Free coffee",
        "summary": "Just OK",
        "role": "Senior Manager",
        "date": "Feb 2, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "No company is perfect, definitely not this oneConstant looming fear of layoffsEndless negative pressHigh attrition due to the above 2 consSO MANY POINTLESS MIGRATIONS... one quarter it's migrate to this, next quarter it's migrate to that, next quarter the team maintaining that platform is either laid off or bails to another company because they are tired of this BS, next quarter it's m… igrate to another platform because nobody is maintaining the last one. Repeat.Many of the internal services are extremely unstable and are not treated with the same respect as a production service. This has resulted in a large portion of the company using services like slack because we can't keep our own damn internal messaging services online.Recruiters will spam your inbox, even your work inbox... and don't even think of answering your phone. I seriously cannot answer my phone anymore.ESPP was discontinued about a year ago and replaced with stock grants that have lost 50% in value and take forever to fully vestStock price is tanking with no end in sightDirection and future of company is unclear. Facebook / Google are leeching all of the ad revenue and ad-block software is reducing itManagement fails to see the harm QPR is causing to the company.You will only receive high ratings if your projects are in the spotlight. This means if you end up with a streak of un-sexy projects for multiple quarters, you are at risk of being fired. The number of people that can receive a high rating is extremely limited. This means if you have a team of 10 world class engineers, only 1 would get the highest rating, 2 would get the next highest, and everyone else would be rated \"average\". This is extremely demotivating and causes high performing engineers to leave the company and go somewhere they can be property recognized.",
        "advice": "QPR is killing the company. Remove this policy and don't look back.Take a survey of users and ask what Yahoo properties they know about. Shut down everything that is rarely named.Invest employees from the failed properties into ones that matter.We only need one or two major offices in each region of the world, close all of the others and be done with layoffs for the next 5-10 years.Spi… n off the BABA stake faster, nobody wants to wait another year.Do these things and our company will be extremely profitable",
        "pros": "Best place I've worked at so farExcellent benefitsCompetitive salary and bonusesFree breakfast / lunch / dinnerFree coffee / juice bars all dayExcellent networking opportunities since many ex-yahoos go to LinkedIn / Google / Facebook / AppleSince the company has been around for 20+ years, it's a great place to learn what works and what does notMacs everywhere, n… o Windows2 factor auth system is seamlessEnormous scale - your work can affect millions of people daily",
        "summary": "Rearranging furniture on the Titanic",
        "role": "Yahoo Technical Yahoo",
        "date": "Feb 7, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The bane of Yahoo! is senior management. They're a tribe of executive nomads who roam between companies looking to loot as much as possible until they either leave of their own accord or are forced out. I attended a company all-hands meeting once where a brave soul stood up and verbalized what I held inside for the better part of 5 years... at Yahoo!, the only criteria for strategic direction is that it be significan… tly differentiated from that of the former regime. Plenty of accountability at the lower levels, but executive management gets endless free passes.",
        "advice": "Please resign and suggest to the BOD that a \"promote from within\" policy be instituted for a minimum of 2 years until the company can course correct. The worker bees know how to create amazing content, they just need senior management to be pushed aside.",
        "pros": "You'll work alongside bright, talented and ambitious peers who often see the big picture and have good instincts on how to achieve success when faced with significant obstacles.",
        "summary": "The best job you'll be happy to leave",
        "role": "Anonymous Employee",
        "date": "Feb 10, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Unstable, and yearly lay-off is very bad for morale and culture.",
        "advice": null,
        "pros": "Good free food. And my manager is very nice.",
        "summary": "Data Engineer",
        "role": "Data Engineer",
        "date": "Feb 13, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "* Because the CEO is technical oriented, generating revenue is a challenge for her. Unfortunately, revenue is the only thing that investors are focusing on after the three years on the job.* Because speed (agility) is the focus, the product quality suffers.* Employee rating system is another issue which resulted in low morale.",
        "advice": "* Focus on generating revenue not product innovation. The company has enough pieces to sell. The CEO needs to pay attention to revenue.* Need to hire more seasoned executives to help run the company. There are too much politics and some of the executive staff need more experience before running huge organizations.",
        "pros": "CEO works extremely hard. She has changed the cultural from slow delivery to a very fast delivery. She is doing a good job taking care of employees. Employees work very hard as well to keep up with delivery schedule. can feel the energy at the campus.",
        "summary": "my observations",
        "role": "Program Director",
        "date": "Feb 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Unfair quarterly reviews; Unbalanced work load (no work/life balance; Awful management",
        "advice": null,
        "pros": "Great culture; Travel opportunities; Good bonus and commission opportunities",
        "summary": "Great culture, but poor work/life balance",
        "role": "Anonymous Employee",
        "date": "Feb 14, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "The corporate strategy to turnaround the company has stalled and stakeholders have lost faith that it can be pulled off. Employee morale is low due to continual layoffs and endless restructuring. A poorly executed employee quarterly review program motivates short term goal planning at the expense of creating compelling products that adhere to a long term vision.",
        "advice": null,
        "pros": "The pros of working at Y! include working with amazingly talented individuals on products that make an impact to millions of users. The perks are first rate.",
        "summary": "Manager",
        "role": "Manager",
        "date": "Feb 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Lot's of potential , poor management structure.",
        "advice": "The culture at Yahoo! is shot and operating a declining company in a culture of fear is no way to attract and keep talent.",
        "pros": "Good Benefits, Free Food, Pay was ok before new management",
        "summary": "Potential",
        "role": "Account Executive",
        "date": "Feb 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Middle management lacked vision. Rating system was unjust and borderline illegal",
        "advice": null,
        "pros": "Good life-work balance, benefits, and perks",
        "summary": "From good to awful",
        "role": "Video Editor",
        "date": "Feb 16, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Stock price continues to be unspectacular and the murky outlook makes it dangerous to join now. Six months from now the situation will either be much better or much worse, but will probably at least be clarified.",
        "advice": null,
        "pros": "Engineers are intelligent, hard working and experienced. Lots of resources are available to employees, and the free food is great. On large products, your work will be seen by millions of people.",
        "summary": "Turbulent times, good people",
        "role": "Front End Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "unstable management, political, rude people",
        "advice": null,
        "pros": "Good perks, nice people, interesting work",
        "summary": "OK place",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Leadership, lack of directionRevenue is a struggle",
        "advice": null,
        "pros": "Free lunchesGood benefitsSmart peopleBeautiful officesFlexible work schedule",
        "summary": "Some perks, but a lot of changes",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "stock is totally jumbled with Alibaba, so no one knows what to think of Yahoo. Only a couple L2s really know what's up - lots of others are resting and vesting. There are pockets of awesome, but there's a lot of mediocre as well.",
        "advice": null,
        "pros": "Good compensation, fun culture, great SF location",
        "summary": "Tough times",
        "role": "Anonymous Employee",
        "date": "Feb 18, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Strategy is not always clear and senior leadership does not consistently drive towards a unified focus.",
        "advice": null,
        "pros": "The people across the company are amazing. I've worked across multiple groups and time and time again you always end up working with awesome people.",
        "summary": "the good, the bad and the ugly",
        "role": "Anonymous Employee",
        "date": "Feb 20, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not stable, net income decline year by year. Lay off happens almost once every year...",
        "advice": "Focus on product rather than stock",
        "pros": "A lot of small benefits like free food, free upgrade to Dell curved screen, free vending machine to get apple accessories like keyboard, magic mouse, etc.Use a lot of open source tools and open to integrate with latest open source software.",
        "summary": "Not a good choice for long term career development",
        "role": "Intermediate Software Development Engineer",
        "date": "Feb 22, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Leadership has no direction, people are afraid of losing their jobs, the company is so large that it takes a year to navigate it.",
        "advice": "Figure out what you want to achieve, stick to it and encourage everyone to work together",
        "pros": "The people are the best place about the company and the breadth of digital experience that you will receive. It truly is like working at a bootcamp.",
        "summary": "Sr. Manager",
        "role": "Senior Manager",
        "date": "Feb 22, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Senior management is completely out of sync with teams on the front line. Shift in direction countless times while not ensuring previous commitments to clients are kept. .",
        "advice": "Constant swirl in media about the future of the company makes building advertising relationships a challenge. Lead in an open and honest way that does not simply paint a picture of positive hope without a plan or communication strategy to those looking in.",
        "pros": "Great people in lower management, product debelopent and individual contributor roles who are very smart, adaptable and able to succeed in the midst of challenging conditions.",
        "summary": "Account Director",
        "role": "Senior Account Director",
        "date": "Feb 24, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Changes CEOs all the time",
        "advice": null,
        "pros": "Free food and nice gym.",
        "summary": "Yahoo for Yahoo",
        "role": "Anonymous Employee",
        "date": "Feb 24, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Poor long-term decision making and project planning across all disciplines. Including impact on both internal and external users.",
        "advice": "Improve planning and decision making skills and have everyone push back more on upper management and more senior employees.",
        "pros": "Scale, constant engineering challenges, work life balance, benefits, free food, modern cell phones and laptops. Knowledgeable engineers.",
        "summary": "Good company, long term planning and decision making needs work",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2016",
        "is_current": true
    }
]