[
    {
        "rating": 4,
        "cons": "Though I feel it is reversible, Yahoo was on a decline before the economy turned sour - and with two rounds of layoffs in under a year, it's had the effect of shoving a lot of good people out the door before they get caught unawares. That's created an above average level of churn, which really cuts out a lot of momentum towards changes.I also think Yahoo! can be a bit hidebound at times, depending on the mana… gement above you. Sometimes shipping a lite version is better market insight than a market study.",
        "advice": "Yahoo's got good bones, and passionate people - but we need to quickly (<1 year) get to a few key initiatives and start getting clear wins. Don't sell Search - the insights are too valuable to so many other products.",
        "pros": "There are not a lot of companies out there where just about any new product gets 50+ PR mentions and thousands of users on Day 1 of its release. That's just the coolest thing in the world. And I love the challenge of coming up with pretty broadly appealing mass market products - how am I going to make something that works for at least half the Internet?",
        "summary": "Despite choppy waters at the moment, I really enjoy working here now and look forward to winning the challenges ahead.",
        "role": "Product Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You have to develop thick skin as media has been lashing out at the company for a long time.Matrix org structure makes it difficult to figure out responsible groups. Success has many fathers and failures have none. Too many managers and incompetent sales force.",
        "advice": "Get out of the shadow of Google. Yahoo! is still a great company with many great people. Improve decision making. Get rid of dead wood.",
        "pros": "- \"Yahoo!\" brand on your resume: Contrary to what many so called financial analysts of bankrupt Lehman Brothers, Merill Lynch, Goldman Sachs etc. describe; the company still carries a great reputation among general public.- So many really smart people: Some of the people are really top notch. A look at the developer network would give you a glimpse of the talent at Yahoo!- Fun culture: People work hard and pa… rty harder- Free latte/mocha and other facilities: Great facilities. Although, no 'free food' but good pay. Free lattes alone can save you $1200 every year. :-POverall, a great environment to work",
        "summary": "Do you Yahoo!?",
        "role": "Senior Business Systems Analyst",
        "date": "Mar 14, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "bad management - hire too much then fire. they also hire senior level management that doesn't have experience and definitely does not have experience in the area, so the team fails. over spending is also a huge issue - they have great parties but should have cut back. the overtime that some people did was crazy!!!!",
        "advice": "convert the good contractors and get rid of the employees that don't do anything",
        "pros": "it's just a fun place to work - i found my best friends at yahoo and loved going into work but i think the environment is a bit too relaxed for the competition and the market out there right now. At least your opinions were heard and you got a lot of freedom to build your own programs.",
        "summary": "fun place to work with great people but bad management",
        "role": "Media Delivery Coordinator",
        "date": "Mar 23, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "In general, there have been too many product lines with little integration effort to draw synergies. As a result, there could be a lack of focus in terms of market position to offer an attractive value proposition to end users. The future direction and vision are not clear in recent years, especially with the frequent change of upper management.",
        "advice": "Define the near and long term strategies to compete ASAP",
        "pros": "Managers are in general opened for opinions. Yahoo! has a strong culture for having fun at work and the management has a strong commitment to talents. Innovation is part of the culture as well. There are a lot of industry experts and early pioneers in the company.",
        "summary": "Innovative company with fun culture",
        "role": "Product Manager",
        "date": "Mar 26, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too many managers. People getting comfortable and not pushing their limits. Too many meetings. Too many emails",
        "advice": "There are too many manager. Give engineers your confidence and let them do their work, minus the unnecessary reports / meetings",
        "pros": "With some luck, it's possible to advance through the hierarchy of job positions in a company of this size",
        "summary": "Overall still a great place to work",
        "role": "Senior QA Engineer",
        "date": "Apr 25, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company is lack of direction overall. Heavy middle management and lack of responsibilities of individual and team. Innovation and hardworking doesn't get rewarded as they used to be",
        "advice": "focus",
        "pros": "Good for work and life balance. Flexible working hours and generally nice people. Good perk and benefit, informal and easy going environment",
        "summary": "time to change",
        "role": "Marketing Manager",
        "date": "May 4, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lot of Silos and not focused on one thing. There are projects which needs more structure and some of special interests needs to be managed properly. I think Yahoo needs more guidance for engineers and less management interference.",
        "advice": "Yahoo need to make sure some middle management people are very political in nature and need to get rid of those politics for engineer to strive",
        "pros": "Lot of Energetic people around and there are very smart people and top management is some what too thrifty about some real needs of company. One thing I hate is hardware selection of the company where only cost matters rather than total cost of ownership.",
        "summary": "Good luck Yahoo",
        "role": "Director Network Operations",
        "date": "May 9, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "It is still a young company that grew fast. There is a lot of disorganization and duplication of effort internally.",
        "advice": "Once you sort things out organizationally I think its important to foster more ownership in the management. Management is always moving around too much and too fast.",
        "pros": "It really is a great place to work despite all the flack Yahoo! gets. I truly enjoyed my time at Yahoo!",
        "summary": "A Great Experience",
        "role": "Anonymous Employee",
        "date": "May 29, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not very stable, too much reorg, company is not going the right direction, working too hard, not good stock price.",
        "advice": "There are too many managers, and so too many layers and less efficient. As a result, many first line managers' are not technically strong enough.",
        "pros": "It has fair compensation, I can work on interesting project. Good employee training system. More opportunity to play a role in project.",
        "summary": "Good place to work",
        "role": "Senior Software Engineer",
        "date": "May 29, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Upper Management is still acting as if Yahoo! is still a garage start-up; middle Management is more concerned with the political infighting than supporting the troops in the trenches. Politics getting in the way of Progress....",
        "advice": "Flatten the structure, get rid of the assorted VP's and Executive VP's. Decide on where the Company is going to be in five years and go for it. Quit reacting to Wall Street and listen to your User base.",
        "pros": "Good folks to work with, interesting problems to work on. You have a chance to make an enormous impact on a large number of people. Yahoo! defines the term 'Internet Scale'.",
        "summary": "Review Yahoo!",
        "role": "Technical Yahoo",
        "date": "Jun 7, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's a big company that is stuck with many acquisitions, and along with that, many different platforms for running the site. Everyone has their own way of doing things and usually they don't want to accept other ways. They need to standardize on one thing, not ten.",
        "advice": "Pay attention to your employees ideas and the market. I felt like the upper management did not pay attention to the very brilliant people working there or the direction of the market (besides what wall street thought).",
        "pros": "Yahoo is a great place to work. They understand work life balance. They treat employees as humans, not resources. Overall its definitely the best place I've ever worked at.",
        "summary": "Operations at Yahoo",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Morale is generally not great because of attrition and layoffs and Yahoo! is getting beaten up in the press- Management is always shuffling around and there are alot of political turf wars- Consensus driven (impossible to make a quick decision and move quickly). For a Product Manager this is especially frustrating and undermining.",
        "advice": "Focus on product excellence and delighting consumers. Depoliticize the management team.",
        "pros": "- You're surrounded of talented and creative and cool employees.- The work, despite the occasional distractions and annoyances, the work is still satisfying- You'll keep on top of the latest and greatest web and consumer internet design- Nice environment (if you're on the Sunnyvale Campus... not so great on the other campuses like Santa Clara)",
        "summary": "A good place to work if you can find the right position.",
        "role": "Senior Product Manager",
        "date": "Jun 17, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Poor leaderships, bad HR people and inexperience employees. These make it hard to request for service or to change direction. Too much complications and meetings.",
        "advice": "Streamline the process and focus back to Engineering. Let HR know that their role is to help employee to be successful.",
        "pros": "A lot of smart people whom are expert in their respective fields. Very collegiate, fun, and friendly atmosphere work environment.Opportunities to do research and tech advancement.",
        "summary": "Smart People, bad management and HR",
        "role": "Technical Yahoo!",
        "date": "Jul 26, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Some problems are well known: Yahoo! lacked a clear vision from upon high. There were intergroup rivalries; your world may have been reproduced by someone at some other location, and they would try to undercut you in favor of their own group. Planning was weak; many deadlines were missed, largely because people had not properly calculated the resources that were needed. The last year I was there, my group realized th… ey had not planned adequately in the past, and overcompensated by insisting on a rather bureaucratic process which killed off much of our group's innovation.I don't think this was a widespread problem in Yahoo!, but in my specific situation I dealt with a couple managers who came off as particularly manipulative. I didn't form friendships of the sort I had at other employers; there was a bit of a revolving door.",
        "advice": "it's a hard to know what to do with it. Handing search and search advertizing to Microsoft may have been a huge mistake, but time will tell.",
        "pros": "Frankly, I took a lot of pride at the opportunity to work on technology that got used by so many people. I learned an awful lot about what it takes to keep a web site reliable. At its best, it encouraged the creativity of its engineers and designers. They were very concerned about the feedback they got from customers; I felt I really knew what the public thought of our technology and what we needed to do to improve i… t. The competence level of engineers and designers was high. A couple years back, it felt as if what we did was really going to change the world.Yahoo! had a constant flow of fun events and interesting presentations by knowledgible speakers. They treated us well. The facilities - with the fitness centers and cafeterias - were great. I got the opportunity to travel overseas a couple times, which broadened my view of the world.",
        "summary": "Fun place to work that lost its buzz",
        "role": "Senior Software Engineer",
        "date": "Aug 4, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Jerry and Sue were the wrong people to lead the company. That's fixed now, and friends there seem much more optimistic.Decision making was awful. Generally unclear who made the decision, and thus 4 people tried to make it and nobody followed anything.Matrix organization gave too much power to Product Mgmt. Engineering had no budget, but had to \"work with\" (read beg) product for any headcount needed. Hard to g… et people staffed on maintenance and code cleanup/repair (technical debt) projects.",
        "advice": "Be better than the old management. Make quick decisions and make them stick. Balance the responsibility between Eng and PM.",
        "pros": "One of the centers of the internet world Was THE center in 1998.Lots of groups to work in, pretty good freedom to move aroundGood growth opportunity in Engineering",
        "summary": "Management was bad in 2008, curious to see how it performs now",
        "role": "Vice President",
        "date": "Aug 31, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "1. unstable org/ too much restructuring/ layoffs2. lacks strategy for financial growth/ dealing with competition",
        "advice": "Come out with a strategy to achieve financial growth",
        "pros": "1.cutting-edge work/ professional growth2.work life balance",
        "summary": "Good place to be but uncertain future",
        "role": "Anonymous Employee",
        "date": "Sep 3, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Yahoo! is often spoken of in the shadow of Google - even though Yahoo! is a prime Internet portal. Also, management is not always transparent, for e.g., with the recent Microsoft-yahoo deal.",
        "advice": "Talk to your soldiers: i.e., the engineers before making big-time mergers/deals. It is insufficient to simply loop in upper management.",
        "pros": "Well know brand, strong impact on mainstream media. Extremely smart engineering team, and very ethnically diverse. Higher than average compensation.",
        "summary": "Personal opinion of Yahoo!",
        "role": "Senior Software Engineer",
        "date": "Sep 7, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "things have been so muddled for so long that it will take 2-3 years to cut away the fat to get to where yahoo needs to be in terms of systems, operations, product development, and processes",
        "advice": "get a focus and exexute",
        "pros": "great place to work, especially if you have kids, they recognize that you have a life outside of yahoo",
        "summary": "great place to work but...",
        "role": "Ad Operations Manager",
        "date": "Sep 17, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There are many layers of management and different properties (mail, front page, news, search, etc.) don't necessarily work with each other. If you join one property you'll effectively be working for that silo-ed division of the company. Change comes slowly and only after layers of management have reviewed the change.",
        "advice": "Create incentives for different parts of the company (different properties) to work with each other.",
        "pros": "Yahoo has a very open culture. The benefits are great and compensation is very good. There are very smart people and a collaborative, competitive culture. Food is subsidized and coffee is free. The campus is fun; and they encourage employees to have a good work/life balance.",
        "summary": "Great place to work for designers",
        "role": "Senior Interaction Designer",
        "date": "Sep 29, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of innovation, lack of transparency, lack of focus, plenty of slackers, engineers have little significance in decision making, and layers of middle management.",
        "advice": "Cut the fat. Pressure managers to deliver more. Focus on improving core properties in innovative ways. Keep improving user's experience in any way possible.",
        "pros": "Huge impact, great people to work with, fun culture, great compensation & benefits package, free coffee, good work-life balance, and lots of opportunities to learn.",
        "summary": "Increasingly becoming a sales and marketing shop",
        "role": "Senior Software Engineer",
        "date": "Oct 11, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "This is a great place to work but I am sure everyone is aware of all the problems Yahoo has been having recently so chances of going through a layoff is higher at Yahoo compared to competitors.",
        "advice": "I have no advice for the management at this moment but I have to fill this space so all I'll say is keep your focus on what you've been focusing on. It is better to focus on the wrong target than to have no focus at all.",
        "pros": "Yahoo is a good place to work if you can channel out all the negative stuff surrounding the company and just focus on your work, enjoy the great benefits and the really relaxed and laid back working environment.",
        "summary": "A Yahoo",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- incredibly bureaucratic. getting access to databases, systems and processes takes forever- the organization structure is a mess. people have indirect reports left and right. positions are vague. you never quite know what someone is doing within the organization.",
        "advice": "Streamline processes within the company. Flatten the organization. Also, change the marketing tactics. Instead of pure brand messaging on prime-time, also have product-specific ads with common themes. Different products have different audiences...",
        "pros": "- people understand how to balance work and life. they work hard but also leave at 5pm to be with their families- great people. after the recent lay-offs, those left behind appear to be very intelligent and hard-working, as well as great to work with- it's still a great company with an incredible brand and products that touch millions of people",
        "summary": "People take their jobs seriously but still have a life",
        "role": "Anonymous Employee",
        "date": "Oct 20, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There is no clear vision from corporate executives.Company is running like a start-up company but lack of start-up's efficiency.Too many management levels and non-productive employees.",
        "advice": "Clear vision for the company is badly needed.Prioritize projects inside the company; cut low priority projects, and invest on key projects/products.Improve management efficiency.",
        "pros": "Compensation is fair. Flexible working hours. Plenty of opportunity to learn, either through various projects or training. Work and life balance in general is good.",
        "summary": "No Vision. Organization is a mess",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2009",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Indecisive management, amateur politics, cylos, engineers are supreme; management doesn't understand/value other professions besides engineering.",
        "advice": "Yahoo doesn't have a uniform culture. My advise to any interviewee is to assess each group you interview with rather than making a decision based on your impression of Yahoo as a whole.",
        "pros": "Energetic, passionate peopleLatest technologies to work with",
        "summary": "Should you work for Yahoo?",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Depending on your manager and group, you may or may not like it and feel like you are on your own. Some people are used to being told what to do at all times, some dont.",
        "advice": "I do not have any input with regards to management as I had to work for many managers at the time.",
        "pros": "Cutting edge technology, good environment, nice people, good perks, life/work balance, food, shuttle, bonuses, good reputation and good thing to put in your resume.",
        "summary": "Good engineering",
        "role": "Software Engineer",
        "date": "Dec 4, 2009",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Getting rid of the search team, I'm not so sure about. Yahoo wants to become a smaller company. Will their technical leadership stick around?",
        "advice": "I don't know what Yahoo leadership is doing. Selling off search may be a smart business decision on it's own, but do they realize that all the talent (search team or not) is leaving with them?",
        "pros": "Yahoo is (was) a great company. The work environment is good, the people are smart, and there's opportunity for high impact. Also, you get good perks, benefits, and a competitive salary.",
        "summary": "Yahoo.... was great, questionable future.",
        "role": "Senior Software Engineer",
        "date": "Jan 22, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Constant rumors of layoffs- Not bringing innovative products to market- Feeling of stagnation- Exec shuffles never end",
        "advice": "- Stop the incessant re-orgs- Hire senior management in the location were the team actually resides- Start innovating",
        "pros": "- Flexible hours if need be. You can really manage your own schedule and people do respect it, or stay quiet about.- Cross-functional teams are mostly beneficial to everyone involved.",
        "summary": "Been with Yahoo! with more than 3 years and will plan on staying there for a while (if i end up surviving post MSFT)",
        "role": "Marketing Manager",
        "date": "Jan 23, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "being compared to google.i just want to say. if you want to be a real code monkey, working in inane problems that no one else sees. work for google.",
        "advice": "be more transparent about management and strategy decisions. we trust you, but we want to know where this is headed.",
        "pros": "y! is different. its a content company. it started as one, and always, in its heart, it will be about serving interesting and useful content.as a developer, its an interesting place to be. you are on the front-lines, you see the business and processes, and you deal with the best and proven web technologies out there.you learn a lot, the pay is competitive, and the work-life balance is great.th… e best thing about yahoo is that you work at a company that caters to the masses: i went into the company being a hardcore code monkey, and came out with an appreciation for the common internet surfer. really opened my eyes to the opportunities of enabling others to use the web.",
        "summary": "great place - for engineers with a soul",
        "role": "Software Engineer",
        "date": "Feb 5, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Innovation not happening everywhereSome managers are not good",
        "advice": "Hire better managers, let go the othersDecisions should be made fasterMost people have no idea where Yahoo! is going and they don't seem to care",
        "pros": "Most people love Yahoo!Pretty good salary",
        "summary": "Great company",
        "role": "Senior Software Engineer",
        "date": "Feb 6, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Low morale in search and advertising groups- Sometimes senior management lacks in providing direction- Too many reorgs",
        "advice": "- Yahoo can still get its glory back, but please set up the environment which is conduicive. Too many reorgs cause a lot of confusion between engineers and PMs working on projects.- Encourage the culture to take risks. We seem to have lost it over last couple of years.",
        "pros": "- Good salary- Good perks- Friendly and intelligent coworkers- Very open, executives very approachable and ready to listen",
        "summary": "Great place to work, Good perks, Sometimes lacking direction",
        "role": "Software Engineer",
        "date": "Feb 28, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management seems impotent to capitalize on Yahoo's talent. Constant reorgs keep you from being unable to get anything done. Ineffectual upper management tends to trickle down to lower management.",
        "advice": "Stop with all the reorgs and stick with one strategy and see it through to completion. Panama was a failure, APT has been a failure, and now just as the search technology is getting really good, we undermine ourselves with the Bing deal.",
        "pros": "Great benefits. The shuttle saves me a ton of cash. You'll be hard pressed to find more subject area experts in the spaces that Yahoo competes in.",
        "summary": "Great environment, great perks and benefits, bad execution of strategy.",
        "role": "Search Quality Analyst",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Constant management turmoil which has probably abated somewhat now the Carol Bartz appears to be firmly in command. Stock just won't move so don't expect those options to be worth much for a while.",
        "advice": "Goaling was often done after the quarter had already started which allowed Yahoo to keep people from making too much money in case you did hit a home run.",
        "pros": "Biggest player in the display space which gains you lots of access. Usually the biggest share of anybody's budget in the portal space. REALLY big dollars, no scrounging for pennies here. Lot's of new technologies to present.",
        "summary": "Yahoo Sales Executive",
        "role": "Account Director",
        "date": "Mar 3, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Obviously, Yahoo is having a tough time increasing it's revenue. While other Internet companies are growing, Yahoo is struggling to grow. It's revenue is heavily dependent on display advertising which was hit hard ever since the economy began a recession around 2008. The hostile takeover attempt by Microsoft also created divisions within the company and many talented employees left as a result .Prior to 2008,…  I became frustrated that Yahoo wasn't aggressive in seeking new growth opportunities. (In particular, I always wondered where was Yahoo's version of AdSense. It exists today, but is not competitive.) I wanted Yahoo to kick ass. I wanted to be part of a winning team. But in the end, I felt like I was playing for a 2nd or 3rd place team. In Silicon Valley, if you're a decent software engineer it's not difficult to find a new job. Thus I decided to move on from Yahoo.",
        "advice": "Aggressively seek out new markets. Expand and don't focus on contracting (layoffs). Growth is the way to succeed. Rely less on advertising as a source of revenue. Maybe acquire some of the cool web hosting companies like Weebly, Square Space, etc. Or look into cloud computing as a new business. Just make sure that paid services surpasses advertising as the main source of revenue.",
        "pros": "My overall experience at Yahoo was positive. The company treats employees well by giving them competitive salaries, decent benefits, some nice perks like a gym, and a fun year end party. People at Yahoo are friendly, open minded, and willing to help each other.As software engineer, I learned some good programming practices related to code modularity, scalability, and maintainability. The scale at which Yahoo … operates is very large (still one of the biggest websites in the world) and that means there are cool problems to solve (i.e. what is a good data store for holding 500 million user accounts? Make it fast, reliable, and secure). There are also regular tech talks, which can be stimulating.",
        "summary": "Nice place to work, but I wanted the company to be more successful.",
        "role": "Software Engineer",
        "date": "Mar 22, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Upper management seems weak. They don't interact directly with us pawns, and they don't set much of an example. The company mission statement, \"Yahoo! powers and delights our communities of users, advertisers, and publishers – all of us united in creating indispensable experiences, and fueled by trust.', is exemplary of the problem.",
        "advice": "Quit.",
        "pros": "Friendly people, low-stress environment, huge scale systems that reach a lot of users, and many brilliant coworkers.",
        "summary": "Great place to work, could use more technical rock stars",
        "role": "Senior Software Engineer",
        "date": "Apr 13, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Command-and-control management- Exodus of key personnel- 2-paragraph mission statement- Severe burnout: Need to hire more producers",
        "advice": "Let people innovate. Reward experimentation. Stop doing the same things over and over and expecting a better/different outcome. Stop trying to be other companies. Leverage your brand better.",
        "pros": "- 500 million users- Brand recognition- Opportunities to do different things- A big player in the Internet world- In the heart of Silicon Valley",
        "summary": "Magnficient Burnout",
        "role": "Content Producer",
        "date": "Apr 24, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Senior management always changing, and does not seem to know where they are headed.",
        "advice": "Needs to stick to a plan.",
        "pros": "Treats employees really well.Money and benefits are really good.Learn from one of the most trafficked sites in the world.",
        "summary": "Great place to work if you are starting to build a career.",
        "role": "Senior Manager",
        "date": "Apr 29, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Fairly large org so it can be hard to feel like you've made a meaningful difference to the bottom line.",
        "advice": "Yahoo should continue to cut non-core businesses and focus on doing fewer things great!Improve your mobile content and advertising products along with your local information services.",
        "pros": "Ability to reach millions of users.High quality peers and personal networking.Fun, creative environment.Decent work and life balance.",
        "summary": "Big reach, a bit slow",
        "role": "Product Manager",
        "date": "May 4, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Low share value, as good as peanuts. A mix of media and technology, so to say not totally technology company.",
        "advice": "Provide more incentives to the employees. Regular incentives and surprise incentives go a long way in getting good results from the employees.",
        "pros": "Good environment, good people, good facilities, good pay, flexilibility, Variety of technical groups and good scope of growh too is there.",
        "summary": "general overview of yahoo",
        "role": "Software Engineer",
        "date": "May 17, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "long hoursself-imposed deadlinesmediocre medical benefitsparties to celebrate every release (got tiring)",
        "advice": "Pay heed to the joke about the big search companies: Google is run by engineers, Microsoft is run by lawyers, and Yahoo! is run by Hollywood types. Too true and likely to be Yahoo's ruin in the long run. Sorry Jerry & Filo....it was a good run.while it lasted.",
        "pros": "100 smartest people on the internet back then were the first 100 yahoosopen communication from upper managementparties to celebrate every releasevideo game centerEntertainment People (company band!)",
        "summary": "Early days were great - dunno about now (worked there 1996/7)",
        "role": "Technical Yahoo",
        "date": "Jun 18, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Some teams are territorial and do not like to cooperate for the bigger picture. Sometimes work creeps into your entire life, taking phone calls, checking/responding to emails all times of the day and night",
        "advice": "Try to stay ahead of the curve. There are times when it seems that Yahoo is trying to catch up or dropped the ball on key projects",
        "pros": "Interesting projects, get to work with great teams and individuals, scale and breath of your projects enable you to touch almost 1 out 10 people in the world.",
        "summary": "A program manager POV",
        "role": "Program Manager",
        "date": "Jun 29, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "there can be many long hours of extra time to met project deadlinescompany still has not yet found its way",
        "advice": "Yahoo is a great company to work for but still has not yet found its way. There's stil a ton of talent at the company but we need stronger management and direction to really succeed",
        "pros": "great work environmentwork with very talented and fun peopleget to work with new cutting edge technologiescompensation is very competitive",
        "summary": "Great environment to learn and grow professionally",
        "role": "Senior QA Engineer",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- development resources were always the bottleneck.- felt like we never shipped new products- didn't always have a clear picture of priorities",
        "advice": "spend more time with your team. you need to learn about each member and figure out their strengths and weaknesses",
        "pros": "- people are great to work with- learned a lot from my colleagues- fun environment - interesting content",
        "summary": "Was great place to work - years ago",
        "role": "Senior Visual Designer",
        "date": "Jul 23, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The work was not particularly interesting. Most of it was maintenance coding.",
        "advice": "None",
        "pros": "Yahoo was a very good place to work. It provided a very good work/life balance, and the people were very smart and nice; no real egos to deal with. The facilities were great, and the food was pretty good.",
        "summary": "Work at Yahoo",
        "role": "Anonymous Employee",
        "date": "Jul 30, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Low BonusAverage SalariesLack of strategic focus",
        "advice": "Streamline operationsFocus on a few priorities - do not try to be jack of all trades",
        "pros": "Excellent CultureGreat LearningGood work life balanceGood On site facilities",
        "summary": "Excellent workplace",
        "role": "Senior Manager",
        "date": "Aug 6, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Too much of the maintenance-oriented- Ideas don't go quickly, which leads to not much of engineering innovation",
        "advice": "Move quickly and don't make it to be maintenance company. Get the engineers to get cool ideas for every release!",
        "pros": "- There are still a lot of areas that could be improved, a place to make difference!- Flexible work time- A lot of smart people, friendly, and helpful- Perks are extra credits",
        "summary": "A lot of opportunity for growth and make difference!",
        "role": "Software Engineer",
        "date": "Aug 8, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The direction of the company has not been clear. Several leadership groups came and went while I was with the company, and all sounded roughly the same, though all claimed to have a much clearer vision. Carol as an individual has made a impact on the organization, but it's not clear that she can turn it all around. There is a culture of playing-it-safe that needs to be uprooted.",
        "advice": "Keep trimming, keep investing in the things that the company is successful at and where there is growth to be had. Don't be afraid to admit a bad bet and cut your losses.",
        "pros": "Great benefits package, fun atmosphere (even if it feels a bit forced at times), flexible management, relatively open for a company its size - there's plenty of opportunities to suggest ideas to upper management and to be recognized.",
        "summary": "Sputtering, but still a great place to work",
        "role": "Software Engineer",
        "date": "Aug 26, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Yahoo has missed on several key industry changes and it is losing relevance with consumers and advertisers so employees are scrambling. Senior management needs an overhaul.",
        "advice": "Reset financial goals and focus on the consumer again. Collaboration is great, but decision making is way too complicated and slow. Streamline and focus!",
        "pros": "Yahoo is a good company to work for. Pay and benefits are good, employees are smart and there are lots of passionate people eager to contribute.",
        "summary": "Great Company/Questionable Future",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "organization structures that initiate projects and product development.",
        "advice": "Need to clarify the product directions",
        "pros": "flexible time, interesting projects, good benefits, gym facility, etc",
        "summary": "Research",
        "role": "Research Scientist",
        "date": "Sep 13, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Outsiders think that Yahoo has missed on several opportunities and is having a hard time to keep eyeballs on several properties. Senior management changes have been going on for a while, with several reorgs.",
        "advice": "Listen more to lower-level employees (engineers, implementers) and solicit their feedback. Identify which projects are 'pet projects' and which are useful.",
        "pros": "Very good company to work for. Employees are above average and you will find good people who work hard and contribute. Pay and benefits are good too.",
        "summary": "One of the best",
        "role": "Senior Software Engineer",
        "date": "Sep 13, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Long commute for meSometimes difficult to move up in the same org.",
        "advice": "Keep the company focused on our core principles and values.",
        "pros": "Medical BenefitsTime off policyFree coffee and soda!Regular employee recognition events",
        "summary": "Excellent place to work!",
        "role": "Lead Support Engineer",
        "date": "Sep 15, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lots of flux in senior engineering and upper management, since there are lots of suitors for experienced folk. The new leadership seems promising in vision, but we have to wait for the outcome of its execution.",
        "advice": "The new leadership is setting the vision for the next few years, and things are looking good.",
        "pros": "Lots of interesting projects to work on. Lots of smart people to work with. Lots of in-house libraries to learn from. One of the few places in the world to learn how to build a web-scale platform.",
        "summary": "Great place to work on web-scale technologies.",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Sometimes a passive aggressive culture. People could be a little more proactive in either agreeing or disagreeing to do something. Atleast then once you know people agree, you have faith they will follow through.",
        "advice": "better alignment to actually achieve a goal. Stick with the same org until you acheive the goal. Too much disruption can cause the company to keep spinning.",
        "pros": "Great place to work, embraces diversity, open culture, very cognizant of work/family life balance, truly flexible, work hard & play hard is the motto. High end technology & a fun place to be.",
        "summary": "Yahoo Culture",
        "role": "Senior Director",
        "date": "Oct 1, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Keep faith in new projects, adaptaion",
        "advice": "Keep Improving",
        "pros": "Superb HR, Employees Care, Strong culture",
        "summary": "Lots of Opportunites",
        "role": "Service Engineer",
        "date": "Oct 9, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The few leads that would come in went managers \"friends\", no plan on how to grow book of business, no direction from mamagement when asked for help re: prospecting, customer questions, product changes, product issues, etc.",
        "advice": "None...Yahoo sold HotJobs to Monster",
        "pros": "Office location, awesome work environment, work hard, play hard mentality, Yahoo's benefits, fun co-workers all around the same age, company happy hours/outings/sporting events, great random office bonuses",
        "summary": "San Francisco HotJobs",
        "role": "Account Executive",
        "date": "Oct 14, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Big company equals over process sometimes. Takes a long time to get anything done. Diverse people work at different pace so fast pace people may get frustrated with others.",
        "advice": "Work on innovation more than anything else. Innovation helps the company grow and \"reinvent\" itself. Stick with the same thing day in and day out and eventually, the company becomes a dinosaur.",
        "pros": "Balance between work and personal life. Big company with lots of bright people. Fun events and perks makes working here fun.",
        "summary": "Truly a big company environment",
        "role": "Anonymous Employee",
        "date": "Oct 16, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Seems the senior management has forgotten what an internet company should do. They need to be more innovative, or at least maintain a department that innovates. Regardless of whether Yahoo becomes a media company or what, it needs to truly encourage the thinkers here to really think way out of the box. We did have some outstanding engineers here, but with Search gone, there is really no cutting edge technology that c… an differentiate Yahoo from another web portal. In the Valley, once you stop innovating, you stop the growth needed to stay a power on the Web and you stop attracting the people that will make a difference for the future.",
        "advice": "Stop the brain drain, if at all possible. If you're going to buy a property, don't let it die after purchasing it. it's a waste of lots of money and talent. Plus, it is demoralizing to the people that are still here. We need inspiration from Senior management.",
        "pros": "People here are very intelligent. I've met some amazing individuals that truly inspire the people around them. Access to job related training is good. Work environment is good. And the all you can drink coffee bar is outstanding!!",
        "summary": "Yahoo, not as bad as you might think",
        "role": "Anonymous Employee",
        "date": "Oct 19, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Transparency- Need to be more agile",
        "advice": "- People need to be held accountable- Need more transparency in feeback and review",
        "pros": "- Chance to work with really talented and highly motivated people- Technology stack is good- Problems faced are challenging",
        "summary": "Can be more agile",
        "role": "Anonymous Employee",
        "date": "Oct 23, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "At Yahoo, there were too many reorganizations to caused lots of distractions instead a focus on the projects. A Microsoft buyout was not healthy for the organization",
        "advice": "Focus more on the internal workings of the company and less on the stock price and then the products will end up speaking for themselves.",
        "pros": "Overall, I worked with some great product teams at Yahoo. Great product managers and technical leads made for some very satisfying job experience.",
        "summary": "Senior Interaction Designer",
        "role": "Senior Interaction Designer",
        "date": "Oct 24, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "No advancement opportunities and job satisfaction.",
        "advice": "Higher pay to employees.",
        "pros": "Fun and place to work",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Need to establish it's own identity- Not understanding it's core strength- Getting confused amidst various competing products",
        "advice": "- Understand your strength and reason why users come to Yahoo! every day- Provide the best user experience in the world",
        "pros": "- Respect for employees- Freedom to champion your ideas- Community environment- Balance between work and personal life",
        "summary": "Yahoo! is still great place to work",
        "role": "Director of Engineering",
        "date": "Nov 2, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Big company structure so things are slow. The organizational structure is clearly not optimal although changing quiet a lot lately (hopefully for the better).The company has some difficulties right now but has some good opportunities as well.",
        "advice": "Clarify the Org so decisions can be made instead of fostering consensus all the time. A strong leadership makes decisions, and executes.",
        "pros": "Company culture is very open, friendly, respectful of others. Work life balance is great.The scale of projects and audience is huge and therefore interesting. You will find that at very few companies.Easy to move internally to another job. supportive environmentIt is still on of the very top web company in the world.",
        "summary": "Yahoo is a great company that has to go through some tough time to rise again",
        "role": "Senior Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Difficult to get recognized. Lots of processes tend to slow the progress of a task or improvement.Overall not bad.",
        "advice": "Management may look towards streamlining the processes in place for project implementation. give yahoo employees better benefits in terms of health,transportation.",
        "pros": "nice work culture,friendly,many things to learn",
        "summary": "nice working experience",
        "role": "Quality Analyst",
        "date": "Nov 15, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The lack of company vision or even hope of market success is depressing. When I tell friends in the industry that I work for Yahoo, they offer their condolences.",
        "advice": "Figure out what you want to be when you grow up, before you lose all of your mojo.",
        "pros": "There are some smart, talented folks working for Yahoo.Compared to other tech companies, the work environment is pretty tame, and supportive of work/life balance.",
        "summary": "Great environment gone bad",
        "role": "Recruiter",
        "date": "Nov 19, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Growth, job stagnation, unpredibility, lower salaries,",
        "advice": "Great company",
        "pros": "Great culture and technological leader",
        "summary": "Yahoo",
        "role": "Product Manager",
        "date": "Nov 22, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Huge company. Hard to stand out. Stick options are almost worthless right now.",
        "advice": "Management needs to care about the little people and not just the big picture.",
        "pros": "Great company culture. Young, fun and great food. The campus in Mountainview is amazing.",
        "summary": "Great company! Awesome culture. Poor management.",
        "role": "Key Account Executive",
        "date": "Nov 22, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "lack of innovation compared to competitionpeople are smart, but smartest are leavingpoor reputation in silicon valleybureaucracy of large company",
        "advice": "take risk -- real risk. don't just innovate on display ads...go into mobile, operating systems, cloud computing, etc like google has. learn to innovate in a new way! hire the next mark zuckerberg as head of product. buy some amazing startups and change the game.",
        "pros": "nice, friendly coworkers and managementgood pay, benefits, and work life balanceimpact on a big audiencecan lead to big opportunities outside of Y!",
        "summary": "Good place to work with good people",
        "role": "Senior Business Development Manager",
        "date": "Nov 26, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "strategy needs work. Too many conflicting agendas",
        "advice": "Figure out who you want to be and make it work",
        "pros": "benefits are good. people are good.",
        "summary": "Up and down",
        "role": "Anonymous Employee",
        "date": "Dec 15, 2010",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Poor planningmixed messaginglayoffs not being performance driven",
        "advice": null,
        "pros": "Working with Talented peopleFun Environment",
        "summary": "Good but not Great",
        "role": "Sourcer",
        "date": "Dec 20, 2010",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Being laid off is a constant threat, but more-so than other companies, it seems. Teams are fragmented, so lots of duplication of efforts. Also, skills get stale, since there are teams that handle each technology.",
        "advice": null,
        "pros": "Everyone knows Yahoo!, so it's great to see people's eyes light up when I tell them who I work for. The offer was great -- not just the $$, but also being able to help millions of people...",
        "summary": "Morale goes with the market.",
        "role": "Anonymous Employee",
        "date": "Jan 11, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Management is making a move towards being a media company. Even though its the only chance for Yahoo to survive, for engineers its a little disheartening.The worldly view of Yahoo sucks and Yahoo is not able to change it.",
        "advice": "Its a hard puzzle to solve. Everybody talks about how Yahoo is going down but nobody seems to have a clue if given a chance or nobody wants to give Yahoo a chance. So screw those people and move on with the current strategy. This is the last chance and hopefully it will work",
        "pros": "Inspiring smart people aroundGood recognition if you work hard",
        "summary": "Management is trying to do its best but its too hard to get back the old glory",
        "role": "Senior Software Engineer",
        "date": "Mar 13, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The downfall. Why work at Yahoo when you get better recognition at Microsoft, Google, Facebook, etc.? Incompetent leadership.",
        "advice": "Get a plan. Better hiring. Better benefits. Better location. Less bureaucracy. Better hires. Make it more fun and a great place to work again.",
        "pros": "Not sure how great it still is to work at Yahoo, but in the past it was a fun place to work in the Valley.",
        "summary": "Great",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "When working at a low-level on the totem pole, there are about 9-10 levels of hierarchy between you and the CEO, meaning there are lots of levels of management things filter down. The crazy thing about this is that due to frequent reorganizations, there's not much point in getting to know management more than a few levels above your position.",
        "advice": "I think the occasional status report from management a few levels above to those below as to how well things are/are not going would help employees have a better feel for their value in the organization as a whole, and where they're going.",
        "pros": "Lots of options to move around and do different things, at least if you're willing to move to a bigger office.Very much a team-based environment.You are not coddled.Good food provided at parties ;)Nicest severance package I've had when laid off :p",
        "summary": "Lots of challenging stuff to work on, but stressful during periods of layoffs",
        "role": "Software QA Engineer",
        "date": "Apr 5, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Stock options suckLeadership fails to grow the company",
        "advice": "Set targets for yourselves for the following two, announce your targets to employees, let all compare your targets to your achievements at the end of quarter/year. Don't play with words please. Search market share Revenue growth",
        "pros": "Low bureaucracySmart team of engineers - one always learns new technology and new ideasFair compensation - comparable to the marketGood health and vacation benefitsStartup culture not going away yet",
        "summary": "Good work-culture, smart teams of engineers, fair compensation, poor business growth",
        "role": "Principal Software Engineer",
        "date": "Apr 6, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Teams performance can be lagging depending on the leaders lack of drive. Still have people who are parked than who wants to go somewhere.",
        "advice": null,
        "pros": "Challanging environement with a lot of exiting people to work with. Industry leading company and latest technology to work in.",
        "summary": "Fantastik!",
        "role": "Anonymous Employee",
        "date": "Apr 8, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you are not in one of the core business groups (e.g. Buzz, HotJobs), the company is not as fun a place to work, due to fewer resources and doubts about longevity. It's never fun to be a low priority, and you feel it. Also there is a big disconnect between views of Yahoo! on the inside (\"We are gaining momentum, on track to win\") and what you see in the media (\"The Internet giant is failing.\") The steady exodus of … really solid talent is also troubling.",
        "advice": null,
        "pros": "The company culture is pleasant, and the on-campus perks (free espresso bars, special events and presentations) add good variety and make you feel valued. Compensation is very good relative to similar jobs in other companies. If you are in one of the core business groups (e.g. mail, mobile, front page) it's more exciting because you can have confidence in your unit's worth.",
        "summary": "I loved my job and felt lucky to have it, but doubts linger about the company overall.",
        "role": "Anonymous Employee",
        "date": "Apr 14, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "a little unorganized, and a little too laid back not a lot of structure so if you need structure you may have a hard time",
        "advice": null,
        "pros": "great management never micro managedtrust",
        "summary": "Fun",
        "role": "Human Resource",
        "date": "May 9, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Company was very disorganized from a structural perspective. It seemed many parts were disjointed. Spent a lot of time just trying to figure out how things fit together instead of doing actual productive work. The work given was not very interesting.",
        "advice": null,
        "pros": "Smart group of people and a relaxed working environment. The lunch there is subsidized and generally the atmosphere is friendly.",
        "summary": "Great company, some groups are better than others",
        "role": "Anonymous Employee",
        "date": "May 10, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Future is tenable. Morale isn't exactly the highest and the work hours can be a little long for certain groups.",
        "advice": "Yahoo is still very much a valuable web property - make sure everyone knows that.",
        "pros": "Interesting projects. Great people and great perks. Lots of opportunities for information sharing and a wealth of resources. The commute is one of the best if you're coming from the East Bay.",
        "summary": "Interesting",
        "role": "Senior Software Engineer",
        "date": "May 11, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you intern not on the main headquarter, you miss out on many intern events.",
        "advice": null,
        "pros": "It's a great, casual environment. Able to work in projects and collaborate with others.",
        "summary": "A great environment to learn and grow.",
        "role": "Intern",
        "date": "May 18, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Same as any other place: Sometimes the ass-kissers tend to get more noticed. But that's mostly for the egotistical or shallow managers (which are rare). The lot is pretty fantastic. Can't say anything bad about Yahoo!",
        "advice": "Be clear, be sure to promote on merit and train manager to be really good motivators so that people stay and continue working with Yahoo!",
        "pros": "Fun, big, international, lots of room for growth or movement (if you're savvy), and really smart people.",
        "summary": "Fun is actually one of the company values. It's a great place to work. Depends on the team, but usually people are great",
        "role": "Marketing Manager",
        "date": "Jun 2, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of focus on business and core competencies",
        "advice": "Business focus",
        "pros": "Very talented people and felt like you were part of a community.",
        "summary": "Loved the people",
        "role": "Director Human Resources",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "senior management appears risk adverse. Difficult to steer a larger company quickly.",
        "advice": "If Yahoo is to remain a growth company new businesses will need to be aquired or cultivated from within. When growing from within think long term and don't grow a group 300% and expect it to produce game changing revenue immediately.",
        "pros": "Good people and smart people",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Jun 9, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Always #2. The company has to figure out organization for upper level mgmnt.",
        "advice": null,
        "pros": "The people and Y! environment were great. They made sure you were trained and updated on any changes within the company.",
        "summary": "Great Place but lacks career growth",
        "role": "Account Manager",
        "date": "Jun 13, 2011",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "top management don't have future goal.",
        "advice": "focus on products",
        "pros": "nice people, and working environment.",
        "summary": "work flexable",
        "role": "Technical Yahoo",
        "date": "Jun 29, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Very large company - things move slowly.Orgs suffer from either total lack of process, or are smothered in process.",
        "advice": null,
        "pros": "Smart people, great depth in their fieldGood work/life balancePotential for work having far reaching impact",
        "summary": "One of the best places I've worked",
        "role": "Anonymous Employee",
        "date": "Jul 6, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Budgeting constraints get tighter each year and lead to some compensation levels to be below fair market value and affect overall morale. Some members of leadership team who make the money decisions don't have a clear picture of what they are pulling money from.",
        "advice": "Transparency on how you want the business to be run and what progress is or isn't being made within the company is key. People can't do their best work when they can't trust in their employer.",
        "pros": "Unique culture that promotes both playing and working hard. Employee perks are fairly generous. Yahoo provides employees with resources to aide in professional development and growth. Yahoo is one of the leading digital media companies and is recognizable everywhere.",
        "summary": "The culture and people in my group cannot be beat.",
        "role": "Anonymous Employee",
        "date": "Jul 12, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "uncertain directions, no good sign of turn around, lose many smart people.",
        "advice": null,
        "pros": "nice life/work balance.smart people, many resources, can learn a lot.",
        "summary": "good place to work",
        "role": "Senior Technical Yahoo",
        "date": "Jul 28, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No direction to the company",
        "advice": null,
        "pros": "Perks, People, Growth, Job Functionality. Work life balance",
        "summary": "Amazing experience",
        "role": "Operations Engineer",
        "date": "Aug 3, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not being able to monetize the amt of traffic better.The recent wave of people jumping ship makes for a bit of a moral killer.",
        "advice": "Get the word out about Yahoo, truly how good we are as a whole, not just the parts that are valuable in Wallstreet's eyes. Only when the heavy negativity stop will the talent drain slow down.",
        "pros": "FlexibilityMobility to move within companyStrong company with much traffic still driven to front pagestill on cutting edge of technology",
        "summary": "The people are great, the company is still a strong brand and very recognized which still gives it a cool factor to work",
        "role": "Business Analyst",
        "date": "Aug 15, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not trying to risk, take bold actions. suffers from loosing top talent!",
        "advice": "No strong leadership with vision & execution. Especially lacks execution.",
        "pros": "Very good place to work. People are friendly, flexible work place - allows creativity.",
        "summary": "Its a great place to work however lacks leadership support for vision & execution.",
        "role": "Principal Engineer",
        "date": "Aug 26, 2011",
        "is_current": true
    }
]