[
    {
        "rating": 5,
        "cons": "If you don't deliver, you will not be rewarded. Fairly standard yet people seem to have a big problem with it.",
        "advice": "Keep promoting people with proven track records, keep the positive vibes going!",
        "pros": "Supportive management, focus on career advancement from day 1, pay high performers very well, positive proactive environment. I left Yelp because I wasn't built for sales but never once had a problem with the work environment, they work hard and they do honest work.",
        "summary": "I don't care what you say, Yelp was great to me",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Very competitive and low retention",
        "advice": null,
        "pros": "Transparency and laid back environment",
        "summary": "Great company with lots of perks!",
        "role": "National Account Executive",
        "date": "Sep 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Low payFew opportunities for advancement",
        "advice": null,
        "pros": "Plenty of trainingSupportive mentorsPositive reinforcementRecognition for achievements",
        "summary": "Great training and opportunities",
        "role": "Anonymous Employee",
        "date": "Sep 14, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "very very little compensation for level of work",
        "advice": "build faster",
        "pros": "good training and growth opportunities",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Sep 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "This is a hard job and it is easy to give up. If sales you don't like sales, then this job is not for you.",
        "advice": "Keep Doing what you're doing",
        "pros": "It is a great work environment with great benefits. The managers constantly give you feedback on your performance. Plus there is free food!",
        "summary": "Yelp",
        "role": "Account Executive",
        "date": "Sep 21, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Pay is low at first, but once you make commission it is a lot better!",
        "advice": null,
        "pros": "I love everything about working for yelp. The benefits are top notch, the company culture is so much fun and the training program really prepares you for making great sales cycles!",
        "summary": "Great company, great benefits, great training",
        "role": "Anonymous Employee",
        "date": "Oct 10, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The base salery is a bit low. Yes the commission is excellent but after taxes is still makes a difference. But considering health and dental are paid for by Yelp it makes sense.",
        "advice": "Higher base salerys I believe would help with retention and over all employee happiness",
        "pros": "Amazing culture, they take a huge interest into your development and set you up to have an amazing career. Besides the amazing office, free food or the beer it's the people that keep you there.",
        "summary": "Life at Yelp",
        "role": "Junior Account Executive",
        "date": "Oct 19, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not much. The job can be difficult, but that's sales",
        "advice": "Keep doing what you're doing. Super approachable managers",
        "pros": "Awesome managers and benefits. Job is hard, but if you work hard and like sales it is worth it.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Oct 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- The biggest complaint you'll hear is about the job itself.The job can be taxing and is high volume. Business owners often are tough to deal with regarding Yelp, you'll get hung up on, yelled at, sassed, etc. You'll also have months where you don't perform as well or miss quota. Until you find your groove, you'll definitely have to hustle.But management knows this and is there for you. Be sure to ask and lea… rn from them after training.- Even with commissions, bonuses, raises down the line, the 36k starting base salary is very low for the San Francisco Bay Area.- Lunch options are basically deli sandwiches (known as the \"Yelp-wich\"), microwaveable convenience foods, and snacks. Good, but there could be more variety or hot foods as well.- Elevators and Bathrooms can get crowded in the new building.",
        "advice": "GREAT JOB! If I had to say one thing, it's that maybe training could be a little more ongoing into the third month, especially regarding things like pipeline management. But awesome overall.",
        "pros": "Great opportunity and first job out of college. Golden opportunity if you're looking to build a sales career, but also great if you're motivated yet undecided about what you want to do career-wise.First, Yelp has hands down one of the best company cultures, people, and management.You'll know if Yelp is a great fit for you. You'll feel welcome at Yelp as long as youa) do the work, andb) are pos… itive, authentic, hard working, sociable, and have a sense of humorVibe is very West Coast, including the dress code, but still a motivated and professional environment. Dominated by millennials.Great people, social environment, theme days, off-sites with your team around the Bay, happy hours on the top floor after work on Fridays, people and culture make it worth it. Authenticity and being yourself is one of the company's biggest values.You start off with a two-month training with your class of new hires, where you're put in a team of fellow trainees and a training manager. You learn all about selling Yelp, and hit the phones on the second week. After the two months, your team either rolls out together with your manager, or you get put on an already existing team.From the beginning, management is very real with you - they acknowledge that \"the job can suck at first,\" and encourage you to look at it with some perspective. They're there for you when you're going through a slump, and really care about your development in the role. And communication is very direct and open, in line with the culture.There is little to no drama or unnecessary micromanaging, negativity, etc. Managers do vary and I may have gotten lucky since I was on a great team, but I didn't see too much deviation from this for the most part.Also, the company is pretty transparent with the C-suite - the VP of Sales comes down to the floor sometimes to see how everybody's doing, and there's a monthly round-up where he addresses the whole of SF Sales. Jeremy Stoppelman the CEO has addressed employees quite often.- 8-5 set work hours including 1-hour lunch - 40 hours per five-day work week.- General expectations of 65 calls a day and/or 2 hours of talk time.- Stocked kitchen for breakfast and lunch.- Get to work in downtown San Francisco - great location! New sales building as well.- Transparent: CEO, Execs, and VPs are great.",
        "summary": "Great Company. One of the Best Cultures. Learned a lot.",
        "role": "Account Executive",
        "date": "Oct 27, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "No cons at this time",
        "advice": null,
        "pros": "Loved the people I worked with",
        "summary": "Great Place",
        "role": "Anonymous Employee",
        "date": "Nov 3, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Long hours. There is not much bad to say this is a great company and you put in what you want to get out. Every job you get is going to be challenging you just have to work at it.",
        "advice": "Theres not much advice to give here. They are very involved with their teams and employees and making sure that no matter what they are there to help.",
        "pros": "Great work culture. Everyone that works there is always friendly and willing to give a helping hand no matter what. The benefits offered here are great. They provide breakfast and lunch as well as many opportunities to bond and get to know your fellow coworkers.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The sea of young people",
        "advice": null,
        "pros": "The company perks and benefits.",
        "summary": "Cool",
        "role": "Anonymous Employee",
        "date": "Nov 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Work can be very challenging but very rewarding at the same time.",
        "advice": null,
        "pros": "Fun, fast paced work environment. Great training for people with no sales experience. A ramped up quota that is appropriate for time on the job. Great opportunity for forward career growth within the company.",
        "summary": "Account Executive",
        "role": "Sales Associate",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It's a sales job and isn't easy. Get ready to work your butt off!Lots of rejection and disappointment, but that's why closing a deal is so awesome!Work can be repetitive and monotonous.",
        "advice": null,
        "pros": "Fun, energetic and young culture. Met some amazing people who I plan to keep in touch withStructured training program. You'll learn so much about sales and small businessIncredible sales talent. They know what they're doing.Opportunity for advancement.",
        "summary": "Account Executive in Chicago",
        "role": "Account Executive",
        "date": "Nov 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Personally, I just couldn't do it. I'm not an on the phone type of person. Tasks were very much the same and I can't do the same thing all day every day. It was just same conversations with different people.",
        "advice": "Just make sure you keep investing in your employees their your biggest ally.",
        "pros": "They really invest in training and empowering employees. They also are very open to change/new ideas from anyone.",
        "summary": "Good place not for me.",
        "role": "Account Manager",
        "date": "Nov 18, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Hard at times, need to be mentally strong",
        "advice": null,
        "pros": "Great training program, learn how to sell, perks and benefits",
        "summary": "Account executive",
        "role": "Associate Account Executive",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "low starting salary until you are eligible for compensation.",
        "advice": null,
        "pros": "Culture, great training program, work-life balance",
        "summary": "Great place to get sales experience!",
        "role": "Account Executive",
        "date": "Dec 6, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "I don't see anything bad not to work here",
        "advice": "Y'all managers are just incredible se",
        "pros": "Great place to work they really care for you",
        "summary": "GREat",
        "role": "Anonymous Employee",
        "date": "Dec 6, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "There is absolutely nothing negative for me to say. I literally do not know anyone that I would trade jobs with.",
        "advice": "Keep doing every single thing that you've done. Thank you for changing my life, and the lives of many of my colleagues.",
        "pros": "Working for Yelp has been beyond my wildest dreams. Autonomy, compensation, the people, my bosses - it's all been the absolutely wonderful. I dread the thought of ever having to look at life without Yelp.",
        "summary": "Dream job",
        "role": "Regional Lead",
        "date": "Dec 8, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "-The management is tough on people that they don't like-The culture seems to be somewhat cliche sometimes",
        "advice": "Bring people together and don't break them down",
        "pros": "-Great culture-Awesome CEO-A place where you can be yourself and work with young people",
        "summary": "Sales rep review",
        "role": "Account Executive",
        "date": "Dec 13, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Company has a stigma that comes from clients and small businesses which can create awkward conversation in public situations in my personal life.",
        "advice": null,
        "pros": "Great culture and benefits package is incomparable. The job itself is tedious and detailed work and, without the people surrounding me, would not be the worth the salary.",
        "summary": "Overall a great company to work for",
        "role": "National Account Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "The position can be stressful. Inside sales is not for everyone. You definitely need to WANT sales to work here",
        "advice": "Start offering ads on the mobile platform",
        "pros": "The culture, opportunity for advancement and the training program",
        "summary": "If you want sales, this is great",
        "role": "Account Executive",
        "date": "Sep 29, 2010",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Seriously - nothing worth typing in this field. If I must put something, then I will say that I wish that the pay were slightly higher starting, but again, even that was ok... Just would have been sweeter if were about $5k- $10k more.",
        "advice": "Bump up stating salary for CMs a good $5k- $10k. You know they deserve that! lol! Also - every CM should have an assistant after 6 months. Having at least a 1.5-man team in each city would help CMs really rock out their cities even more. Other than that, no advice. Your business model is excellent and management is inspiring (wow - can't believe I even said that. I have never said that about anywhere else I have work… ed at! lol! Seriously though - not sucking up. They know their stuff). As long as Yelp keeps doing what it is doing, you will continue to have CMs just as happy as I am!",
        "pros": "Everyone I work with, from the top down, is intelligent, creative, competent, and driven. My talents and expertise were valued from Day 1 and our continued training constantly adds to my skill set as I further develop my marketing and event-planning skills.No one micro-manages you (which I hate). You are trusted to do the job that you were hired to do and celebrated when you go above and beyond goals set before y… ou. A little bit of recognition goes a long, long way. I work from home most of the time when I am not out and about in the community and I can tell you that I work super long hours without a care in the world. Keep in mind, no one is watching! lol! I do it because not only do I enjoy what I do, I am valued for doing it.Yeah, everyone would like a bigger check, but what I earn right now is fair and I know that the company actively looks to advance and promote employees which of course comes with a bump in pay. Until that time comes, I am more than fulfilled with my overall employment here. My job makes me feel good daily. Not only do I get to help small business owners whom I really care about, I get to plan and execute events that get my entire community engaged and looking at their city in a new and different light! I have had so many people come up to me and say that our Yelp events have helped them to re-enjoy their city and discover new businesses or old businesses with something new to offer. I know it sounds cheesy, but it makes me feel like a bit of a do-gooder as well, which I don't mind at all. <3 me some Yelp! LOL!",
        "summary": "I have never been so happy and fulfilled in a job EVER! SERIOUSLY!",
        "role": "Community Manager",
        "date": "Dec 18, 2011",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Pay is just okSometimes involves a lot of driving",
        "advice": null,
        "pros": "Elite EventsGreat passionate people, all with outgoing personalitiesMeet new people within the company and community you're working inFREE STUFF",
        "summary": "You get as much as you put in",
        "role": "Anonymous Employee",
        "date": "Feb 25, 2012",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "-I wasnt paid any extra benefits-There werent any offices in Montreal",
        "advice": "Keep up the great work! It was a pleasure working with the Yelp team.",
        "pros": "-I had a lot of freedom regarding what I could write-Amazing team with cool upper management",
        "summary": "Writer",
        "role": "Anonymous Employee",
        "date": "May 14, 2015",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Open calls are hard, and a Google-stlye office isn't for everyone. If you don't like being part of a team and you're hard to motivate, you probably won't like it as much. I'd also suggest to anyone who thinks that this is a stepping stone in your marketing career, to reconsider. If you start in sales your career is in sales. Which, btw, is not a bad thing AT ALL!",
        "advice": null,
        "pros": "You will be working hard but you will love doing it. Managers are very helpful and always ready to guide you if you're having trouble with anything.",
        "summary": "Really cool atmosphere, accepting and progressive collective, great food!",
        "role": "Account Executive",
        "date": "Oct 15, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Starting salary can be low compared to similar tech start ups- however there is a lot of potential earnings that can be made with commission and increases in base salary.",
        "advice": null,
        "pros": "There are a lot of opportunities for learning and development. Account Executives are trained in the full Sales cycle including in depth training in Salesforce. Intelligent co workers with a vibrant fun work place. It is very much a work hard - play hard environment.Big game room. Kitchen with free food and drinks. We have also launched cultural groups during and after work hours. The office location is perfe… ct (right in the centre of Dublin). Employees receive health benefits from day 1. This also includes money towards Gym Membership. Work life balance is great- pretty standard 40 hour work week. There are also opportunities to meet with Senior management SVP, VP, Senior Directors etc.",
        "summary": "Great Environment For Learning",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2015",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "too big, too complicated, slow",
        "advice": null,
        "pros": "Young and modern, hip company",
        "summary": "Top",
        "role": "Anonymous Employee",
        "date": "Jan 19, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "It's tough to work on a product that consumers mostly love (\"I use Yelp every day, it helps me find the best restaurants, shops, etc.\") but that business owners mostly deride (\"I can't believe that Yelpers are allowed to write whatever they want!\"). Despite Yelp's best efforts to have internal controls between editorial/product and sales, despite numerous dismissed lawsuits to the contrary, we still struggle against … a general perception by business owners that we're out to get them.",
        "advice": "Keep up the good work on culture, stability, and driving towards common goals. But let's also take a few chances now and again.",
        "pros": "I've worked with some eccentric executives in a half-dozen tech companies over the years, and Yelp has one of the most even-keeled, smart, and emotionally intelligent executive teams that I've seen in a long time. It's a pleasure to work at Yelp and watch them operate the company.Most everything flows from having a strong team in place, so it's not a surprise that the strong exec team has resulted in a great … working culture, a strong tradition of promoting from within, and generally a collaborative work environment. There is a good level of communication around what is now a 3000+ employee base in the form of all-hands meetings (quarterly), short update videos (weekly), and frequent opportunities for department- and team-level communication, feedback, and Q&A.Lastly, Yelp is a fun place to work. I thought it was BS when I first interviewed here: everyone I talked to said it was fun to work at Yelp. I thought that must be some strong corporate kool-aid they're drinking, but it's actually true. Somehow when people are well-managed, have an opportunity to make a difference, and work together, they have more fun. The company also makes fun a priority, so that helps.",
        "summary": "Highly underrated company and exec team",
        "role": "Product Manager",
        "date": "Apr 13, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Inflexible working hours. The whole office starts at the same time, which is great for the team spirit, but can be a little annoying when you plan your day to day work and are trying to match your schedule to your customers needs and convenience.",
        "advice": "Keep up the effort regarding the team spirit: Playing well with others and the transparency.Maybe put a little more trust in each individual employee. You train everybody so well, that there is absolutely no reason to micromanage! Relax, you are doing a great job as leaders already!!",
        "pros": "Exceptional team spirit. Great, jung management! They are always willing to help and support the whole team and each person individually. Well organized onboarding process and development program, super equipped office, fully covered health insurance from day 1!",
        "summary": "Account Manager",
        "role": "Account Manager",
        "date": "Sep 3, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Cons of all similar sales companies. If you are not hungry do not join.",
        "advice": "Keep on like this, be more realistic about career opportunities.",
        "pros": "- Great Team Environment- Coaching- Continuous learning- Opportunity to grow in Salary- Clear and Transparent Commission Scheme- Benefits and free food- Great Ambient- Incentivised Integrity and collaboration- Competitiveness and Challenging opportunities",
        "summary": "Best Company So Far",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    }
]