[
    {
        "rating": 4,
        "cons": "Not a lot of change",
        "advice": "Keep the great work life balance!",
        "pros": "Very empowering work placeGreat life/work balance",
        "summary": "Designer",
        "role": "Designer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Speed of iinovation could be better",
        "advice": null,
        "pros": "Really good atmosphere and collective.",
        "summary": "best job ever",
        "role": "SEO Analyst",
        "date": "Apr 6, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Cold call phone sales job. You will be calling small business owners all day asking them to spend money they don't think they have on advertising.",
        "advice": "Management was great. Very encouraging and want to help you succeed. Most managers started where I was so they understood the struggles.",
        "pros": "Fun company, fun people. Great atmosphere and makes the sales environment really fun. Fully stocked kitchen and great benefits",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Apr 6, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Cold calling every day. But you should expect this going into it. If it's not for you, then it's not for you. It's also pretty difficult to reach qualification for commission. Depending on how good you are at closing sales over the phone",
        "advice": null,
        "pros": "Love the culture. You immediately become family with your coworkers. Great management. Amazing training at Yelp University. The managers will never let you give up or see you fail. It's the best support system since day 1. There's plenty of room for growth if you are looking to be in sales forever. The perks are great. Fully stocked kitchens, a full time barista, 401k, medical, dental, vision insurance.",
        "summary": "Great Culture!",
        "role": "Anonymous Employee",
        "date": "Apr 8, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "There wasn't many opportunities for career development or growth as a new employee to this entry-level position. It took some time and even then, you had to prove your intelligence and quick thinking for several months before you would be given more work projects. A few of my co-workers expressed feeling restless and that they were just cogs in a machine, trying to solve that quota rather than doing anything personal… ly meaningful to themselves.",
        "advice": "Give new and continuing employees in the User Operations department more opportunities to make an impact on the company. We want to do a good job but it's also important that our work is being valued and that senior management is receptive to feedback and allows employees the opportunity to go beyond the daily quota if they so desire.",
        "pros": "I was luckily to have had a wonderful boss who understood my potential and allowed me to take on more projects when I demonstrated my competence. Co-workers were great and the free perks that come with working for the tech industry were appreciated.",
        "summary": "Good but could have been better",
        "role": "Anonymous Employee",
        "date": "Apr 10, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not very much of an office setting, the music they play is awful, its tough to even sit and work all day because of the blaring music they play, I feel as if they want us to quit.",
        "advice": null,
        "pros": "People are generally nice to be around, free food, fun happy hours, above all else, management does a great job teaching you how to be come an elite sales professional",
        "summary": "Fun spirited",
        "role": "Anonymous Employee",
        "date": "Apr 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Product could be more targeted, needs quite a bit of work to help salespeople feel more comfortable selling it. Feels like emphasis is placed on more impressions becoming available (thereby allowing more inventory for ad space, more salespeople to be hired, etc). rather than efficiency of program/client success.- Since they've gone public, they've grown an insane amount. This has led to some territory issues, e… specially with new hires.- Chargebacks.",
        "advice": "Do a better job of finding paths for talented salespeople that don't feel like they can contribute within the current hierarchy. Yelp is losing some of their best salespeople to other companies (namely Google). Assess whether the super intense growth that's being pushed by C-levels is negatively affecting retention.",
        "pros": "Incredible culture; you'll definitely attend more culture events and form more friendships here than likely any other job you take anywhere else. If you go out of your way to form friendships and network successfully, you'll find a ton of people to have your back and help you grow. Yelp does a good job of celebrating top performers and making sales reps feel like they're a part of something special. If you are succes… sful enough here, you can literally do whatever you want.",
        "summary": "Underrated place to work, lots of opportunity",
        "role": "Account Executive",
        "date": "Apr 12, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Low base, high chargebacks (you are not part of the retention process), loud environment, college grad age group",
        "advice": "Life is not a party at work - sometimes cliques form and it's weird for new or shy employees to be a part of. Be a bit more aware of how \"favoritism\" may come across.",
        "pros": "Bootcamp style training program to prepare you for any sales role if you take it seriously and put your head down. Supportive people managers that focus on your development and well being. Positive environment where they work with you to overcome obstacles and bring out the best in everyone. Approachable senior management.",
        "summary": "Hard work pays off",
        "role": "Market Account Executive",
        "date": "Apr 12, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Below market pay and not much growth",
        "advice": null,
        "pros": "Good work life balance. Stocked kitchen and spacious office environment",
        "summary": "Chargeback Specialist",
        "role": "Anonymous Employee",
        "date": "Apr 13, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Can be extremely repetitive work.",
        "advice": null,
        "pros": "Awesome place to work, awesome benefits, awesome people.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Apr 19, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Many young managers must become good leaders quickly. Build relationships, earn trust and allow your leadership to rise organically. Your ultimate leadership role is to protect your team and get them recognized in new ways.",
        "advice": "Older generations want managers to respect their ideas and ideals which are more meaningful and purposeful.",
        "pros": "Fun-working environment, potential to make a great income with Medical, Dental, and Vision covered along with food stocked in all kitchens.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Churn and burn. You will most likely burn out. The environment can be a tad unprofessional.",
        "advice": "Care about each and every employee.",
        "pros": "You will work hard and you will have fun. The training program is excellent and will prepare you for any future endeavor.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Apr 27, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very metrics driven, if you don't hit the daily metrics you won't be around long. Bad work/life balance. Money isn't great.",
        "advice": "Be consistent with what your doing. It makes it hard to adapt when things are always changing.",
        "pros": "Great culture, free snacks, cool office. The people you work with make the job fun.",
        "summary": "Cool culture, low pay.",
        "role": "Account Executive",
        "date": "May 6, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you're not an engineer you're underpaid.",
        "advice": "Value your employees and pay at a competitive rate!",
        "pros": "Lots of perks as are typical with large tech companies. They support having a work-life balance and there are plenty of fun, company activities if you like the social aspect of working in tech.",
        "summary": "Designer",
        "role": "Anonymous Employee",
        "date": "May 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The base salaries are weak - LinkedIn & Google are starting way more competitively, and offering uncapped commission as well. Yelp \"Swag\" is rare & Often only given in training. I like a company that is always throwing cool little nick-knacks at you to flaunt around & be proud of!",
        "advice": "Instead of hiring 30-45 new people every single month in the San Francisco offices, try reserving that money for an increase in pay for this office. With the cost of living in the Bay Area, it's realistically impossible to be able to survive off of a base salary of $36-40K (I get you also earn commission, but when it's taxed by about 50%, c'mon!). Happier & less stressed employees with bigger checks = harder work… ers!!",
        "pros": "Awesome culture, values, and willingness to help you succeed in your career. They help you map out a clear path to get where you want to be in the company within a your desired timeline, and so far have been completely transparent with everything involving the company.",
        "summary": "Great Company",
        "role": "Anonymous Employee",
        "date": "May 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "People hate Yelp over the years with so much bad press and negative reviews where businesses think we are exploiting them. Basically your job becomes the nature of selling to people why they shouldn't hate Yelp anymore or you have the 40% of people who will never change their minds since Yelp has received such bad press and the stock has been plummeting over the years.I was lucky enough to do great and almost…  booked a million dollars for the company, however it is a random territory assignment. If you get a bad territory your commission will suffer vs someone else who might not be as tenacious and hard working can always hit their number due to territory.New York office was much more cut throat than the SF and PHX offices. Making the job heavily dependent on internal office politics and Yelp Koolaide drinkers.",
        "advice": null,
        "pros": "Excellent well rounded training. The head of training in Chicago is by far the best training for someone coming from no sales experience.The people are what keep you here short and long termYelp is everywhere, universal languageAmazing chance for growth. Start as an AE and become a manager in less than a year. Continuous growth in salary is a great motivator. I wouldn't suggest starting in NYC…  with the low base pay unless you have a situation where you can live at home for awhile.Easy to navigate Salesforce integration with assigned territories so keeps you organized through pipeline managementStocked kitchen 24/7Excellent heath insurance with substantial coverage for pharmaceutical needsGreat team and director bonding activities through out",
        "summary": "Amazing first job out of college",
        "role": "Account Executive",
        "date": "May 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Sometimes managers play favorites and really hone in on working with the best people on the team, when it is everyone else who needs help. I feel that I would have stayed more than I did (1 year) if they had helped me work on my development more, rather than play favorites.",
        "advice": null,
        "pros": "I have enjoyed working at Yelp a lot. The culture is amazing and the product works, it really does! If you want to be in sales, I truly believe this is the best sales job out there. The company is super transparent with us. I never thought I would be able to succeed in sales, and they have great training. I have also learned a lot in general about learning to deal with people in my personal life from the skills I lea… rned at Yelp. Also, there is decent base pay and they are very fair with commission. You can make a lot of money right out of college if you work hard.",
        "summary": "No better sales job",
        "role": "Junior Account Executive",
        "date": "May 22, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Cold CallingVery Metrics Based - zero tolerance for underperforming during training",
        "advice": "Keep trusting your process, it's gotten the company this far. Job just isn't for everyone.",
        "pros": "Great PeopleFun AtmosphereKnowledgeable Managers/Team LeadersFree BenefitsStocked Kitchen",
        "summary": "Account Executive Trainee",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Nothing really from my perspective. If you work in sales though, I hear it is a pretty rough time and there is a decent amount of changeover",
        "advice": null,
        "pros": "Great benefits, amazing office (barista in house), fun/great people, great tech culture",
        "summary": "Great People, Great Place",
        "role": "Anonymous Employee",
        "date": "Jun 2, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I wouldnt recommend it unless you are going to pick up sales quickly, the metrics are not difficult but if you have never sold before prepare to work VERY hard and hear about it if you are falling short even in month two.",
        "advice": "I get that you want results but it does take everyone in their own time to come out of their comfort zone and talk through someone before they get a chance to hang up on you.",
        "pros": "Great benefits, great work environment, retirement and 401k option, stock options as well",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jun 14, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Needs to be more competitive in terms of benefits",
        "advice": "Meet the minimum of what benefits are offered by competition",
        "pros": "Felt supported throughout my careerAble to take different pathsLearned many new skillsWorked for great managers",
        "summary": "Long relationship!",
        "role": "Elite Account Director",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Selling advertising to local businesses is a tough vertical. Particularly when many business owners are not the biggest fans of Yelp.",
        "advice": "More engagement between different teams. While in general I believe office culture is strong, at times it felt segmented and had high school elements to it.",
        "pros": "Training, upper management, work life balance, good energy/ culture in a growing office.",
        "summary": "Great entry level sales job",
        "role": "Account Executive",
        "date": "Jun 21, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The job can become very repetitive. It can also become quite frustrating when you're having a tough month to see the success everyone around you is having.",
        "advice": null,
        "pros": "Great team atmosphere, really fun work environment, everyone wants each other to succeed, great competitions to try and help everyone succeed.",
        "summary": "Junior account executive",
        "role": "Anonymous Employee",
        "date": "Jun 21, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "\"Cold Calling\" can get stale at times depending on your territory.",
        "advice": null,
        "pros": "Money was big incentive, knowing you have the commissions.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jun 27, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Making the number of dials each day. Don't get parking for months as a new employee. Measured based on metrics. Territories where people don't know what yelp is makes it tough.",
        "advice": "Continue to value your employees. It goes a long ways. I like the ways you all keep morale high in the office. Continue to treat each employee with the same amount of importance as the higher ups.",
        "pros": "Great people and atmosphere. Great company that keeps morale high. Stocked kitchens. Good ASTMs. Great training. Great location with fun people in the office.",
        "summary": "Sales position",
        "role": "Anonymous Employee",
        "date": "Jun 28, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Low payLong development periodCollege environment",
        "advice": null,
        "pros": "Unlimited snacksGood benefits401k Match15 days PTO",
        "summary": "Good first job",
        "role": "Account Executive",
        "date": "Jun 29, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Bad lead distribution sometimes. Management doesn't always listen to complaints and concerns. Some managers are a little harder than others and they aren't understanding of bad weeks all the time.",
        "advice": "Give out better leads and get rid of the bogus ones. Sync up with the active restaurants so we don't call existing customers. And lastly instead of firing sales reps maybe downgrade them to customer service or menu?",
        "pros": "Great working environment and amazing team mates. The salary is low but the benefits are high. There are a lot of tools but you need to use them. Stay positive and make your calls and you will succeed",
        "summary": "Account executive for Eat24",
        "role": "Account Executive",
        "date": "Jul 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- Little career growth in local. After MGMT, there's not too much, unless you want to relocate to Chicago.- Career advancement is largely a politics game now, and growth isn't always judged mainly on performance. If you want to climb the ladder, get ready to play. Otherwise, look elsewhere.- It's hugely a boys club. There are very few women leaders in the directors+ levels, which really sucks and infiltrating…  the Yelp Boys Club is really tough for a woman who does not play golf.",
        "advice": "Stop making the promotion such a game. You overlook a lot of really great employees because they didn't play the right hand, not based on their success.",
        "pros": "- TRAINING - when I left Yelp, I joined another tech company and my ramp up time was much quicker than a lot of my peers because of Yelp. You're trained on everything that makes you a successful sales rep, then the managers reenforce that throughout your career, so you're always getting better. You learn how to prospect, how to cold call, how to manage your pipeline, your metrics, objections, discovery, people in gen… eral... These are skills I continue using every day in my new career and I have Yelp to thank for the strong foundation.- Awesome culture - you can't help but to drink the kool-aid.- GREAT benefits - Free health insurance, free food, gym subsidy, employee stock purchasing/RSU's (this will become your savings and you'll be so thankful for it), and AMAZING offsites.- Supportive leaders - your managers are there to make sure you're happy and producing. They're also there to talk you off a ledge when you've had a rough day on the phones.- Amazing peers - you'll make all of your friends here and it won't even seem like coming into do work.- A product that works. Can't tell you how important this is to a sales rep. While many business owners have a love/hate relationship with Yelp, you can't help but argue that many consumers today depend on Yelp to find great local businesses.",
        "summary": "Great first sales job!",
        "role": "Elite Account Executive",
        "date": "Jul 5, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The majority of employees were young and very \"clique-y.\" Since I was a temp, I also felt like I got treated differently than the permanent employees. They wouldn't include us in any of the team activities, which really got on my nerves.",
        "advice": "I would say treat the temps with more respect, but last I heard, they were planning on not bringing more in.",
        "pros": "- Covered parking (a huge plus during the summer months)- Unlimited snacks and drinks- Games and kegerators for after hours fun- Music played throughout the officeI was a temp there for 2 years, and I loved it. My manager was chill and a nice guy. I was able to come in early and leave early as long as I was caught up on all of my work. I never had to make or receive any phone calls, so I could jus… t put my headphones on and be left alone, which I prefer.",
        "summary": "I loved it there.",
        "role": "Anonymous Employee",
        "date": "Jul 6, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Long hours, constant grind of making calls, base pay to start (can get better with time and with commission). Job not for the weak minded as it can be very testing to deal with business owners. If you can handle objection and realize its an odds game, you'll be fine.",
        "advice": "Management is great at Yelp. Managers give everyone individual attention and try to find ways to develop your career in the company. They are open and honest with their advice on how to get better at the job.",
        "pros": "Big name, fun environment, good benefits, in control of your own development. Base pay not so good when you start but you can make some good cash in commission. Plenty of opportunities for career growth within the company.",
        "summary": "Account Executive",
        "role": "Account Executive Trainee",
        "date": "Jul 6, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The base is alot lower than other companies.",
        "advice": null,
        "pros": "The employees are great, the atmosphere is friendly, and of course the free food!",
        "summary": "Great place to work!",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "hard cold-calling sales role - must be willing to dial down ~80 calls/day",
        "advice": null,
        "pros": "great culture, people; everyone is very supportive and encouraging; positive atmosphere",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jul 7, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Tons of calls into small areas that showed little to no interest in yelp ads",
        "advice": "Stay positive",
        "pros": "Great kitchen and capable management.",
        "summary": "LIked it",
        "role": "Account Executive",
        "date": "Jul 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very High Pressure, somewhat cultish, dubious product, zero work/life balance.",
        "advice": "act more like people tele-evangelists",
        "pros": "Excellent Sales training program, you won't come out the same person. Lot's of opportunities for growth within and outside the company.",
        "summary": "Worthwhile Experience/High Pressure Sales Job",
        "role": "MidMarketccount Executive",
        "date": "Jul 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The sales role can be taxing-- it is high volume cold calling and should not be glamorized much more than that.",
        "advice": "More than just the top producers should be praised, it's the consistent reps that will probably retain the most often!",
        "pros": "The culture at Yelp is amazing and they do provide a lot of training resources to try to make you successful.",
        "summary": "Yelp Sales",
        "role": "Account Executive",
        "date": "Jul 12, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You can work there for 2 years or 7 years but when you hit Senior AE your base pay will always remain the same.",
        "advice": "Management does a great job helping new people develop and grow into an AE. Many reps learn as much as they can and develop into great AE for other companies because of the mentorship from management.",
        "pros": "This is a great starting point for someone who has zero experience in sales. I honestly can say they have an amazing training program to get people developed into amazing sales reps. Its also a great way to learn how to use CRM and understand the dynamics of how ad search works for directory search.",
        "summary": "Building an AE career",
        "role": "Account Executive",
        "date": "Jul 13, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Cold calling is rough and it's not Yelp's fault.",
        "advice": "Keep doing what you're doing. I left my old job and had a hard time leaving this job because of my manager.",
        "pros": "Great environment. They really take care of their employees. The culture is awesome. Fun, smart, cool people",
        "summary": "Cold calling is not for everyone",
        "role": "Account Executive",
        "date": "Jul 17, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Hypocrisy in upper management. Some of the team is arrogant and acts before understanding the true nature of a situation. Politics and favorites are played quite often.",
        "advice": "Lose the \"I've never done anything wrong\" attitude and manage to a true situation. Lose the politics and manage to talent, not anything else.",
        "pros": "Great working environment. Being able to work with a Collaborative and talented pool of individuals is a great learning experience. Fun and energetic day to day.",
        "summary": "Sales Manager",
        "role": "Associate Sales Manager",
        "date": "Jul 19, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The position is tough. You have to be cut from the same cloth to survive in sales. Period.",
        "advice": null,
        "pros": "Amazing training and top-tier managers.",
        "summary": "Account Exec",
        "role": "Anonymous Employee",
        "date": "Jul 19, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "It's a cold calling sales position so it can get boring and repetitive doing the same thing every day making about 70+ cold calls",
        "advice": null,
        "pros": "GREAT out of college sales experience and training. Awesome environment of people that really want to help you succeed.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jul 25, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Cold calling.8hrs a day of cold calling.Fine for some people. But there's not one person in the work who actually LIKES cold calling. Some people can turn the part of themselves off that cares; most can't.",
        "advice": "More even distribution of territories would make sense. Some rookies got crappy territories; others got gold mines. A lot of people get burned because they think they're somehow the problem.",
        "pros": "Healthcare.Stock Options.Fitness reimbursement.Nice enough kitchens with free food.Kegs of coffee and beer.Great coworkers.Casual workspace.Work/life balance.All great if you don't care what you spend one third of your life actually doing.",
        "summary": "Great Effort to Make the Job Worth It...kinda not worth it.",
        "role": "Junior Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "phones, i enjoy cold calling but most folks don't. can be super tough for some days.",
        "advice": "not much",
        "pros": "great people, active environment., can be super fun",
        "summary": "my experience at Yelp",
        "role": "Anonymous Employee",
        "date": "Aug 6, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "cold calling; this is a full sales cycle position, you are prospecting for yourself in your territory, all over the phone",
        "advice": "management does a great job with training when you first start and continued training months later",
        "pros": "great work environment; commission; benefits; managers make sales as fun of an experience as possible",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Aug 9, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Need to better train managers in local advertising",
        "advice": "Provide more tools for individual growth. And there needs to be more fun ways to get people excited to come to work everyday.",
        "pros": "If you produce, then the company will take care of you internally.",
        "summary": "You could work here",
        "role": "Sales Executive",
        "date": "Aug 10, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not very good compensations & benefits compared to other medium size companies",
        "advice": null,
        "pros": "co-workers are young and activelots of brainstorm lunch and interesting learning groupsyou'll never get bored of your work",
        "summary": "Awsome company",
        "role": "Software Engineer",
        "date": "Aug 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "You reach your peak quickly and then become discursive with every besides Yelp - this is a transient position so don't kid yourself. Have fun and earn some money, while gaining great experience.",
        "advice": "Keep it up",
        "pros": "Gritty, electric, and fun atmosphere - great launching off point post college! This is a position that can have a huge impact on an individual- need to have a scrappy personality and a growth mindset.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Aug 18, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "If you don't sell. You don't make a lot of money.",
        "advice": null,
        "pros": "Very good work/life balance..He get in what you put out as it is a sales job. It is a cold calling job. It is not for everybody, but the people and environment really pick you up when you are having a rough day.",
        "summary": "Awesome People!",
        "role": "Junior Account Executive",
        "date": "Aug 22, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Small fish in a large pond feel, Your only as good as your current months performance",
        "advice": null,
        "pros": "Great atmosphere, Great benefits, success and helping small business owners is rewarding",
        "summary": "Account Executive",
        "role": "Elite Account Executive",
        "date": "Aug 25, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "its sales so quotas monthly can be nerve racking",
        "advice": "keep it up",
        "pros": "Great environment, great training, fun location in NYC and can be very lucrative compensation wise if you work hard and have the chops for inside sales.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Sep 1, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very few free meals (which at this point is very uncommon), product shows some signs of age and not enough effort has been put into modernizing parts of it",
        "advice": "It's stupid, but add more free food if you want to attract/keep the best talent",
        "pros": "Great culture, nice people, good work life balance, people are passionate about product, surprisingly good growth for such an old company",
        "summary": "Good Place to Work",
        "role": "Anonymous Employee",
        "date": "Sep 6, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Typical corporate environment, but not bad.",
        "advice": null,
        "pros": "Great environment and growth opportunity",
        "summary": "Good place to work",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "A cold calling pisition that can feel repetitive and unsuccessful",
        "advice": null,
        "pros": "Great team environment & support. Give you all the tools to succeed. Work/life balance. Amazing office with lots of perks",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Sep 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Repetitive, cold calling, and it can take its toll on you",
        "advice": null,
        "pros": "Work environment, the perks, coffee",
        "summary": "It's definitely fun.. For a while but it gets repetitive.",
        "role": "Anonymous Employee",
        "date": "Sep 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you tell a business owner that you work at Yelp, they immediately ask how to remove bad reviews (which you can't). This isn't a con of the actual job, but more of an FYI.",
        "advice": "Keep being accessible and approachable to employees of all levels.",
        "pros": "Fun culture, a lot of young people who like to socialize, free snacks, access to upper management,",
        "summary": "Fun company atmosphere",
        "role": "Account Executive Sales",
        "date": "Sep 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Only so much growth once you get to the national segment all the Chic Fil A's and Best Buys of the world are taking up but the top 5 NAE's to get to they are in the company they would either have to leave (which none appear to be and their about 150 people waiting to take their spot) or you would have to wait 10 years and pray your numbers produce",
        "advice": "Begin to hire from the outside, its great to promote from within, but everyones turns out the same when they are managed by the people who drank the kool aid before them",
        "pros": "Great place to launch a career out of college, can be difficult at the start but as time goes on you sale to the top and begin getting large commission checks (for being a new grad)",
        "summary": "Great Starter",
        "role": "Franchise Account Executive",
        "date": "Sep 19, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The job itself is extremely repetitive. I mean after all majority of your day is spent cold calling so how much fun could it really be.",
        "advice": "Continue to keep everyone motivated. It's easy to lose motivation when you are having a bad week/month but positivity is everything with cold calling.",
        "pros": "Great culture at Yelp. They really do everything possibly to keep the environment fun and active. Free kegs, ping pong tables, and contests make it enjoyable.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Sep 21, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "monotony of the job, everyday is the exact same thing.- office politics",
        "advice": null,
        "pros": "- free food- culture- positive environment for the most part- offsites- getting close with your team members- flexible managers, directors - always eager to talk to you about anything",
        "summary": "Acct Exec.",
        "role": "Anonymous Employee",
        "date": "Sep 22, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "keeping up with the metrics and same day to day opetations",
        "advice": null,
        "pros": "great pay and great play",
        "summary": "account executive",
        "role": "Account Executive",
        "date": "Sep 28, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The work itself is just okay - often dull and not super-rewarding ... you often get ridiculed over the phone but that only makes a person stronger and, in my opinion, more prepared for jobs that much easier. Reviews and our software gets people very emotional. Selling advertising has no guarantee. Those two things can get very disheartening but our job is to change that.I do not believe there is much care and…  attention to the morale of our sales people and, when we are producing revenue for the company, it makes a lot of employees bitter and solely reinforces negative energy.",
        "advice": "To give more trust and freedoms to reps that have earned it - especially in sales, if someone works hard, proves themselves and truly adheres to the values of the company then they should be treated as such.",
        "pros": "What's kept me at Yelp for over three years is the people and culture. At the end of the day, I feel like the overwhelming majority of teammates, manager and directors truly care about my happiness and my success here and visa versa. I believe I've had the rare luxury of working with smart, honest folks here.",
        "summary": "Veteran Opinion",
        "role": "Client Partner",
        "date": "Oct 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The culture can be a little much at times. The stress of the job isn't worth the pay, you spend all of your day cold calling and the people can be a little fake.",
        "advice": null,
        "pros": "Promotions from within, Good kitchen, Free coffee in the morning from a barista, Younger work crowd and monthly team happy hours,",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Oct 4, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "I read some of the comments here and I absolutely want to face palm myself.Oh noooo, poor babies actually have to work? You don't like being in an office and calling people and getting those fat paychecks? :(People like this shouldn't be hired. I am so tired of these whiny poor kids who majored in English and are upset that they have to work when they get out of college. No honey, you're not going to … get out of college and make over 6 figures without busting your butt.However, I will agree the base starting salary should be somewhere in the high 40's since NY is expensive.",
        "advice": "- Continue to promote form within.- Hire more diverse groups of people- Please stop cutting back on kitchen snacks, I mean tomatoes are not going to break the bank.- Please hire older people who understand what a hard days work entails, and the rewards that come with it.",
        "pros": "Working at Yelp has been the best experience of my life. Even with about 7 years of work experience, I still continue to learn something new everyday.I have been working for years in marketing and other fields, and they don't even come close to the Yelp experience. Yes the job can be a roller coaster, but the benefits far outweigh the cons of the job.Yelp provides:Free Health CareCommuter bene… fits401kStockHealth plans for gymsYes, the starting salary is low, but if you suck it up and bust your butt, and REALLY own the concept of self development then you can be on your way to 52k base salary within 6 months. The commission is pretty good as well compared to other tech companies.Positive fun environment.",
        "summary": "A Year's Review",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Growth - as they grew it became more difficult to have the same autonomy, but this is often the case as a company grows in size",
        "advice": null,
        "pros": "Ability to grow my career, Exposure to higher ranking individuals within the organization. Ability to sculpt and execute marketing campaigns.",
        "summary": "Yelp offered a dynamic opportunity for growth",
        "role": "Anonymous Employee",
        "date": "Oct 5, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You start out with a low pay but it gets better over time, mostly with commission and experience that increases.",
        "advice": "I would like to see the management a bit more inviting and rewarding. Sometimes it's nice to be recognized for your hard work",
        "pros": "Great company culture and environment. I enjoyed going to work every day, sometimes just people of the people I was surrounded with.",
        "summary": "Accoutn Executive",
        "role": "Anonymous Employee",
        "date": "Oct 12, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "high turnover, low base, takes a while to get commission",
        "advice": "people can't live on just the low base salary revamp how commission is distributed",
        "pros": "Great training, Management patient for those who don't perform immediately, kegs with good beer, snacks, barista, stocked fridge",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Oct 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The product you sell is not the greatest thing in the world and a very hard sale .",
        "advice": "Stop hiring 22 year olds as managers",
        "pros": "Awesome Training , Awesome People , Awesome EnviromentThey really care about helping you develop as an Account Executive and everyone is very supportive",
        "summary": "Great company to develop as in sales",
        "role": "Account Executive",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Upper management is extremely nepotistic. Promotions and internal team changes were based completely on who they \"liked\" better. If you didn't want to go to happy hour after work and rub elbows with upper management you were considered to have a bad attitude. Good, reliable work isn't enough to get you anywhere there.",
        "advice": "Do the research on what your people are doing for your company. At some point upper management will turn over too and you'll be stuck with the people they just happened to be buddies with versus those that are moving the business forward.",
        "pros": "Overall Yelp had a great day to day atmosphere, good perks, nice office, good people. It's a fun place to be everyday.",
        "summary": "Good Experience",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Very draining, feels like a call-center at times",
        "advice": null,
        "pros": "Top of the line training, fun atmosphere, good benefits",
        "summary": "Great experience",
        "role": "Account Executive",
        "date": "Oct 19, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Short term contractNo opportunities to meet other people doing the same job",
        "advice": null,
        "pros": "Decent hourly rateFlexible working conditionsAutonomy for what to review, see, doGood way to get to know your own town",
        "summary": "Good temp role",
        "role": "Anonymous Employee",
        "date": "Oct 30, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "- Sometimes it may get very loud during month end close.- Compensation-- wouldn't say it is bad because you get paid for the position you do; and the allocation of budget towards amenities, food, and drink.",
        "advice": "- People should not be rewarded for the things they say, but rather, they should be rewarded for their merits and contributions in creating a more effective and efficient workplace.",
        "pros": "- Everyone is very nice and open about things.- Very relaxed culture in terms of attire and workload.- Plenty of snacks and beverages to get you through the day.- Open spaced office",
        "summary": "Good to place to start",
        "role": "Anonymous Employee",
        "date": "Oct 30, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Company tends to give special treatment to engineers. Non-tech employees don't have the same resources and support to grow within their careers. It's very difficult to apply for internal roles because HR also prefers to recruit external applicants who already have more experience.",
        "advice": "Provide more opportunities to grow internally (either open new roles or support continuous education)",
        "pros": "Great benefits and the company culture is superb. You get all the wonderful perks of a big company (time off, medical and dental insurance, stock options, stocked kitchen, etc) and the support and flexibility of a startup. Management and coworkers are all very approachable. Overall it's a great company to get experience working for a tech company especially if you're a fresh grad.",
        "summary": "Great Starter Job",
        "role": "Anonymous Employee",
        "date": "Oct 31, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The pay is difficult and only because of the location. In almost any other city the pay would be adequate to start but being in the most expensive metro in the country the starting pay is the only drawback. Once you are there for a little while you can make some decent money but $36,000 base is tough to hold you til you breakthrough.",
        "advice": "Consider the idea of more reps in local markets serving as Sales and Account Management for local restaurants. OpenTable (the biggest competitor) has personal relationships with many of their restaurant owners and managers and I think that human, face-to-face interaction would go a long way.",
        "pros": "The people you work with are great, the benefits (health/dental/vision from day 1), good 401k, free snacks, coffee shop, drinks, beer after 5:00pm are also great. I was an Account Exec for SeatMe/Yelp Reservations. It was definitely difficult at times doing phone sales but it helps having an awesome team around and a management team that was invested in me being successful. .",
        "summary": "A 21st century company with some really great people",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "strenuous job- must be interested in sales",
        "advice": null,
        "pros": "great atmosphere, fun work environement",
        "summary": "Yelp",
        "role": "Account Executive",
        "date": "Nov 8, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Scaled out too fast and many employees ended up feeling like a number and not valued",
        "advice": "Practice what you preach. If you tell reps to invest in the long term growth of the company than invest in your long term relationship with the rep",
        "pros": "Fun work environment and mentorship program. Leaders care about you if you care as well.",
        "summary": "Great for your resume",
        "role": "Anonymous Employee",
        "date": "Nov 8, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Pay is very bad. Definitely can't afford to live in the city you work in if you're doing this gig. 40 to start.Unfortunately none of the pros are enough to make up for the crushing boredom that eventually sets in with moderating content. It gets tough reading poorly punctuated block paragraphs written by racist, angry people all day.They tell you straight up when you start not to really expect this to…  go anywhere. It's kinda sad since we have a lot of talented, intelligent people on the team wasting their smarts. They could do more to prevent turnover and have a more stable long term workforce.In our particular department there is a lot of forced fun that really gets irritating. It's a bit tone deaf since they actually advertise the position as being for introverts. Then they do things like cliche team building exercises, scavenger hunt running around the office, trivia, assigned seats to force mingling at lunch. There's lots of guilt tripping about participating. There have been plenty of times where they've deliberately withheld details about an event to try to get more people to show up, and then force participation of some activity on them. It's stressful, childish and often feels like I'm back in school.And maybe you'll think this is a pro, but they recently instituted music on Friday afternoons and it is the worst. I've never worked in a professional office environment where music has been played, so it seems especially out of place in our otherwise very quiet space. This isn't sales.There are a lot of management changes lately that make the job really stressful. There are a lot of bad personalities in the department.No one seems to be on the same page about anything. The communication is ridiculous. You can be doing something wrong for months due to a misunderstanding. It's a mess. I'm looking to move on.",
        "advice": "If you don't expect much out of the team, you won't get much. You're always hiring way too many people for the job and scrambling to find things for us to do. Why not provide more incentives for increased performance, make your employees feel valued so they stick around and have a smaller, longer-term more experienced workforce. I think most of us would be willing to take on overtime when it was called for. That has … to be cheaper than training and providing full benefits to constant unnecessary hires.",
        "pros": "All of the pros are really not about the actual job itself sadly.You don't have to wear real clothes or show up at a specific time and that's nice.Great free snacks. Not so great compared to other companies in the area, but definitely above average.Beer! I've never liked hanging out at an office after hours before. I do that somewhat regularly here.Flexible Hours with the option to wor… k from home when necessary.Sweet health benefits and they're pretty generous with stock even for us lowly user ops workers.Average good-ish time off/sick time",
        "summary": "Yelp is Pretty OK",
        "role": "User Operations Associate",
        "date": "Nov 9, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "- repetitive telemarketing- overemphasis on number of calls- not a good fit for every business on Yelp",
        "advice": null,
        "pros": "- fun environment- fully stocked kitchen/snack bar- craft beer for after work- young professionals- great place to start a career in tech sales",
        "summary": "Good starting point for sales career",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Poor 401k matching, middle-of-the-road benefits and compensation, restrictive remote working policies, on-call work breaks into work-life balance (should have Mondays or Fridays off during on-call rotation).",
        "advice": null,
        "pros": "Friday lunches catered, great working environment, strong team members, high mobility within company, low churn",
        "summary": "Overall positive",
        "role": "Software Engineer",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The job is very difficult. It is cold calling, there is nothing easy about it. It can stress you out and can be frustrating. That being said, there are many people who succeed at the job, it is all about your mindset going into it, having tough skin, and working very hard.",
        "advice": "You guys are doing well, you keep people motivated, and provide assistance if need be. The only advice I would give is to raise the base salary, it is not at the level of other companies that offer similar positions.",
        "pros": "Yelp is by all accounts a great culture to work in. It's a fantastic company, offering a great service, and provide valuable experience to those new to sales.",
        "summary": "Solid but tough place of business",
        "role": "Account Executive",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "the pay if not reasonable, despite how much you close",
        "advice": "management is GREAT",
        "pros": "great place for a positive, driven sales professional to grow",
        "summary": "Junior Account Executive",
        "role": "Anonymous Employee",
        "date": "Nov 21, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Tough objections from companies because of reviews.",
        "advice": null,
        "pros": "Flexibility w/ schedule. People are fantastic.",
        "summary": "Great Job",
        "role": "Senior National Account Executive",
        "date": "Nov 29, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Same, tedious cold calling day after day. Care a lot more about \"metrics\" (daily calls, etc) than anything else which seemed a bit backwards. Seemed to prioritize quantity/quality. Like to tout \"work/life balance\" but will still encourage/guilt you into working more hours and don't pay overtime.",
        "advice": null,
        "pros": "Company culture (people) was really good. Tons of free snacks/beer. Some managers actually really care for your wellbeing.",
        "summary": "AE Role",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "80 cold calls a day. The job can get very tedious. Average PTO/sick days. A lot of favorites in the office depending on who's making sales.",
        "advice": "Don't have favorites. Listen to feedback. Get out of the bubble your in and explore different ways to do things. Don't be set in a particular way of getting things done.",
        "pros": "Free food and snacks. Good work environment and culture. People are great. Good opportunity for growth within the company.",
        "summary": "Tough job",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Aggressive sales cultureSome potential clients hate the company so that can be draining at times",
        "advice": "Hire solid talent, no offense to fresh out of school but some experience is nice. The frat environment grows old quickly..promote of merit and hard work rather than filling a number",
        "pros": "Great training programSalesforce.comTeam cultureGreat benefitsInfinite training resources",
        "summary": "Account Exeuctive",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "-Salary-Salary-Salary-Salary-Lack of connectivity amongst the managers and the employees.",
        "advice": "Listen to your inferiors. Try to streamline your operations by uniformizing internal procedures. Leads could also use a refresher training.",
        "pros": "-Excellent healthcare-Modern tech environment-Fully stocked kitchens on each floor-Friendly, forward thinking culture",
        "summary": "Steady paycheck, relaxed company culture.",
        "role": "User Operations Associate",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The company culture tends to overshadow how difficult the actual job is. The fun can suck you in and never let go, sometimes veiling the fact that you are at work and not still in college.",
        "advice": "Focus on the individuals of the team and learn to fashion your management style(s) to align with each individual team member. Work with those members over time to learn from different styles.",
        "pros": "True meritocracy. Success is completely based on performance but job security is not, meaning some people struggle with inside selling but hard work cannot be taught so eventually the hard work pays off and success comes over time, both financially and career-based. The training program is incredible and truly sets you up for success whether you stay at Yelp or move on.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited product, wish it could be more customizable.",
        "advice": "none",
        "pros": "Fun culture, great people, and free coffee/beer.",
        "summary": "Great Place",
        "role": "Anonymous Employee",
        "date": "Dec 10, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Within the sale org, there are a lot of challenges associated with working in sales related mostly to the position itself and not the company.",
        "advice": "The management team overall does a phenominal job and the companies leadership is its greatest asset. keep it up team!",
        "pros": "The career advancement opportunities. free odwalla smoothies. other perks include PTO, a great culture and fun people to work with.",
        "summary": "Great",
        "role": "Sales Manager",
        "date": "Feb 1, 2011",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Low salaryNewbies start with bad territories",
        "advice": "My manager was awesome.",
        "pros": "Fun atmosphereGreat trainingEnjoyable peopleGreat product",
        "summary": "Short but I enjoyed it",
        "role": "Anonymous Employee",
        "date": "Sep 10, 2012",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Yelp is less structural compared to most companies. Though you still have your seniors supporting you, it's a very self-learning job.",
        "advice": null,
        "pros": "The flexibility is amazing - most days I work offsite from lovely cafes. The hours are not fixed - just as long as you get things done.",
        "summary": "Community Management and Marketing",
        "role": "Community Manager",
        "date": "Dec 9, 2014",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "none so far. very good",
        "advice": null,
        "pros": "Very good eay to work with",
        "summary": "office admin",
        "role": "Anonymous Employee",
        "date": "May 30, 2015",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not much room for growth",
        "advice": null,
        "pros": "Flexible job opportunities, great management",
        "summary": "Flexible, Fun",
        "role": "Reviewer",
        "date": "Aug 31, 2015",
        "is_current": false
    }
]