[
    {
        "rating": 2,
        "cons": "- At the mercy of a terrible territory system- no 401k matching- no opportunity for career growth unless you're part of the \"it\" social group- extremely unprofessional workplace atmosphere- treated as a number and nothing else- you will work for a manager that is less qualified than you",
        "advice": "Don't pretend you are concerned about employee retention. You talk the talk, but you need to walk the walk.Level the playing field -- the rich get richer (some through dishonesty in selling) and the poor get fired.Get a better handle on your territory system -- Metrics don't mean everything in determining good turf - get input from the people who are actually on the front lines, not someone looking at…  a spreadsheet.Don't promote managers based off of a few good selling months and then overlook your true leaders. You have management that not only can't do their jobs, but don't know how to do the job of their subordinates",
        "pros": "Free foodgood insurancecasual workplace attire",
        "summary": "Unless you have no other options, look elsewhere.",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "More than 1200 employees yet the company is in denial about no longer being a start up. Still refers to itself as scrappy and a \"non hierarchical environment.\" The company is enduring some serious growing pains from getting too big too fast. Culture is no longer what it once was but upper management takes no interest in the lack of strong culture. You have the developer team that will admit it's overcoddled and cater… ed to and the sales team that is happy to have any shiny perks at all, but it's clear who is more valued more highly. Departments never mingle nor transfer knowledge. There are no on-site activities unless it's a event for engineers. There's little cohesion between teams and little innovation unless it's directly tied to revenue. Idea sharing is encouraged in theory but not in practice.Nothing gets done in a timely way. Lots of red tape, missed deadlines and no accountability. No repercussions for a job not well done.",
        "advice": "Hire some serious outside talent. Have someone from the outside come in and do an audit of the bloated teams where people aren't working efficiently and nix the mediocre (and sometimes unprofessional) managers instead of keeping them around out of loyalty. The people that were hired when Yelp first started as a small company of 20 are not the same ones who will carry it forward to a team of 2000.",
        "pros": "Good location, free soda and snacks. Safe working environment where you could (for the most part) talk to anyone in the office like a peer. Office parties when the community managers would visit were amazing.",
        "summary": "Growing Pains",
        "role": "Anonymous Employee",
        "date": "Nov 19, 2013",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You have a 20,000 quota every month and the turn over rate is insane. They hire around 30 employees each month and after my first year there it was down to 8. They fire and have people quit.Poor management. I will say that occasionally there are some very kind authority figures.. but some of the main ones that have ultimate power over who stays and who goes are hypocrits. I feel bad saying it but at the same time…  I want to be honest to future job lookers, and just understand that if you are able to deal with some messed up managers then go ahead and good luck. Some managers party and secretly date their employees. There is so much that goes on behind closed doors and at times you will feel like you are back in college. The last thing I want to say is that as much as it doesn't sound like it I love yelp. The job itself and the lack of professional management is twisted and down right wrong. I understand they like to promote within but for authority and managerial roles they should look to hire unbiased and more respected figures.",
        "advice": "Look at San Fran and the amount of professionalism that shines. Hopefully the management in phx office doesn't bring the company down",
        "pros": "Every pro has a con to it. But overall, cons win.Stocked kitchen - but expect to gain a lot of weight from the food too.Nice employees - while you're new to the game. Don't get me wrong I have made some great friends that will be with me for some time. But majority of the employees are between the age of 21 and 28.Parties/kegs in the office - Although they try to create fun events for holidays and to keep…  employees happy you will shortly realize it's because roughly 90 percent of their employees are stressed every day and miserable more often than happy at the job.",
        "summary": "Didn't hate the job but never again",
        "role": "Anonymous Employee",
        "date": "Apr 22, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "COLD CALLS- don't think your time will be spent doing anything else .... because it won't!",
        "advice": "Not everyone has the same job. Someone selling into a metropolitan downtown area is not the same as selling to a place that has people who don't have internet.",
        "pros": "The people. You make friends that you will do tons of things with both in and out of the company",
        "summary": "It's an experience....",
        "role": "Account Executive",
        "date": "Apr 27, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Telesales with blaring music in the background, constant loud noise, to the point where prospects are asking you,\"what is going on there??\". Low base salary, no private work spaces. Super-micro-managed!",
        "advice": "I was terminated after three weeks after coming off of a very successful outside sales career of 15+ yrs. in a Fortune 100 Company. There was no sales quota for the 1st month, but was a quote to \"pitch\" to 10 small business owners in some remote part of the country. Week 1 was mostly classroom training, and on weeks 2-4 of the 1st month we hit the phones. In week 2 I was put on \"warning\" because management didn't fee… l that I was \"on-pace\" to hit that quota, whereas, I had a number of scheduled phone \"appointments\" lined up. In week 3 of the 1st month they fired me, without even giving me the chance to finish up my 10 \"pitches\" with still over a full week until month-end!, which I easily could have accomplished - unfair, no-chance policy. Some training manager packed up my personal effects, and i was walked out of the door.",
        "pros": "Great benefits., fun people, dress however you want, unlimited free food and drinks. Exciting for young, inexperienced college grads who like beer served to them at their workspace, and going to happy hour every night.",
        "summary": "There's a fine line between a \"cool\" environment, and a professional one, with no real individualized support.",
        "role": "Account Executive (Trainee)",
        "date": "Jun 8, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "They claim to care about their employees but it's a false since of security. They have no loyalty and think you can be easily replaced. It's hard to work in an environment like that. The salary is also not competitive to similar positions with other companies and they do lot compensate you for previous experience.",
        "advice": "Realize that the increase in turnover may have something to do internally.",
        "pros": "They have free health care. Free food and drinks and a positive atmosphere.",
        "summary": "They have a strong since of entitlement",
        "role": "Anonymous Employee",
        "date": "Jun 17, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's a stressful work environment that doesn't pay well. They give you left over leads while the warm ones (businesses that are interested in signing up) to the senior sales people.",
        "advice": null,
        "pros": "The sales training is great for an entry level salesperson to learn the basics of how to cold call. They provide free snacks, drinks and beer.",
        "summary": "Account Manager",
        "role": "Account Executive",
        "date": "Sep 10, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You're a glorified telemarketer (and paid like one) with a fancy degree. The only college experience I used was how I learned to schmooze in my sorority. If you stay more than a year in the account exec position, you're not doing your career any favors unless you want to be a telemarketer or local salesperson.It's demeaning and drone-like work. The most miserable job I've had. A bunch of kids with too much re… sponsibility pretending they can run a company. The CEO hooks up with employees. It was like a coed fraternity that took themselves far too seriously. They try to brainwash you into thinking working there was the best thing that every happened to you.",
        "advice": null,
        "pros": "You'll learn a lot about the basics of online advertising, but not much else. Good health benefits. Freee (unhealthy) food. Good location. Fun atmosphere. Great stepping stone as they're known as slave drivers - if you last for a year you'll get respect in the industry.",
        "summary": "Great place to learn the basics of online advertising, terrible place to work.",
        "role": "Account Executive",
        "date": "Nov 17, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "This position is extremely limited for horizontal growth within the company. Your Managers & the leaders of the company do not try to develop you as a whole-person, but rather they are only looking to help you grow within your sales role. Also, they start you at a small wage compared to many companies in the same zip code and lead by motivation with your future commission.This role is extremely demanding.…  Their expectations are high (in a bad way) & want you to become numb to your work. The company values seem to purely be about growth, money & revenue. This was a sad realization because I really did love the product before I started working here. I will continue to support it, but with an awareness of how the company works. Sales employees are as replaceable as the paper printout of your name.",
        "advice": "I believe you should motivate more with having employees believe in the product, not just the money side of the job.",
        "pros": "The office culture was interesting. It was great to have some snacks, drinks, a great coffee bar & happy hour w free beer after work. Coworkers were great! You easily make friends if you're in your 20s (like 90% of the sales floor) & a good number of people moved to San Francisco for the job, so everyone is down to explore!Although I did not have a good experience with the work, it is a great place to…  start if you are REALLY interested in INSIDE SALES. You move up quickly if this is the particular career path you're looking for.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Dec 3, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Base salaries are shockingly low for San Francisco - with the rent prices in the area it really is an unrealistic starting point. However, with different promotions and incremental base salary increases it gets better over time. Commission is great but with territory swaps etc, sales can be very up and down and unpredictable. I still feel like I work harder and am more stressed out than the majority of my friends wit… h a similar education and background - but make about 20k less. For me it's not worth it. There is extremely high turn over and you will see some great people go. It is super easy to get burnt out. It doesn't seem to matter what you do for the company one month you can overproduce by 400% but the next month if you don't hit quota it's as if they forget everything right you have ever done. The product is pricey and sales tactics that are encouraged are pretty intense. They claim to be transparent but when it comes down to hard facts they give you vague answers with a healthy dose of kool aid. It is very hard to sell impression based ad programs in a cost per click ad world, which I did for over a year and did not believe in the product. However, we did recently release a cost per click ad program that is a huge stride forward, but still has some big flaws. You will get yelled at, and you will get hung up on. If you want to survive here you need to be ready to make 60 - 80 cold calls a day, talk to people who absolutely hate Yelp and therefore take it out on you, and have a completely resilient personality. The reality is that people wait to hit their year mark so they can put it on their resume and then they run like a bat out of hell. I was there for a year and a half. Out of my starting class of 45 people, I think only 6 or so of us were left. With a 13% retention rate, I think you get the idea.**TIP - do not come to this company assuming you can start out in sales and then maybe transfer into a different department (recruiting, marketing, HR).. it is very unlikely this will actually be a possibility for you as they really only give you the opportunity to move into sales management.",
        "advice": "Work on employee retention. You lose amazing talent every single day and it's a serious issue. Pay your employees a living wage straight off the bat.",
        "pros": "Health insurance fully covered, recently started offering 401k matching, stock benefits (they are granting less shares now with newer hires), free snacks, big name on your resume (although some sales companies in SF specifically will not hire from Yelp), working in a youthful office environment with casual dress. The CEO and top tier team will hold meetings at the SF headquarters and answer questions and talk about u… pcoming updates/changes with Yelp. Fun team offsite events and happy hours.",
        "summary": "Not realistic for the long term, do not recommend to my friends",
        "role": "Account Executive",
        "date": "Dec 18, 2014",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "From day one they SELL YOU on why you are \"lucky\" to work there----\"you were hired in top 25 out of the 2K resumes we received\" \"People always leave and try to come back\" etc. The metrics are silly, and you are literally doing nothing but COLD CALLING alllllll dayyyyyy lonngggg. I did well there, however was burnt out after a little under two years. Huge turnover rate, I started with 27 reps and by time I left there … were 5 of us left. Constant revolving door, so if you are looking for a long term position this most likely won't be for you. If you want a little taste of corp culture right out of college, Yelp is wonderful.",
        "advice": "My manager was a rockstar, she was solid and always kept me motivated with her words. Not complaints there. Us reps always had names for the managers-----for example one manager was \"where you go to die as a rep\" manager. I know there are a lot of interoffice dating between managers but as along as it doesn't effect my work...I could care less. Oh one more thing, when you decide to venture off to another company----t… hey will completely disown you and treat you like your killed off your whole sales team.....clearly their motto is \"Yelp or death\"",
        "pros": "Benefits were great paid in full by company---a tactic they use to get college kids in their doors wanting to get off their parents insurance. Help yourself kitchen stocked with anything from redbull to humus. Energetic office and they put on nice parties for their employees.",
        "summary": "Great for the \"Righter out of college\" Kids.",
        "role": "Senior Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Grew too quickly, lost faith in many individual employees because they were hiring so many.If you don't do well, they refuse to believe any factors come into play other than what you are doing wrong.",
        "advice": "Train managers better. Find a way to make each employee fee valued.",
        "pros": "Young, vibrant environment.Super transparent about pay, opportunities to advance, etc.Good benefits.",
        "summary": "Typical sales job at a tech start up",
        "role": "Junior Account Executive",
        "date": "Jan 6, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Not an extremely high salary for New York City. Very high stress environment with most people not hitting commission each month unless you did exceptionally well. Also, they teach you to steam roll the sale with most sales coming on the first call.",
        "advice": "Set the expectation at hiring. I was told the average is right around 50K in your first year which can't be true unless they are manipulating the numbers somehow.",
        "pros": "Very fast paced and I personally grew an exponential amount in just a couple of months.",
        "summary": "Great learning experience but after a few months I was already looking for the exit.",
        "role": "Account Executive",
        "date": "Jan 19, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Cold call sales is not for the faint of heart! Starting salary is pretty low compared to other sales programs.",
        "advice": null,
        "pros": "Great culture and and perks! Has a fully stocked kitchen for employees with kegs and company happy hours! Stock options are great!",
        "summary": "Kegs & Cold Calls!",
        "role": "Account Executive",
        "date": "Feb 19, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "weird management style and aggressive",
        "advice": "select smarter people",
        "pros": "it was fun after college",
        "summary": "account executive",
        "role": "Account Executive",
        "date": "Mar 3, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's a call center, plain and simple. They have an upbeat culture to distract you from that fact. The culture is a little distracting sometimes. It's hard to hear the advertiser yelling at you on the phone while hip-hop music is blaring and your manager hula hoops by on a razor scooter (seriously). Yelp talks about how it's growing - which is true. But it's all lateral growth. They are adding more sales and AMs, NOT … more managers and other fun roles. The wait list to even transfer to another office, same role, is years long. The people that are in the non-call center jobs have been there 7+ years and are not leaving (and why would they? With paid trips to Mexico, telecommuting opportunities, and bonuses?!).Yelp used to have much more integrity than it does now. It caters too much to the needs (complaints) of the paid advertisers than the reviewers, which is sad and part of the reason I left.If you're comfortable being in a stereotypical call center job, being yelled at by customers (and threatening to be sued, seriously), begging angry customers to please not leave - this is a good place for you. At least compared to other headset wearing call centers, this place has free food and you can wear jeans to work.",
        "advice": "N-a",
        "pros": "Upbeat culture. Good benefits (100% insurance coverage!).",
        "summary": "Don't let anyone tell you Yelp is anything but a call center",
        "role": "Account Manager",
        "date": "Mar 7, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Amazing benefits and environment can be a total seller for some. While others is dependent on pay. If you're looking for a company that pays well as a base, don't expect Yelp to satisfy that hunger. Starting salary for all sales executives is 34K base, hardly enough to get by and definitely underpaid in the Bay Area as any other company starts you off at 50+ including commission.On that note, if you do well, … the commission structure is very decent. However, this probably only applies to the top 5% of the Yelp's top sales reps as the other 95% are generally average and don't make much after you consider living in such an expensive city and don't push yourself. They used to require employees to bring in double what they currently except before earning commission, but lowered it as their retention over the last 5 months hasn't been great - in fact, probably the worst in company history.They always tell you that it's not about territory, but it is. And they match the top sellers with top territories, Elites get first dibs, and if you don't do very well or if you're just average, you get average territories - which doesn't entirely make sense. They recently made a huge change and mixed up territories along with other changes. Needless to say, after failing 2-3 months, they changed it back because it wasn't well thought out and caused a lot of employees who have been there long term and short term to leave.New changes in 2015 has raised a lot of eyebrows. The compensation prior used to be more fair, as they counted your gross revenue rather than your net. You obviously have no control after you make the sale and how business owners manage their accounts, if they even do. And the Account Management teams are less than good. You'll have better luck managing your own accounts as each business gets a couple of AM's assigned to them during their advertising term because they keep leaving, with no word and your scared business clients just sit there, calling you ten times a week and flooding your emails because they have no idea what's going on.Retention is low. Given my time here, I would say Yelp retains about 20% of individuals after a year, maybe a little less. You have to consider the fact that the company is hiring 30-60 disposable individuals a month who are excited and drinking the coolaid, until they're not. At which point, the rookies have made more for the company than the company realistically pays you. If it's not you, it's another 60 new individuals every single month.Lastly, engineers are great - but your sales team makes the company money and sells products that engineers come up with. Don't just feed your engineers and have sales get scraps. Sales or anyone else in the organization (sales being biggest) get to eat AFTER engineers have their lunch - we get their leftovers. Unless you accidentally order pizza on the wrong day and have 80 pizzas delivered.",
        "advice": "Compensation is something that is contributing to your large turnover rate. I would highly suggest you consider compensating better rather than making it virtually impossible for anyone to hit their YSDP or making any real money unless you're one of the people consistently on the DSU.",
        "pros": "The best things about working at Yelp is the environment and support you get. Everyone wants you to succeed and pushes you to succeed. Really friendly managers, directors, and higher ups. You'll often end up in the same elevator as Jeremy and he'll joke around as if he doesn't own a huge company. Although a glorified call center, it has AMAZING benefits. The music is always blaring in the background from PG Hip Hop t… o dance music. They give you a $60 gym stipend, full benefits, decent stock plans (if stock does well, not like lately) and fully stocked kitchen daily with food and drinks galore. Amazing growth opportunities due to its expansion, and good commission plans, if you're good. The monthly quotas are attainable, but take note that you get as much as you put in, and you're ultimately rewarded well. Also, beer on 8, EVERY DAY. Occasionally we'll get IPA's because facilities is AMAZING, but we generally don't because we had some cases where rookies couldn't handle their liquor...",
        "summary": "One of the best experiences for an entry level sales job, but terrible pay considering.",
        "role": "Elite Account Executive",
        "date": "Mar 13, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Your call times and amount of calls made are logged everyday. If your metrics aren't what they like it looks bad. Constant pressure to sell and hit quota because this is determines whether or not you keep your job.",
        "advice": "Has your home phone ever rung and when you pick up its a stranger trying to sell you something like solar panels or try to tell you they can save you hundreds on your electricity bill? Well, when you get a job at Yelp you are doing the exact same thing. You are a cold call salesperson who is trying to sell Yelp advertising to a stranger over the phone. The management there don't like the word \"cold call\", but that's … what this is.This job for me was just a job. Liked it at first because the training was good and the people I worked with were fun, but as time went on I started to dread going to work and picking up that phone and hassle a business owner to buy advertising that they didn't need.At Yelp they try really brainwash you into thinking that Yelp and Yelp Advertising are the best thing since sliced bread and that if a business owner doesn't buy Yelp Advertising then their business will fail.If you are a 21 year old college grad and looking for a job to boost your resume a little before you move onto something more serious, or looking to make a little money before returning to school, then take this job. Other than that, Yelp is not a place to have a successful career.Lastly, now that I don't work for Yelp anymore and actually manage 2 very successful small businesses, I see the struggle business owners have with money. At Yelp you are taught that spending thousands of dollars a month on advertising should be a drop in the bucket. After seeing the books for a small business, and paying things like office rent, payroll, insurances, supplies, and things like that I now see that spending or saving the money that Yelp Advertising costs would be a much smarter business move. It's ironic that I now wouldn't even think of buying the stuff I used to sell.",
        "pros": "Can wear anything you want to work, fully stocked kitchens, modern office, team happy hours.",
        "summary": "If you care about the people you're selling to, don't work here.",
        "role": "Account Executive",
        "date": "Mar 21, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "lack of directionhigh turnaroundyoung managementextremely repetitive cold-calling",
        "advice": "Territories given to reps aren't all equal. Sometimes you get stuck with a terrible places to call which in turn effect ability to make a sale.",
        "pros": "environmentmultiple fully-stocked kitchensgreat co-workersfamily atmosphere",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Apr 14, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many cons.-extremely low pay-Super high quota-Your fate for success is out of your hands. It all depends on the territory they give you.-COLD CALLING IS BORING-declining company-Mngmt treats you like children-If you are not a giddy frat boy/sorority girl, this culture isn't for you-Promotion is based on how much of cheerleader you are, rather than intelligence and effort",
        "advice": null,
        "pros": "Great Training programGood start to a sales careerGood Kitchen, ping pong table",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "May 29, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Too many cons outweigh the pros:- Cold-calling is the only thing you ever do (this is warned in interviews and applications but it is a shocker when you actually only do it all day long)- The turnover rate is so high.There are new sales training groups every single month and people either quit or are fired almost every week. They have so much empty desk space that is continually not being filled.- Managem… ent micromanages you all the time with your calls, daily metrics etc.- The success of your experience in sales does heavily rely on your territory no matter what they say- The environment can feel very immature, noisy and unprofessional with loud cheering, swearing and clapping etc...- Essentially you are chained to the phone day in and day out either getting hung up on or occasionally talking to small businesses- Pay is low and the only opportunities are to just get higher in sales",
        "advice": "Stop micromanaging. Think about diversifying the company away from just sales + focus on growing the user base that is quickly diminishing.",
        "pros": "Co-workers are all really young and fun to be around, fully stocked kitchens, cool office and great location",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Call center, high pressure sales, lots of push back. No long term future.",
        "advice": "Offer lower price advertising",
        "pros": "People, off site activities, free lunch and kitchen.",
        "summary": "Good culture, bad job",
        "role": "Account Executive",
        "date": "Jun 7, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "You find out very quickly why the focus on great work culture is so strong. The work sucks. Cold calling into over picked territories in which the only advertisers are Home Depot or Ruby Tuesday. Most of your time will feel wasted on conversations with people who want nothing to do with you. I did the math once and realized I'd have to call 723 unique businesses in my territory before I made a sale (purely statistics…  based on current advertisers). If you are even a remotely intelligent person you will not last longer than two months. It is hard to derive satisfaction from this job.",
        "advice": "Management needs to get their stories straight. Every manager has a different piece of feedback. Can be very confusing when you're told so many contrasting sales approaches.",
        "pros": "Amazing work culture. The people are fantastic. So many benefits. Yelp is very transparent about their expectations of you. You'll always know where you stand.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jun 14, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "This section could get quite lengthy so I will keep it as short as I can. To start, this is an entry level job and I would not recommend this job to anyone who thinks otherwise. Like to refer to this job as a call center dressed up as a Tech Sales job... The managers here are pretty chill but they treat it almost like a summer camp in some ways and they continually demand an unhealthy workload in terms of daily dials… . You will find that retention at this job is very low and more than half of your training class will be gone by month 4 on the job.I think the hardest part for me was to see that Yelp doesn't invest anything into their sales force. The compensation is poor, you are tethered to your desk by a wired headset (wireless headsets should be a standard, but Yelp rather make you earn that through revenue booked). It's just sad that a company with so much negative publicity is just as ugly on the inside. I think they'd be best served to take some action.",
        "advice": "Fix your sales structure and retention will go up - INVEST in your sales reps.",
        "pros": "The culture and people you meet are awesome (for the most part). There is a fully stocked kitchen that can hold you over with some snacks. You do get confidence in talking on the phone and learning how to get what you want through sales.",
        "summary": "Yelp Account Executive",
        "role": "Yelp Account Executive",
        "date": "Jul 5, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "There is very little room for growth, and opportunities are few and far between. While I enjoyed the culture, it felt very cliquey. If you are over 22, Yelp is not the right place for you. I felt tethered to my desk by my headset, and being told off (I use this term euphemistically) by auto shop owners or bakery owners was demoralizing. The on-target earnings (or \"average salary after year one\") is *not* realistic. T… he base is abysmal and the threshold for commission takes far longer than advertised. Even then, only the top 1% of reps make anything worth putting into your savings.",
        "advice": "Managers are young, hungry, and expect the best. Remember -- try to win hearts and minds before you hit quota. Pay attention to other reps -- reach out to them. It might save them.",
        "pros": "I enjoyed the camaraderie and the team-building a lot. It felt like summer camp most of the time -- or Chopped, since they had us use kitchen items to create a unique dessert after our first week. The training, in all honesty, was invaluable, and opened tons of doors for me. I absolutely loved my floor director, but felt it was hard to connect with other managers on the floor. The free beer was a nice perk, too.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jul 7, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Salary (36K is a slap in the face)- Management is too young. You feel like you are in a HS environment.- Feeling pressure to go to team offsites- No growth opportunities- You do not feel valued as an employee. We have pool tables and ping pong tables but no one ever uses them because we have to be on the phone all day long. If we take breaks longer than 10 minutes to relax after a bad phone call we … are asked to go back to the phones.",
        "advice": "You are hiring sales managers that are too young. They try to be your friend and your manager, which does not work well. Then managers tend to isolate account executives that they do not like as much. I also do not like the idea of being guilt tripped into a team offsite.Pay your employees at market value please. Other companies such as Zenefits and Glassdoor are paying their account executives at a very reas… onable rate.Message for HR: You are supposed to make employees feel comfortable to talk to you about what is going on. HR is very judgmental and rude.Lastly, please listen to your account executives. We have first hand experiences with business owners and we NEVER take their concerns into account and report back to upper management on what we can do to make improvements to the program.",
        "pros": "- You become more resilient after being hung up on so many times on the phone when trying to sell Yelp Ads.- Fully stocked kitchen with snacks- You get a lot of recruiters reach out to you once you have been at Yelp for 2 months.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jul 15, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "long long long long long hours",
        "advice": null,
        "pros": "great work environment, lots of friends",
        "summary": "Ok",
        "role": "Anonymous Employee",
        "date": "Jul 29, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "This is the most soul sucking environment I have ever had the displeasure of working in. I went into it knowing I was taking a ridiculously low base, but figured a company as \"great\" as Yelp would be worth it. I couldn't be more wrong. I literally drove myself into debt and sadness working at this hell hole. This is absolutely the worst paying sales job, and worst commission structure you can find in San Francisco.… r>Oh, and their earnings call was less than satisfactory...again. Do yourself a HUGE favor and get out, or stay away, before this place goes under.Jeremy- treating your employees well goes a long way in a company culture. You should really look at the extremely high turn over your salesforce sees and realize there is a huge problem there.",
        "advice": null,
        "pros": "Amy's frozen burritos?Met some life long friends (all of whom have quit as well)",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jul 31, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "I felt so disposable. People drop like flies. It is a cut-throat environment. They expect you to work from 7am - 7pm, and then they got sued for only paying 8 hours a day so I later got a check. They fire a third of the people and don't care that people left other jobs or moved for this job. I was not motivated to invest myself in the company and they did not invest in me, they just fire you!",
        "advice": "I do like seeing Jeremy and Darwin around!",
        "pros": "Gym reimbursement. Free beer and snacks.",
        "summary": "They might fire you out of the blue, so keep other opportunities open!",
        "role": "Account Executive",
        "date": "Aug 21, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you get the wrong territory or a bad manager it's miserable.",
        "advice": null,
        "pros": "Great company culture but a little \"fratty\" at times. Cool company parties. Great place for a first job. Put in a year and get out.",
        "summary": "Good Place for first job",
        "role": "Account Executive",
        "date": "Aug 31, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "At the recent all hands meeting (with all staff/workers) there was some mention of the \"unicorn bubble\" of startups offering sales reps double the salary causing them to jump- and it's true, the base pay is godawful, this is even joked about during training. They spew constant BS about you \"being your own CEO\" and \"managing your own leads\", etc. but once you leave here and go to a job where you're not being monitored…  24/7 and treated like an adult you'll see how bad it actually was. If you're not making enough calls to your manager's liking you will receive friendly gchats \"45 calls??!\" which is always appreciated. Furthermore there are no inbound leads at all. You are cold calling straight up all day. A lot of sales jobs once you rack up the Yelp experience will pay you 15k more, give you inbound leads, and treat you like a human being rather than a calling robot.The ad program works in NYC and California and some other highly populated markets. It does not work in small towns and it does not work for many categories. Cost per click is a much better program than CPM, we have the stats to prove it, but especially if you're in a bad area they still make you push this antiquated awful program to 95% of your clients. I've had problems sleeping at night selling the lowest level CPM but have to do it because the client won't do anything else. And then it doesn't work and they get mad. -.-There are also asinine comp battles you may have to fight due to an account deciding they want to sign up for \"self serve\" advertising after you send a contract for full service advertising, or when two people own different locations of the same account, or other really dumb things. So sometimes you will get denied compensation for a deal you rightfully closed. Yay!Mandatory happy hour fun time. This is where your team gets together for drinks and tries to convince each other that Yelp is the best place to work of all time, period. Multiply this by ten during company parties.",
        "advice": "Pay 10k more and turn it from a call center into a real sales opportunity and people won't jump as easily, ie stop micromanaging after the first month and let people sell. Give a few inbounds to everyone.",
        "pros": "You learn lots of sales skills and because they thoroughly train you, you can get out of college, milk the benefits, then get a real sales job after a year or so. The people are also really great. The rewarding part of this job was calling someone out of the blue and 30 minutes later you get a $7,000-$10,000 sale. If you can do that you can do pretty much anything.",
        "summary": "Good first year experience after college. After that, kick it to the curb.",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Poor management. Horrible hours. Bad territories. No help in trying to succeed. Managers are all too young and inexperienced.",
        "advice": null,
        "pros": "Great people and fully stocked kitchens. PTO is effective immediately.",
        "summary": "Account Executive (sales)",
        "role": "Anonymous Employee",
        "date": "Sep 9, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The job is monotonous to say the least. If you're someone who can't sit in front of a computer screen all day literally tied to your desk, please don't apply. If you're someone who crazes new projects, team collaboration, fast-paced work environments, please don't apply. If you're someone who wants to make a meaningful contribution to society through the work they do, please don't apply.",
        "advice": null,
        "pros": "Working for Yelp is a great opportunity for anyone who is self-motivated with a singular focus of making money. They give you all the training and advice you need to go as far as you want in terms of climbing the sales ladder.",
        "summary": "Takes a certain kind of person to do sales",
        "role": "Anonymous Employee",
        "date": "Oct 7, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "They promote managers from the sales force that are utterly clueless about how to manage people or motivate. Despite the attempt to be trendy with blasting music and free junk food it's a straight up boiler room. The turn over rate is beyond belief. Very few stick it out not when other companies offer way better money and commissions. They are behind the times stuck in a time warp.",
        "advice": "Sell the company or clean house from the top down. There are no more new ideas coming from J & J boys and girls.",
        "pros": "Looks good on a resume and training in their CRM will be a foot in the door to other companies. Health benefits are good as you pay little or nothing.",
        "summary": "Phoenix - boiler room no matter what you call it",
        "role": "Account Executive",
        "date": "Oct 12, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "too competitive, not supportive or flexible",
        "advice": "be more flexible to the trainees",
        "pros": "Good training program, good benefits",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Oct 13, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "As a programmer I was pressured to weaken privacy criteria. Yelp! privacy settings allow only your friends to view your full profile, while a limited profile is still accessible to other YELP! members. You can see the last 100 people who have viewed your profile and, if necessary, you can block individual members. You can also limit the continents that can see your profile. For example, if you want your profile to re… main public but don't want unsolicited comments from people in other countries, you can set your profile so that only people from North America can view your profile. I told management I was troubled by this direction, and I was terminated.",
        "advice": "Sinking ship becoming irrelevant. So in this digital autopsy, the cause of death was a drop in the cost-to-benefit ratio. “This measure can be seen as a precursor of the later collapse of the community,” they conclude. But a contributing factor was also the k-core distribution.There are clearly lessons here for today’s online social communities. Indeed, the collapse of Yelp has more than a passing resemblance…  to the collapse of Digg, a social news aggregator, following design changes that presumably altered the cost-to-benefit ratio for its users. However, it's k-core distribution must also have been a contributing factor.Yelps mobile initiative has failed thus far and stock keeps dropping. Focus on the privacy of your users; not on the quarter.",
        "pros": "Technology is solid. Free iPhone. Good yogurt in cafeteria. Management focused selling vested options ASAP. As social media sites go, this site is not visually appealing. Ads take up the right side of the page and the entire background advertises one of the featured reviews. You can receive notifications and inbox messages, but within a day of setting up an account, a handful of spam messages had already been sent to…  our inbox. While Yelp! was once very video friendly, it has moved away from its focus on reviews to upsell to small businesses and sharing.",
        "summary": "Yelp! Sinking ship. No credibility",
        "role": "Programmer",
        "date": "Oct 14, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The sales job itself is awful. I felt like my soul was being sucked out everyday. Training isn't bad, but the actual job was not fun. Not ethical. Not \"helping people connect with local businesses.\" This job is about making a sale and that is it. It's not about anything else despite what they tell you in training.If you're a ruthless salesperson who doesn't care if the product actually works or not, this is y… our dream job. But, if you genuinely want to help businesses and do what's best for them, stay away.Most of the people I called hated Yelp or had no interested in Yelp advertising. But, these are just excuses because every business needs Yelp and we need to sell them 24/7. No. Sorry, but rural areas in random states don't need Yelp advertising. It's pretty apparent that it only works in cities. If you do take this job, you'll be amazed how good you get at lying! Is that a pro or a con for you? Think about it.Metrics heavy: you need to make 70 calls and have high talk time every day. This is extremely stressful but it can be done. I did it almost every day.Managers: this is actually a joke. The managers are all 22 or 23 and seem to have never been in a leadership role before. Getting that manager position depends on how good you are at selling...their job consists of monitoring their team and listening to what you're saying on the phone. To be honest, it looks like the easiest job in the world. Just listening into calls and making fun team events. And firing people.Attitude: if you don't have a \"I drank the Yelp kool-aid\" attitude 24/7, they will can you. You're expected to be close with your team, which is absolutely ridiculous. Work is work and if people get along at work, that's good enough. This is supposed to be a career, not high school where you have to be BFFs with everyone. You have to be smiling - they watch you. You have to bleed yelp from your glowing face every single day.Cursing: I don't know if it's just me, but having your boss or your boss' boss curse at employees is just super unprofessional. It happens a lot.These people are nuts about money and you should know that whatever they fill your head with during training better stick. When it falls apart, like with me, you start to realize you physically and mentally cannot and will not do this job anymore.The benefits are great, but at what cost? This isn't the part where you decide if sales is for you. This is the part where you decide is Yelp Sales is for you.",
        "advice": "This entire company needs fixing...Starting with the expectations of helping businesses down to the management and practices.",
        "pros": "Amazing benefits: great medical/dental/vision.401k, free breakfast, lunch and snacks. Plus a coffee bar. The company has a lot of fun events, too. You have to remember they have money & like to party. These benefits are vital to actually keeping their sales people for more than 2 months.",
        "summary": "Associate Account Executive",
        "role": "Account Executive",
        "date": "Oct 19, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "On a computer ALL DAY...Cold calling all day... College like atmosphere, very young office. If you're looking for something thrilling this isn't the job for you.",
        "advice": "None. Management does there best to make up for the boring job.",
        "pros": "Fun work environment. Yelp cares about the employees.",
        "summary": "Sales",
        "role": "Account Manager",
        "date": "Nov 3, 2015",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "80 Cold calls a day, terrible management, immature work environment (frat boy mentality and huge lack of professionalism), false promises of promotions, huge company that doesn't value sales people unless that are generating unrealistic revenue, favoritism and sexism run rampant.",
        "advice": "Give your sales people actual leads. Cold calling is not effective. The stock didn't plummet for no reason - the culture and user experience need a serious face lift.",
        "pros": "Free food, good health care",
        "summary": "Spend the rest of your life cold-calling!",
        "role": "Junior Account Executive",
        "date": "Nov 4, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's emotionally draining when you are trying to sell a product that is not needed/wanted by a lot of business owners.",
        "advice": "Much more organization and fixing up to do. Be more realistic/less over-promising during training.",
        "pros": "Great benefits. The people. I loved my sales team and other co-workers.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Nov 12, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The most obvious is shady selling practices. Multiple reps quote figures that are absolutely not correct and don't care as long as they get credit for the transaction. Secondly, the overwhelming majority of business owners do not like Yelp at all. Management mentions to ignore former notes--however very often those notes are accurate. Lastly, the territory you are assigned WILL effect the level of success you have.",
        "advice": "Be more open to switching territories. There are certain areas of the US and especially Canada where there is an educational gap and as a result selling is very difficult.",
        "pros": "Some pros include: fully stocked kitchen with wide variety of snacks/foods. Healthcare is fully covered which is a huge plus. Certain businesses do very well using yelp as a form of advertising.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Part time job, working weekends and nights, no upward mobility, no training from HQ, job responsibilities change based on needs of your CM.",
        "advice": null,
        "pros": "Great learning experience, exposure to challenging opportunities, critical thinking and creativity, not boring and always something new to do. Cool swag.",
        "summary": "Marketing Assistant",
        "role": "Marketing Assistant",
        "date": "Dec 27, 2015",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Cold Call/Smile and Dial- Very hard product to sell because most prospects don't need or want it- Some territories are better than others and can lead to resentment amongst employees- Promotions seem to be based off of only revenue booked which leads to some managers being promoted to early and struggling on the floor.",
        "advice": "- Make territories more equal- Promote a more professional work environment",
        "pros": "- Great coworkers- Pretty good benefits- Fully stocked kitchen and coffee bar",
        "summary": "No long term potential",
        "role": "Anonymous Employee",
        "date": "Jan 3, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Tough sales job, constant cold calling, micro-management, limited career options",
        "advice": null,
        "pros": "Great people, city location, nice office, don't have to work beyond 8hrs daily",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jan 6, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "High-school feel, cold-calling, unprofessional, no advancement other than barging calls.",
        "advice": "Be more professional and be equally attentive to everyone.",
        "pros": "The food available to you.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jan 7, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "It's a tough job. You need to put 100% everyday to make baby steps. Pay is less than competitive. To hit quota (which is very hard to hit) you get a small bonus of 600 dollars. In order to make a decent amount, you need to triple your quota. It's very hard to blow your quota out of the water consistently- meaning it's hard to make bank at this job. It also doesn't help that business owners have a negative view on Yel… p as a whole which makes our job so much harder. Good luck.",
        "advice": "Adjust quotas based on territories, and increase pay. You all know how hard it is to hit quota so make it more of an incentive to hit it.",
        "pros": "You work with fun people, but that doesn't pay your bills.",
        "summary": "Meh",
        "role": "Account Executive",
        "date": "Jan 13, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Cold calling, cold calling, cold calling... and more cold calling (its literally all you do)-Managers only care about you hitting the numbers which they make physically impossible unless you make over 150 phone calls a day. Yet they want you to send out an email to every client you spoke with AND close deals. Its impossible.-The management is terrible and they are young/untrained/ immature-If you have a … different selling style or need an extra little help they will fire you-HIGH HIGH HIGH TURN OVER RATE !!!!! Beware",
        "advice": "Train you managers to not talk down and only care about numbers. You should care more if your team is making connections with their clients, thats what will close the deal! NOT INTIMIDATING THEM. Treating business owners with no respect isn't what will get them to hand over money.",
        "pros": "-GREAT ATMOSPHERE (music, kegs on fridays, open office, open kitchen)-Young and friendly employees work there, great opportunity to make new friends-Trains you how to work on Salesforce-Hire people right out of college",
        "summary": "If you love cold calling, this is the job for you!",
        "role": "Account Executive",
        "date": "Jan 25, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "immature managers, unprofessionalism, claim to be “transparent,” but are anything but",
        "advice": null,
        "pros": "cool office space, cool brand",
        "summary": "High School on Steroids",
        "role": "Account Executive",
        "date": "Feb 2, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "making 65-80 cold calls every day, they give you a bs territory when you first start, if you start in sales thats where you will stay so you have to really like sales",
        "advice": "all of the do's and don'ts should be made clear the first week of training, not the last.",
        "pros": "free food and coffee everyday, great people to work with, the company pays for team outings, training is helpful in general if you want to learn how to sell",
        "summary": "don't work here unless you REALLY love sales",
        "role": "Anonymous Employee",
        "date": "Feb 11, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Oh, where to start. First, let's talk about the environment. Don't let the toys fool you, no one ever has time to kick back and shoot hoops when you're expected to stay (quite literally) chained to your phone making more dials as the same loud pop playlist blares in the background of your calls. I often only see managers playing games, ironically.Last week our director tried to leverage the free food and coff… ee as to why our base salaries are so low. Have to say, that was pretty weak. Cheap lunch meat with 1,200 hands in it everyday and a barista station I personally never use are not good reasons to underpay employees. Fully paid benefits are nice (way to stay competitive with literally every other tech company), still no excuse for a 35K base when most people don't see commission for a year or more (if they don't quit sooner.) I took the job to get experience, but probably wouldn't have if they didn't overpromise on the commission front.Which brings me to yet another con: territories. Managers will find a way to make you pay for even bringing it up, by giving you a new (but worse) territory or just giving you the cold shoulder with your concerns, but whether or not you succeed here largely depends on where you call into. Makes sense. You will close way more calling into a metropolitan American city than you will Nowheresville, Canada. But they act like everyone is given equal opportunity. Even if one area has 5x the volume of sellable businesses, they act like it's entirely your problem if you're not reaching the same numbers in your \"non-Yelpy\" territory. What's worse is that you're stack ranked solely on revenue, so all contests, promotions, shout outs and accolades are awarded to high sellers, no matter the advantages they have in the territory system. Territories can be switched without notice org-wide, which happened recently, and you will lose all of your accounts unless you can close but 15 of them in 15 days. Lastly, like I said, everything is stack ranked per revenue, so your next territory is based on how well you do with the one before it. Do I need to explain further?Managers. Mostly 23-25 year olds with no previous experience and have only ever worked for Yelp. They will cheerlead you until the cows come home, but at the end of the day they're there to babysit your metrics and make sure you're putting out 80 dials and 2.5 hours of talk time daily. Other reps have had better luck, but no manager has ever been able to help me close a call. I have had 4 of them so far. Just goes to show you success at Yelp depends on the hand you're dealt up front in terms of territories and management.Meager time off. Meager sick leave. An overall very stressful job with little returns on your investment with Yelp. Now I know exactly what a boiler room is.",
        "advice": "Stop over promising. Let people know they most likely won't make scratch past 35K in year one, and that even top performers aren't pacing for 65K thereafter.Stop boasting the \"7th most popular place to work in Chicago\" to frustrated veteran reps. It's obvious feedback would differ if you weren't hiring thousands of new grads with no previous experience. Volume and naïveté won that rating for you at the end of…  the day. This is a straight up telemarketing operation that's great for experience, but pays nothing.",
        "pros": "Great training for entry level inside sales reps. You will learn how to approach decision makers, set appointments, qualify your leads, and attempt to sell Yelp's display ad products as a solution.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Feb 17, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Stressful, low pay, poor management",
        "advice": null,
        "pros": "Fun startup environment, perks, friendly co-workers",
        "summary": "Could be better but not a horrendous first job",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The job pays peanuts, management pushes you to believe that \"anything is possible,\" that is a half truth. Commission structure is such that only the top performers will ever see anything above base. Success is highly dependent on your territory, and you're stuck with what you get for months, calling and recalling angry business owners. It gets old very fast. Turnover is high. For many this is a first job post-grad an… d once they stop believing the hype that management forces down their throats, they jump ship. Some of the training presentations are laughable, still referring to themselves as a \"startup\" despite being a massive publicly traded company. Statistics given as sales ammo to send to clients and in training are all conveniently tailored to hide the last couple years of downward trends. The advertising product can work for some, although most sales seem to be to owners who do not fully understand what they are buying. I did not feel good about many of my sales, feeling scummy for selling expensive packages to businesses who could not afford them nor fully understood how to use the site. My biggest problem with the job is not talking down furious owners who hate yelp with a passion, but the reality that every quality lead has been called 50-100 times in the last few years and they know the snake oil you are selling the second you tell them you are from Yelp. Absolutely soul crushing. The pop music blaring on every sales floor becomes distracting and highly annoying. Unless you perform extremely well and can move to a management role, the job stays the same all the way up the ladder.",
        "advice": "Be real with trainees. Its possible to hype new employees on the company without outright lying. Other than that I have no constructive criticism for a deeply flawed sales program.",
        "pros": "Young hip co-workers, Free food/ beer, nice offices, company name recognition,",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Feb 28, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Its all cold calling, the leads that you get have been worked through by several other reps before you get them as a new Account Executive",
        "advice": null,
        "pros": "The company culture and the fun work environment was unlike anything I have ever experienced before.",
        "summary": "Accout Executive",
        "role": "Anonymous Employee",
        "date": "Mar 30, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Huge double standard between technical and non technical teams, people don't say hello to you in the elevator, low pay, very little chance to grow, operations and payroll are very slow to respond.",
        "advice": "Try and find out how people are actually doing. Most folks on my team were miserable and felt anything but the happy go lucky culture you claim the company has.",
        "pros": "Yelp offers pretty good benefits in terms of health insurance, PTO, sick time as well as free snacks and stocked fridges. Definitely a good place to launch your career after college but I would leave after a year.",
        "summary": "Good launching pad and that's about it",
        "role": "User Operations Associate",
        "date": "Apr 2, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Favoritism and promotions to highly unqualified people. Management is shady. Questionable sales tactics. POOR PAY.",
        "advice": null,
        "pros": "Cool location in SF. Honestly, that's about it.",
        "summary": "Low pay, frat-house environment, terrible management",
        "role": "Senior Account Manager",
        "date": "Apr 2, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Hoards of people hired per monthLots of turnoverCold calling all day is horrible",
        "advice": null,
        "pros": "Lots of young peopleSnack roombeer room",
        "summary": "Blah",
        "role": "Anonymous Employee",
        "date": "Apr 7, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Yelp is run like a high school. Every manager wants to be buddies with their team and you get 'a talking to' if you decide you don't want to partake in every happy hour or house party the team decides to throw. The maturity is lacking in both lower employees and management. The management that is there is very young and for the most part don't understand how to manage or guide a team or work one-on-one with their tea… mmates.",
        "advice": "Stop encouraging a drinking mentality and focus on work while at work. Everything is centered around booze and partying. Almost 90% of the incentives were alcohol related - there are more things to do than drink yourself stupid on the company dime.Stop promoting people that have only been with the company 1-2 years max, in their first 'real' job, into management positions. They have no idea what it takes to manag… e. A good salesperson on the phone does not equate into a good manager.Lastly listen to the board of directors. You have a crap-tastic rating by business owners because you aren't winning hearts and minds and many managers are actively working against that push because it's 'too nice/soft' and won't sell anything. I get that you need to hit numbers, but that shouldn't be at the cost of ruining relationships with small businesses, which just keeps happening more and more.Also pay people over time!!! Stop having people vet on the weekends or after work from home! I can guarantee that at least 25% of your workforce is lying on their time sheets to make it look like they're working only 40 hrs each week so they aren't patronized by their manager. (This last one isn't true of all managers, but many of them.)",
        "pros": "Yelp is a solid job straight out of college. It will teach you some great skills; how to work in large groups as well as on your own, understanding salesforce, how to navigate business conversations, cold calling confidence, etc.",
        "summary": "High School again",
        "role": "Elite Account Executive",
        "date": "Apr 11, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "So this is where it gets fun...you are a telemarketer. They try to dress it up as warm calling because they already have a Yelp page but you know you are calling business owners, disrupting their day to try and hock expensive advertisingWhat they expect is 2 pitches, 3 appointments, 65-80 calls per day and 2 1/2 hours talk time. The problem is they covet pitches SOOOO much that you end up completing pitches y… ou know won't close so you can hit their pitch expectations. Pitching 10 times or less can easily get you fired. Not hitting quota enough can get you fired. Not smiling enough, you guessed it, fired.It's a high pressure environment filled with loud music, cheering, and screaming. They try to overcompensate for how crappy the job really is by giving you freebies and acting like this is a dream job.They say territory doesn't matter, but it SURE does. Get some place in rural Michigan, let's see how long you last. If you get that territory you will end up spending hours explaining what Yelp is, struggle to find good pitches, and if you close deals they will be low inventory so you get basically no revenue.If you get a GOOD territory that's half the battle. Most territories have been picked clean. The size of the territories continues to go down because they are hiring so many people. The ones making huge amounts of money have NYC, LA, Chicago etc. They make it seem like you too can make 10k commission checks. If you do get a good commission check, chances are you will struggle the next month because you worked all the good leads, now have to trudge through garbage for months until you get a territory change.Business owners are going to hate your guts. They get calls so often that once they hear Yelp they hang up. Call a bit more and they will block you, forever closing off the ability to talk again.There is a ton of hate around Yelp as well and lots of claims that they are extorting business owners. It's not true, but tell that to the angry man on the phone screaming at you.Until they change this mantra of pitch 800 times a month, things wont get better. They are hiring idiot kids out of college that couldnt get a job elsewhere to man the phones to chat with business owners that have been in their professions for 80 years. Somehow they have to act like they know what's best for them.Managers will tell you to be super pushy to the point that the business owner will be totally turned off and never answer your call again. They want one call closes consistently which is illogical. The way they want you to pitch is WAY too needy. Basically peppering them with why don't you want to get started? What is there to think about?",
        "advice": "Hire real managers, ones that know how to play to a reps skills. Start becoming more professional so you attract better reps and stop hiring so dang much. Expand the territories and offer more and cheaper options for business owners.",
        "pros": "All the nice perks of a tech company:Free Medical, Dental, and VisionFree Beer from the kegs after 5:30pmTeam Happy Hours where your manager will buy you at least one drinkContests and referral bonusWell stocked kitchensLots of cool 20 somethings, you will make lots of friends",
        "summary": "Here's the REAL story",
        "role": "Account Executive",
        "date": "Apr 11, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Fake attitudes from management, too much focus on metrics and making calls ( even if half the territory has disconnected numbers, they want call volume to be high), management is too young to lead a team. Directors here are a joke. they prance and dance around the office.The music in the office is no where near professional, lots of curses and vulgarity in almost every song played. Higher ups do play favorite… s, even though they say they are transparent, the managers tend to lean towards the first few reps to close and then stick with them through almost every call.Every incentive was based on drinking.Felt more like a college frat house then an office.",
        "advice": "If you're going to say you are transparent, then behave so. Your actions will be reflected in the other employees. If you are going around dancing at 11 am or 2 pm, in front of employees in the middle of a sales floor, you look highly unprofessional, and do not come off as someone others want to strive towards.Stop playing favorites. If a rep is having a tough time closing deals, figure out why in regards to … closing language ( metrics don't determine everything).",
        "pros": "Friendly co-workers, everyone starts at the same position, so the workers around you, whether 2 months or 2 years, have done what you are doing.",
        "summary": "Sales account executive",
        "role": "Anonymous Employee",
        "date": "Apr 15, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The actual work. Its telemarketing. Don't let them sell you on this gig with the 'perks'",
        "advice": "Reduce the quotas to receive commission. You first have to make 30k in sales to start, then every month you need to hit 12k to receive commission",
        "pros": "The people are great, the kitchen is great, the 2 drink beers on Friday are great",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Apr 24, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Monotonous day after day routine pounding the phones gets old fast. A vast majority of the clientele HATES us, which makes calls interesting to say the least.Basically, you will be a glorified telemarketer in this role",
        "advice": "Congratulations on being a great b.s. artist! In all honesty, you are in your positions because you have a gift that many of us don't. Loved working there, but hated the day in and day out.",
        "pros": "Amazing company culture, environment, and coworkers",
        "summary": "Ups and Downs",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "High turn overmanagement keeps secretsno transparency about how or why certain things are in place for clients and staff",
        "advice": null,
        "pros": "Great peopleOpportunity to make a lot of moneyDifferent routes for growth",
        "summary": "Little Transparency",
        "role": "Junior Account Executive",
        "date": "May 18, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Call Center Customer Service role-Low pay-Limited moment outside of the account management department",
        "advice": "Be transparent about the changes you are making and where the department is going. Communication has seemed more honest and open the last few months which I commend your for, keep looking for input. The role started out fun and challenging and was gradually and slowly mutated into an inbound call center. You will do nothing but answer the phone and get cursed out, threatened, and yelled at by local business owners. Y… ou talk about reviews 95% of the time and can do nothing about them, that polarizing aspect of the platform will eat up your day, time, and soul. Previous perks have been stripped away as they tighten the reigns on cost. Unfortunately the Account Management department will be one of the most susceptible as its several hundred phone answering monkeys. You will learn absolutely nothing about actual advertising and set yourself up for a career of pretending to care that someone hit the gong for doing the bare minimum their job requires. Motivated and driven people have all left do to the changes of the department and have been replaced with mediocrity. Fun environment at times and good perks but not enough to cover up the fact that you are doing a soul less job that should and eventually will be outsourced. If you want to do nothing but call people who don't want to talk to you and take calls from angry business owners than this is the role for you. If you want an actual career in the advertising field I suggest going to an agency. They will burn you out and do not try and keep employees because they can replace you with a cheaper and naïve new grad when you quit.",
        "pros": "-The people you work with are awesome-Fully Stocked Kitchens-Benefits are solid",
        "summary": "Account Management",
        "role": "Account Manager",
        "date": "May 22, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "really inexperienced management, very hostile work environment and not a great culture. Sometimes felt like a sorority because of how cliquey people were. Salary is not enough to live comfortably in SF, and it is very hard to hit quota.",
        "advice": "dont micromanage your employees",
        "pros": "free snacks, good entry level opportunity, gym membership",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jun 2, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The pay in this department is ridiculously low. Its so low to a point where you would have to get a second job. The pay really upsets me a bit because it was lower before I got there but they gave a raise like it was such a big deal but they are nowhere near the pay other companies are paying for a support member. On top of that, because they try to Match Yelp on its holiday schedule, they DO NOT PAY HOLIDAY PAY. If … you were scheduled to work a holiday, you have to request a day off in which you get paid for. That is ridiculous in my opinion. Most would rather take time & a half pay rather than an extra paid day off.",
        "advice": "You are all doing a great job.",
        "pros": "Great Environment.Great SnacksEveryone who works for Yelp is so uniqueBeautiful buildingEat24 couponsThe work load isn't stressfulManagement is very understandingManagement does what they can to help you",
        "summary": "Eat24 Customer Support",
        "role": "Customer Support",
        "date": "Jun 4, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-It's HARD. The job in theory is easy, but it's a difficult product to sell. Especially if you have morals.-It's cold calling. No one wakes up and says, I want to cold call. Forever. But that's what you'll be doing.-I hated sales. I hated the people I worked with me because of the phoniness that comes with sales. But it IS a great learning opportunity.- I was never NOT stressed. I was stressed about hitti… ng quotas, about getting berated on the phone, about the gossip in the office, about failing. It's an emotional job. But alas, that is sales.-People hate Yelp. They do. They blame Yelp for their poopoo business practices. Guess who gets to hear about how much Yelp sucks? You do. Every time you pick up that phone to call a business, you're either going to get ripped a new one, or blown off.",
        "advice": "Find a new way to make money. Yelp advertising isn't going to be profitable for much longer.",
        "pros": "-Great company culture for the most part.-Good benefits-(Most) people are cool-If you're good, promotions come quickly.-Good opportunities to make commission-Great first job out of college*If you are seeking a job in sales, this really is a great place to start. Every company in the Bay Area poaches Yelp employees for sales jobs because of their stellar training program.",
        "summary": "Good for some - terrible for most",
        "role": "Anonymous Employee",
        "date": "Jun 16, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Excessive firing due to constant hiring classes each month. No true direction or guidance as an AE because everyone tackles the job differently and in different methods, but expect you to follow them all. Little to no diversity. Hit or miss of an experience if you get a terrible manager that doesn't care for you, or is biased to certain individuals on the team.",
        "advice": "smaller teams, more ASTMs, more diverse selection of people, larger compensation packages for AE's, and more investment into each employee.",
        "pros": "Health, Vision, Dental Package, snack availability, youthful environment (Feels like 5th year of college) full time barista, beer taps in office.",
        "summary": "Fattening You Up, Leave You For The Kill",
        "role": "Account Executive",
        "date": "Jul 15, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "If you are stuck and feel like you aren't getting anywhere your manager won't like you. Cold-calling sucks a lot and if you are struggling they don't care about you. Actually they don't care about you unless you buy into this cult like culture. It's cool at first, but then it gets a little over the top. They also claim to have a good work/life balance, but encourage people to work on sick days and work on days off.",
        "advice": null,
        "pros": "Depending on the manager you have, you will have a great support system. The perks are good and the kitchen and barista are good.",
        "summary": "It's okay",
        "role": "Anonymous Employee",
        "date": "Jul 17, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The management in AM land is far from truthful or honest. The Yelp values are merely words, never actually practiced by any person in charge. If you dare to be the individual they hired, they will actively push you out of the door. (Something that many people who try for management are told to do). There is very little integrity, & the design the company to lull you into a fake sense of security by disguising the…  place as an adult frat house where little to no actual work is done. If telling an associate manager to relay to his team member \"fix your face\" is your idea of good management, well, that's far from the truth.",
        "advice": "Practice the values you spew because the number of stellar employees that have left AND are actively leaving should have been a wake up call ages ago. No one likes a liar, and that's the only light that shines brightly in AM land",
        "pros": "A really solid benefits package that starts the first day of employment. A fully stocked kitchen, with an in house barista.",
        "summary": "A wolf in sheep's clothing",
        "role": "Account Manager",
        "date": "Jul 18, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Mundane routine, lack of mental stimulation, frat-like",
        "advice": null,
        "pros": "Made great friends. Best place to learn how to sell. Once you sell empty space, you can do anything.",
        "summary": "N/a",
        "role": "Anonymous Employee",
        "date": "Aug 13, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "cold calling, cold calling, cold calling and more cold calling.... Not me!!! I did not go to 4 years of college to be a telemarketer",
        "advice": "Expectations are just a tad too high...",
        "pros": "job atmosphere, co workers, Breakfast, lunch, barista, and happy hour on Fridays.... They try to make it fun....",
        "summary": "Like cold calling?",
        "role": "Account Manager",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Too many managers, pretty much all millenials, high turnover, micro managing, cheerleaders syndrome, overall very hard sell and difficult to make a living",
        "advice": "Stop micro managing and calm down on the ra ra ra yay Yelp is awesome routine. Oh yeah and play music for more than kids out of college who live at home",
        "pros": "Great health benefits, friendly people, free food",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Aug 29, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "They try so hard to make the job and environment worth it but it really isnt worth it.cold calling all day long and pressure to hit daily metrics.harrass business owners and people who dont want anything to do with you",
        "advice": null,
        "pros": "Health Benefitsoff weekendscoworkers",
        "summary": "Account Executuve",
        "role": "Anonymous Employee",
        "date": "Aug 31, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Management is run by a group of self important youngsters that don't know how to exactly sell anything themselves. They couldn't close a barn door.",
        "advice": "How about getting folks in middle management that can lead by example and truly coach towards success.",
        "pros": "Pay is okay. Just enough so you don't quit. Not a long term opportunity.",
        "summary": "Sales",
        "role": "Anonymous Employee",
        "date": "Sep 6, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Feels like bootcamp/summer camp combinedPoor managementVery high turnover in sales org",
        "advice": null,
        "pros": "Great benefits - healthcare, 401k, commuter and wellness benefitsgreat office, great locationFree food all the timeGood hours",
        "summary": "Seems great until you're doing the work",
        "role": "Anonymous Employee",
        "date": "Sep 8, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "While the list of pros is very enticing the benefits of working at Yelp, in my opinion, fail to outweigh the unfortunate reality of what the job is. Truthfully, management is as helpful as they can be from an instructional/leadership standpoint, but it is insurmountably difficult to make amends for the brutality of the position. You're given a territory of burned out, recently called/pitched accounts that have been c… alled on dozens of times per month prior to you picking up the phone. Most of the business owners you talk to express immediate frustration with you and disinterest in the product within seconds. Of course, this what inside sales is all about, and I don't fault Yelp for the job function itself. Moreover, your days have no variety- as you're expected to make over 80 dials, talk for over 2 hours on the phone, and hit a variety of other metrics, most of which are pretty much attainable. It's not a difficult job to be OK or passable at, but it's a difficult job to excel at. I left after two months and at that point nearly on third of my hiring class was gone. Within my first week of my new job, my office had received 3 resumes from AE's trying to flee the Yelp phone center. I don't blame them. So, reader, if you're a recent or soon to be recent college grad looking to get into sales, this job is definitely exciting at first, but unless you're a robot who is fine with making a career out of sitting at a computer talking to people who already hate you, this job is an average experience at best. Look for something else unless you're truly committed to the exrcutiating experience of inside sales.",
        "advice": "Offer more transparency during interviews about the expectations of the job. Raise the base pay about 5-10k, spend more time training and role playing prior to throwing kids on the phones, teach good pipeline management skills BEFORE AE's hop on the phone and wreck their pipelines, and somehow devise a system of more equitable account distribution.",
        "pros": "Fully stocked kitchens, friendly coworkers, you're usually done by 5 PM and have a good work/life balance, 2 month training that helps you get acclimated, casual dress attire, modern office space in a great location (Merchandise Mart).",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Sep 12, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "For the record, I do not regret working for Yelp at all, and I have no bitter feelings towards the company. I owe Yelp's sales training program for helping me land a better sales position making almost double my first year out of school.On the contrary, don't kid yourself. This is a telemarketing position masked by a clever title, behind the facade of the \"hip\" tech company image that you can brag to friends … about. Be prepared for a high volume of calls and voicemails under strict micromanagement.I sold advertising part-time for 2 years during college, and Yelp is a very hard sell. They already have an extremely bad rep with business owners, and on top of that, the businesses have already been called by a rotation of rookie account executives, nonstop for years. Most calls end after you say you're from yelp.Some people love the culture there, and I did to an extent, but there are a lot of things wrong with it.Yelp has transitioned from tech start up to corporate sweatshop, and they try to preserve the image with free snacks, loud music, foosball, and obnoxious speeches from the directors. Once you're used to the amenities, monotony and regimented daily tasks will wear you down until you start sending out applications. It was a running joke amongst coworkers that it felt like we were still in high school with how each day was structured.Most of the people you become friends with will be gone by the 6 month mark, readily replaced by the massive amounts of new hires pumped on to the sales floor each month.The Yelp team is very cult like which some people enjoy, but I found it very distracting. You will not succeed at this position unless you \"drink the kool aid,\" regurgitate what your managers tell you to say, and let the company completely take over your persona.When it's all said and done, Yelp will give you great sales experience and help you get a better job, but this is not a career if that is what you're searching for.",
        "advice": "The managers are great, energetic, and very supportive. Some should focus less on metrics and more on revenue. The directors can be fun to have around but are extremely distant from the AE's and honestly feel irrelevant and powerless on the sales floor unless they're forcing us to clap every five minutes.",
        "pros": "A lot of kids your age will be working here, and you will make some great friends at this company. The only downside is that you can't expect that they'll be around for too long. The sales training program here is great and helped me get a better sales job.They will hire literally anyone that is young and enthusiastic, so it is a great first job out of college, to use as a resume piece and meet new people.",
        "summary": "Great first job. Know what you are getting into.",
        "role": "Account Executive",
        "date": "Sep 16, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Very few chances of career growth",
        "advice": null,
        "pros": "The work is very interesting",
        "summary": "Interesting work, but very chances of career growth",
        "role": "Anonymous Employee",
        "date": "Sep 25, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- Ego driven upper management; i.e. upward mobility or investment in you as an individual heavily dependent on who are willing to kiss up to.- an average 4 month office turn over rate; at this point hiring 60-80 recruits every month.- Under lying racial issues; lack of diversity in upper management (0) in the Chicago office.- With a younger group of employees, tends to be an extension of school environmen… t. Very cliquey, manager/manager & manager/ rep fraternizing.- Common saying from management \"it's not an difficult job, but it's not an easy job\" For the effort that is required to truly be a great representative at Yelp a base of $35,000 pre-tax is not quality compensation.- By far the worst part, canned responses from management regarding career position & issues. Further proof to the employees that rather than an individual that is to be invested in, employees are just #'s to the company.- Shady acts to get the job done; i.e. price gouging clients, language, etc.",
        "advice": "Stop spending money to build on and grow an underachieving office. Invest in talent that is in the office already. Bring more diversity to management and company as a whole to better represent the ever changing landscape of the city. Being more authentic and address the elephant in the room, great job of highlighting every situation for a positive where negative situations are swept under the rug as if they don't exi… st.",
        "pros": "- Most coworkers are 22-30 and are in the same place in life and that is 99% of the \"fun\" environment. Management focuses on hiring new college grads.- Benefits: Paid Medical & Dental. Free Food (after 2 months being there, you won't want the same things anymore). Free Beer.",
        "summary": "Yelp Chicago - A great city, great office? Not so much.",
        "role": "Account Executive",
        "date": "Oct 3, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "The whole actual job. They do tell you what you are getting into and set the right expectations, but ultimately there is so much that is out of the control of you and for the most part management too.They preach fairness and that everyone is doing the same job, at the end of the day that is just not true... some people call into the middle of nowhere and some call into the Yelp-iest of areas, there is some luck. … Highly emotional sales role, not selling to people who make purchasing decisions with logic, rather with emotions. There were many times that the program failed the client and they come back to the sales rep who has no control over the success. I found it pretty hard to sell something that I ultimately did not believe in for every client, but the way the kool-aid drinking works, you have to sell to all of you assigned clients as if it will work for them too. I found this to be very disingenuous.Praise is definitely handed out for all kinds of small achievements, but they treat some like gods.This is where it honestly can get a little catty, there are hundreds of 23 year olds who are competitive by nature and very outgoing in general- thats why they got the sales roles- and the culture sometimes can flip on itself and wear you down. Its fun and young, but its also annoyingly young and dumb. With that, it was a good place to make new friends..On the young note, the management that I saw was often way too green and fresh to provide proper leadership. Some were immature, some too emotional, and others not masters of the job yet themselves. I think that this rose out of the desire to grow so quickly and expand (very revenue driven) that they were forced to promote people who were not ready to be brought into leadership. Personally experienced large disconnect between manger and director that ultimately led to being sent down the wrong path with out help for many months of frustration.",
        "advice": "Get more experienced management in there. Promote more approachable leaders outside of the direct management- since there are not equal manager skill levels, some reps are put at a disadvantage even if they want to work really hard.Pay better- who cares about free food (that is all good and fine, but ultimately gets old), when you could afford better living as a trade off.Promote work-life balance as you say … you will, there was often pressure to work longer and stay later, but then ridicule when you logged more hours at the end of the week. Unclear messaging there.",
        "pros": "Co-workers and culture made for a great first out of college job. Met lots of great people and gained some good experience.Would recommend, but don't plan on staying for more than a year, not much to get out of the job after that.",
        "summary": "Account Executive- Sales",
        "role": "Anonymous Employee",
        "date": "Oct 13, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "- high volume of cold calls- low pay- difficult to meet standards- hard work with no real pay off",
        "advice": null,
        "pros": "- good benefits-consistent hours- great work culture",
        "summary": "tough job with not enough pay off",
        "role": "Account Executive",
        "date": null,
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The nature of the job on the Sales side. Having to be on the phone for 9 hours straight. Constantly making calls to get hung up on or cursed out at. A lot of the people you talk to cant even afford Yelp Advertising.",
        "advice": "There should be more responsibilities to the job than just being on the phone all day and recording each call on Salesforce. Way too repetitive.",
        "pros": "The environment is very relaxed, you can wear absolutely anything to work. Have a barista and kitchen loaded with food and snacks. Everyone is super friendly as well !",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Oct 18, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "This is a cold calling position. So all day you sit in a room filled with about 50 people who are calling all day long and forcing business owners to sign up and spend thousands of dollars with you on the phone. They fire you if you don't sell \"enough\". Even if you sold and hit your numbers in the past and had a slow few months they fire you. Their is no stability and no room for growth. Out of 800 people that work a… t the NYC office I only saw about 10 people get promoted to higher sales positions.",
        "advice": "Management is young like 23-25 years of age. Hire people with more expiersnce managing a team:",
        "pros": "I have met amazing people and made lifelong friends. Communication skills improved and gained expieriance necessary to move onto different higher paying roles.",
        "summary": "The job itself is unbearable",
        "role": "Anonymous Employee",
        "date": "Oct 22, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Low pay, unattainable sales goals, micromanaged, loud sales office, no one over the age of 27, frat house environment, pushy sales tactics",
        "advice": "Stop with the stupid gong, hire a more age-diverse workforce (and this is coming from a 28 year old who worked there) and stop forcing AE's to harass clients",
        "pros": "Casual dress code, free food, free health benefits",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Nov 10, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Yelp constantly tries to tell its employees how great it is to work there. If the job were actually great, Yelp wouldn't have to reassure its employees of that; it would speak for itself. There are many manipulative tools the company uses to keep employees on board. The largest being a \"promotion\" at Yelp. Instead of having large increases in pay, Yelp will give you two computer monitors instead of one or a wireless … headset instead of a wired one. These aren't real promotions; they're simply ploys to make the employee seem as though they are a valued member of the team.",
        "advice": "Let your top reps actually innovate. Yelp is not an innovative company; it's a reactive company. Eat 24 was a response to GrubHub; Yelp Reservations was a response to OpenTable. The leadership in the company doesn't know how to innovate, but many of your sales reps see the problems within the company every single day; they're the ones selling your products, so listen to what they have to say.",
        "pros": "Account Executives at Yelp get to learn the entire sales cycle, which is rare. Most companies have you move from an SDR role into an AE role, but at Yelp, you learn the entire cycle within the first 3 months on the job.",
        "summary": "Great first job",
        "role": "Account Executive",
        "date": "Nov 13, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "the job itself is the worst thing someone can think of. Cold calling small business owners trying to get them to spend thousands of dollars over the phone on something that only works in certain cities.",
        "advice": "Management is good and really friendly. They try to help you out with everything. Keep doing what your doing",
        "pros": "the culture was great and everyone is super friendly. Also, you get unlimited free food and drinks which can really save you alot of money",
        "summary": "account exectuive",
        "role": "Anonymous Employee",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "-Training does not include lots of hands-on experience with the Business Owner's App/Account.-Territory can have a huge impact on success.-Yelp continually bombards the same regions over and over and most businesses have heard the Yelp Ads spiel before, and are also being pursued by Facebook/Google.-Most managers are very young and have limited people management experience.-Yelp's ad s… ervices are very unrefined and have failed business owners in the past leaving no credibility when trying to sell newer services.-Most of your sales will come from new businesses which can be tricky if they do not have a good or established reputation.-Reps are penalized if a business cancels their services because they are not seeing an ROI.-Base salary is terrible if you live in the Bay Area.-May take a few weeks to become commission eligible and you have to far exceed your quota to see a decent commission check.-Can go from booking 40k one month to 10k the next.-You have to be on Adderall, or some heavy duty stimulants to hit expected call volume/talk time.-Many business owners hate Yelp because they did not create a page (pages can be created by bots), and are then being called to get sold on something they did not set up in the first place.",
        "advice": "Smaller teams, be upfront with reps about what the job actually is, spend more time on development and less time listening to your reps pitch, learn how to use/set up an account before managing people on how to sell Yelp's services,Also, get rid of contract lengths and early termination fees. Many businesses will sign up if you do this.",
        "pros": "Snacks, drinks, and food on every floor. Yelp really focuses on facilitating employee interaction. Offices are nicely designed, have meeting spaces, and even nooks where you can nap. Beer on tap, and an in-house (free) coffee shop.",
        "summary": "Account Executive, Digital Marketing",
        "role": "Account Executive",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "This is a call center. In the interview process they pitched an entirely different job. I was told I would have my own book of business and there would be endless career opportunities. That could not be more wrong.We are customer service reps not account managers. We get talked down to all day long by I'll-informed business owners. And day by day more responsibility is taken from us. We have to regurgitate sc… ripted language.",
        "advice": "AMs don't actually feel like it's a \"safe space\" despite the fact we are told it is. We've seen too many people be honest and end up shouting themselves in the foot.",
        "pros": "Great insurance and benefits. Made great friends...very fun coworkers. The kitchen is pretty convenient and having a barista is great.",
        "summary": "Account manager",
        "role": "Account Manager",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "The actual job, cold calling and selling ad packages to small business owners in CT",
        "advice": null,
        "pros": "Great environment lots of perks",
        "summary": "My yelp experience",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "While the gig seems exciting for new blood - It absolutely is not. Please to those that are seriously considering working here - Understand, you are a number, you will be trained to make 80+ dials a day, you are working in an extremely intimidating, political system that will eat you alive.The core goal for Yelp is to hire excessive amounts of employees to find the few diamonds in the rough. No matter what th… ey tell you, understand that you will be given a horrible territory, and selling a product that is extremely faulty and cost a lot of money. Your morale will slowly default, and you will notice many sleepless nights, stressing to hit very unreasonable quotas.Your upper peers are at best some of the most condescending colleagues you will ever work with. It's their job before yours and they will beat you to the ground if they are not getting what they want. I exceeded numbers far higher than 75% of the office in Chicago and kept to myself, meaning I didn't brown nose. This is where I made a mistake, Although I had the numbers - I was coming into an office that hunted for attention and if they didn't get it you were off the list. Where I eventually ended up.I hate to scare you from an opportunity but I want to be very honest of what this company does and how you will be treated. There have been several cases of sexual harassment and discrimination within the Chicago Office as well as heavy drug usage within the heads that run it. While HR is very understanding of the employees that work here - they side the people that run it. You will be a lost cause.",
        "advice": "The issue with Yelp Management is that they treat it like a cult. Hiring good sellers does not make them good managers. This is what they do.They are extremely unprofessional, and act like children. I've worked with several companies and it boggles me that they have these people running a company like yelp.If i can give advice - I hope that it's to bring a reorganization within the companies managemen… t team. You need to hire outside of the company and not always side with what wall street is telling you.",
        "pros": "Yelp creates a very very unique culture. While most of your coworkers are new grads, they keep it up beat and exciting for those who are new to the tech scene. i met some of the greatest people in my professional career here.",
        "summary": "Deal with the devil",
        "role": "Account Executive",
        "date": "Nov 29, 2016",
        "is_current": false
    }
]