[
    {
        "rating": 1,
        "cons": "This place is an employee factory. It seemed as though everyday a new person was hired and somebody was leaving because of their impossible quotas. Stay away! When employees are let go, they are done so in a really unprofessional manner.",
        "advice": "I would recommend that you guys look for better jobs. You do a great job and aren't compensated nearly enough for your efforts.",
        "pros": "Great opportunity to learn about social media, online advertising, etc. If you love to talk on the phone for endless hours to business owners that aren't interested in talking to you because they've already been called numerous times, then this is your gig.",
        "summary": "I wouldn't recommend it to anybody I care about",
        "role": "Account Executive",
        "date": "May 20, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "--No racial diversity. Homogenous work environment. Scottsdale location is 95% caucasian. Minorities rarely ever get hired. I was the one of the few minorities in the office.--Boiler room environment. Did you get a college degree only to work in a high pressure call center?--Laughable compensation.--Long hours and high turnover. You are just another cog in the machine here.",
        "advice": "--Hire more minorities. Promote racial diversity.",
        "pros": "--Big company that is expanding rapidly.",
        "summary": "Minorities don't stand a chance at Yelp in Scottsdale",
        "role": "Account Executive",
        "date": "Dec 11, 2010",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-Every day you worry that you will lose your job-Compensation is poor and you have to sell 105k before you start earning commission-Everyone wants to quit after 30 days but doesn't because they wait to get fired for the severance package-Management is horrible-Every month there are 30-50 new sales people and they fire like its no big deal",
        "advice": "Stop treating people like a pawn in chess. If an employee makes your company 30k in revenue over the course of a few months, so what if it is less than a 15k average, they still paid 1 years worth of their salary...",
        "pros": "-Free Food, Drinks, and Beer-Ping Pong, Pool, and Fooseball-Good Music All Day-Social Atmosphere-Great Technology to use (including Mac's for everyone)",
        "summary": "Ever wonder what it's like to go to work everyday and think you will lose your job?",
        "role": "Junior Account Executive",
        "date": "Jan 4, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Only 20% of the employees in the scottsdale office have been there longer than 6 months.You will watch all of your friends get fired, and then you will get fired. NO JOB SECURITY.Even if you are a top performer, they will fire you if you have ONE bad month.DO NOT TAKE THIS JOB IF YOU DO NOT HAVE INSIDE SALES EXPERIENCE.The PAY is horrible. You will make just enough to pay rent and bills and be able to…  hit the bar a few times a week.The recruiter is lying when they tell you that you will make commission your first year. You have to sell over $100,000 first, then you can make commission.Small business owners hate that you call them everyday.",
        "advice": "Invest in your employees. Stop hiring 50 new reps every other month and focus on your current employees. Fix the commission structure.",
        "pros": "Yelp provides great benefits including a keg in the office and unlimited snacks and refreshments.Awesome trainingIt is an extension of college, all of of your coworkers are down to party including your MANAGERS",
        "summary": "You will get FIRED.. eventually.",
        "role": "Account Executive",
        "date": "Jan 4, 2012",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Crazy place to work. No work/life balance.",
        "advice": "Treat people with respect and appreciation",
        "pros": "There are no pros to this place.",
        "summary": "It is a terrible place to work",
        "role": "Account Executive",
        "date": "Jan 6, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "*This is a telemarketing position, not an Account Executive position. You are making 80+ phone calls, talking for 3.5-4 hours of actual talk time, setting 5+ appointments, and pitching 2-4 businesses a day. You're not doing anything else. This classifies as a telemarketer, I'm sorry! When someone leaves their job for this \"opportunity\" it should be made very clear. If you don't do the previously mentioned metrics the… n you are made to feel like a failure. Sometimes you just may be on the phone with a really good lead who might take longer to talk then others! It happens! Although there are some good managers here, most are poorly trained and this is their ONLY experience with ad sales for the most part. You read straight from a script and management doesn't like when you ask why you are being told to say something. They barge your calls and will tell you what to say even if it's not how you prefer to talk to someone. You feel like your job is very fragile here and fear you may be fired if you're having a bad week/month. In few months of employment here, I've witnessed about 5-10 people get fired or quit.*Another thing that was bothersome was the lack of diversity here. With a New York office employing a lot of people, this shouldn't be an issue. They talk about the \"culture\" of Yelp all the time. This culture is a mixture if mostly white, young, hipsters. HR even made a few comments how we are a company of mostly young people so that's why the benefits are so good. Being in my mid to late 20s I should NOT feel like an old soul here! Why not add some diversity into this mix? It would only benefit the company to have different people with different life experiences.",
        "advice": "Besides the above mentioned, I agree with what everyone else is saying. There needs to be an evaluation on how territories are handled. Someone calling into a town where they lived is obviously going to succeed faster than someone who's from New York with a strong accent calling into the south. Management needs to be trained better and selected with more care. Every manager was different. Some were amazing while othe… rs were completely unhelpful and unprofessional at times.",
        "pros": "-Free food, young people, and good music-Good benefits",
        "summary": "If you're thinking of working here, don't.",
        "role": "Account Executive",
        "date": "Jan 12, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They need to rename their title of \"account executive\" to \"telemarketer.\" You aren't handling any accounts - all you do is call people nonstop all day! Territories completely matter. How am I going to sell advertising to a small Amish community in Pennsylvania versus someone who has Manhattan or Miami? Makes no sense. They are very strict with you having to be on the phones 3+ hours and making a certain number of app… ointments and pitches. It's ridiculous. They have a program that monitors how long you have been on the phones so even if its noon and you think you've been on the phones awhile, it could only turn out to be 40 mins in reality. Sales is tough and it's not for everyone, I suggest if you're just looking for a job DO NOT work here. If you're looking for a serious career in sales then do it. The nonstop cold calling, getting hung up on by rude people, being yelled at for not being on the phones more than 2 hours daily, is what ultimately made me quit. I haven't looked back and I'm much happier!",
        "advice": "Managers have no experience in sales so why are they our managers? Stop saying your territory doesn't matter - it does. And stop telling people this is an account executive job! Once you sell these people their advertising you never speak to them again because someone else manages their account.",
        "pros": "Young, good-looking crowd. Fully stocked kitchen. Casual dress attire.",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "Jan 20, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-Unprofessional at times-Not very diverse. Mostly young white hipsters, was one of the few minorities-ridiculous, unfair metrics and territories-Like a a teenage soap opera at times",
        "advice": "Terrible management!! All too young and seemed to only get promoted because they had a decent few months. My manager was insensitive to everyone's growing pains and seemed to think his way was the best way in sales, when it certainly was not. It is a luck of a draw to see what manager you get, which can really make or break you. Hire some outside management.The Recruiters are fibbers, they had me move all the…  way from Texas. They told me a bunch of lies (probably because they have such a high hiring quota to meet with the number or people they fire each week). They falsely assured me that although you don't have sales experience, they will teach you everything you need to know and that the training class was for SIXTY days. Also they said no one ever gets fired unless they have a bad attitude.Bull crap! I had a rough few days and had really turned it around at the end, working very hard, in good spirits with my team and working long hours. On my last day there, I had 5 pitches and 4 appts. Unfortunately, I was never allowed to see if I could close my first deal because they were eager to fire me by that afternoon.Develop your employees. There should never be a reason to fear that you are losing your job everyday and that you are indispensable. I've never seen a job in which so many people are fired or quit in such a short period of time, even if it is sales.I agree with everyone about the territories; my team had bad territories while other teams who had California, NY succeeded well. It's not fair nor right and they know it! Glad I was let go and I am much happier. Plus that whole Yelp concept won't be around for more than a few more years; biz owners are starting to catch on.",
        "pros": "-Nice area, beautiful office.-The recruiters did a good job \"selling\" the nice kitchens. I do admit, the kitchens stocked with a variety of food is a generous gesture.-Nice little outings, such as an open bar pool party. decent (for the most part) people that you work with; I have met a couple of close friends in the class that I was in.",
        "summary": "Unprofessional",
        "role": "Account Executive",
        "date": "Feb 17, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-Horrible pay-Bad middle management, they typically promote those who did well at sales and not those who can actually manage employees-They hire 20-30 people (a new \"sales class\") at a time and make cuts fairly often so you essentially feel like livestock-80+ calls a day so you're pretty much \"smiling and dialing\"",
        "advice": "Pay people better and actual put some value in training staff and helping build their sales experience. But since its a churn and burn sales cycle with tons of low dollar value transactions so they are probably pretty content with this model.",
        "pros": "-Builds good entry level sales experience-Fun culture for younger employees",
        "summary": "Good only for initial sales experience",
        "role": "Anonymous Employee",
        "date": "Feb 24, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "23 and 24 year olds are constantly promoted to management positions (which puts them in charge of 8-12 other sales reps). The reason for their promotion has nothing to do with management skills, but has everything to do with how much they suck up and drink the koolaid.The pay is abysmal. Imagine making $30k a year in SF or NYC.Managers sleep with reps on their teams, there is tons of office drama, yet nobody … gets punished for it.The territory system is a complete and utter joke. You're given the same quota in Mobile, Alabama as you would have in Beverly Hills.",
        "advice": "Hold your employees accountable for their actions. Start drug testing your management team. Ban in-office relationships. All of these things make for a very toxic environment. Promote people that will actually be good managers instead of playing favorites.",
        "pros": "Cool office, fully stocked kitchens, very good training, 100% of health insurance is covered. Fun culture if you are in your early 20s. They have some fun contests (giving away iPad minis etc). You'll get some great initial sales experience here.",
        "summary": "Horrible.",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "People are miserable. Culture of young hipsters is enough to make you want to jump off a cliff.",
        "advice": "Go work at Taco Bell.",
        "pros": "None that I can think of. I'll come back.",
        "summary": "I hated it.",
        "role": "Account Executive",
        "date": "Jul 26, 2013",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "From the very first day I started I kept my resume posted online and actively networked with recruiters for any opportunities that came alone. Every single one of them told me to remove every reference to Yelp from my resume. Every recruiter had been told by the HR teams they worked with to never forward any resume from anyone who had ever worked for Yelp because of their lack or real business experience, lack of pro… fessionalism, and lack of legitimate skills.Yelp only hires people with very limited or no experience so they have nothing to compare it to. The company has an extremely bad reputation with businesses both big and small. You will not make your goals. It's a mill that just uses people for sub par wages. It eats them up and spits them out. Ask yourself why they have such massive and perpetual turnover and that says it all. It's just a bad company. The people that think it's great are clueless hipsters who are so blindly ignorant that they cannot see for themselves they are working for a failed company. The incompetent are promoted. if you're over 25, your manager will be younger than you. Extremely unprofessional work environment and absolutely ridiculous management.Do not bother.",
        "advice": "Go back to a real business school and learn some skills.",
        "pros": "Free food. I guess it's the least they can do for the minimum wage salaries.",
        "summary": "DO NOT Use Yelp on Your Resume",
        "role": "Account Executive",
        "date": "Sep 17, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Fratty, college atmosphere. Loud music. Repetitive, mindless work. Unreasonable expectations. Faux-startup vibe that's obviously a put-on.",
        "advice": "Grow up. Everyone there should grow up. Treat people like humans and not cogs in the machine.",
        "pros": "Stocked kitchen (when it's not empty), relatively set hours without much need to stay late.",
        "summary": "Grow up.",
        "role": "Associate Account Executive",
        "date": "Sep 27, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "**WARNING: I ONLY RECOMMEND working at YELP for people who don't have other job offers or they need an immediate paycheck OR they want to explore a new career opportunity OR if money isn't that important.=====--the ABOVE PROS don't outweigh the CONS!!--DISGUSTINGLY LOW salaries, they have some of the LOWEST salaries in the market!--after being there for a while, i noticed they don't have very competen… t people--most employees are entry-level, incompetent or new to their job role...--very small table space for each employee, no cubicles and no table partitions--very tough to move up in the company--very HIGH turnover--very disorganized--certain people are very unprofessional",
        "advice": "--INCREASE your employees' salaries!!--How do you expect your employees to survive on such LOW salaries??",
        "pros": "--VERY young work people working at Yelp, so it's great for the younger generation of people--healthy free foods available in the kitchen for everyone (cereal, carrots, milk, bagels etc..)--they subsidize your gym membership--nothing else",
        "summary": "Absolute DISGUSTINGLY LOW Salaries!! But great for entry-level people",
        "role": "Revenue Accountant",
        "date": "Oct 12, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Wasn't given a chance and then I was abruptly let go without being able to prove myself. Was given a crappy sales territory, had very high expectations for the territory that I don't think anyone could meet, boss wanted me to do unethical things in order to get sales, soo much pressure. I was working 12 hour days doing sales on the phones, and I was still let go. Kind of hate this company.",
        "advice": "Slow down- just because you're working fast, doesn't mean it's effective. It's very costly to hire people and have fast turnover. Cool your egos- too many egos running rampant in the company.",
        "pros": "Awesome perks- apple computers, brand new everything, bright office, free food, drinks, pandora music playing, cheerful, innovative, fast-paced, best technology, very forward thinking company. Smart people to work with- everyone is young, smart and talented. Learned a lot about an Internet company.",
        "summary": "Revolving Door- Rapid Turnover and Relentless Sales Tactics",
        "role": "Account Executive",
        "date": "Oct 14, 2013",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "No support dealing with clients. Spotty training. Very stressful. Call center atmosphere.",
        "advice": "Better training for all departments. If you have to continuously tell your new hires how lucky they are to be \"chosen\" to work here. there is a serious issue! I know every employee is replaceable!",
        "pros": "stocked kitchens, start up young atmosphere, kegs in the office, paid holidays, and great benefits",
        "summary": "A lot of hype with no support",
        "role": "Anonymous Employee",
        "date": "Jan 2, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Selling an overprices CPM program that won't help 99% of business owner.Total chop shop. No control over territories and if you miss quota for a couples months you'll be out of a job.",
        "advice": null,
        "pros": "Good training program, good benefits.",
        "summary": "Call center with virtually no opportunity for long term growth.",
        "role": "Anonymous Employee",
        "date": "Jan 10, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "1. The way HR and management interacts with employees brings the term \"Digital Plantation\" to mind.2. The company seems to have the HR and management processes of a 10 person start up although they are now a large publicly traded company.3. This company just doesn't care about employees and does nothing to create a culture of empowerment.",
        "advice": "1. Get to work on your HR and management processes.2. Care about your employees.",
        "pros": "1. Great product with an amazing future.2. Some of the smartest people you will ever meet work at Yelp.3. They do offer 30 days to opt our of their \"Dispute Resolution Policy\" upon starting. I encourage everyone to do so.",
        "summary": "Great product but they just don't seem to care about their employees.",
        "role": "Linux Systems Engineer",
        "date": "Jan 18, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All young people who are brain wash to believe their are \"Account Managers\" when in reality they are telemarketers. You have to call 90something businesses throughout a day, pitch a certain amount, close at least a deal, etc. It was horrible. I was an Account manager prior to working here for a well known media company. I was under the impression I was going to be doing the SAME EXACT THING but just at Yelp with more…  opportunity. I came in on the first day to a \"class\" of about 50 kids under 25 years old, fresh out of college. Some were even given incentives to relocate. Since I quit, only about 5 of those kids are still currently employed by Yelp. All the others either gave up or were fired.The benefits are good, zero career opportunity, absolutely NO work/life balance (I was calling into another time zone.. I had to stay late almost every night!) and the only culture 7 values of yelp is being a hipster. Worst place ever.",
        "advice": "There is no management here, thats the problem",
        "pros": "The only pros about this place is the free bad food they supply for lunch and the music that you get to pick when you close a deal.",
        "summary": "It's a Call Center!!!!",
        "role": "Junior Account Executive",
        "date": "Mar 1, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Pay is not good...the environment really depends on the manager that you get, and they work you to death. Little work-life balance. Some incompetent individuals who talk more than execute.",
        "advice": "Train your people in true leadership practices and manage them more effectively.",
        "pros": "Good brand recognition and casual environment. I have used Yelp to rate restaurants in the past before.",
        "summary": "Stay out of this place at all costs",
        "role": "Human Resources Assistant",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "So many cons...-expected to hit daily metrics of 80+ calls, 2+ hours on the phone, 5 appointments, 2 pitches-randomly assigned territories, some places that you can assign can have an average income of under 20,000 dollars a year and you are expected to sell them packages starting at 350/month. And you are stuck with that territory for a year-training program is not good. Ur only \"trained\" for the first w… eek and then you are immediately put on the phones. All training consists of is practicing the script-extremely competitive environment, constantly reminded of others success and your own failures-have to sell advertisement to people that work in rundown pharmacies and dive bars in small towns aka people that don't have the money to advertise and don't need it-forced positivity-lots of gossip-constant pressure to succeed-have to be consistently yelled at and hung up on and then be able to pick the phone back up and call again-no down time-low pay-higher up claims that managers are there to help give you advice, but no one really has any advice to give",
        "advice": "Invest more in training",
        "pros": "Great people, fun environment, music playing, free food, kegs, ping pong table",
        "summary": "Stressful",
        "role": "Junior Account Executive",
        "date": "Mar 18, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Not sure how you'd live in the city with this pay",
        "advice": null,
        "pros": "Happy hours, great location, gym stipend",
        "summary": "Low Pay",
        "role": "Anonymous Employee",
        "date": "Mar 22, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Low pay, shady business practices, poor & inexperienced leadership, cutthroat, fratty environment",
        "advice": "Offer your non-engineering employees the same perks you give to engineers. Clean up legacy managers that don't know how to manage their people or do their job well.",
        "pros": "Free snacks/beer/beverages, San Francisco location, fun people and offsite events",
        "summary": "There are better places to work in the bay area",
        "role": "Anonymous Employee",
        "date": "Apr 9, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "-Territories are not fair. Most small business owners you'll be calling have been pitched to at least five times and said no five times in the past few years.-Digital Plantation. Managers walk around and make sure you're always on the phone. Unrealistic metrics expectations- 80+ calls, 2.5 hours on the phone, 5 appts and 3 pitches per day.- Selling product that doesn't work for lots of businesses- loses peopl… e money.-You're constantly being sold on how awesome your job is and how lucky you are by management when in reality everyone there is miserable. Feels like brainwashing. Something is just really off about this place.-Crazy turnover. 50 people are being brought in and leaving every month. They take recent grads who have to move into expensive New York City and rent apartments when they know the chances are most won't even last a year.-Commission doesn't start until you hit a certain number- usually takes over 6 months. Horrible base salary.-They sell you on room for growth, but very little opportunity.",
        "advice": "Adjust expectations to territories. Lower your metrics expectations. Stop bringing in 50 kids a month and brainwashing them while sending 40 others out the door.",
        "pros": "- Fun young office- Free food- breakfast and lunch- Good sales training- Cool brand that everyone knows",
        "summary": "Overall Horrible Experience- Don't fall for Sexy brand name",
        "role": "Account Executive",
        "date": "Aug 25, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All you do is cold calling all day to people who will never want to talk to you. Also this is not a place with diversity, at times I felt like I was somewhere in the Midwest and not in San Francisco.",
        "advice": "Some of the sales manager are great people, very helpful and have excellent personalities, other ones will make you wonder how they got a sales position at all, super unfriendly and arrogant, know it all, I would say must be the job duties that they have, after a while it probably takes a toll on them, I noticed the unfriendly ones were usually the ones that were there for a much longer time. They hire kids to do sal… es jobs, not professionals, the less you know the better. I would definitely recommend this job to anyone who has recently graduated and need some sales experience. Go there work for a few months then get out!",
        "pros": "Beautiful office, nice friendly people, lots of space and food.",
        "summary": "Cold Calling is so yesterday business approach. This is why you will make a 100 calls with no leads.",
        "role": "Anonymous Employee",
        "date": "Aug 28, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The office feels like a giant call center filled with hundreds of people dialing the same leads over and over again and constantly being told by businesses to stop calling. The job can get old fast because there is only one task. Managers are promoted from the AE positions which helps reward top sellers, but the managers aren't qualified to be managers. The pay structure is designed to begin rewarding you about the s… ame time you are burned out. Not much care is given to individuals because of the high volume of employees and new hires. I relocated for the position and immediately regretted it",
        "advice": null,
        "pros": "Having a kitchen with cliff bars and coffee is nice Benefits are paid for. Young work force that can be fun to hang out with",
        "summary": "Account Executive Job Sucked",
        "role": "Junior Account Executive",
        "date": "Nov 12, 2014",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-As sales you're a second class citizen / disposable and you'll be reminded of that fact.-50% of the salesforce quit after a year of working there.-You're selling a product that as a advertising platform works sometimes.-You're managed by people that are proud of the fact they drink the Yelp kool aid.-Don't let them fool you with so much room to grow. There is no room for career advancement other then…  you managing 12 other sales folks and taking on their quota.",
        "advice": null,
        "pros": "CEO genuinely cares about his companyBrand recognition works when you decide to get a real job",
        "summary": "If you love Tsar based Russian serfdom you'll love local sales at Yelp!",
        "role": "Anonymous Employee",
        "date": "Nov 25, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management doesn't know what to do at this point because things have gotten so bad. Every person I know is looking for a job or going on interviews right now because things are so bad. The culture has become a sad sad thing. They might as well make a script for us to follow off the phones too and maybe everyone will come to believe its still a cool place to work. The product is awful and Im sick of reading emails fro… m clients telling me that its not working for them. Even when I close a deal I cant get excited because i am too busy wondering when they will call me back to cancel. Dont believe any of the reviews recently posted. They are fake. The New York office has is a miserable place. The managers don't care because even the worst managers never get fired anyway. Its the perfect position to come to die. A girl on my team quit already and i know three others who want to find another job by mid January. They are afraid that it will get to a point where Yelp is poison on a resume. I feel the same way. The directors all walk around looking dead in the eyes even though they still insist that Yelp is good. Its OVER. They know it. We all know it.",
        "advice": "Start looking for another job. Yelp is still great itself. But nobody wants what we have to sell. And we shouldn't have to sell sell sell people on how good it is when they should know at least by now that it works. Stop selling your reps a bill of goods just because you can't admit that the ship is sinking fast. Maybe you are afraid to see what a real corporate job looks like. The numbers dont lie.",
        "pros": "Whatever the pros may have been once upon a time they don't exist anymore.",
        "summary": "ITS OVER",
        "role": "Account Executive",
        "date": "Dec 19, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Lets see.Probably the desperation I saw today as the directors sold us the biggest bill of goods of a time rather than just admit that this company is losing. We used to be cool and hip and exciting but now even the best reps in the company can only manage mediocre numbers. The cancellation rate is crazy and when the public and investors learn what a sinking ship its become its going to be embarrassing.They a… re trying to pull out a the stops to keep us there. But it doesn't matter if nobody wants advertising that is a money suck.I am not venting. Anyone considering this opportunity should understand what they are walking into. It's not a stable situation anymore.",
        "advice": "Stop lying to us. Stop putting on a brave face and telling us its still okay because Yelp works. Stop trying to give us false hope to buy you more time to figure out where we go from here.",
        "pros": "The friday happy hours. Everything else off-site also being centered around alcohol. The best way to improve attrition is creating dependency on alcohol. And then reminding them that there's nothing what better while they are too wasted and exhausted from vomiting to disagree. They do is because they really care about their reps. That's a pro for sure.",
        "summary": "Update: Commission is Capped Btw",
        "role": "Account Executive Sales",
        "date": "Dec 20, 2014",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Never in my years have I seen such blatant disregard for the truth. The \"algorithm\" is flawed and hurting small business nation wide. Told to hush up about \"the little people\" and that the \"algorithm\" was not to be changed.You will be asked to fight \"flagged reviews\", in order to leave them on people's accounts, regardless of truth. I have never seen a business refuse to remove information that is being asked to … be removed, either via email or lawsuit.What yelp stands for is what's wrong in the world. I'm sorry but a review from years ago should not be relevant, and the fact they can't upgrade the \"algorithm\" is BS. I programmed a solution to remove bad reviews after 1 year, and was promptly fired. (Don't go above and beyond at this job, clearly.)Fun fact, YELP in fact DOES charge to remove bad reviews, via Cold Calling from their sales staff.Shady Shady Shady.I feel dirty working for such an irresponsible company who blatantly disregards requests from struggling business owners.",
        "advice": "Find a job that has integrity, morals and betters the world. Not something as pathetic as a \"review site\" that shows somebody's 'opinion' from 4 years ago that isn't currently relevant. Sweet baby J, you had potential, and decided to be the greedy 'by any means necessary' company it has grown into today.",
        "pros": "Morally Bankrupting type of environment.",
        "summary": "Worst experience ever at a tech company. SHADY business plan.",
        "role": "Junior Software Engineer",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Complete lack of tranparency, impossible to move out of the sales org, almost no understanding of an effective modern sales process, laughable compensation.",
        "advice": "(Sales Org only): Read Predictable Revenue",
        "pros": "Working with great people and a shiny new office",
        "summary": "Worst - Run Modern Sales Org on Earth",
        "role": "Associate Account Executive",
        "date": "Jan 5, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Where do I begin? The pay SUCKS! You think you're going into the job as an Account Executive- you're not. You're starting from the very bottom. It's all cold calling and the management team drinks and forces the kook aide. There's absolutely no room for growth. You can work your butt off- yet that doesn't matter because you can't hit quota. And you can't hit quota because you've been given horrible opportunities. And…  you can't say its your opportunities- they'll blame you! They tell you to trust the process- it's a bunch of bologna. The ethics as well is horrible. \"We want to help small businesses\" no actually we're hurting them. And I'll be the first to apologize and take responsibility for a corporation that doesn't stand behind their mission statement.",
        "advice": "I had a wonderful manager. But one thing I would change and suggest for the company: stop forcing the kook aide. Jeremy- stop telling people they should live in San Francisco. You're paying us close to the poverty line. It's unrealistic. And for gods sake find a sanitary way to serve the bread, meat and cheese.",
        "pros": "It's a great starting point. They teach you what you need to know. And some great tools you're able to take with you to your next job. Depending on your manager, the culture is great. You'll meet life long friends.",
        "summary": "Utter disappointment",
        "role": "Account Executive",
        "date": "Jan 12, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "You will want to end your life daily.Degrading work.TERRIBLE pay.A slave to the system of territories.Party atmosphere.You will be treated like you're in a frat and then BERATED by management in the most humiliating ways.Shady, shady in terms of professionalism/interoffice romance.Need to be in the in crowd to have any shot at promotion.",
        "advice": "Stop promoting \"the cool kids\" only.",
        "pros": "Lots of other young people to make friends with. Free food. Gym stipend. Good health benefits.",
        "summary": "Run as fast as you can.",
        "role": "Account Executive",
        "date": "Jan 15, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Whenever I feel oppressed or upset in my current job, I try to remember my time at Yelp, and I feel much better. The starting pay is literally below the San Francisco poverty line.Seriously, if you want to be underpaid, lied to, and devalued as an employee, work here. Yes, managers sleep with their employees. Yes, employee drug use is rampant. Yes, Yelp employs dodgy sales tactics. Small business owner with a…  Yelp listing? You've been called 200+ times by 6 different employees (who all don't work there anymore) in the last 3 years.The very job title is a lie. Account Executive? What \"Accounts\" am I responsible for? This is inside sales/telemarketing, straight up. No sales skills, no personal nuance - read the script and play the 100/10/1 numbers game. Plain and simple. Once you make the sale, you ring the gong, and your new account gets handed to the real account executive.",
        "advice": "Drug test your managers. Don't fire your high achieving sales staff. Move the sales office to a less expensive city.",
        "pros": "Get to work in a room full of college kids that love to party and socialize - not a pro for all workers, but I enjoyed it.",
        "summary": "Telemarketing Boiler Room",
        "role": "Account Executive",
        "date": "Jan 26, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Management is not organized, the so call HR department does not really exists. The pay is just at the margin of poverty. This is the perfect job for a college student trying to get experience in the start up business. This college student needs to live at home with parents and make sure you don''t have any debts. Due to the poor salary that Yelp is willing to offer you, there is absolutely way that you can make in Sa… n Francisco expensive/ cost of living. I give the Company another 10 years before it becomes a well managed, stable company.",
        "advice": "Fire the management and start over.",
        "pros": "The coffee, coffee, coffee, coffee.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Feb 1, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All you do is cold call all day.Management is young and inexperienced.Starting salary is horrible.Promotions aren't what they seem.Insanely high turnover.You're only as good as your last sale.Glorified telemarketing job.So, this place is amazing if you truly have a passion for cold-call sales. But if not, stay away (unless you need a good name on the resume for leverage). The job entai… ls finding leads on SalesForce and literally calling them out of the blue, setting appointments with the business owners, and pitching them on why they should give your their money to advertise on Yelp. Expectations per day are about 80 calls, 2 hours of talk time, and 1-2 pitches. The \"pitching\" part is honestly pretty fun but getting there is hard and 90% of the job will always be making open cold-calls, which in my opinion is too monotonous for me. Promotions are given when you reach a certain amount of sales, however despite pay raises the actual job never really changes nor do you assume any more responsibility. You just receive a different title to put on your resume. Although, you can decide to go into management over time and manage a team or move into selling mid-market and national brands, but like I said it still all involves cold-calling for the majority of the job. This reason for me is a deal breaker because if I'm not planning to stay here forever (or work as a cold-calling salesman forever, which I'm not) the only thing I can really say I've gotten good at is cold-call sales which really isn't that valuable of a skill to me. However, If you do really like this type of sales than the opportunity to make a lot of money is great if you become really good, and by really good I mean within top 10% of your hire-class. The other 90% either quit or get fired within the 1st year so enter at your own risk. Starting salary is 36K. The average employee becomes available to earn commission on top of that after about 6 months. Commission is uncapped and the top performers (about 10% of the people who are left) are making 6 figures within their 2nd - 3rd year on the job. Extremely rare but people do it.",
        "advice": null,
        "pros": "Well known company in a high growth period.Household name may look good on resume.Great training program for cold-call sales.Promote from within.Transparency.Fun young environment.Work life balance.Fully stocked kitchen and great benefits.",
        "summary": "Career or Telemarketer?",
        "role": "Account Executive",
        "date": "Feb 2, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Managers barge your calls, which wouldn't be an issue but you don't even know the product that you are pitching to business owners. Managers doesn't really give you the run down on the product they just throw you on the phones",
        "advice": "Have patience , teach your employees on the products before throwing them on the phones",
        "pros": "Free food, snacks, yearly metro card, and good benefits",
        "summary": "Super intense",
        "role": "Account Executive",
        "date": "Mar 6, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-The higher ups have no idea how to grow revenue in markets that aren't urban. Its almost impossible to sell if outside a city and the chances of the ad program actually working are slim to none.- The higher ups tried splitting territories and accounts up and it was an udder disaster that probably destroyed the company. The switched things back after only a couple of months but the damage has been done.- Unle… ss you are a top rep, you will make absolutely no money. If you are in San Francisco or New York, new reps will actually take food from Yelp so they can eat on the weekends. That is how horrible the pay is to the reps who are stuck in horrible territories.- Account Managers are completely overworked. The turn over is huge and business owners are constantly nervous once they signed up because their point of contact ends all the time. If you are a decent human being, you will be the Account Manager for the businesses you sign up. This gets in the way for you to actually do your job as an AE.- If you are good, you have two options- manager or mid market. I would have been a manager however the pay for new managers is embarrassing low. Managers complain all the time that they can't afford to live in the city anymore. They expect you to take more than a 50% pay cut to become a manager. If you go into Mid-market, you get paid pretty much the same as local. There is no incentive to move up as you will get paid less for doing more work.- The stock is horrible and this is something they use to offset how horrible they pay their employees.",
        "advice": "Quit and find a better job that will pay you what you are worth.",
        "pros": "- I have met some amazing people working there.- Yelp trained me to be an excellent sales person although I need to lose my \"scrappy\" sales technique.- The benefits were great, able to take time off if you produce.- 2014 was a great year for Yelp.",
        "summary": "Beginning of the end for Yelp",
        "role": "Account Executive",
        "date": "May 24, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Where to even start? Leaving Yelp was like leaving an abusive relationship. Salespeople are brutally underpaid, and by the way, they don't get comp on every deal they close. Career opportunities? Either be a feckless, idiotic manager or join the mid-market team shilling the same terrible product to larger businesses. You are rewarded for being loud and fratty, not for critical thinking or being strategic, and you are…  routinely encouraged to use unethical sales tactics. Ask anyone with a business and they'll tell you the same thing--Yelp salespeople are a nightmare to deal with. The product? It doesn't work, folks. I felt guilty taking credit cards knowing that business owners were literally throwing their money away. Contests, competitions, all-hands meetings, beer on the 8th floor, this is all panem et circenses. Yelp is a terrible company that treats the sales team like livestock, churns them when they burn out, and hires more fresh grads with no idea what misery awaits them. My manager, hired the same month I joined, was enormously unprofessional, broke HR code several times, and mismanaged our team. I would not encourage ANYONE to work at Yelp.",
        "advice": "Fire your managers, invest in your sales team, and stop lying about the efficacy of Yelp ads.",
        "pros": "I got good sales training. Companies in San Francisco know that Yelp sales people are well trained, fearless, and competent on the phone.",
        "summary": "So happy to be out of that nightmare",
        "role": "Account Executive",
        "date": "Jun 3, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I worked at Yelp 7 years ago, but gauging by the reviews, things have only declined in that time. Super high pressure sale gig with a script to make cold calls to sell a BS product. If you were off script, or attempted to change it in any way to make it your own, management would come down pretty hard, after listening to your calls without your knowledge of course. It was a bummer to be the 2nd, 3rd even 5th person t… o call on an account within a quarter, a bigger bummer when you realized you were the only one still employed there. The MO is to hire kids straight out of college that don't know any better and mold them into phone calling little drones. There is also zero tolerance for mistakes, no matter how trivial, and when you're making 80-120 phone calls a day, you're going to make mistakes. There were a couple of girls in my class that broke down crying a few times, not exactly a positive work environment.The main point of the pitch seems to be to just ware someone down until they give in. I love the idea of helping small businesses market themselves better and communicate more effectively with their customers, but the service provided just wasn't worth the cost. Maybe that's changed now, but I find that hard to believe. If a small business is doing a good job and provided good service, there are built in benefits to Yelp that are worth every penny of free. What Yelp charges to go that little extra step just isn't worth it.Also, it was weird how everyone idolized Stoppelman. This was my only job in tech sales, or any part of the tech industry, but from an outside perspective, that seems to be normal. Really drives me mad to think about all the egotistical jerks chipping away at the rich culture of SF in the vain hope to one day be like this guy. He hasn't actually done anything that makes a positive contribution to society, why do people treat him like he cured cancer?I've since moved on to sales in a different industry and have fared pretty well. Some of the positions I've held have equaled the pressure, some have been a little easier, but nothing ever gave me cold sweats like working at Yelp.",
        "advice": "Maybe stop hiring so many people so rapidly and actually train and develop a solid sales force. Unless you're trying to do that thing where you spend as much money as possible to inflate your value. If that's your racket, then stay the (just god awful) course.",
        "pros": "Free food, no dress code, beer sometimes, learned some productive ways to be cutthroat that have helped me at certain points later in my career; points I'm not necessarily always proud of.",
        "summary": "It was long time ago, but the memory still stings.",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "1. Fear driven work culture2. Disillusioned leadership3. Terrible work hours. Zero work-life balance4. No regular lunches like in other companies",
        "advice": "Treat employees better",
        "pros": "1. Competitive salary2. There are some really fantastic engineers",
        "summary": "Very bad experience",
        "role": "Software Engineer",
        "date": "Jun 17, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Extortion. There have been rumors that the Yelp sales team will extort businesses to pay the membership fee so they can get better reviews. This is all true.",
        "advice": "Change your business model. Yelp is a public company now so none of this shady business practices is sustainable.",
        "pros": "Pros is that it feels like a startup. Can be fun if you are a recent college grad but it can get old.",
        "summary": "Extortion",
        "role": "Anonymous Employee",
        "date": "Jun 22, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Bad practicesHorrible managementExtortion tacticsHorrible pay",
        "advice": "Be niceBad karma",
        "pros": "I hated extorting money from small business to get them to buy ads. We would hide their good reviews if they didn't pay up",
        "summary": "Horrible",
        "role": "Anonymous Employee",
        "date": "Jun 24, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Everything and Everybody. Managers are terrible. They do NOT have real human skills in fact no skills at all. yelp is a place for empty minded individuals who have no use for their own life. If you are an idiot and would to be bossed around as a slave then be my guest and sign your life away.",
        "advice": "Close the Scottsdale Location down. There seems to be an ultra high level of immaturity and stupidity in that location.",
        "pros": "There is nothing good about working at yelp. yelp is NOT a good place to work. Horrible. Horrible. Horrible. You're better off working as a janitor somewhere, working in fast food, or in prison.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jun 24, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-Job title did not describe tasks-Cold calling business owners who despise Yelp-No actual office to work out of-Most negative corporate experience I've had-Cost of transportation to do job was not covered",
        "advice": "-Better compensation for \"marketing assistants\"-Change strategy for Yelp advertisement exchange as most restaurants do not want to give away free product",
        "pros": "None, as I was part time.",
        "summary": "Bottom of job experience pyramid",
        "role": "Marketing Assistant",
        "date": "Jul 26, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Where to begin. Even if you are over quota, you will have a manager breathing down your neck every minute. The daily expectations for call time, etc are unrealistic. They work you to the bone and every employee is expendable to them. The perks do not make up for it being a telemarketing call center where you have a territory that has already been worked to death and you are calling businesses over and over who are si… ck of being called. This is an overglorified telemarketing position and the turnover is extremely high. The pay is below industry standard and you are working for managers who got there because of office politics.",
        "advice": "Stop treating employees like they are expendable. If you treated employees better and stopped the telemarketing atmosphere and not paying overtime, you wouldn't have to hire a new training class each month to make up for how many employees quit.",
        "pros": "Free food is the only perk.",
        "summary": "Worst company I have ever worked for",
        "role": "Account Executive",
        "date": "Jul 27, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "your job is to badger business owners. They play music so loud that can't even hear the people you are talking to. If you aren't hitting your numbers even in training you can get fired.",
        "advice": null,
        "pros": "great sales training and people to work with. Free food and drinks. fun atmosphere.",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Jul 27, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "YELP is an awful place to be. It wasn't the people, it's the company. It destroys businesses and I have seen and heard about it first hand. I had to leave. Good thing too, they fire people very easily too.",
        "advice": null,
        "pros": "my coworkers were pretty nice, laidback place to work.",
        "summary": "AWFUL",
        "role": "Sales Associate",
        "date": "Aug 30, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "I do not even know where to begin with the cons of this company. Firstly, \"Account Executive\"=Telemarketer. This job consists of cold calling small business owners who do not want speak with you at all, and trying to convince them to spend thousands of dollars on advertising that usually does not work for these businesses. That is the only responsibility you have. All you do is cold call businesses that have bad stig… mas of Yelp already. What makes matters worse is that these business owners have already been rejected the many Yelp sales reps before you (which most probably quit), making these business owners even more upset. The lack of honesty in this company is outstanding as well. You are told that territories \"do not matter\" and to\" trust the process,\" when in fact whatever territory you are assigned absolutely determines your success as an \"Account Executive.\" The quota for a rep whose territory was in NYC is the exact same quota for a rap who calls into a small town in Pennsylvania with a population of 5,000 people. CRAZY. What makes matters worse is that I did not feel ethically selling a product to someone who I knew it would not work for. But no one at Yelp cares about this, it is all about revenue. The amount of people canceling advertiser service is laughable, and this company will soon breakdown in itself. Beware young, naive college grads: these people will lie to you about growing a long term \"career\" here but the chances of you being fired in your first 2 months for not hitting unattainable quotas is extremely high. This company is like a revolving door, people coming in and leaving just as quickly as they showed up. I would also like to add that if you are not a frat boy you will be looked over. \"drink the kool aid\" and maybe, just maybe you won't be fired. Would also like to add that managers are constantly talking behind you back (very obviously) and you are monitored in everything that you do, like a young child. Managers are chosen by popularity, so you are highly likely to be managed by someone who i completely unqualified. Also, 36K in NYC? That is insulting. These people are like a sweat shop. They prey on recent grads who live at home who do not know any better and work them to misery, and then just fire them. I really hope that this review prevents someone from making a mistake and accepting an offer here",
        "advice": "Treat employees like people, not just a number. Compensate employees with a a livable salary. Do not lie about the role. Promote people that are qualified to be managers, not just people who drink the \"kool aid.\" Change how quotas are handled dependent on territories. Realize that your company is rapidly declining, and stop putting on a facade.",
        "pros": "Free food/beer. That is it.",
        "summary": "Stay away... far, far away.",
        "role": "Account Executive",
        "date": "Sep 25, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Being an AE at Yelp is by far the worst job I have ever had. You are expected to make at least 65 cold calls a day to business owners who have already been pitched on the product. Even though you get to punctuate your long thankless work days with trips to the fully stocked kitchen, the taste of Hot Cheetos and diet coke can't cover up the bad taste left in your mouth by bothering honest business owners day in and da… y out.",
        "advice": "Yelp should make an active attempt to pair multilingual AE's with territories where the language the employee can speak is widely spoken. When I worked at Yelp territories were randomly assigned leaving AE's who could speak Spanish with territories where Cantonese is widely spoken. Yelp could not only make more money by capitalizing on their employees' lexicon of language but also could put an end to their applicatio… n of borderline racist sales practices. That is to say, that if the Yelp ads program is as important and profitable as Yelp would have us all believe then by giving Spanish speaking territories to state school graduates who can barely form grammatically correct sentences in English let alone in the Spanish that they learned studying abroad in Madrid then Yelp is being a little racist. Hey Jeremy Stoppleman-- there is no office language in the US!",
        "pros": "There is free beer sometimes",
        "summary": "Worst Job Ever",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Poor Pay. You are getting paid below market value. Your manager are children fresh out of college with no work experience",
        "advice": "Pay your workers!",
        "pros": "Health benefits are really nice but thats about it",
        "summary": "Avoid working here, POOR PAY",
        "role": "Account Executive",
        "date": "Dec 2, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Extremely shady ethics and the way they run their company is questionable. Got fired because a disgruntled employee made up lies about me and their HR automatically believed her without discussing the issue with me first. Not sure what kind of merit and and level of morality they operate on, but this is not the company that you want to work for unless you don't mind watching your back like a hawk from overly sensitiv… e and immature employees. You have to essentially bend over to these kind of employees in fear retribution for something that you never did or just by being yourself.",
        "advice": "Instead of automatically assuming that your employee is at fault when accusations are made against them, try investigating and handling the situation better. It doesn't bode well with all of your other employees when they find out that their co-worker/friend got screwed over because of an overly sensitive person.",
        "pros": "Full stocked kitchen, people that I worked with were awesome and super helpful.",
        "summary": "Qustionable ethics and immature employees.",
        "role": "Anonymous Employee",
        "date": "Dec 22, 2015",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "This is easily the most unprofessional company I have ever worked for. The so-called Silicon Valley culture claim is bogus - Yelp (Chicago) is nothing more than a spruced up telemarketing / sales boiler room operation. The music they play constantly at ear piercing levels is horrible, repetitive, and not a good fit for when you're trying to do business with clients over the phone. Hope you like reading from a sales s… cript, too, because that is all you will ever do at Yelp. Full sales cycles? - not happening! You have to turn over every account to Account Managers or Elite AEs. The managers here are all young and inexperienced; micromanagement is the name of their game. Nothing but 20-somethings at this office, which makes sense as the younger you are the more likely you are to buy in and drink the Kool-Aid. They hire a ton of kids right out of college that don't know how good they could have it at another more professional company. Very stressful job - which is not how professional sales should be. Again this is a straight up boiler room / telemarketing operation. 80 dials and 2 1/2 hours of talk time every day, and they record every call you make. Micromanagement to the extreme! Not a good place to work for an experienced sales professional; avoid wasting your time at Yelp. Pay is terrible, and you won't make anything worthwhile on the commission side either - your first 30K in commission goes to Yelp, then you can start collecting.",
        "advice": "Create a professional work environment (lose the boiler room / telemarketing mentality) and stop trying to be a hip trendy start-up in every office Yelp opens up moving forward. Embrace the culture of the cities you locate new offices in. You can't transfer Silicon Valley everywhere, because for starters you don't pay Silicon Valley wages. The office environment in Chicago is a joke!",
        "pros": "Easy commute to the Merchandise Mart on the brown line train.",
        "summary": "Unprofessional sales boiler room / telemarketing operation - Chicago Yelp! office.",
        "role": "Account Executive",
        "date": "Dec 28, 2015",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Incestuous staff, cliques and drama, frathouse mentality, little to no work/life balance including pressure to be best friends with everyone there or your job is in jeopardy, petty management, no job growth or job security, shady business practices",
        "advice": "Focus a little more on keeping employees happy and a little less on hooking up and drinking. A company that makes this much money should have a higher base pay.",
        "pros": "Free alcohol, that's about it.",
        "summary": "Terrible.",
        "role": "Account Executive",
        "date": "Jan 29, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Turn over rates are awful for a reason. No wonder they hire 65 new people every month. You definitely have to \"drink the kool-aid\". You're making a minimum of 400 cold calls a week to people who don't want to hear from you. Hard is an understatement. Miss one day in training you start over or more likely fired. You start off at a account executive in training and have to climb up the later to even become an AE. Pay s… ucks.",
        "advice": "Try to appeal to people who want to help people over how much they can make off selling to people.",
        "pros": "Great opportunities to move up. Awesome culture. Free food and great benefits and people.",
        "summary": "I can't express how much I hated this job before I quit.",
        "role": "Account Executive",
        "date": "Feb 8, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "They tell you during the interview that they'll never let you work 40+ hours a week. Not sure how they came to that because I've worked overtime every week I've worked here. They sell you on the money the reps make. They DON'T tell you that only a few top reps make that kind of money. I've gotten two commission checks in the time I've worked here. Most sales come from having a good territory and getting lucky.… >If you get a bad territory, you're screwed for MONTHS. They'll rarely let you change territories. If you're lucky you'll call into a major city. If you're not lucky you'll call into some remote crap stain town that has a few auto shops and a couple plumbers.God forbid you have kids and they switch you to a territory out of your time zone. You work the same hours as the time zone you call in to.The business owners HATE Yelp. Very rarely do I speak to business owners that are happy about my call. If the account is any good then it's been called 50+ times already.There's a reason they hire 40-50 new sales reps a month. The turnover is very high. This place is like a sweatshop. They work young and naive new college grads to death (for little pay) for 6-8 months until they get tired of the job and quit then bring in new ones to replace them.You're expected to make 80+ cold calls a month and talk on the phone for 2.5 hours a day. The pressure is so high that some reps have been fired for calling their cell phones and leaving 10 minute long voicemails to hit their talk time metrics.",
        "advice": "Good luck dealing with the directors. They're nice to you as long as you hit your numbers.",
        "pros": "Free food. You'll need it with what you'll get paid. Music all day. Good training as a first step into a sales career.",
        "summary": "Don't trust the recruiter pitch",
        "role": "Account Executive",
        "date": "Feb 12, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Here we go:1. The pay is structured at 35K base salary, you will receive no commission until you earn 30k for the company, basically paying for your yearly salary. After you hit 30k you need to hit 12k per month before making 120 dollars in commission. They tell you average of first year is around 70k this is a lie.2. Is the free food really free?? Well trust me when I say each sales rep is paying portions of…  the overhead. If you understand the pay structure above then you get it. People get blinded my the music, games and free stuff because they don't get it right away. I would rather make the money than the free lunches.3. Territory, you better be good or be liked. That's how they base a lot of decisions.4.Micro Manage- they watch every detail of your day. 80 calls, talk time etc. But they say they don't micro manage....5. Majority of management was born and bred here. They have no other outside experience everyone speaks Yelp language and are very limited in there own experience. Which I believe limits every reps potential.6. As far as the \"executive team/directors\" I feel like someone gave them keys to the car but they don't have a license. It's really embarrassing to watch. They're clueless.7. If you leave....they take it personally and have verbally attacked and insulted people. I'm surprised I haven't heard lawsuits on this. HR must hate their life.8. Promotion & advancement? Yep they're growing but if you are amazing and crush it in sales that doesn't mean you will get it. Again, they pick who they want. I've seen many people be promoted and weren't qualified.9. They try to pump you up with internal testimonials (previous reps now managers) from earlier years, Yelp didn't have the reputation years ago they have today. It's a lot harder to convince people to buy in.10. You have to clap and follow your team to the gong to celebrate a sale. You may think this is great in the beginning. However, most of us were just annoyed. How bad is it that you have to get that excited when someone does their job? Again, embarrassing. No one cares after a month or 2.11. If you decide to work here, under no circumstances should you think for yourself or outside the box. My advice is to be quiet, smile and just do what they say. Be a robot, if you confront, ask questions as to why you will not be liked, promoted etc.",
        "advice": "I know well enough that any advice to this company wouldn't be taken.",
        "pros": "If You have no sales experience the training here is a great start to learn the basics.",
        "summary": "A True Review on the Company that was built on Reviews! Must Read!",
        "role": "Anonymous Employee",
        "date": "Feb 13, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Looking at many of these reviews it makes me slightly mad. I worked for Yelp for little under a year and let me just say, these reviews from people that say they love it are just flat out lies. This company preys on college grads because these young people don't know better and are easily sparkled by the flashy name and \"perks\" of Yelp. Please don't be easily blinded. This is a straight up cold calling job. You will … be micro managed to a extent that will drive you into depression. Everyday is the same thing over and over, and when you go to take your lunch or even a break you have management timing and making you feel bad for running to the bathroom or being 2 minutes late from lunch. Everyone here hates it except people begging for promotions. The pay and commission structure is the worst I've seen in any sales position offered. If you want to do sales, you can find anything better I promise. Before accepting this job I beg you to look at anything else. After 4 months you will start getting depressed, be working 45+ hours a week, and having business owners tell you how horrible a person you are. The worst is when you quit they treat you like the enemy and will make you leave that day even if you put in your two weeks. You can't say bye to anyone and you're kicked to the curb. Professional. Please just look into anything else besides this job.",
        "advice": "Have managers be older than 27 so you actually take them seriously.",
        "pros": "I wish I could have more positives to say other than a job to realize what you hate in a job and would never subject yourself or a friend to do.",
        "summary": "True behind the Account Executive position",
        "role": "Anonymous Employee",
        "date": "Feb 20, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Yelp is a cool company at times. The people that they hire are friendly, outgoing & have amazing personalities, and you will make some really cool friends. Also, free healthcare. BUT......The pay is horrendous & the actual work is awful!!It was a shame I had to leave but I resigned before I had another opportunity lined up because the job was so awful.First I'll speak about the pay, there … isn't much to say except $35,000 a year is not enough live on in NYC. The offices are downtown - do they expect all of their employees to have less than an hour commute and live in the suburbs? I stay in the 'burbs, and let me tell you, after paying rent I had very little extra funds. They tell you that your first year you are expected to make 45-50k and that is just NOT the case and I will tell you why in a minute, but let me move on to why the job is awful.....It is simply cold calling sales. Meaning..... YOU'RE A GLORIFIED TELEMARKETER!!! You make 90-100 dials a day and you are supposed to be speaking with small business owners but very rarely do you get in touch with them. The metrics are 2+ hours of talk time, 65-80 dials a day and 3+ appointments. Those metrics are impossible to meet because literally no one wants to talk to you. So you keep getting hung up on by hostesses, peons, auto shop workers, ESL workers, nail salon women, and maybe some business owners (in the unlikely event that you get one on the phone).Therefore the only metric you are able to somewhat hit is the dials. If you don't schedule any appointments to show business owners the product then you obviously will not close a deal so, you won't make commission. To make commission you have to make $30,000+ for the company every month. The whole process is completely unrealistic and I feel as if you are set up for failure as an AE.There also isn't a lot of career opportunity or choices. Neither you're in inside sales or you're a manager - that's it.LISTEN TO ME: Cold-calling is not for everyone. 95% of the people you call DO NOT respect you and most of the time, they won't even view you as a human being. You're just another telemarketer trying to sell them something they have no interest in buying. So be ready for that.Oh and they shove how GREAT Yelp ads down your throat from the moment you walk in the door until the day you can't take it anymore and leave. I'll never forget my first day on the job, in training, when we were told getting this job at Yelp was harder than getting into Harvard University. No, they really said that. And it was only the beginning. You're constantly told that no other job in the world is fun and relaxed like your role at Yelp. They tell you Yelp is the greatest thing since sliced bread, even though public perception of the company continues to worsen, and look at you like you're crazy if you ever doubt the company and its capabilities. They TRY to brainwash you to believe that there is truly no other form of marketing that local businesses should ever consider. IT'S ALL A LIE!!!Also, on the sales floor we were constantly taught that over-talking and overselling the product demonstrated doubt in the product on our end as sales people. The thought process was the product is so great that all we had to do was present it, keep it simple and we were golden. Perhaps the management at Yelp should take this into account when they're telling us several times a month how lucky we are to have this job, how great it is, etc. You begin to realize that you, along with the rest of the sales floor, is sold by upper management on a daily basis. Things are carefully crafted and worded to put them in a more positive light to keep morale up, hints of promotions are thrown around liberally to inspire motivation and they always have an explanation/spin to negative press about the company, even if it's true. (Especially on the financial front)Please, for the love of God, stop calling yourself a startup, Yelp. The company is way, way past that phase and is anything but at this point. It's a large public company and the employees do not have the freedoms/opportunities they would at a traditional, true startup. This goes back to the ping pong tables, kegs, casual dress etc. In reality, they're hardly, if ever used. The keg is strictly off limits until after 5:30, no one uses the ping pong table unless they're staying inside the office for lunch (which I would recommend always getting outside and getting fresh air, unless it's freezing of course) or staying late after work. They're nothing more than props to A) entice desperate college graduates on the job hunt and B) give a false sense of working at a fun, laid-back startup to current employees.Make no mistake, the sales floor is high pressure and metrics are painstakingly monitored. And depending on your manager, it can be even more stressful. Certain managers even make their reps work through lunch, which is illegal, but I guess that doesn't really matter to the company when its struggling to hit its revenue numbers like never before. I can't say it enough, Yelp is NOT a startup anymore.Immature atmosphere. I think a lot of this goes back to the startup vibe. Most of the people on the sales floor have no idea what working at a startup is truly like, INCLUDING young supervisors who are still in their frickin 20s, but they think they have this shiny, unique job at a \"tech company\" and it almost makes them overcompensate. We share a building with Credit Suisse and I kid you not, I would hear Yelp reps crack jokes daily about the Credit Suisse employees after they got off the elevator about their professional attire, their jobs, etc. Yes, let's make fun of the people making three times as much as we are. That makes a lot of sense.Also, the office can be extremely high school-like. Very gossipy, cliquey. All of that nonsense. Overall just lacking professionalism in that department far too often.Territories. You're a slave to the system of territories. You will constantly be told that territories don't matter. Laugh every time you're told that. Territories absolutely matter. All of the best reps in the company have major metro areas like NYC, Boston, Chicago etc. If territories didn't matter, there wouldn't be certain managers who do shady things to get their reps the best territories possible. On top of that, because the company is under so much pressure to hit that magical billion in revenue, they are constantly hiring in large numbers. We're talking 70-80 people a class. Because of this, territories are getting smaller and accounts are being touched way too often. If you get a new territory, chances are the best accounts in it were touched no longer than 2 or 3 weeks ago.Oh, and everyone's screwing everyone!!! Managers screwing managers. Reps screwing reps. Reps screwing managers. It's like one big orgy at this place. Then again when everyone is in their 20s and full of raging hormones, what do u expect??It's VERY hard to sell against this company's reputation right now. The higher ups will tell you they've always had their share of obstacles, but reps who have been around since 2012 and 2013 will tell you it's noticeably more difficult than it's ever been right now. There's just too much anti-Yelp clout out there to make it all go away like they're aiming for. Most reps, like myself included, feel that if we don't close a business on the first call, we'll never close them. The reason being that they'll most likely go to Google when they're making their decision, and what they're going to see is nothing but negative. On top of that, the company as a whole is on the way down. It's not the \"next big thing\" or hot platform it was a few years ago. The stock is suffering and not going anywhere anytime soon.Conclusion: DO. NOT. WORK. HERE!!!!",
        "advice": "shut the company down and start over from scratch. This company is ugly inside and out.",
        "pros": "free snacks; meeting cool people who'll become your friends; free healthcare & benefits",
        "summary": "RUN FAR AWAY FROM THIS COMPANY!! DON'T DO IT!!!!",
        "role": "Sales Account Executive",
        "date": "Feb 26, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Where to begin....they will brainwash you and drinking the kool aid is an absolute must. The office is run by 25 year olds who have only had one job in their life and that's Yelp. Among the vast 22 year old AEs you will find a handful of actual adults trying to do their job. You will work your butt off and they won't care. They will find a way to dock your commission when their product doesn't work and business owner… s cancel. DO NOT FALL FOR THEIR 'PITCH' ON WHY YOU SHOULD WORK FOR YELP. YOU SHOULD SPEND YOUR TIME FINDING A REAL COMPANY THAT WILL GIVE YOU TRANSFERABLE SKILLS.",
        "advice": "Get a grip- not everybody buys what you're selling. You take advantage of your employees and management is a glorified babysitting role- get over yourself.",
        "pros": "Free food, free coffee, endless hang ups and blaring techno music to make you slowly go crazy...",
        "summary": "AE Review",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "If you are a hipster who thinks manbuns are cool and like to dress like a werido and listen to techno music blasting all day while your manager brow beats you, then this job is for you. If you do not hang out with your team after work, you are looked at like an outcast. If you do not stay late everyday management will not be happy with you. If you do not show constant positive emotions while getting cussed at by peop… le on the phone, you will be looked at as a failure.There are certain different groups within the office, and if you are not part of that group you are frowned upon. Reminds me of high school all over again.",
        "advice": "Stop the over the top micromanaging. Stop trying to be trendy. Stop trying to be a hipster. Be a boss and start being professional.",
        "pros": "Free Food, cool atmosphere if you want to go back to high school.",
        "summary": "Real Account Executive",
        "role": "Account Executive",
        "date": "Apr 12, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Yelp is one of many companies out there taking advantage of young, talented college grads who are just excited to be working for a big name company that people will recognize, and to collect probably their first paychecks ever. The problem is that Yelp goes to so many lengths to assure you that you're working at the best place in the world that sooner or later, if you're smart, you'll realize that they're lying to co… ver up how poor the working conditions are.I remember one morning meeting, the senior director of the Chicago office showed The entire sales staff an email from a former, and again current, employee who had left Yelp to pursue her dream of working in real estate, then came back and begged for her job again, having decided that \"the grass was greener here\" after a few months out in the world.It's a sad story, but what's sadder is that leaders in the organization decided to show this email to the entire staff can brainwash everyone into thinking Yelp is the best place to work. In the meantime, they say to talk to your manager if you ever have any doubts about your career. I did that, and he encouraged me to quit that same day. Not the professional development and support I would've hoped for.Yelp prides itself on being fun, diverse, and transparent - all big buzzwords in the tech company game right now. The truth: employees here are pretty much white twentysomethings from the middle of the country who went to state schools and his parents are paying their bills because the salary here isn't enough to live on. Most people work illegal overtime because their managers say that the best way to be successful is to never leave the office. In the meantime, the 60 days of sales training you undergo at the beginning of your career are all about teaching you that this is a \"cool company\", better than the ones your friends are working at. Sure.",
        "advice": "You know those open letters that are coming out every so often criticizing the company? Instead of accusing employees of lying, and publishing their confidential employee records, take that criticism to heart. Respect your employees.",
        "pros": "Snacks, breakfast and lunch, and beer at the end of the day. The Phoenix office has a game room and a nap room with massage chairs. All of the offices have \"employee resource groups\" for socializing and some light fundraising/event planning/organizing.",
        "summary": "Exploits New Grads",
        "role": "Account Executive",
        "date": "Apr 20, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "For a company that says they don't sell good ratings, they are buying some on here. The job is given with huge inaccuracies and promises in the interview process that will never come to fruition. Including the one that said benefits start the same day we do--2 months later and I still don't have insurance cards. The pay per hour is almost minimum wage they just dress it up better. It's a stressful job in a really str… essful environment unaided by the atmosphere. If you want to be in sales, do it here but if we can stop listing it on job sites as marketing that would be great!",
        "advice": "Be more honest in the interview process about benefits, perks, and company culture. Also, stop paying minimum wage (or less than) while touting that you are a billion dollar per year company",
        "pros": "Good kitchen, \"fun\" environment, easy application/interview process",
        "summary": "Yikes!",
        "role": "Account Executive",
        "date": "Apr 25, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "It's been said already but I'll just confirm- you will constantly be tested on whether you are drinking the kool-aid, very much like high school and cliquish, your career path consists of being a sales rep (no matter if they call it a pilot team) or a manager, very inconsistent themes that trickle down from the main guy, territories will determine your fate despite what will be said.The office layout is suppo… sed to equal tech, but really it's just a modern twist on making cold calls all day and losing days from your life. There is rarely any empathy displayed from management for your struggles. Oh yeah, everyone hates Yelp no matter what the stock price says.",
        "advice": "Stop using the word \"cool\" after everything you say and maybe people won't confuse you as being a cult. Being bold and doing more just means work as hard as you can for as long you can. How about you add some humility to your role rather than seeing every rep for what they brought in last month. You say you don't care about the revenue but we all know that's not true. And work on better decks.",
        "pros": "Training covers sales techniques that can be applied elsewhere. The culture really stems from the team you are apart of so if you can be around good people then it'll help the day go by. Location makes for easy commute from all parts of the city.",
        "summary": "truth behind a 'five-star' career",
        "role": "Anonymous Employee",
        "date": "May 9, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Number one con is poor pay, the job itself is hard to wake up and have to go do, being micro managed by people who aren't good leaders, just good salespeople",
        "advice": "You could pretend to care about your employees just a little bit and not treat them like cogs in a machine.",
        "pros": "Culture, people, free booze, food is good but gets redundant after a short while",
        "summary": "Account Executive",
        "role": "Account Executive",
        "date": "May 18, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Obviously the biggest con is cold calling. No one likes it but that's the job. The key is numbing your soul just enough that you can get through an 8 hour work day harassing small businesses.The product is very meh, not good not bad. I saw results all over the map, so it was hard to tell if that family-man plumber was putting his money to good use or sinking it into a pit that would tank his business. I had a…  lot of people cancel contracts after I'd sold them, and the ETF is easily 700 bucks so they must have really not liked it to want to get out of it.The main gripe I have with the company was the way they do territories. If you are given a chunk of small towns, best of luck scraping by. The product is a) dependent on searches and b) providing wide-exposure to them. When there are all of 10-20 restaurants in a highway town in the middle of New Mexico, there isn't a lot of innate competition to play to selling advertising against one another, especially when that town doesn't receive many searches to begin with.",
        "advice": "Managers are 50/50 at Yelp in my opinion. Your experience will vary depending on the manager you have looking after you. I didn't luck out and had a manager that did very little to listen or help me succeed.Being stuck in small town territories with not much to call, I was repeatedly told that it was my fault they weren't buying. The only large deals I'd pull were from the lot of 200 accounts I had from a sli… ver of Henderson in the Vegas area.I had a friend on another team who ran out of leads in their junk territory and their manager immediately brought it up with the higher ups and got him put into a Los Angeles territory (a more traditionally Yelp-oriented city) where he saw more success.I scraped by with what I was given, but received no actual help or cooperation from the management I worked with.",
        "pros": "Yelp has the best training I've ever received or heard of being offered at any company. I will give them this, they know their stuff and they will make sure you do to. They are rather forgiving to anyone fresh off the college train who's struggling. I did feel as though the company wanted me to succeed as much as I did. That doesn't mean they did their part to ensure that.",
        "summary": "Good training, experiences vary.",
        "role": "Junior Account Executive",
        "date": "Jun 23, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The job. You are a telemarketer, there is no getting around that. Behind the charade of a \"brand name\", the benefits, and the perks, you are a telemarketer. You make cold calls all day, everyday. They act like its cool and the best job in the world, but its really not. You call local business' that hate you and what you stand for. They've been called hundreds of times by Yelp, and by other companies the … same time you are calling them. They hate you.They judge and micro manage you constantly. They judge you on \"metrics\" or data by computers, data that does not factor the character of a person, but how many dials you make a day. And if you don't meet them, or you don't buy into the fake and phony college attitude, then they will drop you in 4 weeks and if not then then in 8 weeks. Trust me, don't be allured by the name, its not what you think. You can do better. It also doesn't look good on your resume, you will only receive sales jobs, which are awful.",
        "advice": "Don't be phony. Also the best sales ppl don't make good managers, those skills are different.",
        "pros": "FoodHealth, dental, visioncandy, coffee, bagels,Things that don't matter",
        "summary": "Yelp is a Charade",
        "role": "Account Executive",
        "date": "Jun 28, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Worst Salary ever. How can you live on like 35k. This company is out of San Francisco too. You better live with your parents",
        "advice": "College grads make around 63k base.",
        "pros": "Fun atmosphere, in SF, Starter Job, Cheap",
        "summary": "Worst Salary ever",
        "role": "Anonymous Employee",
        "date": "Jul 18, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Manager never gave guidance, no mentorship involved; when you have a Marketing Internship, you should be learning about how it all works for example - when negotiating with businesses to have elite events there, intern should be there to take notes and learn. Did not happen here. Met with her once at the beginning and the rest was just work from home, turn up at events to set up and cross out names.It is essentia… lly a copy and paste job where you copy and paste what they want to FB, twitter, IG. Manager was very autocratic.",
        "advice": "You should have a better Internship plan in place - especially one which has to do with Marketing. Train your managers to be more uplifting and to take care of their employees.",
        "pros": "The company is well known and therefore good for your resume. Dallas community has a sense of togetherness an fellow yelpers are very welcome and friendly.",
        "summary": "Need to improve on internship.",
        "role": "Marketing Intern",
        "date": "Jul 22, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "All perks used to get you on board diminish with time.If an account manager loses an account you closed, you owe Yelp $.Salary is disrespectful, especially if you have experience. If so, you will see thru the motivation tactics.They have a hard time understanding that where employees would have most impact. Sales definitely doesn't mean you can manage teams.If you're coming from tech, … cross reference stats they want you to use. You will know what to use...",
        "advice": "Start applying to one of these companies bc they are already stealing your market share, your user are already transitioning and don't realize it. - Google, Facebook, or Microsoft.Also, check with legal about how using \"(number) of Searches for (industry) every month\" mhm",
        "pros": "Health Insurance.Doctors would call 80% of the office alcoholics.If you like calling small businesses that have been called aggressively for years, this is for you!",
        "summary": "Smoke & Mirrors",
        "role": "Account Executive",
        "date": null,
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "-imagine a sweatshop that is for calling strangers on the phone and convincing them to give you money instead of making a garment-cold calling 8 hours a day-your headset is attached to your desk. get used to that area bc you will be confined to it-priorities in upper management are in the wrong place. drill employees about having a high talk time and high number of dials a day. drill them about getting to…  a certain number of pitches. they record you on every call.-little work life balance-no job security. you can and will be let go at any time if you aren't meeting the numbers-you lie to potential clients on the phone and tell them you are an \"expert\" in the industry and make pricing recommendations based on their goals and what \"works\". really you are just picking a package at random and hope they give you their credit card",
        "advice": "-make your employees feel valued-have training that requires honesty with clients. we are NOT experts in the industry we are calling them about and do NOT make pricing recommendations based on what works and how to achieve their goals. We don't know what will fulfill their goals. We just want to get them to buy so we can \"close\"",
        "pros": "-free food in kitchen-free beer (2 beer max) on Fridays only-free coffee from barista-fun environment. management dropping f bombs at \"all hands\" meetings",
        "summary": "Not worth it",
        "role": "Account Executive",
        "date": "Aug 5, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "The company expects you to pay them back for clients who cancel their ad programs. It is questionable at best and leads to you making even less money while you work hard for a company that is constantly getting their business model questioned.",
        "advice": "It isn't the salesperson's fault if the product doesn't work. Do not penalize your main source of revenue for a product that isn't 100% optimized. It is ridiculous that this company withholds commission and expects to be payed back for chargebacks.",
        "pros": "Previously, I wrote a review for the company. It was 3 stars. I do believe that this is a decent place to work for your first year out of college, but beyond that I believe you are wasting your time. This is from a sales perspective.",
        "summary": "Questionable Practices",
        "role": "Account Executive",
        "date": "Aug 18, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Where do I begin? That \"Kool-aid\" other reviewers have mentioned is very very very real, and if you question it or try and poke valid holes in it they will just pretend not to hear you. Its so frustrating. I've been here about a year and I'm honestly just burnt out at this point. This job is 100% cold calling 80-100 accounts a day, setting appointments, doing pitches, and closing deals. Thats it. You spend 8 hours in…  front of a computer wearing a headset (until you've closed enough deals to be upgraded to a mobile headset), and thats all you do. every. day. The work itself is not only extremely boring, but it also straight up sucks 99%+ of the time. Want to be insulted and belittled and yelled at on the phone by business owners that have no concept of how the program works and they don't care enough to listen? Want to hear 100+ voicemail Want to learn how many ways you can learn to quickly abbreviate the phrase \"pickup hangup\" in your account notes since it happens to you EVERY day MULTIPLE times a day? Want to know how it feels to want to break your keyboard over your head when your manager is harping on your metrics 30 minutes into your workday? Now is your chance!My experience working here has been so unpleasant. I know now how firsthand just how anxious even the thought of this office gets me. Yelp's overall rating on Glassdoor has a satisfaction level of 3.6 - pretty solid for a large tech company, with a strong sales side. The other Yelp offices in NY, San Fran, Phoenix all are at about 3.5 star satisfaction rate. And Chicago? As of right now, 2.7 for satisfaction. What I also find ironic is that we're also the only office that has consistently missed quota months at a time while the other Yelp branches continue to see success. Perhaps the fact we're constantly (secretly, of course. you are looked down upon by management if you publicly express any feeling other than relentless happiness) miserable and overworked and overstressed due to poor management and poor developmental feedback. I feel like I've regressed since I rolled out of training because its difficult for me to keep my day in order because we're assigned specific tasks that we must do every day extra things to do ON TOP of making over 80-100 dials, talking for over 2.5 hours, setting 3 appointments, and pitching at least once a day. I feel like I'm set up for failure because my manager doesn't find it \"conducive\" to spend much time working with me since I'm \"not one of the top revenue producers\" on the team...why should that make a differentI'm tired from working so hard with no reason in return. I plan on leaving soon and taking my skills elsewhere.",
        "advice": "I don't even know. I'm actually really sad it got to this level. I think back to the day of my interview and how badly I wanted to work there. I feel like I was more/less given up on and I don't know why, even though I've asked.",
        "pros": "Fully stocked kitchen, great medical benefits package, the barista station, cool office with a new floor located in one of Chicago's most well known buildings, coworkers that turn into great friends, good and fun and transformative sales training, plus supplemental trainings after you roll out on to the floor. Fun summer office party where no expense is spared. Overall, Yelp is a company people have heard about, for … better or worse.",
        "summary": "No Filter: Account Executive",
        "role": "Account Executive",
        "date": "Aug 23, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Awful job - expected to make 100+ dials per day with a minimum of 2 1/2 hours of talk timeIf you fall below these numbers managers will take you off the floor and threaten to fire you.",
        "advice": "Managers are too young, inexperienced",
        "pros": "Nice officeFree lunch/snacks every day",
        "summary": "Account Executive",
        "role": "Anonymous Employee",
        "date": "Aug 29, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "COLD CALLING all day, every day. If you like getting hung up on, this gig is for you. If you like to be cursed out over the phone, this gig is for you. You will receive a sad territory that has been harassed by 3-6 employees. They will expect you to reach certain goals with the sad territory you have been given. If you didn't get the hang of it in the first three days, good luck getting through training. Dishonestly … runs rampant. My direct supervisor regularly told me to go against policy, like ignore someone's request to be put on the do not call list. There is so much talent wasted in this office. If you are a person who wants to change the world for the better or feel like your work matters, avoid Yelp at all costs. I would only recommend this job to those who have sales experience and love to cold call.",
        "advice": "Be up front about the job. Focus on hiring people that may actually be a good fit, rather than hiring 50+ people each month. Have some integrity that extends beyond the very top tier of management. Follow the rules you set. When has putting metrics before a person ever paid off?",
        "pros": "Kitchen was well stocked, generally cool people, the kind of office you think is exactly where a millennial will thrive. Benefits were pretty decent. Pay was ok.",
        "summary": "New grads should avoid Yelp like the plague",
        "role": "Account Executive",
        "date": "Sep 5, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "This place is a bust. It is pitched as an awesome job in which you will grow and learn and succeed...the first week. After that the goals are insane, you have to call businesses that have been called by yelp for years, asking them for their advertising business, most do not want to talk to you and the others just want you to never call again. The managers tell you to be sneaky and to fool the workers in order to talk…  to owners. They hire tons of people because the turn over rate is through the roof. It made me feel dirty selling small businesses on something that may not actually help their business. It seems outdated and besides, Yelp is outdated and its days are numbered. You will be fooled by the office. Its in the merchandise mart and the office is cool (omg beer and free food?) and they the charm wears off after the first week. WORST job i have ever worked and i worked construction in Joliet. Please take my advice and keep looking for another job, you will be glad you did.",
        "advice": "Be up front to the people you are hiring. A lot of them are coming in new or from other company in search of something better, and you take that joy away from them.",
        "pros": "The employees are amazing people usually just joining the workforce and start out driven.",
        "summary": "Aweful Workplace",
        "role": "Account Executive",
        "date": "Sep 6, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "Pay is not great and compensation is a jokeNot a long term opportunity.High turnoverCOLD CALLING all day, every day.Don't expect to come to the NYC office with a sales job and try to switch departments its not happening.They talk about growth all the time and unless you go to management there is no growth when you get a promotion you are still doing the same job of cold calling you just get paid m… ore each promotion. I don't consider that growth.Would not recommend this job. If you did something else at the company but not sales.",
        "advice": null,
        "pros": "Great BenefitsGood cultureFun work environmentFree foodReally like the peoplewill help build communication skills over the phone",
        "summary": "Sales",
        "role": "Account Executive",
        "date": "Sep 9, 2016",
        "is_current": true
    },
    {
        "rating": 1,
        "cons": "Management. You're not a person you're a number. No growth opportunity",
        "advice": null,
        "pros": "Food and the overal director",
        "summary": "Numbers",
        "role": "Account Executive",
        "date": "Sep 24, 2016",
        "is_current": false
    },
    {
        "rating": 1,
        "cons": "- It is a very hard job and it can get easy to get down on yourself.- The product is not great. Business owners hate it and would probably rather not have a page at all.- If you dont like people swearing at you on a daily basis this isnt for you.- The work is tedious and even if you have a good day you have to come in the next day and do it all over again. - Business owners hate you.",
        "advice": "I assume whoever started the sales program was watching horse racing when they did and thought this is how you treat a sales org. Basically you have to make dial after dial until they finally tell you to stop and then once you get promoted to being a stud you have to keep producing offspring. If you dont fall into the a prize winning horse that can produce offspring you get turned into glue.",
        "pros": "- Nice work/life balance.- The Yelp pantry is amazing, it saves me a couple hundred dollars in food a month.- Nice that they pay your health insurance.- Nice office location right at Merch Mart.- Office is massive and only getting bigger.",
        "summary": "If you want to live your life like a race horse, Yelp is the job for you!",
        "role": "Account Executive",
        "date": "Sep 29, 2016",
        "is_current": true
    }
]