[
    {
        "rating": 5,
        "cons": "Not a lot of mobility within the embossing department due to being a small department. When one wants to move around.",
        "advice": "Help and encourage your employees to move up.",
        "pros": "Flexible hours. Frequent breaks. Awesome managers who really care. Great benefits. Company cares for its employees. Cross-training is encouraged. 3 shifts",
        "summary": "Credit Card Transactions",
        "role": "Machine Operator",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Great Time management skills needed",
        "advice": null,
        "pros": "Benefits and time off are great",
        "summary": "Good company",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "red tape...takes forever to get things done. Different rules / policies for different parts of the business.",
        "advice": "Truly become one Citi with all lines of business having the same requirements and benefits.",
        "pros": "Great people that want to serve the clients. World-wide career opportunities if you're looking to move around and stay with one company.",
        "summary": "Operations Manager",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Felt very replaceable. Turnover can be high at times",
        "advice": "More focus on growth",
        "pros": "A lot of opportunity to learn and grow",
        "summary": "Product Control Analyst II",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Expedited training for phones, cramming too many topics in short training sessions which results in not retaining information and not enough time to practice developing job skill set",
        "advice": "Ensure and follow up that team is on one accord with job skill set following training to prevent poor performance",
        "pros": "Good starting pay, consistent hours, nice work environment",
        "summary": "Decent Company",
        "role": "Customer Service Specialist",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "do not remember any cons, but it has been 8 years",
        "advice": "no advice",
        "pros": "Great benefits, did not micro-manage employees,",
        "summary": "quick review of good former employer",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Management requires some attention to perform better",
        "advice": null,
        "pros": "Ability to grow and move within the company",
        "summary": "Huge Organization",
        "role": "CSC Business Analyst",
        "date": "Dec 3, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not a lot of places to move up in the company without experience",
        "advice": "Get rid of referrals so that the teller can focus on customer service which is more important",
        "pros": "Hours are very flexible, lots of opportunities for cash bonuses, great while going to school",
        "summary": "Great Place to Work For",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "The institution is huge, so not every single detail is perfect. But I believe that is true for every mega institute.",
        "advice": "Nil",
        "pros": "nice people, nice culture. reasonable workload. Even entry level employee know the big picture.",
        "summary": "Pretty good experience",
        "role": "Expected",
        "date": "Dec 3, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Salary could be better for interns",
        "advice": null,
        "pros": "Flexible work schedule and great people to work with.",
        "summary": "Working for a bank can be fun!",
        "role": "Technology Intern",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Inflexible corporate structure unable to respond quickly to changing market conditions. Isolated upper management in control of geographical regions they don't understand and are not able to synthesize advice from middle management.",
        "advice": null,
        "pros": "Citigroup provided above average compensation and benefits. Above the normal health benefits they also awarded stock rights and warrants.",
        "summary": "Decent Company",
        "role": "Financial Advisor",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "While a gross generalization, the competitive atmosphere rewards individual actions/success vs that of a team or general department. Not a 'team' oriented culture, which I prefer.",
        "advice": "I wouldn't suggest any changes to the current direction set forth by management. People who thrive on individual success do very, very well. Management has emphasized ethics and doing the right this as of late, which is having positive results on work environment.",
        "pros": "Global footprint second to none in the Banking world. Uniquely positioned to offer customers access to global markets. On the whole, very smart people comprise the workforce. Very competitive atmosphere drives company forward.",
        "summary": "Bittersweet ending",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Hard to navigateComplexCan make you feel a small cog of a gigantic machineSlow to changeChallenged by the regulatory setting",
        "advice": null,
        "pros": "International presenceStrong brand recognitionMany opportunitiesMany career pathsAll levels of sophistication from mass products to tailored solutions and everything in between",
        "summary": "Constantly looking to improve",
        "role": "Senior Vice President",
        "date": "Dec 2, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "So so many changes days you won't know whether you're coming or going as far as your employment status so many stressful situations if you're not a person who handle stress very well this is not the job for you do not go work for this company as you will have a nervous breakdown I've seen it happen with my own eyes so if you're open-minded don't mind changes needed any changes this is a great job for you",
        "advice": "Focus on the things that's going on within the company rather than the drama that's going on in between individual employees and keep an open mind when there are employees from different nationalities this different from you as everyone is there for the same reason which is to make a paycheck don't show favoritism basically it's what I'm saying",
        "pros": "A good place to work just starting out for training all some trainers very good job to have as long as you don't mind the change",
        "summary": "Unpredictable",
        "role": "Anonymous Employee",
        "date": "Dec 2, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "long hours, constant strategy changes",
        "advice": null,
        "pros": "good people and work location",
        "summary": "citi",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "There are long hours and you are understaffed at pretty much all times. Because of the limited amount of employees on your teams you are constantly over worked and don't have the opportunity to learn things needed for your position",
        "advice": null,
        "pros": "There is overtime available. There is good advancement opportunities to a certain point. Managers are helpful with the progress when you first start and are up any questions you have.",
        "summary": "Middle office anaylst",
        "role": "Middle Office Analyst",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not to many so far but only been there a year.",
        "advice": "Keep doing a great job!!!",
        "pros": "Nice place nice people. I like how they want to help people, and they seem like a good company.",
        "summary": "Citi is good",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too much office politics for career growth and compensation related increases. Also very hard to \"get things done\" b/c of the size of the company.",
        "advice": "Sense of ownership to make Citi a better company and a great place to work has been lost over the years. Needs to be better communication of the company goals and how individual can help Citi meet and exceed those goals.",
        "pros": "Good work life balance, good benefits, good people. Overall Citi is a very nice place to work and offers good opportunities for growth, you just need to push very hard for them.",
        "summary": "Good Place to work but has it's downsides as all very large companies do",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "For cost cutting moving various team to other locations",
        "advice": "More transparent",
        "pros": "Good place to gain broad exposure in KYC and AML compliance.",
        "summary": "Senior Compliance Analyst",
        "role": "Senior Compliance Analyst",
        "date": "Nov 29, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "To be honest, the only con I can think of is that they closed my site and I'm no longer with Citi.",
        "advice": null,
        "pros": "I enjoyed the atmosphere, coworkers and managers. They're very big on employee appreciation which you don't find in many companies.",
        "summary": "Former Citi Employee",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Costco made a contract for citi and now they are 24/7 and I got stuck with the worst shift ever.",
        "advice": "check on how your employees are doing twice a month.",
        "pros": "great pay. I receive 10% extra for working nights and 20% extra for working weekends",
        "summary": "citi costco fraud",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No cons! Great place to work",
        "advice": null,
        "pros": "A very comfortable friendly work environment. Citi offers additional differental pay if you work outside of preferred work hours as well as weekends.",
        "summary": "Citi",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "due to size things take time to get done",
        "advice": null,
        "pros": "good process/procedures, very oriented towards training, excellent environment",
        "summary": "Compensation Senior Analyst",
        "role": "Global Mobility Coordinator",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Difficult to manage personal and professional life",
        "advice": "Providing flexibility for working hours to contractors wont be great",
        "pros": "Since its a bigger company there are lots of rooms to improve and lot to learn",
        "summary": "Good company to work with",
        "role": "Business Analyst",
        "date": "Nov 26, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "No training For incoming employees, no cell phone or laptop but hard work required as of course it should be; no parties or holiday parties, basically lots of work with no extras.",
        "advice": "Interview well to hire the people you need, make sure you have tested well if they meet the requirements needed.",
        "pros": "Doing a great job in transforming after the financial crisis. Tight expenses may not be pleasant but working for the company, many opportunities.",
        "summary": "Great international bank with lots of opportunities",
        "role": "Project Manager",
        "date": "Nov 26, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Organizations have grown too huge",
        "advice": null,
        "pros": "Great work culture and good people",
        "summary": "Senior Vice President",
        "role": "Anonymous Employee",
        "date": "Nov 24, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "too many layers, simply too big",
        "advice": null,
        "pros": "GREAT work experience, Many avenues to grow",
        "summary": "GOOD COMPANY",
        "role": "Director",
        "date": "Nov 24, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Not efficiently organized. Unclear pathway to promotion.",
        "advice": "Better lay out path to promotion.",
        "pros": "Interesting work. Good Pay. Hours aren't terrible.",
        "summary": "Citi Research",
        "role": "Senior Associate",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Stressful at times due to computer program failuresNot given accurate information in trainingNot consistent training and yet expected to know systems that are not trained in",
        "advice": null,
        "pros": "Local Management is compassionate and understandingGood benefitsColleagues are willing to work together to assist one anotherGood amount of time allowed for holidays and vacation time",
        "summary": "credit",
        "role": "Anonymous Employee",
        "date": "Nov 23, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "No Planning or coordination or some of the projects that are worked in. If you need direction this is not the place for you.",
        "advice": null,
        "pros": "Flexible, easy work, people are nice",
        "summary": "Management could use some work",
        "role": "Anonymous Employee",
        "date": "Nov 22, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "none to be noted here.",
        "advice": null,
        "pros": "great culture, team and company",
        "summary": "CoS",
        "role": "Cos",
        "date": null,
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Limited opportunities to work remotely",
        "advice": null,
        "pros": "Strong bank with good client relationships",
        "summary": "Senior Vice President",
        "role": "Senior Vice President, Credit Risk Management",
        "date": "Nov 21, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Limited Career development, industry, regulations",
        "advice": null,
        "pros": "Work life balance, diversity",
        "summary": "Svp",
        "role": "Anonymous Employee",
        "date": "Dec 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Can be very frustrating to work with Latin America as it takes long to get feedback and get them to deliver work.",
        "advice": "Strategies to change the culture, employee development programs.",
        "pros": "The culture is relaxed and welcoming, with team work attitude. There are a lot of different opportunities within the company.",
        "summary": "Analyst",
        "role": "Analyst",
        "date": "Dec 6, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "In my 6 years with the company so far haven't find much cons, maybe parking space, since there are 2 campus in different areas, one of the campus has small cafeteria but the building is temporarily and they are extending the land so in the future shouldn't be a problem",
        "advice": "In terms of communication The company has been with all employees transparent and efficient. Different newsletters, emails, collaborative site. Management are taking all necessary actions to put the firm up and creating an environment of great place to work. No advice at this point.",
        "pros": "Great company, always with employee engagement and great environment, big organization to do career development across multiple functions and areas, diversity is amazing, people with different backgrounds make the company rich in knowledge",
        "summary": "Vicepresident",
        "role": "Solution Analyst Lead",
        "date": "Nov 17, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lower pay scale. Schedules are not as flexible",
        "advice": null,
        "pros": "The benefits are what kept me so long. Great benefits!",
        "summary": "Its just ok",
        "role": "FLORIDA",
        "date": "Nov 21, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "some departments can be highly stressful.",
        "advice": null,
        "pros": "Decent starting pay for buffalo",
        "summary": "Ok",
        "role": "Anonymous Employee",
        "date": "Dec 4, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Low pay, call center environment, where everything is on a timer, calls, bathroom breaks, lunch and breaks are on a schedule, metics for measuring your performance is base on feedback from upset customers, even if it not your fault, like customers is upset because they can not pay their bill, if they leave a bad review, then it counts on you, they try to say it even out, but it does not. Most of problems is cause by … the company that issue the card, rep does get the correct information, and they give out false and misleading info to the customer in order to issue a credit card",
        "advice": "Fix the issue with your partner that give false and misleading information to customer, fix the metics your agent are judge on, better pay, and make it easier for someone to promote to another opening, instead of a year, and hire good people, not people that make your company look bad",
        "pros": "They tried to make a good place to work, nice clean building, some nice people that works there, they like to show their people that been there a long time",
        "summary": "Customer service representative",
        "role": "Call Center Customer Service Representative",
        "date": "Dec 4, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Meritocracy not well followed and improvement in transparency in performance evaluations. Inner politics and self promoting interest overrides sometimes. Policy execution not well followed - esp for the regions outside the US. Accountability is often not clear to management and often not viewed as one company due to finger pointing between functions/departments.",
        "advice": null,
        "pros": "Focus on the right areas for innovation and process improvement. Global company with global mind. It is a good company in general to build career with global network.",
        "summary": "Generally good but have execution issues",
        "role": "Anonymous Employee",
        "date": "Dec 3, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "- Supervisor and staff may forget you exist since they get overwhelmed with work of their own- A lot of work and strict deadlines may throw you off",
        "advice": null,
        "pros": "- Very friendly, close knit and helpful staff.- There's a lot more to do than fetch coffee and make copies",
        "summary": "Corporate and Investment Banking Analyst",
        "role": "Anonymous Employee",
        "date": "Nov 18, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Progression, leadership from management and employee turnover.",
        "advice": "Treat employees better.",
        "pros": "Colleagues' personalities and work hours.",
        "summary": "Case Manager",
        "role": "Risk Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Low salaries. The bonuses are low as well. You are rated on a bell curve against people that have your same level but not job function there fore someone must be in the back end of the curve.",
        "advice": "Embrace changes, promote innovation, welcome opposing opinions. The company needs people who aren't afraid to challenge status quo",
        "pros": "They try to place you if your job is right placed. If you're lucky enough to get under right leadership there is opportunity to move around.",
        "summary": "Citi",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "You may need work alot of hours on salary",
        "advice": null,
        "pros": "Work and life balance is good.",
        "summary": "Analyst",
        "role": "Analyst",
        "date": "Dec 2, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Nothing that I can think of",
        "advice": null,
        "pros": "Friendly managers, great benefits, good pay",
        "summary": "Call center agent",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Some of the systems used are legacy systems that are clunky and unruly; having to use several different systems that do not work as advertised can cause frustrations some days.",
        "advice": null,
        "pros": "Citi has an inclusive, diverse culture that promotes working with local communities and charitable giving. Flexible work schedules and good benefits.",
        "summary": "AML",
        "role": "AML Analyst",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Pay is average. Might not be a good fit for those who don't like working in big corporations. Slow to make changes within the company, but that's to be expected with a company this size.",
        "advice": "I have nothing bad to say about management here at Citi. Again keep in mind this is a huge company with many tiers of management.",
        "pros": "Great company to work for. Great Benefits, 401k matching, tuition reimbursement. I have had great opportunities here and have advanced quickly.",
        "summary": "Overall Great Company",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "None that I can think of.",
        "advice": "Keep up the good work.",
        "pros": "Great place to work, great benefit, smart co-workers.",
        "summary": "Great place to work",
        "role": "Anonymous Employee",
        "date": "Nov 17, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "just got cut my entire bonus next year for analyst level which is a pay cut for me. Manager said will be able to get paid for overtime (which I usually don't do).",
        "advice": null,
        "pros": "Good work life balance for risk reporting. 17 vacation days. 6 sick days.",
        "summary": "Good work life balance for risk reporting",
        "role": "Anonymous Employee",
        "date": "Dec 1, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "It can get noisy in some of the open office areas. There should be better documentation of work processes.",
        "advice": null,
        "pros": "Interesting work. Great chance to improve your technical skills. You get to use headphones at work.",
        "summary": "Associate Client Onboarding Analyst",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Having actual knowledge and skills will not be a factor in getting higher positions, if you are not part of the favorites, you have no chance of ever moving up.HR and Ethics will do absolutely nothing in your favor, even if you have proof, it all comes down to how much they like management.If you're someone who keeps to themselves and has zero motivation to move up, this may be the job for you. That i… sn't an insult, it's meant for those who are not going to be disappointed when they find out someone who is buddy buddy with the management gets the position and you didn't.",
        "advice": "Take a management course",
        "pros": "Getting paid sick pay that you can use virtually whenever you want and however you want, getting paid vacation from the very start, health and 401K options from the beginning is also solid. Most part timers here worked just for the benefits alone.",
        "summary": "Benefits are good, that's about it",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Alot of midlevels staying around to collect their incomethis group uninterested in teaching or explainingThe program left me tired on a daily basis",
        "advice": "make use of the intelligence you recruited.Smart people should be interested in training the young to excel. All the pieces are there",
        "pros": "my desk was interesting and involved as a teamwe worked hard/played hardroom for personal growth and pushing oneself to do really hard work",
        "summary": "analyst",
        "role": "Financial Analyst",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Limited growth. Position felt stagnant.",
        "advice": null,
        "pros": "Pleasant working environment. Wonderful work/life balance. I worked from home two days a week or more if I needed.",
        "summary": "Senior Assistant",
        "role": "Senior Assistant",
        "date": "Nov 15, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Nothing to comment on citi.",
        "advice": null,
        "pros": "It was a good company.",
        "summary": "IT Engineer",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "closing too many locations recently, taking away full time positions,",
        "advice": null,
        "pros": "great benefits, good hours, friendly co-workers, good upper management, numerous locations, opportunity for growth, good work life balance, decent pay",
        "summary": "Teller",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "* No true management promotion structure",
        "advice": "*Create a fraud management plan",
        "pros": "*8 week training* comfortable work environment* Everyone is accepted and accepting* strong training program",
        "summary": "Most accepting company I've worked for",
        "role": "Fraud Investigator",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Does not pay as well as some other firms",
        "advice": "N/A",
        "pros": "Good people, good environment - down to earth and not cutthroat. Comfortable place to work. Pretty good pay",
        "summary": "Good people",
        "role": "Anonymous Employee",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Always looks to relocate you to lower cost region",
        "advice": "Invest more in your people.",
        "pros": "If you have a good manager you will be ok.",
        "summary": "Good not great",
        "role": "Anonymous Employee",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "Not many people here at Citi seem to care about their job. Many people get in late and leave early and the office atmosphere is lacking to say the least",
        "advice": null,
        "pros": "Work life balance is great. A lot of people work from home and it allows you to have a flexible schedule. Compensation is high.",
        "summary": "Citigroup",
        "role": "Assistant Vice President",
        "date": "Nov 29, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "- Long hours- Mediocre technology platforms, given such a big corporation",
        "advice": "na",
        "pros": "- Comprehensive benefits- Decent Pay- Room to grow- 401k Match",
        "summary": "Big Company, Good people",
        "role": "Anonymous Employee",
        "date": "Nov 30, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Too spread out in different offices in NYC",
        "advice": null,
        "pros": "Better than expected, one of the best bulge brackets, lower pay, but understanding bosses, room for upward mobility",
        "summary": "Citigroup",
        "role": "Anonymous Employee",
        "date": "Nov 14, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "Senior leaders have no concept of team, focusing on a couple of individuals and relying on them to do everything as opposed to developing more junior employees.",
        "advice": null,
        "pros": "good vacation time. plenty of opportunity to move around if you are in DE or NY.",
        "summary": "Toxic",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Lack of raises. Mangers seem to hire who they know.",
        "advice": "Commit to yearly raises.... especially when employees are rated 2 or higher",
        "pros": "Work life balance is great",
        "summary": "Fraud",
        "role": "Fraud Analyst",
        "date": "Nov 14, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "unrealistic pressure at times is biggest detractor",
        "advice": null,
        "pros": "Global Presence, Autonomy..resources and opportunities",
        "summary": "Banker/Citgold",
        "role": "Citigold Relationship Manager",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The time that you have to actually help customers and not have them call back because of another problem.",
        "advice": "Raise the time allotment of helping people so the customer truely gets the help with their account that they need without feeling rushed or like a problem.",
        "pros": "Good benefits and good people. Wage not to bad.",
        "summary": "Customer Service",
        "role": "Anonymous Employee",
        "date": "Nov 15, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "disorganized.play favories, they dont have a lot job growth, they tend to have management do a lot shady stuf",
        "advice": null,
        "pros": "quick, easy, money, they have daycare,a cafeteria,friendly, relax environment",
        "summary": "Dont work here",
        "role": "Anonymous Employee",
        "date": "Nov 28, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "selling products is a priority",
        "advice": null,
        "pros": "great benefits on site café sick pay and time off is sufficient",
        "summary": "mortgage collections",
        "role": "Mortgage Collection",
        "date": "Nov 29, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Too many jobs being sent offshore",
        "advice": "Embrace the idea that People Matter... our American people / workers should be more important than just the bottom line.",
        "pros": "Good people, challenging work, flexible",
        "summary": "Analyst",
        "role": "Anonymous Employee",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "The environment has become very political",
        "advice": "Be more sensitive to employees needs",
        "pros": "A company that allows you to grow, with opportunities to do different roles.",
        "summary": "Director",
        "role": "Director",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Gaps in communication from senior management to middle/lower level employees",
        "advice": null,
        "pros": "Great work environment, compensation and benefits",
        "summary": "VP/Senior Investigator",
        "role": "Vice President/Senior Investigator",
        "date": "Nov 14, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "8-10 Hour shifts can seem long if not used to being in one spot for that amount of time. Just like most jobs so not too big a concern.",
        "advice": "Keep doing a wonderful job!",
        "pros": "Amazing work environment! Very positive and open. Benefits are very good. Managers actually care for their employees. Company strives to not only provide the best customer service but also strives to provide a great environment for their employees and provide employees with services to keep them happy as well. Plenty of opportunities to move up and move around the company.",
        "summary": "Customer Service Representative",
        "role": "Customer Service Representative",
        "date": "Nov 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "don't know/ don't really know any cons but good company",
        "advice": null,
        "pros": "Very good yes good work for everyone",
        "summary": "WOrk",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "promotion is really difficult to get",
        "advice": null,
        "pros": "good training and high client experience",
        "summary": "Citibank",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Customer service surveys taken very seriously. Bad surveys will affect monthly commission pay outs as well as branch quarterly. External candidates will be paid more than internal most of the time. Entered company right out of graduating with a Bachelors degree with hopes of developing career with company. Unfortunately if corporate route is what you are seeking don't start out as a branch employee. Very rarely do br… anch employees transition to corporate roles or other areas outside branch.",
        "advice": "Branch staff very rarely gets the chance to move to corporate side of business . Lots of opportunities available for senior leaders to develop their careers but not to branch staff. There should be more programs assist those would like to remain with the company and develop as a professional. Scope of career path basically Teller to Personal Banker, to Small Business Banker to CG Relationship Manager or Assistant Bra… nch Manager to Branch Manager, then Area Director. No clear path to other roles.",
        "pros": "Company with global brand recognition. Strict compliance requirements that enable you to know they take ethical selling very seriously. If surpass goals there is good room for commission.",
        "summary": "PERSONAL BANKER",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Work Like balance. Compensation lower than median.",
        "advice": null,
        "pros": "Opportunities around the company are great, you can move between functions and regions.",
        "summary": "Great",
        "role": "Anonymous Employee",
        "date": "Nov 10, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "None everything's great, nothing to complain about",
        "advice": "Listen with an open mind",
        "pros": "Very diverse environment, room to advance",
        "summary": "Awesome job",
        "role": "Call Center Customer Service Representative",
        "date": "Nov 8, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Not much communication in management and organization. They give very limited time off if you haven't been with for over 5 years. Not much room for growth.",
        "advice": null,
        "pros": "Fun environment within team. Department gave remote which allowed flexibility when it came to bad weather or emergencies.",
        "summary": "Okay company",
        "role": "Anonymous Employee",
        "date": "Nov 23, 2016",
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "High turnover rate for employees, management doesn't care, lots of calls, coworkers are loud during live calls.",
        "advice": "Care more about your employees.",
        "pros": "Good pay, full time schedule, benefits, incentives",
        "summary": "Good money, terrible job.",
        "role": "Anonymous Employee",
        "date": "Nov 22, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Citi large and vast resources may make it challenging to navigate through.",
        "advice": null,
        "pros": "Citi's global footprint provides a unique Culture",
        "summary": "My review",
        "role": "Vice President",
        "date": "Nov 7, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Not a lot of mobility within the embossing department due to being a small department. When one wants to move around.",
        "advice": "Help and encourage your employees to move up.",
        "pros": "Flexible hours. Frequent breaks. Awesome managers who really care. Great benefits. Company cares for its employees. Cross-training is encouraged. 3 shifts",
        "summary": "\"Credit Card Transactions\"",
        "role": "Anonymous Employee",
        "date": "Nov 5, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Extreamly long hours, work weekends, and intentional under staffing.",
        "advice": null,
        "pros": "Consistently strong in security practice. Extreamly fast paced, and aggressive time lines.",
        "summary": "Great company",
        "role": "Anonymous Employee",
        "date": "Nov 6, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "If you are on the lower rungs, then you will generally be dissatisfied.",
        "advice": null,
        "pros": "If you are educated and smart and can obtain a good position, you will be generally fine with working at Citi.",
        "summary": "Depends on your level",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Management rapport, declining more, lack of work, lack of communication amongst managemt and their teams",
        "advice": null,
        "pros": "Benefits, schedule, salary, I like my direct teammates",
        "summary": "It was ok",
        "role": "Anonymous Employee",
        "date": "Nov 4, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Bad food service, really expensiveworking in weekend",
        "advice": null,
        "pros": "Good env, people are nice",
        "summary": "Oracle Database Administrator",
        "role": "Vice President",
        "date": "Nov 5, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "throw you right into job after training no resources during on the job training",
        "advice": "have people actually help during on the job training",
        "pros": "great time off supposed good benefits",
        "summary": "collections",
        "role": "Collections Representative",
        "date": "Nov 16, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Too heavy on business politics.",
        "advice": "Far too often promotions are done by who you know not what you know.",
        "pros": "Business casual setting, team support, excellent benefits",
        "summary": "Client Relations Specialist",
        "role": "CRT",
        "date": "Nov 3, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "pay was not competetive compared to the work load",
        "advice": "pay a bit more and u will be able to retain freat employees",
        "pros": "Very employee oriented atmosphere and were allowed to work from home, especially with bad weather. Grreat STD benefit and Vacation",
        "summary": "SAlary",
        "role": "Anonymous Employee",
        "date": "Nov 4, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "You have to network here and it's a must. You will run into a few people and it raises your curiosity on how they got their position but their not horrible. They are in the process of hiring a lot and renovating so you may find yourself moving around too much. I've had 3 different cubicles and on two different sites that are 15 minutes apart. the renovations are said to be so people are more collaborative but really … its so they can fit 3 people where two people sat before. Managers have shared offices of 2 to 3 people.",
        "advice": "Displacing people is a major inconvenience with ongoing traffic. Keep the strong players in our group and don't let them go so easy. I've seen a director, group managers and managers leave all within a 2 week time period.",
        "pros": "There are many tools and trainings available to you for professional growth. They are continuously making improvements to their technology groups and keeping up to date with the latest trends. They encourage movement within the company so its really hard to look else where since there is so much opportunity available within Citi and Tampa.",
        "summary": "Excellent growth and great Tampa, FL campus",
        "role": "Project Manager",
        "date": "Nov 1, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "can be very stressful at times",
        "advice": "listen to your employees more",
        "pros": "great benefits, ok pay a lot of ot is available",
        "summary": "working at citi",
        "role": "Anonymous Employee",
        "date": "Nov 14, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "The data quality and our technology are severely lacking the attention they should get. Data quality is very subpar. Bank is pretty complex and should be simpler. Work life balance is not good but that is part of the industry",
        "advice": "Spend the company's money on our internal systems so we can be more efficient and employee satisfaction would be exponentially better.",
        "pros": "Very good 401k benefits and good pay. People there are friendly and there is opportunity to move around to different groups.",
        "summary": "Analyst",
        "role": "Anonymous Employee",
        "date": "Nov 12, 2016",
        "is_current": true
    },
    {
        "rating": 3,
        "cons": "Work was boring and repetitive, very little opportunity to learnMiddle management was a PITA about work/life. Nitpicked over people leaving early, time off requests. Although we have the capability to work from home, some managers are old school and frown upon it, which is not family friendly. This is part of the reason there is high turnover. However, they come and go as they please and work from home when they … want to. Also, there is little to no loyalty; people backstab to try to get ahead (which doesn't work in this environment).",
        "advice": "Get with the times. People who are able to work from home on occasion are more motivated and get more work done.",
        "pros": "Lots of diversity programsHR programs/resources were goodPeople I worked with were talented and knowledgeable",
        "summary": "VP Compliance",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Min bonus for individual employees",
        "advice": "Present more lucrative bonus program",
        "pros": "Good working environment and diverse",
        "summary": "Collections and cash control",
        "role": "Anonymous Employee",
        "date": null,
        "is_current": false
    },
    {
        "rating": 3,
        "cons": "*Work/life balance has been poor in each department that I have worked at.*Compensation could be better, especially for the amount of work you are responsible for. (granted each role I had while working here, I was essentially doing the job of my V.P. while they took the glory)",
        "advice": null,
        "pros": "*It is a great place to work, if you are looking to work in Corporate finance./can also be a horrible place to work, it depends on your manager.*Plenty of travel opportunities if you land the right position/areas to relocate.*Different areas to specialize in.",
        "summary": "Associate Transaction service analyst II",
        "role": "Anonymous Employee",
        "date": "Nov 10, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "None really good company to work in",
        "advice": null,
        "pros": "Great benefits fair company upper manegment envolved with employees and customers. Great balance for work and personal time.",
        "summary": "Citi",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2016",
        "is_current": false
    },
    {
        "rating": 2,
        "cons": "Everything else. A lot of finger pointing and lack of communication/politics in management. Favoritism is alive and well. No room for real growth",
        "advice": "Value employees and dont waste resources. Dont offshore too much. You get what you pay for",
        "pros": "Work from home, 401k, Vacation",
        "summary": "Living in the past",
        "role": "Anonymous Employee",
        "date": "Nov 11, 2016",
        "is_current": false
    },
    {
        "rating": 4,
        "cons": "Not a lot of opportunity to advance",
        "advice": null,
        "pros": "Flexible hours, frequent breaks, telecommunting",
        "summary": "Great Place to Work",
        "role": "Senior Financial Analyst",
        "date": "Oct 26, 2016",
        "is_current": true
    },
    {
        "rating": 4,
        "cons": "Lack of flexibility, big bank so change is slow, experiences vary significantly by groups, not a strong identity (probably because the bank is so big), heavily regulated, lots of politics",
        "advice": "Hard to try and do everything as a company - pick a more defined route (other than just being global)",
        "pros": "Great people, good salary, fast paced work, opportunity to deal with a diverse group of global citizens",
        "summary": "Sales and Trading",
        "role": "Anonymous Employee",
        "date": "Oct 27, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "Moves at enterprise speed (the aircraft carrier, not the spaceship), so change and innovation takes time and effort.You must work smart, hard, or both to keep up. VDI thin clients are standard equipment.In- Office hours tracked and mandatory for 6 months before work from home is an option.BYOD is not mature (Good for Work)",
        "advice": null,
        "pros": "Best team environment I have experienced in civilian life. Pay is competitive, Benefits are good, Paid vacation is excellent. One of the happiest/most satisfied group of employees I have worked with.",
        "summary": "Happy People, Challenging Work, Competitive pay and benefits.",
        "role": "Technical Information Security Officer, Vice President",
        "date": "Oct 25, 2016",
        "is_current": true
    },
    {
        "rating": 5,
        "cons": "Less pay as compared to the tech companies for college hire",
        "advice": null,
        "pros": "Great team. Focus on product and releasing features only",
        "summary": "Very good team",
        "role": "Technology Analyst",
        "date": "Oct 25, 2016",
        "is_current": false
    },
    {
        "rating": 5,
        "cons": "too big to understand the whole functions even within your group",
        "advice": null,
        "pros": "good place to work, big company, complex structure",
        "summary": "modeling analyst",
        "role": "Anonymous Employee",
        "date": "Oct 26, 2016",
        "is_current": true
    },
    {
        "rating": 2,
        "cons": "disorganized, lack of proper training",
        "advice": null,
        "pros": "Nice people, good cafeteria, competitive wage",
        "summary": "Nice people but they're a mess",
        "role": "Contractor",
        "date": "Nov 8, 2016",
        "is_current": true
    }
]
